{"url": "Arkadia_Calimondra", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Sith Lords of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Arkadia Calimondra"}, {"tag": "p", "text": "Arkadia Calimondra was a female Human Sith Lord who was the eldest daughter of Lord Chagras, and the older sister of Dromika and Quillan. She ruled a region of the Grumani sector known as the Arkadianate, which was governed according to a philosophy of ordered chaos which involved rotating her subjects in different jobs to keep them perpetually distracted. Those living on her capital, the icy world of Syned, were expected to be familiar with a wide variety of professions and prepared to be appointed to any particular job at any given time. In 1032 BBY, Arkadia invaded and annexed the Dyarchy world of Byllura, which was ruled by her younger siblings, and took them under her custody. Her conquest was inadvertently assisted by the efforts of Jedi Knight Kerra Holt and the mercenary leader Jarrow Rusher who had fought of the Dyarchy's attempts to assimilate them into a Force-induced mental thralldom."}, {"tag": "p", "text": "Following the battle, Arkadia attempted to win over Kerra and Jarrow by providing them with refuge at her capital city of Calimondretta; intending to keep the student refugees aboard their ship Diligence as her new subjects. Later, she tried to persuade Kerra to assassinate her grandmother, Vilia Calimondra, supposedly because she believed that Vilia had her father murdered. Vilia would later, while neither confirming nor denying that she had killed Chagras, note that Arkadia herself was an equally likely suspect. When Holt refused, Arkadia had her imprisoned, intending to extract information from her and then kill her. However, Narsk Ka'hane, an independent operator for several Sith Lords, secretly freed Holt while Rusher helped destroy much of the complex to ensure they and their refugee charges' escape from the Arkadianate."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rise to power"}, {"tag": "p", "text": "Arkadia Calimondra grew up in the Calimondra family during the Republic Dark Age, a period when various Sith Lords controlled large areas of the galaxy. The Calimondra family was one of these powerful Sith dynasties and ruled the Grumani sector in the Outer Rim. Her father was the Sith Lord Chagras who ruled the Chagras Hegemony, one of the feuding remnants of the Sith Empire which had sparked the Fourth Great Schism in 2000 BBY. Her grandmother Vilia Calimondra who occupied a managerial position as the family matriarch. Due to the competing claims of seven children, she devised an armed contest known as Charge Matricas whereby the heir that conquered the most territory would inherit her vast holdings. Beginning in 1066 BBY, the Charge Matrica lasted several decades and laid waste to large areas of the Outer Rim. This conflict when one heir alone—Chagras—emerged victorious; heralding a shaky peace which depended on the cooperation of his nephews and nieces. Chagras became the titular ruler of a Sith dynasty known as the Chagras Hegemony, which bordered his mother's empire."}, {"tag": "p", "text": "In 1040 BBY, Chagras was killed during an attack involving nerve gas, which led to the collapse of the Hegemony into several warring factions. This coupled by rival Sith Lord Xelian waging war on the Chagras Hegemony brought about a second series of conflicts known as the Second Charge Matrica, which was fought among Vilia's numerous grandchildren. Following the death of her father, Arkadia established her own state known as the Arkadianate with her capital being Calimondretta, a new settlement on the frozen planet of Syned. She saw herself as a benevolent autocratic dictator and implemented a policy of continuously rotating her subjects in different jobs throughout their lives. For example by 1032 BBY, the Herglic mother Seese had worked in at least five different occupations including teaching, algae-processing, metallic reclamation, as a tactical officer on Arkadia's flagship New Crucible, and a tour guide on Calimondretta. She justified this policy on the rationale that it instilled flexibility and versatility among her subjects by providing them with experience in different lines of work. However, it was designed to prevent the emergence of any potential domestic threats to her rule since it kept even her most skilled subordinates perpetually preoccupied with new assignments."}, {"tag": "p", "text": "In contrast to most of her contemporaries, Arkadia was seemingly open to dialogue and criticism when the situation was in her favor. Unlike other Sith Lords who neglected the social welfare of their subjects, Arkadia invested substantially in providing extensive social services like education, food, and even clothing. She established several schools throughout a realm known as Promisoriums, which were open to individuals of diverse species and also boasted extensive dining facilities. Under Arkadia's regime, students would work to become as versatile as possible so that as adults they could contribute to her state. This contrasted with her cousins Daiman who exploited children as forced laborers and Odion who had all the children in his realm imprisoned in a series of planet-sized orphanages known as cloisters."}, {"tag": "p", "text": "Her capital Calimondretta was known to import large stocks of food to sustain its population. Arkadia also implemented a policy of making her subjects wear bright clothing allegedly under the pretext of helping them become more \"noticeable and memorable\" individuals. The Arkadianate was also comparatively more enlightened than other Sith states since it did not utilize violence in coercing people into work. Despite its positive aspects, the Arkadianate still remained an authoritarian dictatorship centered around the personal philosophy of its titular ruler Arkadia Calimondra. She had her enemies imprisoned in harsh conditions at the Impound on Calimondretta, where they were also subjugated to much physical discomfort and torture. Finally, Arkadia harbored ambitions of killing her grandmother Vilia as part of her irredentist ambitions of enlarging her own empire within the Grumani Sector. She also invested much resources into the development of a deadly nerve toxin called Chagras's Blood, which was harvested from Synedian alga. She planned to deploy the bioweapon for assassinations and military offensives."}, {"tag": "h3", "text": "Annexing the Dyarchy"}, {"tag": "p", "text": "By 1032 BBY, Arkadia had turned her attention to the Dyarchy, a small Sith principality centered around the planet Byllura. The planet was nominally ruled by her younger twin siblings—her brother Quillan and her sister Dromika—but real power actually lay in the hands of their Krevaaki Regent Saaj Calician. The two Sith twins had powerful mental telepathic powers which they used to enthrall the planet's population into mindless slaves. Under the guidance of Calician, Quillan had created an organic mental telepathic network spanning the entire planet with a network of enslaved Celegians serving as conduit points to relay the twin's commands. Due to its secluded location, the Dyarchy remained isolated from other developments occurring within the Grumani sector and the wider galaxy. By that year, Calician had also assembled a fleet of newly-constructed battleships known as the Dyarchy Fleet for an invasion of the rearward systems of the Daimanate, the state ruled by Xelian's younger son Lord Daiman."}, {"tag": "p", "text": "Following the collapse of the Bactranate, the Jedi Knight Kerra Holt and the Brigadier Jarrow Rusher fled to Byllura aboard the modified troopship Diligence, which carried over a thousand student refugees who had escaped from the Battle of Gazzari. The Bothan spy operative Narsk Ka'hane was contacted by his true master Vilia Calimondra, whom assigned with the task of monitoring Kerra's movements. Through unknown means, Vilia had been aware of Kerra's exact location. She also assigned him to work for Arkadia Calimondra since she needed the services of a \"specialists. Narsk would participate in Arkadia's military invasion of the Dyarchy."}, {"tag": "p", "text": "During their brief stay on Byllura, Kerra inadvertently helped destabilize the Dyarchy by overpowering Calician and kidnapping Quillan; causing the breakdown of the Dyarchy's mental telepathic network which triggered a mass uprising on the planet. Bereft of one of its twin \"strongmen\", the highly-centralized Dyarchy was unable to function since there was no one to give instructions. His sister Dromika had descended into a comatose state and Calician lacked the means to communicate with his fleet of battleships. The Dyarchy Fleet's warships were captained by Celegians and were intended to operate as an organic extension of the twin's planet-bound command. Without its centralized leadership, it could not function. This scene of chaos enabled Akadia's fleet to enter the Bylluran system and easily wipe the fleet and occupy the capital city Hestobyll with minimal resistance. Arkadianate forces freed the enslaved Celegians and imposed a military occupation which heralded a transition to Arkadianate rule."}, {"tag": "p", "text": "Narsk was present when Arkadianate soldiers executed the deposed Regent Calician who calmly accepted his demise. He later presented these findings in a report to his employer Arkadia who justified Calician's death due to his role as the mastermind who manipulated the twins' powers. During the battle, Arkadia's fleet also intercepted the Diligence and made contact with Kerra and Rusher, offering to provide help and shelter to their refugee passengers in exchange for handing over Quillan. The Diligence accompanied Arkadianate's war fleet back to her capital of Syned and the two parties formally met each other on the frozen surface on the outskirts of her capital Calimondretta."}, {"tag": "h3", "text": "The Jedi and the Mercenary"}, {"tag": "p", "text": "During this meeting, Arkadia met Kerra and Rusher, the two de facto leaders of the Diligence. Arkadia stated that she was here to help and offered to give shelter for the refugees aboard the Diligence. She also requested that Lord Quillan of Byllura be handed over to her custody. Kerra was initially apprehensive until Arkadia revealed that Quillan was her brother and professed to care for the well-being of her younger brother. Kerra and Rusher quickly produced Quillan, who remained in a semi-catatonic state, and was accompanied by the teenaged Sullustan girl Tan Tengo and one of Rusher's mercenaries: the Duros Beadle Lubboon. Arkadia then took her visitors on a tour of her capital city Calimondretta. Syned had been recently colonized and Arkadia's city had been built within a series of connected ice calderas."}, {"tag": "p", "text": "Compared to other Sith worlds like Darkknell and Byllura, Calimondretta and its citizens appeared to be more affluent and well-maintained. During the tour, Arkadia praised her guests for \"making history\" by helping her to bring about the defeat of the Dyarchy. She complimented Kerra by remarking that she was a destabilizing factor wherever she went in Sith Space. She also attributed her recent victory to its leader Quillan's dependence on using a physical linkage to maintain his power, since that linkage could be attacked. While touring Calimondretta's streets, Kerra also had a brief reunion with the Bothan spy Narsk Ka'hane, whom she had overpowered and subsequently helped to escape during an earlier mission to Darkknell, the capital of the Daimanate."}, {"tag": "p", "text": "Kerra and Rusher learnt that Narsk was an independent operator who had been working for several different Sith Lords, and that he was \"currently\" working for Arkadia. Narsk also gave a brief report of the ongoing Arkadianate occupation of Byllura. He also revealed that Quillan's twin Dromika still remained on her mountain top home but was now under Arkadianate custody. Arkadia remarked that she had arranged for the twins to separated permanently due to the strong Force connection between them. With Dromika free from the domination of her twin brother Quillan, Arkadia expressed her hope that she could now have a better life. Arkadia also justified the execution of Regent Calician on the basis that he had been the mastermind who manipulated Quillan and Dromika to further his own grandiose ambitions of galactic domination."}, {"tag": "p", "text": "Arkadia complimented Kerra for inadvertently helping the Arkadianate cause by being a destabilizing force wherever she went in Sith Space. Narsk demands to have his stealth suit returned to him. She then allowed her to go on a tour of Calimondretta with the Herglic tour guide Seese. During the tour, Kerra became acquainted with ordinary life within the Arkadianate. While she liked Arkadia's socially progressive policies and the absence of violent coercion within her domain, Kerra felt uncomfortable about the former's policies of rotating people through different occupations throughout their lives. Meanwhile, the Sullustan student Tan was completely bought over by Arkadia's charismatic personality and \"utopian\" society particularly its well-run Promisoriums. Due to her impoverished background growing up in the Daimanate, Tan had little exposure to other parts of the galaxy. At one point, the teenaged Sullustan gave Arkadia a hug, which pleased the Sith Lord but caused Kerra to wince."}, {"tag": "p", "text": "Arkadia saw this as an opportunity to promote a favorable image of her realm by inviting Tan to tell her friends aboard the Diligence about the supposedly \"good life\" waiting for them in the Arkadianate. Arkadia also sent one of her Twi'lek assistants Warmalo to help Rusher replenish his stock of food for the refugees. Rusher himself was surprised by the wide variety of food available within the Arkadinate. Sensing that the Twi'lek had outlived his usefulness as a cargo worker, Arkadia had him reassigned to a new position as the director of metallurgical operations on Syned. When Kerra queried on whether the Twi'lek had any training in metallurgy, Arkadia merely replied that Warmalo had the same grounding she expected from all her people. She added that he had been working on the same assignment for three months and thought he could do more."}, {"tag": "p", "text": "Arkadia justified her rotational policies on the pretext that she liked to instill the traits of flexibility and versatility among her subjects. She also claimed that constant revival was needed to ensure that a Sith Lord's rule lasted forever. Kerra quickly recognized that her policy of rotating everyone was an insurance policy that preserved her rule. Her more skilled underlings never became rivals because they were always having something new to do in order to maintain their place in society. While, Arkadia offered sanctuary to all the refugee students on Syned, Kerra still did not trust the Sith Lord. She sensed that Arkadia wanted to utilize her services in return for guaranteeing the safety of her student refugee charges. In the case of Rusher however, Arkadia was not interested in recruiting mercenary groups like Rusher's Brigade because she regarded their thinking as too narrow. Finally, Arkadia departed to prepare for a meeting at her museum in Calimondretta."}, {"tag": "p", "text": "While Kerra remained aloof and suspicious of Arkadia, Rusher by contrast was completely taken in by Arkadia's personality and utopian policies. He revealed that the Arkadianites had offered to provide a big icecrawler to transport the Diligence and all its passengers to Calimondretta, where they would be given refuge. He also argued that they should remain on Syned since they lacked any knowledge of reliable hyperspace routes that would allow them to travel back to the Republic safely. Kerra then criticized Rusher for her willingness to work for different Sith Lords. This led to a heated argument between the two erstwhile allies with Kerra arguing that Rusher should put his energies into working for the people. Rusher responded that he had to care for the lives and well-being of his crew and passengers. One of Arkadia's Citizen Guards then interrupted their conversation to summon Kerra to participate in a meeting at the museum. Meanwhile, Rusher was instructed to wait outside for a meeting at Arkadia's Museum. Brigadier Rusher is instructed to wait outside once he had finished work with the Arkadianate engineers. Kerra sensed that Arkadia had not asked for anything yet but has only given in. Before leaving for the meeting, Kerra instructed Rusher to look after the kids and his crew."}, {"tag": "h3", "text": "The Bequest"}, {"tag": "p", "text": "While in Arkadia's museum, Arkadia conversed with her guest and traditional foe: Kerra. The first topic they discussed was a handcrafted branding tool on display that had been crafted by a single artisan who had worked in that field for thirty years. She was driven out of the market by a Republic company which was able to replicate the tools at a hundredth of the price. Out of humiliation, the artisan committed suicide by throwing herself into the sea. After smashing the branding tool, Arkadia surmised that the idea of spending a lifetime in a single pursuit was a recipe for stagnation, for obsolescence."}, {"tag": "p", "text": "When Kerra suggested that Arkadia's policies were running her people to their deaths, Arkadia pointed out in response that the Galactic Senate was also dominated by commercial interests. They created occupations but did not guarantee them since the Republic's capitalist economy allowed competitors and new technologies to prosper without any regard for those whose livelihoods were disrupted. Kerra replied that the Republic's citizens chose to face those challenges. Arkadia defended her system by claiming that under her rule, her people at least knew when change was coming. For the Sith Lord, change in the Arkadianate had meaning and served a cause, which happened to be her own. While Kerra regarded Arkadia as misguided, she had to concede that Arkadia was logical. Arkadia urged Kerra to question her own long-held beliefs that all Sith were the murderous villains, adding that no one would be able to run a galaxy while in that."}, {"tag": "p", "text": "Kerra demanded that the students be released but Arkadia refused, stating that she was not going to release the lives of those she controlled in exchange for gaining the trust of a Jedi outsider. However, she offered to give them refuge and claimed that she had something else that would be of great value to the Jedi woman. Acknowledging that Kerra had come into Sith space to fight the Sith and to help some of the people under their sway, she rightfully sensed that Kerra wanted an explanation for the internecine conflicts occurring throughout the galaxy. Arkadia added that she needed Kerra's help but first she had to show something that no one outside Sith space knew: the Bequest. After explaining the intricate family dynamics of the Calimondra family and the complex histories of the two Charge Matricas, Arkadia allowed Kerra to observed the proceedings provided she remain hidden behind the shadows. She warned the Jedi Knight that she would have to kill her if she was spotted."}, {"tag": "p", "text": "The Bequest was conducted via hologram with each member being able to participate in the meeting despite their disparate locations throughout the Grumani sector. The pylon where these holographic images were projected also doubled as a star map. At the center of this pylon stood a figure of the Sith family matriarch Vilia Calimondra; who congratulated her children on the liquidation of the Quermian Sith Lord Ayanos Bactra, the ruler of the Bactranate who had outlived his usefulness to the Calimondra family. She divided up the territories of the former Bactranate to the Sith Lords Daiman, Odion, Lioko, and Malakite—those four warlords who had been situated nearest to the former Bactranate. During the bequest, Daiman inherited Bactra's corporate assets including Industrial Heuristics and its affiliated enterprises. While Daiman was pleased with his acquisition, Odian objected and claimed that he had a rightful stake to the company since it was based in Jutrand, the former Bactranate capital which had fallen under the Odionate. In an attempt to appease Odioan, Vilia allowed him to keep Jutrand but ordered that he allow the company's executive staff enough time to relocate to Daimanate territory. However, an enraged Odion retorted that he would kill the staff rather than allow them to fall into the hands of his estranged younger brother, who he hated passionately."}, {"tag": "p", "text": "In response, Vilia reminded her family that despite their differing philosophies, they had to preserve corporations since they were essential economic assets in the war effort against the Galactic Republic. When Odion dismissed corporations as mere tools of the Republic, Arkadia herself responded to her cousin Odion that the Republic was controlled by corporations. As quid pro quo, Vilia proposed a deal where she would compensate Odion's loss by sending two legions of Trandoshan slave warriors from her own forces to augment Odion's forces. They would arrive in the Odionate within the span of three days just as the Industrial Heuristics staff departed for the Daimanate. Odion reluctantly complied but tensions would linger between the two brothers, which would affect the politics of the Grumani sector. After Vilia had finished distributing Bactra's remaining corporate assets among her grandchildren, the meeting turned its attention to Arkadia's recent annexation of the Dyarchy."}, {"tag": "p", "text": "Arkadia explained that she had taken custody of the former Dyarchy's twin rulers: Quillan and Dromika. The catatonic Quillan was brought into the Bequest in a hover chair, completely oblivious to the ongoing proceedings. Vilia was concerned about the well being of her younger grandchildren. Arkadia assured that they were being well taken care of and that she had kept them apart. Vilia granted Arkadia complete jurisdiction over Byllura and the former Dyarchy territory. Arkadia and her grandmother discussed about the future of the two dysfunctional Sith twins, explaining that it was best that the twins be kept apart for their own safety. Dromika was still on Byllura but the catatonic Quillan needed more attention, with Arkadia adding that Vilia would be best suited for providing that role."}, {"tag": "p", "text": "While Vilia was initially surprised at Arkadia's request, she agreed and requested that the teenaged boy be brought to her secure home. For secrecy, Vilia insisted on transmitting the coordinates via a secure channel. She complimented Arkadia for her task, praising her for her intelligence and reasoning. Following the end of the Bequest, Kerra confronted Arkadia about the power dynamics of the Calimondra family, expressing her shock that Matriarch Vilia had the power and influence to make her grandchildren stop fighting. Kerra then asked why the various Sith warlords did not work together for all the time. Arkadia explained that any cooperation between members of her Sith family was brief, often lasting barely ten minutes. She explained that her grandmother held significant leverage due to her own conquests and various marriages to several deceased husbands who died under suspicious circumstances. Since Vilia held a large amount of wealth, military power, and corporate holdings, she was able to keep her descendants in line by doling out presents to keep them in the political game. Due to the enormous stakes involved, Arkadia explained that no one wanted to fail the Charge Matrica and their grandmother."}, {"tag": "h3", "text": "A High Stakes Gambit"}, {"tag": "p", "text": "Arkadia then tried to recruit Kerra as an assassin, explaining that this was the very purpose she had brought her into the Bequest. As part of the plan, Kerra would serve as her personal courier to transport Quillan to Vilia, and would then assassinate the matriarch of the Calimondra family. While acknowledging Vilia as her grandmother, she attributed the endless fighting within the sector to the former's alleged madness. Arkadia tried to justify her conspiracy to assassinate her grandmother by arguing that Vilia was so preoccupied with power that she staged the Charge Matrica as a means of preventing the emergence of a successor. Arkadia resented the fact that her grandmother had been subtly encouraging her descendants to attack each other. She derided the Bequests as a farce meant only to exacerbate the competition within her family. Finally, Arkadia alleged that Vilia may also have had a hand in the fatal poisoning of her late father Chagras, who had succumbed to a potent nerve toxin which overcame his abilities to heal."}, {"tag": "p", "text": "Arkadia explained that she was unable to carry out the assassination herself since her grandmother had dozens of secret retreats and that her bodyguards kept a close watch on familiar presences. As a Jedi Knight, Kerra was regarded as her first choice since Jedi assassins had a reputation of being clean operatives. Finally, she tried to play on Kerra's personal feelings by claiming that Vilia had authorized the invasion of her homeworld of Aquilaris Minor; sensing that the young Jedi woman was a guerrilla operative for her own cause of protecting the common people and fighting for justice against the Sith warlords. However, Kerra unequivocally turned down Arkadia's offer, stating that she was a Jedi and would never work for a Sith. Kerra's recalcitrance angered the Sith Lord who activated her double-bladed lightsaber and ordered her Citizen Guards to take the Jedi woman into the dungeons."}, {"tag": "p", "text": "After departing the museum, Arkadia confronted Jarrow Rusher. She demanded that the refugee passengers aboard the Diligence be brought immediately to Calimondretta. An icecrawler was waiting at the southern garage bay to transport the vast troop ship and its student passengers to the settlement's main atrium. She promised that she would only then allow Rusher and his mercenaries to leave Syned, handing him a set of secure coordinates in a datapad. In reality, she intended to kill them by sending them on a one-way journey to the Nakrikal Singularity, a black hole. When Rusher queried about Kerra and offered to take the Jedi offworld, Arkadia replied that she would be imprisoned at the Impound and then executed as a threat to the Sith. Due to the historic animosity between the two Force-wielding orders, the Sith Lord was unwilling to allow an enemy Jedi to create havoc in her domain, just as she had done so earlier in the former Dyarchy. Arkadia also intended to interrogate the Jedi woman on any intelligence about the Republic and other Sith warlords before executing her personally."}, {"tag": "p", "text": "With Kerra unwilling to work as her assassin, Arkadia instead enlisted the services of Narsk and assigned him with the task of transporting Quillan to their grandmother's secure location. In return for his services, Narsk got Arkadia to successfully pressure Brigadier Rusher into return his stolen stealth suit. Unknown to Arkadia, Narsk had always been secretly in the services of Vilia Calimondra, his true master. While the Bothan had not been present at the family bequest with Arkadia and Kerra, he had received an encoded signal from Vilia through his embedded implant, telling him to beware of his current employer. Through unknown means, Vilia had sensed that her eldest granddaughter was posing a threat to her rule. After receiving his latest set of orders, Narsk convinced Rusher to work against Arkadia's orders, claiming that they would pose a danger to his crew. After briefly outlining plans for an escape attack from Syned which involved both explosives and sending one of his crew to fetch both Narsk's stealth suit and Kerra's lightsaber, Narsk gave Rusher part of the hyperspace coordinates to a jump-point in uncontrolled space which would bring them to another hyperspace lane leading to the Republic. He promised to give the other half of the coordinates to Kerra on the condition that she helped create a distraction that would allow both parties to escape the Arkadianate."}, {"tag": "p", "text": "Unaware of Vilia's secret counter-plot, Arkadia had a modified shuttle prepared for a single hyperspace jump to her grandmother's top secret destination at Embarkation Station 7. She explained to Narsk that his primary mission was to assassinate Vilia. Since the Bothan lacked the Force abilities and lightsaber combat skills of a Force-wielder, Narsk's weapon would consist of a remote-controlled series of pods containing the deadly nerve toxin Chagras's Blood. These nerve toxins had been harvested from Synedian algae, a flora indigenous to the planet Syned. Upon arriving on Vilia's world, he would slip out of the vessel unseen, shadowing Quillan. Once he located both Quillan and Vilia, he would activate the nerve toxins hidden in the chair; killing both targets and plunging her empire into anarchy. Arkadia hoped to benefit from this chaos by annexing other territories, thus furthering her larger ambitions of galactic dominance. In the event that the shuttle was captured by a third party, Narsk would claim that he was working for the Odionate in order to avoid attracting attention to Arkadia. For the mission, Narsk would be hidden within a secret compartment within one of the starship's engines."}, {"tag": "p", "text": "Since the planned assassination of Vilia would destabilize the Grumani Sector's political order, she had assembled several military parties to take advantage of the ensuing chaos by launching strategic attacks on the Arkadianate's neighbors. As part of her expansionist blitz, Arkadia planned to deploy the nerve toxin known as Chagras's Blood to wipe out any resistance. She intended to use the inmates at the Impound including Kerra as her test subjects prior to their operational deployment. During the meeting, the Duros mercenary Beadle Lubboon arrived in an environment suit, carrying Narsk's stealth suit within his pouch. Rusher had sent Lubboon to deliver both the stealth suit and Kerra's lightsaber, knowing that the cumbersome Duros would not attract Arkadia's suspicion. The Duros had managed to smuggle the lightsaber past Arkadianate security by hiding it within the left arm of his spacesuit. Feigning that his left arm had been injured during a fall, Lubboon was allowed by Arkadia to depart for the infirmary for medical attention."}, {"tag": "p", "text": "Arkadia's experiences with Lubboon's clumsy antics gave her a poor impression of Rusher's mercenaries, leading her to reject their services earlier. She planned to kill them by leading them into a rogue hyperspace lane to prevent any information about the Arkadianate from leaking to her enemies. Since Rusher's forces had been reduced to a paltry rump consisting of two artillery cannons, she reasoned that it was uneconomical to employ their services especially since she had already invested much resources into her biological nerve toxins. In return for his services, Arkadia paid the Bothan spy a datachip containing a wealth of intelligence she had gathered on her neighbors in the Grumani Sector. The Sith Lord explained that this information was highly-sought after by various different parties seeking to gain a strategic advantage in the Second Charge Matrica. The datachip was attached to the central gas canister in the hoverchair containing the nerve toxin."}, {"tag": "p", "text": "Following the meeting with Arkadia, Beadle left for the infirmary as well by feigning an allergic reaction to the algae. There, Narsk obtained Kerra's lightsaber from Lubboon and infiltrated the Impound using his stealth suit. After breaking Kerra out of her prison, he convinced the Jedi woman to help her create a diversion that would allow both the Diligence and Narsk to escape the Arkadianate after convincing her that he was working for someone opposed to Arkadia's plans. In return for agreeing to this task which Rusher was already involved in, the Bothan also supplied Kerra with the remaining half of the hyperspace coordinates. However, Kerra and Narsk were unable to free the remaining prisoners at the Impound since they had already been exposed to the deadly Chagras's Blood and quickly succumbed to the effects of the nerve toxin within minutes. When Kerra asked why Narsk had spared her life despite working for Vilia, Narsk replied that he did so because he had no orders to kill her before departing on a turbolift."}, {"tag": "h3", "text": "The Counter-Plot"}, {"tag": "p", "text": "After freeing Kerra, Narsk returned back to Embarkation Station 7. While he was unaware about the full extent of Arkadia's plans for Vilia, the Bothan spy knew he would need a diversion for Vilia's counter-plot to succeed. Narsk also recalled that Arkadia had attached a timer to the gas canister assembly under the hover chair destined to be used during the assassination attempt. Narsk quickly realized that Arkadia had planted a fail-safe so that the nerve toxin would still be released even if Narsk failed or abandoned his assignment. When Arkadia asked Narsk what had kept him away so long, the Bothan claimed that he had to run his stealth suit through some diagnostics on the pretext that the Jedi woman had not taken care of it properly. Arkadia used the Force to levitate the catatonic Quillan onto his new velvet hover chair, which contained the nerve toxin gas canister. She then bid farewell to her younger brother, telling him that he never had a chance in life but that he would instead avenge their father through his death."}, {"tag": "p", "text": "Since Quillan dwelled entirely in his mind, he was not cognizant of any of the developments occurring around him. Prior to sending Narsk away on his mission, Arkadia instructed the Bothan to contact her via the encrypted channel programmed into his datapad after his mission had succeeded. At that moment the emergency sirens in the hangar activated. Arkadia and Narsk quickly learnt that Kerra had escaped the Impound. Arkadia was furious and commented that somebody had helped the Jedi woman to escape from her intended \"morgue.\" With the shuttle ready for departure, Arkadia departed to attend to this situation but ordered one of the Wookiee Citizen Guards present to ensure that the Bothan closed his hidden chamber securely so that he would not die from asphyxiation in space."}, {"tag": "p", "text": "Meanwhile, Rusher and his crew kept to their side of the bargain with Narsk and hijacked the icecrawler \"Crawler One\", using it to transport two artillery cannons. They deployed the icecrawler as a trojan horse and used it to infiltrate Calimondretta. Once inside the fortress city, Rusher and his mercenaries launched their diversionary attack, causing significant interior damage to Patriot Hall. Arkadia's Citizen Guards also caught up with the Jedi escapee Kerra but were no match for the lightsaber-wielding Force-user. In response, an enraged Arkadia ordered her troops to deploy thermal detonators into the public square Reflection Prospect in a desperate attempt to kill the Jedi threat. However, Kerra survived the assault but many civilians and guards were killed or wounded during the conflagration. Further damage to Arkadia's assets were caused when the Diligence detached both its massive cargo assembly pods into Syned's two tractor beam emitters and Arkadia's military fleet, which had been assembled for a blitzkrieg against Arkadia's neighbors in the event that Vilia was assassinated."}, {"tag": "p", "text": "While Arkadia was preoccupied with the intruders on two separate fronts, Narsk sprung his plan into action. He immobilized the Wookiee Citizen Guard by knocking her unconscious. With the technicians tending to Quillan preoccupied by the fighting, Narsk switched Quillan back into his original hoverchair but left the dangerous burgundy one behind in the hangar bay. Narsk also got an unsuspecting Human mechanic to help him push Quillan and the hoverchair into the shuttle's passenger compartment. After attending to Quillan, Narsk entered his hidden engine compartment and activated the vessel's droid pilot. When the ground crew realized their mistake and attempted to stop the shuttle, the Bothan spy activated the nerve toxin assembly system within the burgundy hoverchair; killing them and covering his escape. While Narsk's ears were subsequently permanently damaged by the thunderous roar of the accelerating engines, he had effectively sabotaged Arkadia's conspiracy to assassinate her grandmother and thus plunged the Calimondra dynasty into a crisis from which she could benefit."}, {"tag": "p", "text": "Arkadia subsequently encountered her Jedi opponent at her own museum and the two engaged in a lightsaber duel with the former wielding her double-bladed lightsaber. She expressed her bewilderment and anger at Kerra's successful escape from the Impound but reiterated that it would stop here. Kerra parried with Arkadia but the novice Jedi Knight was unable to match the lightsaber dueling skills of the Sith Lord. The two Force-wielders also goaded each other with Arkadia deriding Kerra as a Padawan while the Jedi Knight in return labeled the Sith Lord as a petty dictator. Arkadia was angered by this comparison, voicing that the Arkadianate was an enlightened regime. Kerra retorted by asking what \"enlightened Sith\" would want to kill their grandmother. Arkadia charged towards the Jedi Knight with her lightsaber but Kerra jumped out of the way."}, {"tag": "p", "text": "Arkadia then utilized the Jar'Kai sword-fighting style, forcing her Jedi opponent into a retreat. Arkadia remarked that she had been a fool to expect a Jedi to do her \"dirty work\" but expressed her comfort in the belief that Narsk had already left to assassinate her grandmother and brother, unaware of the Bothan spy's duplicity. Kerra criticized Arkadia for her willingness to use her own brother as collateral damage. However, their duel was interrupted by the Diligence releasing its second cargo pod assembly on the remaining tractor beam emitter. The resulting impact unleashed an avalanche of explosives and ice which destroyed the southern walls of the museum, exposing it to Syned's thin atmosphere. With Arkadia distracted, the Jedi woman knocked her over with her legs."}, {"tag": "p", "text": "Arkadia survived the impact and attempted to launch a final charge on Kerra. After Kerra goaded the Sith Lord about her homicidal plans, Arkadia merely expounded her grandiose ambitions of galactic dominance. Before Arkadia could leap on Kerra, Rusher ordered his gunners to fire a precision shot at the museum, which opened a hole in its roof and allowed Kerra to escape to the surface. The Brigadier had known that his erstwhile ally was still in Calimondretta and found out that she was at Arkadia's museum due to a tag planted on the latter's lightsaber. Kerra escaped onto Syned's frigid surface where she was rescued by Rusher. After evacuating five hundred defecting Arkadianate citizens who were unhappy with life under Arkadia, the Diligence escaped into hyperspace. However, they left their artillery guns behind since they were too heavy to transport. Meanwhile, Arkadia survived the artillery attack but much of her capital and military assets were damaged or destroyed."}, {"tag": "h3", "text": "Failed Ambitions"}, {"tag": "p", "text": "The escapes from Calimondretta marked a humiliating defeat for Arkadia Calimondra. Besides being deprived of the Diligence's student passengers, substantial military assets including her chemical weapons factories and parked battle fleet were destroyed. Much of Calimondretta suffered extensive war damage and many civilians and soldiers had been killed during the fighting. Kerra's successful escape meant that the lone Jedi Knight still posed a threat to Sith interests within the Grumani Sector. Adding insult to injury, Kerra also took Arkadia's prized twin-bladed lightsaber as a personal souvenir. Most importantly, Arkadia's plot to assassinate her grandmother Vilia failed completely. After contacting Arkadia, Narsk Ka'hane learnt from her that his spur of the moment plan had succeeded. By claiming that he had been in the hidden compartment throughout the entire duration of the fighting, Narsk was able to escape her suspicions that he had been involved in the counter-plot."}, {"tag": "p", "text": "Narsk also alleged that he arrived on Vilia's planet with the wrong hoverchair, leading Arkadia to surmise that her aides had mistakenly loaded the wrong chair aboard the shuttle. She assumed that they had perished when the toxins were prematurely released during the fighting. According to Narsk, an exasperated Arkadia responded curtly to his purported account of the events before cutting off the hologram exchange. In the end, both Quillan and his twin sister Dromika were safely spirited out of the Arkadianate by Vilia's agents and ended up in the custody of their grandmother. However, Vilia kept them on separate worlds due to the curious Force connection between them. Vilia ensured that her son's younger children would be kept away from any opportunists who sought to exploit or kill them. The Calimondra family matriarch had preserved the Jedi Knight Kerra Holt since she wanted her grandchildren to have a \"learning experience\" of dealing with Jedi in preparation for the day that the Sith would invade Republic territory and face the Jedi Order again. Vilia also justified her policy of sowing discord within her family as a defining basis of Sith identity."}, {"tag": "p", "text": "Humiliated, Arkadia decided not to discuss the earlier events with her grandmother Vilia who decided to keep her knowledge of the plot a secret from their other family members. During a conversation between Vilia and Narsk, the former tried to deny her involvement in the death of Arkadia's father Chagras by presenting an alternative theory that Arkadia had the motive and means for murdering her father. Vilia portrayed Arkadia as an ambitious younger daughter who feared that her father's legacy would go to younger, and more favored siblings. She also cited Arkadia's expertise in nerve toxins, the weapon that had brought the death of Chagras, as circumstantial evidence. Vilia then surmised that anyone could also construct a case against Arkadia in the same way manner that they could build one against her. For the Calimondra family, shared illusions mattered as much as bloodlines in explaining the complex and fraught relationship between its various members."}, {"tag": "p", "text": "The defections of five hundred Arkadianate citizens who fled aboard the Diligence dealt a death blow to Arkadia's earlier rhetoric that the Arkadianate was an enlightened island of stability within Sith Space. Due to the heavy damage on Syned, Arkadia was forced to recall substantial forces from Byllura and temporarily set aside her irredentist ambitions to concentrate on rebuilding her war-damaged capital of Calimondretta. It would take some time before Arkadia's forces had recovered to a level that they could serve her expansionist ambitions. Meanwhile, the Jedi Knight Kerra Holt remained at large in Sith Space and still posed a perennial threat to Sith ambitions in the Grumani sector."}, {"tag": "h3", "text": "The Hutt Interloper"}, {"tag": "p", "text": "Later that year, the Calimondra family faced a new competitor: the hawkish Hutt crime lord Zodoh who had ambitions of expanding his operations into Sith Space. He invaded the watery Daimanate planet of Aquilaris Minor, wiping out Daiman's garrison before withdrawing into space. Using a secure holographic transmission, Zodoh contacted the local Sith Lords in the Grumani sector and outlined his irredentist ambitions while offering to establish a business partnership with them. Zodoh's expansionist campaign was met with fierce hostility by the various Sith warlords. During the holo-conference, Arkadia's cousin Odion made xenophobic remarks about the Hutt's physiology and threatened to harass his business operations. Arkadia agreed with her cousin's sentiments and angrily slammed Zodoh for treating her like a gangster."}, {"tag": "p", "text": "Zodoh replied to Arkadia's remark by likening the Sith warlords to a bunch of \"petty crooks\" who fought over crumbs while neglecting the banquet. He compared the Sith warlords within the Grumani sector to other Sith in Hutt Space who degenerated into petty squabbles after the Galactic Republic severed all hyperspace communication relays, effectively bring interstellar travel and commerce to a halt throughout much of the galaxy. Zodoh also stressed the supremacy of the Hutts by claiming that the Hutt clans were able to survive despite the collapse of governments because they had protocols for talking to each other and moving goods and weapons. The smarter Sith Lords in Hutt Space had realized this fact and made peace with the Hutts while the others had been driven out of the market."}, {"tag": "p", "text": "Zodoh claimed that he had come to spread his business franchise in the Grumani sector. He also offered to become their main supplier of slaves and ammunition if they were willing to develop a constructive relationship with him. However, if they resisted, Zodoh promised he would play rougher than the Sith. Finally, he told the assembled warlords to tell their spies to observe developments in Aquilaris in the near future before ending the transmission.During the Aquilaris campaign, Zodoh used his Stormdrivers—large capital ships equipped with weaponized vaporizers—to artificially flood Aquilaris Minor, inundating large areas of the planet. Zodoh had these developments broadcast during a second holo-conference with the Sith Lords. Arkadia was present during that conference and agreed to a deal with the Hutt lord where the Sith warlords would conspire against the Daimanate by keeping Daiman's forces preoccupied with border skirmishes."}, {"tag": "p", "text": "This had the effect of weakening Daiman's military defenses during the Battle of Darkknell when Zodoh's Stormdrivers flooded his capital world of Darkknell. However, Daiman was saved at the eleventh hour by the intervention of the Jedi Kerra and the Republic starfighter captain Jenn Devaad who destroyed Zodoh's flagship Voracious, ending the Stormdrivers's artificially induced flood. Following the battle, Zodoh was captured by Daiman's cruisers and taken as a captive to his palace Sanctum Celestial at his capital city of Xakrea. Arkadia along with Odion and Lord Malakite were present when Daiman executed the Hutt interloper. This effectively ended any Hutt ambitions of challenging Sith dominance in the Grumani sector."}, {"tag": "h3", "text": "Odion's Apocalypse"}, {"tag": "p", "text": "Later, her cousin Lord Odion resumed Project Pandemonium, a top-secret Odionate project aimed at recovering the Helm of Ieldis, an ancient Sith artifact. The Helm had been created by the Sith Lord Ieldis prior to the Great Hyperspace War and was capable of driving sentient beings into a homicidal frenzy. In line with his nihilistic ambitions of ending all life in the galaxy except his own, Odion attempted to use the Helm to launch a galactic apocalypse. Since this threatened the balance of power within the Calimondra family, Vilia ordered her other grandchildren to set aside their differences and to put a stop to Odion's planned apocalypse. Arkadia along with her cousins Daiman, Malakite and Lioko contributed military contingents to this allied armada and made their way to Vanahame."}, {"tag": "p", "text": "However, Odion succeeded in activating the Helm by tapping into the raw emotions of the child captives at the Odionate cloister on that planet. The allied armada momentarily succumbed to the homicidal frenzy. However, Odion was thwarted by the Jedi Knight Kerra Holt and Odion's former second-in-command Beld Yulan, who had freed the children. Following the death of Odion, the Odionate collapsed and was divided up among his relatives. It was presumed that Arkadia participated in the partition of the former Odionate given her own irredentist territorial ambitions."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Arkadia Calimondra was considered a charismatic and unorthodox leader by the standards of Sith Lords during the Republic Dark Age. Unlike most of her other relatives in the Calimondra family, Arkadia was known for her sense of logic which even attracted the admiration of her nominal opponents like Jedi Knight Kerra Holt and the mercenary leader Jarrow Rusher. Unlike her cousin Lord Odion, Arkadia was not given to carelessly listening to her emotions but instead preferred to resolve a problem through reasoning. She inherited these traits along with her frank and direct personality from her grandmother Vilia Calimondra, the family matriarch who had been responsible for initiating the protracted Charge Matrica conflicts among her descendants."}, {"tag": "p", "text": "Arkadia was also a skilled and reassuring communicator who was able to induce a comfortable atmosphere while garnering their respect. Even her erstwhile opponents Kerra and Rusher had to concede that she had a serious and direct demeanor. Arkadia also had a friendly and approachable personality which caused some to lower their guard. The teenaged Sullustan refugee Tan Tengo liked her personality and reformist educational policies to the extent that she gave the Sith Lord a hug, which caused Kerra to wince. She also almost managed to convince her Jedi adversary Kerra that the society she had created was better than anything else in Sith space. However, Kerra was unwilling to trust her since she recognized that all Sith Lords including Arkadia herself crave power and domination at all costs."}, {"tag": "p", "text": "Despite her positive traits, Arkadia was still not above using anger, hate, murder, and other \"dark side\" emotions when the situation arose. One of Arkadia's true talents was deception. At her first meeting with Kerra, she professed to genuinely care about the wellbeing of her younger brother Quillan—the former ruler of the Dyarchy which she had formally annexed. During a family Bequest session, Arkadia continue to maintain this charade by verbally agreeing to transport the adolescent to a safe location in her grandmother's empire. In reality, Arkadia planned to assassinate both her grandmother and younger brother for the purposes of avenging the death of her father and to remove a rival claimant respectfully. However, this plot fell apart due to Kerra's unwillingness to serve as her pawn and the Bothan spy Narsk Ka'hane switching Quillan's nerve gas-laden repulsorlift chair for a different one."}, {"tag": "p", "text": "As with other Sith Lords, Arkadia was not above using murder to achieve her goals. Besides conspiring to kill Vilia and Quillan, Arkadia had the deposed Dyarchy regent Saaj Calician murdered to remove a threat to her imperial ambitions. While she attributed the death of her father Chagras to the machinations of her grandmother, her grandmother argued that Arkadia was an equally likely suspect, citing her expertise in nerve toxins, the weapon which Chagras succumbed to. Finally, she attempted to kill her Jedi opponent Kerra on several occasions including imprisoning her at the Impound and even unleashing thermal detonators following her escape, an action which resulted in the deaths and maiming of many of her own subjects who were caught in the cross-fire."}, {"tag": "p", "text": "Arkadia may have had some cause to regret sacrificing Quillan to accomplish her revenge; she believed that he \"never had a chance to live.\""}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Arkadia was skilled in the use of a double-bladed lightsaber, as well as Jar'Kai. Her weapons could be connected to each side of a staff and disconnected from it, if she wished it. Besides being skilled in lightsaber combat, Arkadia also was knowledgeable about contemporary galactic politics and economics, as shown when she concurred with her grandmother's assessment that corporations were valuable to the Sith war effort and should not be easily destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arkadia Calimondra first appeared as a point-of-view character in John Jackson Miller's 2011 novel Knight Errant, where she plays an antagonistic role in the third section of the book as a 'benign' autocratic dictator. She plays a lesser role in the Star Wars: Knight Errant comic series though she has made cameo appearances in two issues of the Deluge story arc, which ran from August 17 to December 21, 2011. She was also briefly mentioned in passing in Knight Errant: Escape 5, which debuted on October 10, 2012."}, {"tag": "p", "text": "Miller admitted that he conceptualized Arkadia as a \"self-imagined goddess of wisdom\" in contrast to the madness of the other Sith warlords. Arkadia's employment practices were influenced by real-world corporate models described in Bryan Burrough's book Barbarians at the Gate: The Fall of RJR Nabisco including one case where an executive routinely switched people who had achieved competence in their old jobs to prevent the emergence of rival power bases within the company."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}