{"url": "Arkadianate", "categories": ["Category:Legends articles", "Category:Interplanetary governments", "Category:Sith states and governments"], "nodes": [{"tag": "h1", "text": "Arkadianate"}, {"tag": "p", "text": "The Arkadianate was a Sith state that was located in the Grumani sector during the Republic Dark Age and the Sith civil war. It was led by the Sith Lord Arkadia Calimondra and the frozen planet Syned served as its capital. The Arkadianate had borders with the Dyarchy, a Sith state that was ruled by Arkadia's siblings, Dromika and Quillan, and in c. 1032 BBY, Calimondra's forces annexed the Dyarchy."}, {"tag": "h2", "text": "Politics and society"}, {"tag": "p", "text": "The Arkadianate was an autocratic dictatorship dominated by its titular leader Arkadia Calimondra, a Sith warlord during the Republic Dark Age. Its name reflected a naming convention within the Sith territories in Grumani sector of placing the suffixes \"-ate\" or \"nate\" after the Sith Lord's name. The Arkadianate was governed according to Arkadia's personal philosophy of continually rotating her subjects through different jobs. In one case, the Herglic mother Seese had worked in at least five different occupations including teaching, algae-processing, metallic reclamation, as a tactical officer on Arkadia's flagship New Crucible, and a tour guide on Calimondretta."}, {"tag": "p", "text": "Arkadia herself would often personally reassign her subjects at short notice with no means of appealing this decision. She justified this policy on the rationale that it instilled flexibility and versatility among her subjects by providing them with experience in different lines of work. In reality, it was designed to prevent the emergence of any potential domestic threats to her rule since it kept even her most skilled subordinates perpetually preoccupied with new assignments. While the fate of Arkadinate citizens who failed to fulfill their duties is not explicitly stated, the Jedi Knight Kerra Holt speculated that they were imprisoned and executed."}, {"tag": "p", "text": "In terms of territory, the Arkadianate was an interstellar state that was located in the Grumani sector. Two of its known constituent territories were the frozen planet of Syned and Byllura, which was annexed from the former Dyarchy in 1032 BBY. The Arkadianate's capital was the city of Calimondretta, an underground city on Syned. While the Arkadianate was not as powerful as larger Sith states like the Daimanate and the Odionate, it still possessed substantial military assets including long, crystalline warships and starfighters. The Arkadianate military fleet was known to have participated in the annexation of the Dyarchy and an allied invasion of the Odionate."}, {"tag": "p", "text": "Unlike other Sith Lords who neglected the social welfare of their subjects, the Arkadianate invested substantially in providing extensive social services like education, food, and even clothing. It had a series of schools known as Promisoriums, which were open to diverse species and also boasted extensive dining facilities. From young, citizens were trained to contribute to the state. Arkadia's progressive social policies contrasted with those of her Sith cousins in the Calimondra family. Other Sith Lords like Daiman exploited children as forced laborers while Odion had all the children in his realm imprisoned in a series of planet-sized orphanages known as cloisters."}, {"tag": "p", "text": "The Arkadianate was also able to import large stocks of food to feed its population. In line with her personal philosophy, Arkadia also implemented a policy of making her subjects wear bright clothing allegedly under the pretext of helping them become more \"noticeable and memorable\" individuals. Unlike its neighbors, the Arkadianate did not openly use violence to coerce its subjects into working. Despite these positive qualities, the Arkadianate had some unsavory aspects. Lord Arkadia had her enemies imprisoned in the Impound where they were subjected to torture and execution by being exposed to the nerve toxin Chagras's Blood."}, {"tag": "p", "text": "As with the other Sith Lords in the Grumani sector, Arkadia sought to expand her interstellar fiefdom and become the ruler of the entire universe. To support her military ambitions, Arkadia invested substantial resources into colonizing the icy planet Syned in order to gain access to Synedian algae. While Synedian algae was a good source of energy, it could also be processed into the nerve toxin Chagras's Blood. This toxin was capable of killing various sentient beings within minutes. Arkadia intended to deploy this biological weapon as part of a planned expansionist blitz in 1032 BBY. However, the Siege of Calimondretta damaged the chemical plants producing Synedian algae."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Arkadianate was one of the Sith mini–states that emerged from the ruins of the former Chagras Hegemony in 1040 BBY. Arkadia Calimondra was the eldest daughter of the Sith Lord Chagras, who had accumulated a substantial interstellar empire in the Grumani sector following the First Charge Matrica—a succession struggle that had been orchestrated by his mother Vilia Calimondra to select a heir from her seven children. In this contest, Chagras emerged as the victor. However, Vilia still lived and retained most of her substantial holdings."}, {"tag": "p", "text": "Since his deceased siblings had produced offspring, Chagras had to rely on these nephews and nieces to help rebuild the war-damaged region. During this period, Chagras also sired two other children—the Sith twins Dromika and her brother Quillan. According to Vilia, Chagras favored his younger children over their sister Arkadia which created resentment within the family. By 1042 BBY, Chagras had reconsolidated his forces and was ready to invade the Republic. Chagras' forces invaded and annexed several Outer Rim worlds including Aquilaris Minor."}, {"tag": "p", "text": "However, Chagras died two years after being infected with a powerful nerve toxin that prevented his body from healing. The suspicious circumstances of his death fuelled much speculation and at least two conspiracy theories. His daughter Arkadia pinned the blame on her grandmother Vilia on the basis that Vilia was prepared to use any means necessary to maintain her grip on power. In response, Vilia alleged that Arkadia herself had engineered her own father's death to advance her own political ambitions. Whatever the circumstances or intentions, Chagras' death created a power vacuum that produced a second succession struggle known as the Second Charge Matrica."}, {"tag": "h3", "text": "Consolidation"}, {"tag": "p", "text": "During the conflict, Arkadia created her own interstellar princedom, known as the Arkadianate, which was based around the icy planet of Syned. The underground city of Calimondretta became the capital of her realm. Meanwhile, her younger siblings Dromika and Quillan became the rulers of the Dyarchy—which was centered around the planet Byllura with the Krevaaki Saaj Calician acting as their regent. Due to the Arkadianate's remote location, very little was known about it until after the Battle of Byllura and the Siege of Calimondretta in 1032 BBY. While it was an authoritarian dictatorship, the Arkadianate's society was progressive in comparison to its neighbors. Lord Arkadia invested substantial resources into providing food, clothes, education, and most importantly employment for her subjects."}, {"tag": "p", "text": "Arkadia's personality cult succeeded in instilling a sense of patriotism into her subjects. However, her policy of arbitrarily reassigning her subjects to different jobs was not universally popular. Arkadia was also not above employing malevolent methods of maintaining her grip on power like imprisoning dissidents and enemies at the Loft, a harsh prison where inmates were incarcerated in cabinets and subjected to dangerous experiments. As with her fellow Sith warlords, Arkadia also harbored grandiose ambitions of accumulating an interstellar empire. For these purposes, she invested substantial resources into developing a military star fleet and the biological weapon Chagras's Blood—a nerve toxin that was extracted from Synedian algae. Arkadia's main motives for colonizing Syned was to exploit its vast Synedian algae resources for her war effort."}, {"tag": "h3", "text": "Annexation"}, {"tag": "p", "text": "In 1032 BBY, Arkadia turned her attention to the Dyarchy and sought to annex it. As part of her invasion plan, she contracted the services of the Bothan spy Narsk Ka'hane, an independent operator who had worked for several different Sith employers including the Vilia Calimondra, the family matriarch. Earlier, Narsk had been hired by the Sith Lord Odion to gather intelligence and to destroy a Daimanate military project. After being captured by the Daimanate authorities, Narsk had narrowly escaped captivity with the assistance of his nominal enemy Kerra Holt, a lone Jedi Knight operating in the Grumani sector."}, {"tag": "p", "text": "As part of the Arkadianate invasion, the Bothan spy infiltrated Byllura in a specially modified stealth starfighter and attached a transmitter device onto the Loft's video surveillance system. The Loft was a massive seaside palace in the main city Hestobyll and was the residence of Dromika, Quillan, and Regent Calician. This transmitter device enabled Arkadia to spy on the Dyarchy's leaders and provided her with intelligence about developments occurring on Byllura. Narsk then retreated to a cave in higher ground which he would use to observe developments on Byllura. Since Kerra had also acquired Narsk's stolen Cyricept Mark VI stealth suit on Darkknell, Vilia was able to use its electronic systems to spy on the Jedi woman and learnt that she was also heading to Byllura."}, {"tag": "p", "text": "Kerra had recently escaped from the Battle of Gazzari with Jarrow Rusher, a mercenary leader who led Rusher's Brigade, an independent mercenary group operating in the Grumani sector. Kerra had also brought nearly a thousand student refugees aboard Rusher's ship Diligence. Rusher had reluctantly agreed to transport the students to the next offworld destination. After traveling for several days and making six hyperspace jumps, the Diligence arrived at Byllura. There, Kerra and Rusher's Brigade resisted attempts by the local Sith to forcibly integrate them into the Dyarchy's mental network. This mental ethernet was created by thousands of enslaved Celegians, who had been forcibly pressed into the Dyarchy's servitude by Regent Calician."}, {"tag": "p", "text": "The fighting eventually culminated in a raid on the Loft which ended with the kidnapping of Quillan. During the fighting, Kerra had convinced the leading Celegian known as \"One\" to encourage his compatriots to rebel against their Sith masters and to stop transmitting commands. The travellers' actions effectively decapitated the Dyarchy's leadership and the highly centralized fiefdom quickly descended into anarchy as the population rebelled against their Sith masters. Amidst the fighting, Narsk used the transmitter to monitor the recent development on Byllura and relay the intelligence back to his master. He also learnt about Kerra's presence and used a comlink to contact her and demand the return of his stolen stealth suit."}, {"tag": "p", "text": "After finishing his work on Byllura, Narsk returned to Arkadia's space fleet in his stealth starfighter. For the duration of the campaign, he would remain at the helm of Arkadia's flagship New Crucible. Shortly later, Arkadia's war fleet arrived in the Gazzari system and quickly immobilized the Dyarchy Fleet, a fleet of battleships that had been commissioned by Regent Calician for an invasion of the Daimanate. Arkadianate forces then occupied Byllura's cities with minimal resistance and also liberated the enslaved Celegians. Following the battle, Regent Calician was executed and Arkadia took Quillan and Dromika into her custody. Overnight, the Dyarchy ceased to exist and was amalgamated into the Arkadianate."}, {"tag": "h3", "text": "Setbacks"}, {"tag": "p", "text": "Following the annexation of Byllura, Arkadia offered shelter and refuge to Kerra, Rusher, and the crew and refugees aboard the Diligence. She provided hyperspace codes which allowed them to travel to her remote base on Syned. While Arkadia succeeded in winning over Rusher due to her charismatic personality and a propaganda tour of her capital city of Calimondretta, Kerra remained distrustful of the Sith Lord's intentions. Kerra's suspicions were later confirmed when Arkadia tried to recruit the Jedi woman as an assassin to kill her grandmother Vilia Calimondra. As part of this plot, Arkadia had planned to used Kerra as a courier to escort her younger brother Quillan to Vilia's homeworld. Arkadia also revealed her intentions to exploit her grandmother's death as an opportunity to launch an expansionist campaign. When Kerra refused, Arkadia had her imprisoned at the Impound and ordered Rusher to bring her the student refugees so that they could be assimilated into Arkadianate subjects."}, {"tag": "p", "text": "However, Vilia learnt of Arkadia's plot and ordered her agent Narsk Ka'hane to sabotage her granddaughter's plans. He succeeded in convincing Rusher to launch a siege of Calimondretta so that he could escape back to Vilia with Quillan. Narsk also freed Kerra from her prison and also succeeded in convincing her to create a diversion. In return for their help, the Bothan spy provided the two Humans with hyperspace coordinates leading to neutral space. During the Siege of Calimondretta, Rusher's Brigade inflicted significant damage to Calimondretta's infrastructure and casualties on Arkadia's Citizen Guards. During the fighting Rusher's forces also weakened Arkadia's military–industrial complex by damaging several factories manufacturing the nerve toxin Chagras's Blood and several warships which the Sith Lord had assembled for strategic raids on other Sith states in the event that Vilia was assassinated."}, {"tag": "p", "text": "At the climax of the fighting, Arkadia dueled Kerra in a lightsaber duel. Despite her superior swordsmanship, Kerra was able to escape due to an artillery strike by Rusher's forces. As a result of the fighting, Kerra, Rusher, and the crew and refugees aboard the Diligence were able to escape Syned. They were also joined by five hundred defecting Arkadianate citizens who had become disillusion with the political repression and lack of freedom in the Arkadianate. The Siege of Calimondretta was a serious setback for the Arkadianate since it weakened its military capabilities and undermined Arkadia's political cult. Due to the heavy damage to Calimondretta, Arkadia was forced to recall substantial forces from Byllura and temporarily set aside her expansionist ambitions in order to concentrate on rebuilding her war-damaged capital."}, {"tag": "h3", "text": "Later Developments"}, {"tag": "p", "text": "Later, the Arkadianate was threatened by the Hutt crime lord Zodoh, who was trying to establish a foothold in the Grumani sector. During his invasion of the Daimanate, Zodoh succeeded in coercing the other Sith Lords including Arkadia into cooperating with him by testing his new Stormdriver superweapons on Aquilaris Minor. The Stormdrivers were large capital ships equipped with weaponized vaporators that were capable of creating artificial global storms and floods. Arkadia and Daiman's older brother Odion would assist Zodoh by keeping Lord Daiman's military forces preoccupied with border skirmishes. This enabled Zodoh to launch an attack on the Daimanate capital of Darkknell. Following Zodoh's defeat at the hands of Kerra and the Grace Command captain Jenn Devaad, Zodoh was captured and executed by Daiman. Arkadia along with Odion and Malakite were present during Zodoh's execution."}, {"tag": "p", "text": "Later that year, Odion discovered the Helm of Ieldis, an ancient Sith relic capable of driving sentient beings into a homicidal frenzy, on the planet Gazzari. He attempted to use its powers to further his nihilistic ambitions of destroying all life in the galaxy. In response to the threat posed by Odion, Vilia Calimondra succeeded in rallying the entire Calimondra family for a combined assault on the Odionate. Arkadia contributed military forces to this combined assault. Ultimately, Odion was defeated and killed by Kerra and his former second–in–command General Beld Yulan. With his death, the Odionate collapse and its territories were divided up among the Calimondra family. It is presumed that the Arkadianate gained some new holdings as a result of Odion's demise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Arkadianate first appeared in John Jackson Miller's stand-alone novel Knight Errant, which was first released on January 22, 2011. According to Miller, its society was based on real-world corporate models described in Bryan Burrough's book Barbarians at the Gate: The Fall of RJR Nabisco. Burrough's book included a case study where one executive developed a habit of routinely switching employees to different jobs in order to prevent the emergence of rival power bases within the company."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}