{"url": "Arkadianate_shuttle", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Shuttle classes", "Category:Sith starship classes"], "nodes": [{"tag": "h1", "text": "Arkadianate shuttle"}, {"tag": "p", "text": "The Arkadianate shuttle was a small hyperdrive-equipped starship used by the Sith Lord Arkadia Calimondra's domain during the Republic Dark Age. It was a modified starfighter with a longer crew cabin. It was piloted by a pilot droid whose torso was fused to the starship's frame, and received commands from a control center on the ground. The shuttle's passenger section was large enough to house one passenger and a hoverchair."}, {"tag": "p", "text": "This silver shuttle's power plant consisted of three rear-facing cylindrical engines. The central engine contained a hollow compartment that was large enough to hold a single passenger and was equipped with a breathing mask and water supply system. While the chamber had been secured for space travel, it was not insulated againt the loud sound of the engines, and posed a health hazard to its user. In 1032 BBY, this shuttle was used by Arkadia to transport her younger brother Lord Quillan and the Bothan mercenary spy Narsk Ka'hane for a one-way trip to the hidden location of Vilia Calimondra, her grandmother and the matriarch of the power Calimondra family. For this mission, the Arkadianate shuttle's engine compartment was equipped with eight hours worth of oxygen, since it took seven hours to reach Vilia's destination."}, {"tag": "p", "text": "However, Arkadia planned to kill both Quillan and her grandmother as part of a conspiracy to plunge the Grumani sector into a crisis and to secure her own ambitions of galactic dominance. Since the Jedi Knight Kerra Holt had refused to work for her, Narsk had been assigned with this mission but was secretly working for Vilia. During the Siege of Calimondretta, Narsk foiled Arkadia's plot by switching the hoverchair carrying the nerve toxin with a harmless one. While Narsk succeeded in escaping Syned, his hearing was permanently damaged by the loud sound of the accelerating engines around him. However, he was treated by Vilia's medics and received a set of prosthetic implants after delivering Quillan safely to Vilia."}, {"tag": "h2", "text": "Appearances"}]}