{"url": "Mandalore", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Desert planets", "Category:Galactic Empire planets", "Category:Mandalore locations", "Category:Mandalore system planets", "Category:Mandalorian planets", "Category:Shadow Collective planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Mandalore"}, {"tag": "p", "text": "Mandalore was a planet located in the Outer Rim Territories. It was the homeworld of the Mandalorians, a fearsome warrior people who fought the Jedi and raided their temple during the fall of the Old Republic. Wearing distinctive armor that was often made from Beskar, they were feared throughout the galaxy, and had political influence over two thousand other star systems."}, {"tag": "p", "text": "Years of war left the planet inhospitable, forcing the Mandalorians to live within domed cities. A pacifist regime came to power at the end of these wars, led by Duchess Satine Kryze, while those who refused to give up their warrior ways were exiled to the moon Concordia. During the Clone Wars, the New Mandalorians were overthrown by the renegade Sith Lord Maul's Shadow Collective, though the Galactic Empire would rule the planet after the war's end."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mandalore was a hot and arid world, though was hospitable enough to hold life and let a race of people thrive. It became much more toxic the longer it existed as with every war the Mandolorians had to start finding new ways to adapt to the environment, eventually becoming so toxic that they could no longer survive on the surface of the planet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "h4", "text": "Wars and desolation"}, {"tag": "p", "text": "The ancient Mandalorians fought in many conflicts, often against the Jedi Order. No Mandalorian prior to Tarre Vizsla was accepted into the Jedi Order. During the fall of the Old Republic, these commandos raided the Jedi Temple on Coruscant, seizing Vizsla's Darksaber. Before his death, Tarre Vizsla ruled all of Mandalore. After centuries of warfare and prolonged conflict, the once beautiful surface of Mandalore was reduced to an endless desert. This ecological devastation would cause many to turn their back on violence, giving rise to the New Mandalorians."}, {"tag": "h4", "text": "The Mandalorian Civil War"}, {"tag": "p", "text": "At some point prior to the Trade Federation's Invasion of Naboo, Civil War broke out between the New Mandalorians and the martial traditionalists, who preferred the old ways of Mandalore. Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi spent a year on Mandalore protecting the leader of the New Mandalorians, Duchess Satine Kryze, during the war. The three were pursued by bounty hunters, and were constantly on the move. During this time, Kenobi and Kryze formed a romantic attachment. The war killed the majority of Mandalore's population. When the young Duchess returned, she was forced to rebuild her world without the Jedi's assistance, as they were reassigned shortly after the conflict's end."}, {"tag": "p", "text": "Already-damaged surface of Mandalore had been decimated during the Civil War, as was the planetary capital, Keldabe. Mandalore exiled their remaining warriors to their moon Concordia, where they were believed to have died out sometime later. Meanwhile, the New Mandalorians constructed and peacefully inhabited insulated bio-cube cities on their ruined homeworld. Unknown to them, the warriors had survived and formed into the Death Watch terrorist movement under the leadership of Pre Vizsla, who was the leader of Clan Vizsla, governor of Concordia, and current wielder of the Darksaber."}, {"tag": "h3", "text": "Maintaining neutrality"}, {"tag": "p", "text": "While nominally associated with the Galactic Republic, the Clone Wars saw Mandalore declare neutrality between the Republic and the Confederacy of Independent Systems. However, Death Watch, wishing to return Mandalore to the ways of its ancestors, attempted to take back Mandalore with Separatist assistance. After a bombing of the Peace Park in Mandalore's capital of Sundari, Duchess Satine and Jedi Master Obi-Wan Kenobi departed to Concordia to investigate, as the bomber was from the province. There they discovered the Death Watch's secret staging ground, and that Pre Vizsla was their leader. Barely escaping with their lives, the two returned to Mandalore."}, {"tag": "p", "text": "Fearing now for the stability and future of her planet, Kryze departed for Coruscant along with other representatives of the Council of Neutral Systems to plead her case to the Republic. During the voyage they were attacked by Separatist forces and Kryze herself was targeted for kidnapping and assassination by Senator Tal Merrik of Kalevala, but was rescued by Kenobi and fellow Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "Kryze's attempts to remain neutral in the war grew complicated as Death Watch assassination attempts continued on Coruscant and evidence surfaced linking the attacks to the Confederacy. Despite being framed for the murder of one of her cohorts, Satine managed to disprove the alleged evidence and in the process stalled Mandalore's involvement in the war as well as Death Watch's attempts at conquering the planet."}, {"tag": "p", "text": "Following Kryze's reaffirmation of the planet's neutrality, the Mandalorian economy began to struggle due to a lack of connection with key Republic supply routes. In order to ensure that much needed supplies continued to reach the planet, Prime Minister Almec established a black market with Moogan smugglers. In an attempt to speed up the creation and distribution process for imported tea, the Moogan smugglers unintentionally introduced a dangerously high level of the chemical slabin. This resulted in a mass poisoning of Mandalorian children. This incident coincided with a visit by Naboo Senator Padmé Amidala. Together Amidala and Kryze uncovered the source of the incident and crippled Almec's operation."}, {"tag": "p", "text": "Following these events, Jedi Padawan Ahsoka Tano was assigned to Mandalore to educate the students at the Royal Academy about the dangers of political corruption. In between lessons, the students, led by Kryze's nephew Korkie, discovered evidence of food and supplies being moved unofficially. When the students raised concerns to the Duchess, Almec enlisted the Mandalorian secret service to arrest both Satine, the students, and Ahsoka Tano. In an attempt to keep his operation under wraps, Almec forcefully tried to coerce Kryze into signing a confession of conspiracy. The prisoners resisted and fought back and in the process Almec was arrested and sent to prison."}, {"tag": "h3", "text": "The resurrection"}, {"tag": "p", "text": "In the later years of the war Death Watch once again attempted to conquer Mandalore. Now allied with former Sith Lord Maul and his collection of crime families, the Shadow Collective, Pre Vizsla organized a series of strikes throughout the capital city of Sundari. Members of the Pyke Syndicate, Black Sun, and Maul's apprentice Savage Opress conducted attacks on numerous key locations creating mass panic and loss of life. Kryze's peace keeping forces were overwhelmed and soon the frightened public of Sundari marched to the courtyard of the Royal Palace demanding action. Capitalizing on the panic, Pre Vizsla and the rest of his Death Watch forces made a public promise to the people of Sundari to protect them from further attacks. After Vizsla's men appeared to have halted further attacks, the public populace turned to Death Watch to provide new leadership and guidance. Secretly, Kryze was arrested and placed in prison."}, {"tag": "p", "text": "As Vizsla took his place as the new appointed Prime Minister and Mand'alor, disagreements developed between him and Maul, which lead to the arrest and public shaming of both the Sith Lord and his apprentice. While in prison, Maul allied himself with former Prime Minister Almec, hoping to establish him as a potential puppet leader should he regain control of the planet. Together, the three escaped from prison and Maul challenged Vizsla to single combat to determine the deserving ruler of the planet. Maul defeated Vizsla and executed him in front of his own men, now claiming the title of Mand'alor for himself. Maul then reappointed Almec to be the planet's prime minister. In order to assuage public opinion and cover for Maul's role in Vizsla's death, Almec informed the public that it was in fact Satine Kryze that had murdered Vizsla and that the former Mand'alor's final act was to reinstate his position as prime minster."}, {"tag": "p", "text": "Despite the fact that Maul now commanded Death Watch, a portion of its forces, led by Vizsla's lieutenant and Satine Kryze's sister Bo-Katan, rebelled against his leadership and began to actively work towards his defeat. Bo-Katan and her nephew Korkie organized a rescue for Satine in the hopes that she could contact the Republic for aid. While Kryze was captured once again by Maul's forces, she was able to send a message to the Jedi Temple. While unable to send military or official Jedi support due to Mandalore's neutrality, Obi-Wan Kenobi took it upon himself to personally see to Satine's rescue. Kenobi infiltrated Maul's loyal Death Watch forces and broke Satine free from prison. However, once again, Maul's forces blocked their escape from the planet and arrested both. Fulfilling his personal vendetta against Kenobi, Maul murdered Kryze and sentenced Kenobi to indefinite imprisonment."}, {"tag": "p", "text": "In transfer from the Royal Palace to his cell, Kenobi was rescued by Bo-Katan's forces. At this point, Bo-Katan's faction of Death Watch and those loyal to Maul openly began attacking one another in the streets and shipping yards of Sundari, starting a civil war. As the city erupted into chaos, Bo-Katan managed to secure Kenobi's escape from the planet in the hopes that he would bring Republic reinforcements. Meanwhile, Darth Sidious, having grown aware the situation on Mandalore, arrived on planet and personally confronted his former apprentice. The resulting conflict lead to the death of Savage Oppress and the capture of Maul, effectively ending his direct rule of Mandalore. While Maul escaped from captivity, the Shadow Collective was temporarily dissolved and he lost a number of Mandalorian commandos, along with his mother, Talzin, who was a powerful ally. With her death, Sidious believed Maul was no longer a threat to his plans. After these events, Maul and his forces returned to Mandalore, which was under the rule of Almec as Maul's puppet."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Imperial rule"}, {"tag": "p", "text": "Later, the Siege of Mandalore brought further conflict to the world. During the last days of the Clone Wars, the 332nd Division, which had been formed from the 501st Legion, of the Grand Army of the Republic led by advisor Ahsoka Tano and Clone Commander CT-7567 \"Rex\" laid siege to Mandalore with the help of Bo-Katan Kryze's warriors. At some point during the siege, the Night of a Thousand Tears occurred, when gunships outfitted with heavy repeating blasters attacked fields occupied by Mandalorian recruits. Eventually the Republic and Mandalorian resistance forces defeated Maul and his Mandalorians, giving Kryze control of Mandalore. As Tano, Rex, and the majority of the 332nd traveled to Coruscant aboard the Venator-class Star Destroyer Tribunal, however, Order 66 was issued, which caused the clone troopers to turn on the Jedi. Tano and Rex, who was freed from the control of Order 66 by Tano, managed to flee into hiding. Maul escaped after Tano released him as a diversion for the clones. Following the siege, the Republic and its successor state, the Galactic Empire, occupied Mandalore with the Republic troops who had been ordered to remain on planet."}, {"tag": "p", "text": "Though she had been appointed Regent of Mandalore, Kryze refused to do the new Empire's bidding and was forced out of power by Clan Saxon, who collaborated with the Empire. Gar Saxon of Clan Saxon was made Viceroy and Governor of the planet by the Empire with the Imperial Supercommandos serving as his enforcers. The Empire established an Imperial Academy on Mandalore for training military cadets."}, {"tag": "p", "text": "One notable Imperial cadet was Sabine Wren, whose mechanical talents were used to build the Arc Pulse Generator known as the \"Duchess.\" The \"Duchess\" was capable of reacting with the beskar alloy inside Mandalorian armor and incinerating Mandalorian warriors. Sabine became horrified that the weapon was being used to subjugate Mandalore and destroyed her weapon. Sabine spoke out against the Empire but her family sided with the Empire and cast her out. After a stint at bounty hunting with Ketsu Onyo, Sabine joined the Spectres, which was part of the rebel cell Phoenix Cell. As punishment for Sabine's actions, her father Alrich was made a hostage of Clan Saxon on Mandalore to ensure his family's compliance."}, {"tag": "h4", "text": "A second civil war"}, {"tag": "p", "text": "Viceroy Saxon ruled Mandalore on behalf of the Empire until his death at the hands of Ursa Wren in 2 BBY. Saxon's death caused a civil war between Clans Saxon and Wren, with the former being backed by the Empire. By 1 BBY, Gar Saxon had been succeeded by his brother Tiber Saxon as Governor. Clan Wren's insurrection had been joined by Lady Bo-Katan's Clan Kryze, Clan Vizsla, Clan Rook, Clan Eldar, and Fenn Rau, the last surviving member of the Mandalorian Protectors."}, {"tag": "p", "text": "The new Governor Saxon ordered Alrich's public execution in Sundari. Before Clan Wren and rebel forces could liberate him from his prison, Saxon had Captain Hark evacuate the prisoner in a convoy. After Ursa learned that her husband had been evacuated, she worked with Sabine, Bo-Katan, Rau, and the Spectres to trap the Imperial convoy. Ursa's forces staged a diversionary attack, causing the convoy to travel through a narrow canyon. Sabine and her allies ambushed the convoy and freed Alrich. However, this victory was overshadowed when Saxon deployed a rebuilt copy of the \"Duchess\" against Ursa's forces."}, {"tag": "p", "text": "The surviving Mandalorians and rebels retreated to Bo-Katan's camp. To atone for her role in creating the \"Duchess,\" Sabine volunteered to lead a strike mission aboard Tiber Saxon's Star Destroyer to destroy the weapon and the associated data. Saxon's Star Destroyer was parked above Sundari. At the advice of Grand Admiral Thrawn, Saxon trapped Sabine aboard the weapon's storage chamber and tried to force her to strengthen the weapon. However, Sabine reprogrammed the machine to target stormtrooper armor and destroyed the \"Duchess.\" The resulting explosion destroyed Saxon's Star Destroyer, presumably killing the Governor. Clan Wren and the other Mandalorian clans then pledged allegiance to Lady Bo-Katan, who inherited the Darksaber and the mantle of Mandalorian leadership."}, {"tag": "h4", "text": "The Purge"}, {"tag": "p", "text": "Realizing they would never be able to control Mandalore and wanting to make sure no other faction did, the Empire launched the so-called \"Great Purge\" against the Mandalorians. Bo-Katan and her people attempted to fight the Imperial effort, but the purge nevertheless led to the near-total genocide of the Mandalorian people. At some point, Moff Gideon participated in the Purge and managed to take the Darksaber from Bo-Katan. Some Mandalorians, including Katan, survived the Purge and fled Mandalore, though they scattered across the galaxy."}, {"tag": "p", "text": "As spoils of their victory, the Empire gathered Mandalorian beskar and cast the metal into Imperial ingots. The purge was what forced the Mandalorian group known as the Tribe to operate in secrecy, even after the fall of the Empire in 5 ABY. Members of the Tribe came to believe that Mandalore was a cursed world, fearing that anyone who traveled there would be killed."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "After the events of the Great Purge, Mandalore was no longer ruled by the Mandalorians. Bo-Katan planned to steal weapons from an Imperial remnant to help retake her homeworld, and she claimed to Mandalorian bounty hunter Din Djarin, who was under the belief Mandalore was cursed, she would install a new Mand'alor on the throne. Later in their mission, however, she herself stated she would rule the planet once again."}, {"tag": "p", "text": "Later on, Bo-Katan agreed to help Din Djarin rescue Grogu from Moff Gideon in return for Gideon's light cruiser, which she could use to help retake Mandalore, and possession of the Darksaber, which Bo-Katan needed to rally her people. Before the mission, Bo-Katan's companion Koska Reeves and Boba Fett, who were both joining the crew for the mission, exchanged words and briefly dueled each other after Fett expressed his disapproval for Bo-Katan's efforts to retake Mandalore, claiming that \"the Empire turned that planet to glass.\""}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Mandalore was inhabited by a group of humans known as Mandalorians. During the period when the Old Republic ruled the galaxy, these super commandos were a martial people, living in warrior clans. They had a strong sense of honor, though some would later become mercenaries. However, centuries of war laid waste to Mandalore's surface, leading to the New Mandalorians, a faction that opposed the violent ways of their ancestors. This schism caused a civil war, which resulted in the warrior clans being exiled to Concordia, Mandalore's moon, where they were assumed to have died out. However, the conflict killed most of the planet's population."}, {"tag": "h3", "text": "Government"}, {"tag": "p", "text": "During most of the Clone Wars, Mandalore was led by Duchess Satine Kryze. Near the end of the war, she was overthrown and killed by Maul and his Shadow Collective which established former Prime Minister Almec as the face of Maul's rule. After the Siege of Mandalore and the Imperial occupation that followed the end of the Clone Wars, Gar Saxon led the planet as Viceroy for the Empire until his death in 2 BBY. His brother Tiber Saxon succeeded him as Governor until his death in 1 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mandalore first appeared in canon in \"The Mandalore Plot,\" the twelfth episode of the second season of Star Wars: The Clone Wars, which first aired on January 29, 2010. The planet first appeared in the Star Wars Legends 1983 Marvel comic Star Wars 68, though the idea of Mandalore first existed in an early story concept for Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}