{"url": "Mandalore_sector/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:Mandalore sector", "Category:Mandalorian culture", "Category:Outer Rim Territories sectors"], "nodes": [{"tag": "h1", "text": "Mandalore sector"}, {"tag": "p", "text": "The Mandalore sector, also known as Mandalorian Space, was a sector located in the Outer Rim Territories, between the Ojoster sector and Phindar. It contained the planets Mandalore, Gargon, Concord Dawn, and Vorpa'ya. Concord Dawn and Vorpa'ya were in close proximity to each other and in the direction of the Perlemian Trade Route in Mid Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This sector was conquered by the Mandalorians during the time of the Galactic Republic and remained independent over the millennia. The sector's government was comprised of numerous ruling clan, most of whom answered to a monarch who held the title Mand'alor. Numerous Mandalorian worlds were devastated by the Republic and Jedi Order circa 738 BBY in what came to be known as the Mandalorian Excision, though the Mandalorians remained a sovereign civilization. The pacifistic New Mandalorians, backed by the Republic, established their domain on a number of worlds in the sector such as Mandalore and Kalevala. Eventually, the New Mandalorian government collapsed and the warrior clans' rule was restored. After the formation of the Galactic Empire, much of the sector fell under the control of Grand Admiral Miltin Takel, who faced fierce resistance from the locals. The Mandalorians were eventually successful in ousting the Imperials from the sector and reestablished their sovereignty. Following Takel's retreat, another Grand Admiral named Josef Grunger briefly established his domain in the area before he was also ousted. During this time, the sector was invaded by a Nagai army, which managed to gain some ground on Mandalore before leaving. Only a few years after the Nagai's invasion, the Mandalorians encountered another conflict with the Imperials during the Imperial warlord Zsinj's campaigns. Furthermore, the sector was a major front of the Yuuzhan Vong War."}, {"tag": "p", "text": "The sector's primary hyperlane was the Mandalorian Road, which connected the Gargon, Mandalore, and Concord Dawn systems to the Hydian Way."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mandalore sector was first mentioned in the Galaxy Guide 9: Fragments from the Rim guidebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}