{"url": "Mandalore_resistance", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Mandalorian organizations", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Mandalore resistance"}, {"tag": "p", "text": "The Mandalore resistance, also known as the Mandalorian rebels or as the Death Watch loyalists, was a resistance group of Mandalorians that was formed at the beginning of the Mandalorian civil war during the Clone Wars from the Death Watch. Members of the resistance opposed Maul's claim to the throne of Mandalore, and later sided with the Galactic Republic and the Jedi Order, providing intelligence sometime prior to or after the Battle of Ord Mantell."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Before the schism"}, {"tag": "p", "text": "In 19 BBY, Death Watch, a Mandalorian resistance and terrorist organization led by Pre Vizsla, became part of the Shadow Collective, a criminal empire governed by the renegade Sith Lord Maul and his brother Savage Opress and consisted of the Hutt Clan, the Pyke Syndicate, and the Black Sun. The Shadow Collective then conducted a takeover of Mandalore by overthrowing the New Mandalorians, in which Death Watch publicly gained control of the planet Mandalore which would allow Maul to expand into thousands of other worlds under their protection. A power struggle in the organization took place, which saw Maul and Opress imprisoned while Vizsla became Mand'alor and leader of the Mandalorian people."}, {"tag": "h3", "text": "Death Watch divides"}, {"tag": "p", "text": "Maul and Opress, however, were able to escape prison and recruit former Prime Minister Almec to their cause. Maul subsequently challenged Vizsla to a duel, which Maul won by beheading Vizsla with the Darksaber and proclaiming himself as leader of Mandalore and Death Watch. As a result, Death Watch was split and members of Death Watch's units such as the Nite Owls, Airborne Troopers, Grappling Troopers, and Flame Thrower troopers all either joined Maul, or rejected his rule. Following a shootout in the throne room at the Sundari Royal Palace, Bo-Katan Kryze, leader of the Nite Owls, led the rebels in retreat."}, {"tag": "h3", "text": "Civil war erupts"}, {"tag": "p", "text": "With Death Watch split between the Mandalorian super commandos of the Shadow Collective and Bo-Katan's Mandalore resistance, also known as Death Watch loyalists and Mandalorian rebels, a civil war erupted around Sundari. Maul reappointed Almec as Prime Minister and continued his operations. The Mandalore resistance allied themselves with loyalists of Duchess Satine Kryze, the former leader of Mandalore, who remained imprisoned at the royal prison. Rebel forces attempted to liberate her and warn Jedi Master Obi-Wan Kenobi and during the escape, the Mandalore resistance fought against the Mandalorian super commandos, the members of Death Watch who were loyal to Maul. Although Duchess Satine was able to make it to the outskirts of the city and dispatch a message to Kenobi, Satine and the resistance forces were overwhelmed and she was recaptured, forcing rebel forces to retreat."}, {"tag": "p", "text": "Kenobi later arrived on Mandalore to free Duchess Satine himself, but ultimately they were recaptured and Satine was executed. As Kenobi was being sent to prison, Bo-Katan and her rebels managed to free him. Eventually, Bo-Katan and Kenobi managed to fight through Maul's forces to a Kom'rk-class fighter/transport, where Kenobi left to inform the Galactic Republic of Maul's conquest of Mandalore and Bo-Katan hoped for a Republic invasion."}, {"tag": "h3", "text": "Allies of the Jedi"}, {"tag": "p", "text": "During the civil war, the Mandalore resistance provided intelligence to the Jedi Order and the Galactic Republic confirming that Prime Minister Almec and the alliance to crime syndicates was still active. Eventually, Bo-Katan recruited former Jedi Padawan Ahsoka Tano to help capture Maul and the Republic later laid siege to Maul's forces, driving the renegade Sith Lord from the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}