{"url": "Mandalore_system/Legends", "categories": ["Category:Legends articles", "Category:Mandalore sector star systems", "Category:Mandalore system", "Category:Mandalorian culture"], "nodes": [{"tag": "h1", "text": "Mandalore system"}, {"tag": "p", "text": "The Mandalore system was a star system located within the Mandalore sector of the galaxy's Outer Rim Territories. Positioned in the galactic north-east, the Mandalore system was comprised of nine planets—Nog, Akaan, Tracyn, Kalevala, Mandalore, Mandallia, Bonagal, Shukut, and Werda—and their numerous moons, all orbiting the star Mandalore."}, {"tag": "p", "text": "Though the Mandallian Giants were originally the system's only sentient inhabitants, the Mandalore system gained its name and notoriety from the Mandalorian Taung, who arrived from Roon to conquer not only the system, but the entire sector of surrounding space. From that point in time onward, the Mandalore system became a powerbase for the Mandalorian warrior culture. In 738 BBY, the system bore the brunt of a Galactic Republic assault that left Mandalore and portions of the surrounding sector heavily damaged. From this disaster arose the pacifistic New Mandalorian faction, who established a presence on at least two of the system's worlds, Mandalore and Kalevala. Several hundred years later, in 4 ABY, the Mandalore system came under attack by the Nagai people, who launched assaults on both Mandalore and Mandallia. The Mandalorians were able to repel the Nagai, and later the attacks of the extra-galactic Yuuzhan Vong, before entering a period of economic resurgence after discovering a large lode of beskar iron on Mandalore."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Mandalore system was one of several star systems that comprised the Mandalore sector. The Mandalore system was located within the Outer Rim Territories, in the north-east region of the galactic plane. Centered around the cognominal star, Mandalore, the Mandalore system consisted of nine planets and their combined total of seventy-three moons. Of the system's nine worlds, Nog, Akaan, Tracyn, Kalevala, Mandalore, and Mandallia were terrestrial, Bonagal and Shukut were large gas giants, and Werda was an ice ball planet located farthest from the system's sun. It was said that the worlds of the Mandalore system were rich in beskar iron ore."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Long before the establishment of the Galactic Republic, the then nameless Mandalore sector had given rise to a single sentient species, the Mandallian Giants of Mandallia. However, when the Taung—simian Humanoid warriors from the galactic Core World of Coruscant—were forced to flee their homeworld by the Human Battalions of Zhell, they eventually found their way to the uninhabited world in the would-be Mandalore system that they came to call Mandalore, in honor of their leader, Mandalore the First. The Taung also chose to recast themselves as the Mandalorians, or Mando'ade in their language, meaning \"Children of Mandalore.\" Once these warrior nomads had settled their new home and slaughtered the native mythosaurs that had previously dominated the planet, the Mandalorian Taung set out to conquer the worlds in the surrounding system. Their only resistance came from the neighboring Mandallians. These powerful warriors withstood the Mandalorians' assault, earning the respect of their attackers in the process. Because of their prowess, the Mandallians became among the first to fight alongside the Taung and gain equal acceptance in the Mandalorian culture."}, {"tag": "p", "text": "As Mandalorian-controlled space grew, the Mandalore system and the planet Mandalore itself were left largely idle as the Mandalorian Crusaders sought new conquests under Mandalore the Indomitable. During the Crusaders' campaign, Mandalore was joined by other star systems such as the Concord Dawn system, the Ordo system, and the Vorpa'ya system, as the Mandalore sector began to take form. Nevertheless, Keldabe—capital city of the planet Mandalore—became the acting center of government for much of Mandalorian space from at least 3960 BBY onward. The Mandalorians' conquest reached its height during the Mandalorian Wars, an all-out Mandalorian attack against the Galactic Republic initiated by Mandalore the Ultimate. When the wars were brought to a devastating conclusion and Mandalore the Ultimate was slain by the Jedi Knight Revan, many Mandalorian warriors returned to Mandalore and its system."}, {"tag": "p", "text": "In the aftermath of the Republic's victory over the Brotherhood of Darkness at Ruusan, and the subsequent Republic reformation that marked the end of the New Sith Wars, Mandalorians inhabiting Mandalore elected to remake their society into a more rigid, technologically adept, militant one. The growth in Mandalore's militancy so soon after the war with the Sith alarmed both the Republic and Jedi alike, and unwilling to suffer through a second Mandalorian War, the Jedi led a Republic strike force in a brief and targeted conflict with the Mandalorians in 738 BBY that brought devastation to the Mandalore sector and transformed parts of Mandalore into deserts of white sand. Out of this disaster arose a pacifist sect calling themselves the New Mandalorians; the reformist political faction renounced violence and instead preached peace, neutrality, and tolerance. They used their talents as builders and inventors to create grand bio-cube cities in Mandalore's desert, forging a new society isolated from Mandalore's warrior clans. To the New Mandalorians, Mandalore was known as \"New Mandalore\", and the peaceful group also moved to establish themselves on the nearby world of Kalevala. Noble titles such as prince and duchess were instituted on Kalevala, and the New Mandalorians retained a presence on both worlds in the Mandalore system for centuries after."}, {"tag": "p", "text": "Around 60 BBY, not long after the ascension of Jaster Mereel as Mand'alor, the Mandalorian Civil War broke out between Mereel's loyalist True Mandalorians and the radical splinter group Death Watch, led by Tor Vizsla. The civil war drew in Mandalore's full-time army and several prominent clans, yet was fought by two factions that were relatively small in comparison with the overall Mandalorian population, and had little effect on Mandalorian territory beyond the planet Mandalore. It was also around this time that an epidemic of the wirt-cough erupted across the worlds of the Mandalore system, spread through inter-planetary Mandalorian travel."}, {"tag": "p", "text": "During the Clone Wars, a pan-galactic conflict between the Galactic Republic and the separatist Confederacy of Independent Systems, the New Mandalorian senator Tal Merrik of Kalevala represented the Mandalore system in the Galactic Senate. However, Merrik was a supporter of the radical Death Watch group who sought to destroy the peaceful New Mandalorian government and take over Mandalore for themselves. In his collaboration with the Death Watch, Merrik was slain while attempting to take the New Mandalorians' leader—Duchess Satine Kryze—hostage, and the Mandalore system was nearly subjected to a Republic occupation in order to pacify the Death Watch threat. It was only the combined effort of Kryze, and the posthumous testimony of New Mandalorian Deputy Minister Jerec before the Galactic Senate, that allowed the Mandalore system to remain free of Republic military control. However, when Mandalore the Resurrector came to power, he elected to ally Mandalore with the Confederacy, and fought on the Separatists' behalf during several key engagements."}, {"tag": "p", "text": "Following the end of the Clone Wars, the Mandalore system came under the eye of the newly established Galactic Empire born from the former Galactic Republic. After purchasing land from the Mandalorian clans, an Imperial base and garrison was established on Mandalore, within the failed adventure park known as the \"City of Bone.\" Though relations were initially tepid but peaceful, the Empire eventually proved hostile, turning to enslaving the Mandalorians and lording over the Mandalore system and its sector by instilling Grand Admiral Miltin Takel as Imperial overseer. It wasn't until 3 ABY that the Mandalorians under Mand'alor Fenn Shysa, were able to bring an end to the Imperial occupation of their homeworld, and break the Imperial hold over Mandalorian space when they ousted Admiral Takel."}, {"tag": "p", "text": "However, more trouble came to the Mandalore system soon after, in the form of Nagai invaders from the satellite galaxy, Companion Besh. The Nagai struck first at Mandallia, where the Mandalorians were able to expel the invaders at a high cost, though they would shortly move on to attack Mandalore. While the Mandalorians were initially defeated, Mand'alor Shysa led his people into a coalition with the Alliance to Restore the Republic in order to take back Mandalore, personally accepting a commission with the fledgling state to aid in the campaign against the Nagai and their own pursuing enemy, the Tof. Once peace had been restored, the Mandalorian Protectors began to live up to their name in more literal capacity: patrolling the Mandalore system and its surrounding sector of space, if any hostile ship entered Mandalorian territory, the Protectors would board and capture the vessel, taking it back to Mandalore."}, {"tag": "p", "text": "Years of peace followed the conflict with the Nagai, only to be broken by the advent of another extra-galactic invasion, this time by the Yuuzhan Vong race. Though the Mandalorians initially allied with the Vong forces to stall the threat they posed to the Mandalore system and all of Mandalorian space, while secretly seeking to undermine their efforts, the Yuuzhan Vong came to learn of the Mandalorians' treachery and launched an attack on the Mandalore system, specifically targeting Mandalore in retaliation. The battle reaped significant casualties on both sides, with the population of Mandalore being reduced by nearly a third as Mandalore's surface was severely damaged. However, the Mandalorians managed to repel the Vong assault, forcing them to retreat from the system, and earning a reputation as one of the only groups to defeat the Yuuzhan Vong without any external aid."}, {"tag": "p", "text": "After the war with the Yuuzhan Vong came to an end and the galaxy was left in peace as the Vong relocated to the living world of Zonama Sekot, the Mandalore system turned to the slow process of recovery. However, true prosperity came only with the discovery of a fresh lode of beskar iron on Mandalore in 40 ABY. With half commissioned for domestic use and the other for commercial sale, Mandalore's economy surged."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Native to the Mandalore system were the Mandallian Giants of Mandallia. These beings were immense in stature, and covered with scales in shades of green. Mandallians were trained from nearly infancy in several forms of combat, honing powerful martial skills during their lifetimes. The Mandallians' high martial proficiency allowed them to repel the attacks of the Mandalorian Taung who sought to conquer their world and the other planets of the Mandalore system."}, {"tag": "p", "text": "The Mandalorians—beginning with the culture's Taung founders, and continuing with the members of countless other species who later joined—have dominated the Mandalore system since approximately 7000 BBY. A population of around four million individuals lived on Mandalore for much of the world's occupied history, with a significant number of further Mandalorians living on the planet's moon, Concordia, which came to exist as an agricultural settlement and later a base for mining beskar iron ore. The peaceful New Mandalorian faction had established itself within the white-sand deserts of Mandalore, as well as on the neighboring world of Kalevala."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Nog"}, {"tag": "p", "text": "Nog resided closest to the Mandalore system's star, occupying the first of the system's nine orbits. This close proximity rendered the terrestrial Nog a rocky world of searing temperatures. Nog boasted an inhospitably hot climate, and was without any orbiting moons."}, {"tag": "h3", "text": "Akaan"}, {"tag": "p", "text": "Akaan occupied the second orbit of the Mandalore system, between the orbits of Nog and Tracyn. Akaan was a barren terrestrial world without an atmosphere, orbited by two moons. The planet's name came from the Mando'a word akaan, meaning \"war.\""}, {"tag": "h3", "text": "Tracyn"}, {"tag": "p", "text": "Tracyn circled its star in the Mandalore system's third orbit, placing it between the orbits of Akaan and Kalevala. Tracyn possessed extensive volcanic activity across its terrestrial surface, and a total of four moons. Tracyn took its name from the Mando'a word for \"fire.\""}, {"tag": "h3", "text": "Kalevala"}, {"tag": "p", "text": "Kalevala inhabited the fourth orbit of the Mandalore system. A neighbor of the Mandalorians' traditional homeworld, Mandalore, Kalevala was a terrestrial world whose terrain was primarily comprised of a toxic desertscape. Following the rise of the peaceful New Mandalorian faction, Kalevala became home to a number of New Mandalorians. Kalevala produced such luxuries as expensive wines and rich fabrics. Quench-gourds also grew on the desert world. The planet was home to the Kalevala Spaceworks starship manufacturing company."}, {"tag": "h3", "text": "Mandalore"}, {"tag": "p", "text": "The fifth planet in the Mandalore system, the planet Mandalore was the adopted homeworld of the multi-species cultural group known as the Mandalorians. A terrestrial world, Mandalore possessed two moons, including the one time mining base and agricultural center, Concordia. One of Mandalore's most unique assets—believed to have been what first drew the wandering Taung forces to the Outer Rim world—was beskar iron ore, a nearly indestructible metal used by Mandalorian metalsmiths to forge armor, weapons, and starships. Before the rise of the Mandalorians, Mandalore was dominated by the gigantic mythosaurs, but when the Taung warriors arrived on Mandalore, they set to slaughtering the creatures as part of their conquest of the new world. Native veshok trees covered much of Mandalore's northern hemisphere, and herbivorous animals called shatuals could be found living within the veshok forests, as could the six-legged strills that preyed upon them for food. Forty-five degrees north of Mandalore's equator, sat the city of Keldabe. Since at least 3960 BBY, Keldabe had served as the capital of Mandalore, and the center of government for much of Mandalorian space, while following the foundation of the New Mandalorian faction, the reformist sect declared the domed city of Sundari, located in one of Mandalore's expansive white-sand desert regions, to be their capital. Most of Mandalore's settlements were built within a heavy fortification that contributed to the ease with which they could be defended from potential invaders, and most roads on Mandalore were rarely straight, designed so as to grant Mandalorians the advantage in ambushing and pinning down potential hostiles as they traveled."}, {"tag": "h4", "text": "Concordia"}, {"tag": "p", "text": "One of two moons of Mandalore, Concordia was an agricultural center turned mining base. The only other location known to have been heavily mined for the nearly-indestructable beskar iron ore aside from Mandalore itself, Concordia's lush forests were devastated by the Mandalorians' extensive mining efforts. Following the rise of the New Mandalorian faction, Concordia became a refuge for a number of Mandalorian hardliners who refused to yield to their reformist ideals and instead chose exile on Mandalore's moon, rather than live alongside them as many warriors clans elected to do. After the devastation wrought by the Great Clan Wars, during which several members of the fragmented Death Watch attempted to rally the other warrior clans against the New Mandalorians, a number of defeated but unrepentant warlords again chose exile on Concordia. By the start of the Clone Wars, Concordia had become a haven for a resurgent faction of the radical Death Watch—though they were later ousted and driven from the Mandalore system—and by the war's end, Concordia was known for its ostensible presence of pirates, smugglers, and members of the Black Sun crime syndicate."}, {"tag": "h3", "text": "Mandallia"}, {"tag": "p", "text": "The homeworld of the Mandallian Giants, Mandallia occupied the sixth orbit of the Mandalore system, between Mandalore and Bonagal. A terrestrial world, Mandallia possessed a single moon."}, {"tag": "h3", "text": "Bonagal"}, {"tag": "p", "text": "Bonagal claimed the seventh orbit around the Mandalore system's star, taking its place between the orbits of Mandallia and Shukut. Bonagal was a gas giant world—one of two in the Mandalore system—and found itself surrounded by a total of thirty four moons."}, {"tag": "h3", "text": "Shukut"}, {"tag": "p", "text": "The second of two gas giants within the Mandalore system, Shukut held the eighth orbit within the system, placing it between Bonagal and Shukut. Like Bonagal, Shukut possessed a large number of moons, amassing thirty in total."}, {"tag": "h3", "text": "Werda"}, {"tag": "p", "text": "At the farthest edge of the Mandalore system, and occupying its ninth orbit, was the planet Werda. Located so far from the system's sun, Werda was a frigid ice ball of a world, and it lacked any orbiting moons. The planet's name came from the archaic Mando'a word werda, which in Galactic Basic meant \"darkness.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mandalore system has made numerous appearances throughout the Star Wars franchise, including several episodes of the Star Wars: The Clone Wars television series and the multi-novel Republic and Imperial Commando series by author Karen Traviss. Details concerning the system and planets that comprised it, were provided in the 2009 reference book, The Essential Atlas, by Jason Fry and Daniel Wallace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}