{"url": "Mandalore_Customs", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Mandalore Customs"}, {"tag": "p", "text": "Mandalore Customs was a New Mandalorian law enforcement agency that enforced customs and trade on the planet Mandalore during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Mandalore Customs was charged with overseeing customs operations on the planet Mandalore, and used customs officials and officers to complete their responsibilities. Customs officials used datapads to keep track of schedules and conducted inspections. Customs officials wore a teal uniform with a utility belt and the Mandalore Customs' emblem on the upper arms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mandalore Customs operated on the planet Mandalore by the time of the Clone Wars. After Duchess of Mandalore Satine Kryze managed to secure neutrality for Mandalore in the Clone Wars, trade routes became less available. As such, a black market conspiracy began to flourish, and the threat of greed and corruption in the New Mandalorian threatened the planet's stability."}, {"tag": "p", "text": "During the black market conspiracy, a customs official was conducting a standard check up of a shipment from a Shekelesh-class freight gunship when the leader, Tee Va, bribed him. At that time, nearly five times as many officers were supposed to be at the docks, but were occupied with Senator Padmé Amidala's arrival. The customs official accepted the bribery and allowed the Mooga smuggling ring to continue their operations of unloading an illegal shipment of tea and slabin. The official told Va to come to him as his contact directly when he needed to unload more shipments."}, {"tag": "p", "text": "Eventually, Duchess Satine and her friend Senator Amidala along with a Mandalorian Protector investigated the Sundari shipping docks and saw the same customs official accepting another bribe. It was after this that Duchess Satine and Amidala raided a warehouse the next day along with Captain Patrok Ru-Saxon and more Mandalorian Protectors, and dismantled the smuggling ring, whose operations had led to the planet-wide sickness of children."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mandalore Customs first appeared in the episode \"Corruption.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}