{"url": "Mandalore_Defense_Resolution", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Galactic Republic stubs", "Category:Galactic Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Mandalore Defense Resolution"}, {"tag": "p", "text": "As the Clone Wars progressed, a resolution for a military occupation of the planet Mandalore in the Outer Rim was introduced and voted on in the Galactic Republic Senate. The resolution was in response to a sudden increase of violence on Mandalore by the Mandalorian splinter faction called Death Watch movement. Its leader, Pre Vizsla, orchestrated the attacks in order to destabilize the peaceful New Mandalorian government led by Duchess Satine Kryze. Vizsla was backed by the Separtist Alliance leader Count Dooku and together they planned to to create the impression that the Death Watch movement was a significant threat to both Mandalore and the Republic. This, in addition to rumors that Kryze herself was working alongside the Confederacy, prompted the Senate to call a vote on whether or not to send the Republic's military to Mandalore to restore order."}, {"tag": "p", "text": "Duchess Kryze insisted that Mandalore remain neutral in the Clone Wars and resisted the idea of the Republic sending an occupying military force. She believed that it would undermine the pacifist ideals of the New Mandalorian government and drag Mandalore into the war as well as an arms race with the Death Watch insurgency. Vizsla, Dooku, and Lord Sidious also believed this and that it would further their goals for the Death Watch to seize Mandalore and drag it into the war. They then attempted to prevent Kryze from making an appeal against the initiative to the Senate and though their initial attacks on the Duchess failed, Kryze's appeal to the Senate was derailed by testimony from Mandalore's Deputy Minister Jerec, which indicated that Mandalore was in need of Republic protection from the Death Watch. As a result of the testimony and another attempt on Kryze's life, the Senate accelerated the vote on the initiative and approved it. Jerec's testimony was later found to have been changed, and the true recording was presented to the Senate just before the Republic military was deployed to Mandalore. The Senate then voted to rescind its earlier approval of the occupation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}