{"url": "Mandalore_the_Indomitable", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Males", "Category:Mandalores", "Category:Mandalorian Crusaders", "Category:Members of the Sith Brotherhood", "Category:Sith military personnel", "Category:Taung"], "nodes": [{"tag": "h1", "text": "Mandalore the Indomitable"}, {"tag": "p", "text": "Mandalore the Indomitable, referred to as Mandalore by foes and allies alike, was a male Taung who served as warlord of the Mandalorian Clans prior to and during the events of the Great Sith War. In the year 3996 BBY, believing that the seven worlds of the Empress Teta system—under the control of a dark side society called the Krath—had been weakened by numerous campaigns, Mandalore the Indomitable led his Mandalorian Crusaders in an invasion of Tetan space. What followed was a confrontation with the Sith Lord Ulic Qel-Droma, who was leader of the Krath military, the outcome of which saw Mandalore the Indomitable swear a personal oath of allegiance to Qel-Droma and pledge his Mandalorian army to augment the Sith forces."}, {"tag": "p", "text": "Following Qel-Droma in his quest to control the galaxy and defeat the Jedi Order, Mandalore, along with the Krath sorceress Aleema Keto, helped Qel-Droma plan an invasion of the Republic capital of Coruscant. After Qel-Droma was captured by the Jedi during the battle, Mandalore later learned that Qel-Droma had been betrayed by the ambitious Keto, who planned to use Qel-Droma's capture as an opportunity to usurp complete control of the Krath forces. Remembering the oath he swore to Qel-Droma on Kuar, Mandalore paid lip service to Keto but set out to locate Qel-Droma's partner and master, the Dark Lord of the Sith Exar Kun, in the hopes that Kun would help rescue Qel-Droma from his prison on Coruscant. Locating Kun on the jungle moon of Yavin 4, Mandalore enlisted the aid of the Sith Lord. Arriving at the Republic capital alongside Kun, Mandalore watched as Kun and his Massassi warriors freed Qel-Droma from the Inquisition charged with prosecuting him for war crimes."}, {"tag": "p", "text": "Grateful for the loyalty that Mandalore had shown him, Qel-Droma gave his Mandalorian warlord a special assignment while he and Kun led an assault on the Jedi stronghold of Ossus: while the Sith Lords were busy attacking Ossus, Qel-Droma ordered Mandalore to lead the bulk of his warriors in a massive assault against the Republic world of Onderon. Even though the Mandalorians experienced initial gains in their attack, during the battle the invading forces were thwarted by the defending Beast Riders, led by Beast-Lord Oron Kira, and forced to retreat to Onderon's jungle moon of Dxun. During the retreat, Mandalore was separated from his forces, and found himself surrounded by several predatory creatures native to Dxun. They attacked him, leading to the death of Mandalore the Indomitable; however, his mask was found by one of his Taung soldiers, and this soldier would declare himself the new Mandalore."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A pact with the Sith"}, {"tag": "p", "text": "Throughout the generations, the title of Mandalore, translated as Mand'alor in Mando'a, was an honorific designation traditionally taken by the recognized leader of the Mandalorian clans. At some point prior to the year 4000 BBY, a Taung soldier rose through the ranks of the reigning Mandalorian Crusaders and took the title of Mand'alor. Those who fought under him came to call their new Mandalore \"Indomitable\" because of the fighting spirit which he had continually demonstrated in numerous battles and campaigns. Under Mandalore the Indomitable's rule, and continuing in the traditions laid down by previous Mandalores, the Mandalorian Crusaders took part in a number of successful campaigns, like the raid on Iskadrell, during which the Mandalorians liberated the slaves of the infamous Iskallonis, which included the young Antos Wyrick, who was initiated to the Mandalorian Culture by Mandalore himself. These campaigns were driven by what were called the Canons of Honor within Mandalorian lore. The Canons dictated that individual warriors had the power to attain personal glory through both battle and loyalty to one's clan."}, {"tag": "p", "text": "In 3996 BBY, using the tenets laid down in the Canons, Mandalore the Indomitable led his Crusaders in a search for a worthy foe, against which he planned to launch a new crusade. It was during this time that Mandalore began to hear rumors circulating the space lanes regarding the military exploits of a fallen Jedi–turned–Sith Lord named Ulic Qel-Droma. Mandalore believed that Qel-Droma, who had taken control of the powerful dark side cult called the Krath, had overstretched the resources of the Krath's military resources in their various campaigns of expansion, thus leaving their home system of Empress Teta vulnerable to attack. Believing that he and his warriors could seize the Empress Teta system, Mandalore led the Mandalorian Crusaders in several small raids to test the strength of the Krath perimeter defenses. Mandalore's attacks eventually caught the attention of Qel-Droma when Basilisk war droids destroyed an important carbonite smelting station, causing it to crash to the surface of a planet in the Empress Teta system. In response, Qel-Droma ordered his aide, Captain Rooks, to open communications with Mandalore. Qel-Droma proceeded to threaten the Mandalorian leader with annihilation unless he surrendered immediately. Mocking Qel-Droma and the armies he commanded, Mandalore made what he considered a mutually acceptable counter-proposal: a duel between the two warrior-leaders, Sith Lord versus Mandalore. Accepting the offer to fight the Mandalorian leader, Qel-Droma stipulated that if he won the duel, then Mandalore and his Crusaders would swear loyalty to him and serve as a part of his army. Adhering to the tradition of Mandalorian honor, Mandalore the Indomitable agreed to Qel-Droma's terms."}, {"tag": "p", "text": "On the Deep Core Mandalorian world of Kuar, gathered on the Plains of Harkul, Qel-Droma and Mandalore met before their respective forces. Believing that he could hinder the Sith Lord's use of the Force, Mandalore approached Qel-Droma and advised him that their duel would not take place on the ground—instead, it would take place far above the Plains of Harkul upon on a network of thick, interlocking chains. Likewise, Mandalore further wanted to even the odds for himself against his opponent, thus he advised both armies that he would be allowed to use his own customized Basilisk war droid, while Qel-Droma would not be allowed the use of any type of war mount. Unconcerned by how Mandalorian leader defined the rules of combat, Qel-Droma instead chose to rely on his skills in the Force to defeat his opponent. Mandalore began the duel by attacking Qel-Droma using his Basilisk war droid, firing a barrage of blaster bolts at the unmounted Sith Lord. Though Mandalore was skilled in battle and the use of the war droid, Qel-Droma was able to use the Force to avoid the incoming fire, and used his lightsaber to damage the Basilisk mount. Without his vehicle of war, Mandalore was forced to resort to hand-to-hand combat with Qel-Droma. However, realizing that the lightsaber still presented an advantage for Qel-Droma, Mandalore challenged the Sith to put away his lightsaber and fight with a mythosaur axe, a traditional Mandalorian weapon. Qel-Droma agreed to these terms, and proceeded to fight against Mandalore.\nEventually, Mandalore the Indomitable was defeated by Qel-Droma when his weapon was destroyed and he was forced over a ledge by the Sith Lord. Unknown to Mandalore the Indomitable, Qel-Droma's robes were enhancing his protection during the battle. Acepting defeat, Mandalore ceded his warriors to Qel-Droma and asked that he be killed. However, Qel-Droma did not wish to kill his foe, instead telling Mandalore that he had a far better fate in store than death. Mandalore then pledged his loyalty to Qel-Droma, thereby allying the Mandalorian clans with the Sith—a decision that would impact both Sith and Mandalorian alike throughout the coming decades. With the Mandalorian Crusaders now augmenting his Krath armies, Qel-Droma began planning ways to further escalate his and Exar Kun's campaign against the Galactic Republic, known as the Great Sith War. Together with Mandalore, Qel-Droma established a battle plan which would see Mandalore and the Crusaders at the forefront of the fighting: an all-out attack on the enormous Republic shipyards orbiting the planet Foerost."}, {"tag": "h3", "text": "The Great Sith War"}, {"tag": "h4", "text": "Attack on Foerost"}, {"tag": "p", "text": "With his Mandalorian Crusaders now operating under the command of Ulic Qel-Droma, Mandalore the Indomitable prepared his warriors for the upcoming attack on the Republic shipyards at Foerost. By the time of the Great Sith War, the Foerost shipyards had become known as some of the oldest and largest starship construction facilities in the galaxy. It was because of Foerost's historically large production of ships for the Republic Navy that Qel-Droma wanted to shut the shipyards down, as well as capture the newly completed fleet of three hundred warships that sat unguarded therein."}, {"tag": "p", "text": "Disguised by a Sith illusion cast by Aleema Keto, Mandalore, his warriors, the Krath forces, and Ulic Qel-Droma approached the Foerost shipyards. The entire attack force was hidden as a single starship, which was dubbed \"Golthar's Sky\" and was broadcasting that it was damaged and in need of repairs. When the Republic workers at Foerost attempted to help the Golthar's Sky, Keto dropped her illusion, thus allowing the attack force to perform its mission. Spearheading the assault were Mandalore and his Mandalorian Crusaders, who managed to both breach the shipyards' defenses and provide air cover for the advancing Krath ground forces by using Basilisk war droids. Due to the leadership and charisma of Mandalore, the Mandalorian warriors fought their new crusade efficiently, essentially ending the entire battle before it had even begun."}, {"tag": "p", "text": "With the majority of the Foerost shipyards pacified by his warriors, Mandalore accompanied Qel-Droma and Keto to the yards' central control facility. Once there, Qel-Droma and his commanders approached the Republic personnel present, requesting the command codes for the three hundred Republic warships sitting in drydock. The Republic officials initially refused to comply with the invaders, saying that they were not in possession of the codes; in response, Mandalore promptly executed the closest captive, saying that he knew the codes were there, despite their protests, and demanding that someone surrender the codes. Shocked by the tactics used by Mandalore and Qel-Droma, the remaining Republic personnel decided to give the attackers the command codes."}, {"tag": "p", "text": "At that moment, Qel-Droma was contacted by Exar Kun, the other Dark Lord of the Sith, while Mandalore continued to gather the necessary codes from the Republic prisoners. With the command codes now in his possession, Mandalore advised Qel-Droma that the ships were now theirs and that they could continue with their plans for an invasion of Coruscant. Even though Kun initially spoke out against any attack on Coruscant, saying that Qel-Droma and Mandalore should wait for his Brotherhood of the Sith to join their ranks, he eventually gave his blessing after a verbal exchange with Mandalore. The Mandalorian leader told the Dark Lord of the Sith that his Crusaders were the best soldiers in the galaxy and that he and Qel-Droma could handle an attack on Coruscant without having to wait for a handful of Force users. With Kun's blessing, Qel-Droma, Mandalore, and Keto began their preparations for an all-out Krath invasion of the Republic capital."}, {"tag": "h4", "text": "Betrayal on Coruscant"}, {"tag": "p", "text": "With the attack on Foerost complete, and with Kun's reluctant approval, Mandalore, Keto, and Qel-Droma prepared for their invasion of Coruscant. Leaving behind a hologram containing misleading information about the Krath's plans, Mandalore and Qel-Droma managed to successfully convince the Republic that their next target was the Republic jump station at Kemplex IX. With the bulk of the main Republic fleet headed to Kemplex IX under the command of Fleet Captain Vanicus, Mandalore led his Crusaders alongside Qel-Droma and the Krath in a surprise attack against Coruscant."}, {"tag": "p", "text": "Catching Coruscant virtually defenseless with the Republic fleet on its way to Kemplex IX, Krath starships and Mandalorian Basilisk war droids rained down upon the planet. Unknown to Mandalore or Qel-Droma, a sizable contingent of Jedi was present on Coruscant, led by Master Vodo-Siosk Baas. Even though the Jedi were greatly outnumbered by the Mandalorian Crusaders that were swarming Galactic City, they organized a stiff defense against the invaders. Despite this, Mandalore and his Crusaders managed to force the Jedi to retreat to a more advantageous position. With his Crusaders continuing the fight in the streets of Coruscant, Mandalore accompanied Qel-Droma and Keto in their attack against the main Republic military command center. During this time, Mandalore received information from his spies that the Republic was housing a host of newly developed weapons near the command center in a depot. Following agreement from Qel-Droma, Mandalore set out with a selection of his warriors to capture the stock of new Republic weapons. Arriving at the weapons depot, Mandalore had his soldiers set charges on the depot's entrance, which when exploded would allow the Mandalorian Crusaders to quickly breach the building. Once inside, the Crusaders made quick work of the depot's few defenders, and Mandalore soon discovered a new experimental weapons system, designated the MX. Having heard rumors regarding the power of the MX, Mandalore ordered his warriors to take the weapon."}, {"tag": "p", "text": "Following the capture of the MX, Mandalore received a call from Aleema Keto's commander to withdraw his troops from the depot, retreat from the planet, and meet the Krath forces at their Orbiting Command Ships. Surprised and angry that he and his warriors were being ordered to run away from the enemy, Mandalore demanded to speak with Qel-Droma. The Krath officer, however, advised the Mandalorian warlord that Qel-Droma had been killed in the fighting and that the Republic fleet was now on its way to halt the invasion. Realizing that, with Qel-Droma's death, his new master was Aleema Keto, Mandalore relayed the orders to his Crusaders to withdraw from the battle. Mandalore, however, was unaware that Keto had in fact betrayed Qel-Droma, lusting after the power he wielded, and left him behind to be captured by the Jedi. Withdrawing from the battlefield, Mandalore and his Crusaders regrouped with the other retreating Krath and departed from Coruscant."}, {"tag": "p", "text": "Once back at the Krath stronghold on Cinnagar, Mandalore and the rest of the Krath military received word that Qel-Droma had in fact not been killed, but had been captured by the Jedi, who intended to put him on trial for crimes against the Republic. Retreating to the war room, Mandalore pored over the data he possessed regarding the recent attack—and subsequent withdrawal—from Coruscant, looking for an answer which would both satisfy the honor of his warriors as well as explain how Qel-Droma had been so easily captured. Realizing that neither he nor his warriors had forgotten anything nor done anything wrong, Mandalore concluded that Keto might have ordered a full retreat even before the tide of battle had turned against the Krath and Mandalorians. Resolving to discuss the matter of rescuing Qel-Droma with Keto, Mandalore approached her in her throne room. Keto, though, was uninterested in rescuing Qel-Droma from the Jedi, instead attempting to persuade Mandalore to forget about Qel-Droma and fight the war as a leader beside her. Finally realizing that Keto had, in fact, betrayed his master, Mandalore decided to appease her for the time being while he figured out a way to rescue Qel-Droma. Taking the reins of command, Keto ordered Mandalore to once again prepare his Crusaders and organize the fleet for a new plan of attack. Having planned a double-feint, Keto advised Mandalore that they would attack Kemplex IX, believing that the Jedi and Republic would still see it as a diversion of Qel-Droma's. Obeying Keto, Mandalore ordered his Crusaders to prepare for battle, knowing that they would follow his orders to the letter. Mandalore, however, did not accompany his warriors aboard the Krath fleet—instead, he boarded his personal shuttle and set course for the fourth moon of Yavin to seek the aid of Exar Kun."}, {"tag": "h4", "text": "The rescue of Ulic Qel-Droma"}, {"tag": "p", "text": "Pushing his shuttle beyond its limits, Mandalore burned out his engines attempting to reach Kun before it was too late. Finding Kun with his Brotherhood of the Sith on Yavin 4, Mandalore explained that Qel-Droma had been captured as well as the details surrounding his betrayal by Keto. Agreeing to help Mandalore in his self-assigned mission to rescue his master, Kun gathered together a number of his Massassi warriors and, along with Mandalore, boarded his starship and set course for Coruscant."}, {"tag": "p", "text": "Arriving at Coruscant, Mandalore accompanied Kun and his Massassi as they interrupted the trial of Qel-Droma. With the entire Senate and trial committee frozen in place by Kun's Sith magic, Mandalore approached Qel-Droma and reaffirmed his loyalty to the Sith Lord. The Jedi, however, soon attempted to stop the rescue of Qel-Droma, with the Jedi Knight Sylvar engaging numerous Massassi, and Cay Qel-Droma and Nomi Sunrider attempting to reason with Ulic. Despite this, Kun used his powers to kill the Republic's Supreme Chancellor, and managed to kill Master Vodo-Siosk Baas in a lightsaber duel. Reeling from the events that had just transpired, the remaining Jedi were powerless to stop Mandalore and Kun as they departed the trial chambers with Qel-Droma."}, {"tag": "p", "text": "Arriving back at Kun's Sith base on Yavin 4, Mandalore advised Qel-Droma about what had actually happened during their failed invasion of Coruscant, and how Aleema Keto had chosen to leave him to die so she could rule the Krath by herself. Warning his master not to trust Keto any longer, Mandalore settled back into his role as Qel-Droma's warlord. Eventually, Mandalore, Qel-Droma and Kun met back up with Keto who pretended to be relieved that Qel-Droma, her supposed lover, had been rescued—Qel-Droma, however, was indifferent toward Keto, taking the advice which Mandalore had given him to heart. Setting events in motion to pay Keto back for her betrayal, as well as to continue the fight against the Republic and Jedi, Qel-Droma and Kun manufactured a plan which would see Keto lead a Sith attack fleet against Kemplex IX and destroy the nearby Cron Cluster with Sith magic; the resulting supernova would wreak havoc upon the Jedi stronghold of Ossus. Qel-Droma, however, neglected to tell Keto that using Sith magic to create a supernova would not protect her from its blast—thus, Qel-Droma ensured that Keto would pay for betraying him. Upon hearing of Kun and Qel-Droma's plan to attack Kemplex IX, Mandalore was shocked and confused as to why his master had not chosen him, his personal warlord, to lead the attack upon the Republic jump station. Advising Mandalore of the deeper details of his plan, Qel-Droma told Mandalore that he and Kun had another, and much more important, assignment—an invasion of the Republic-aligned planet of Onderon."}, {"tag": "h4", "text": "A final battle"}, {"tag": "p", "text": "Tasked with capturing and holding the Iziz Royal Palace on Onderon, Mandalore ordered his fleet carriers to hold orbit above the planet. Following a pre-deployment speech from Mandalore to his Crusaders, the Mandalorians mounted their Basilisk war droids and launched their attack."}, {"tag": "p", "text": "With Mandalore leading the wing of Basilisk mounts, the Crusaders swarmed from their fleet carriers and made their way towards the walled city of Iziz, where the Dark Citadel was housed. Eventually, the enormous Mandalorian fleet of Basilisk war droids was spotted by Queen Galia and Beast-Lord Oron Kira, the rulers of Onderon, and Kira ordered his Beast Riders to defend the city against the invaders. A vicious aerial fight ensued against the Mandalorian Basilisks and the Beast Rider's flying Drexls. During the fight, the Beast Riders managed to get a call out to the Republic, explaining that Mandalore was leading an attack on them and requesting immediate aid. Under orders from Kira, the Beast Riders continued to resist the Mandalorian attacks until a Republic fleet, under the command of Fleet Captain Orley Vanicus, arrived to lend aid against the invaders."}, {"tag": "p", "text": "Mandalore continued to lead his Crusaders in the fight, exhibiting signs of desperation and ruthlessness, but the combined firepower of the Republic warships and Onderonian Beast Riders proved too much for the Mandalorians to handle. Recognizing that the fight was over when he witnessed the destruction of his orbiting fleet carriers, Mandalore realized that he still had a chance to lead his Crusaders to safety; ordering his warriors to retreat from Onderon and make their way to the moon of Dxun, the atmosphere of which was currently touching Onderon's, Mandalore planned to lose the pursuers in the moon's jungles. However, the Republic warships and Beast Riders continued to chase the retreating Basilisks, concentrating sustained firepower on individual Mandalorian mounts so as to quickly destroy them. During their retreat, Mandalore's personal Basilisk war droid was hit by enemy fire and he crash-landed his war mount on the surface of Dxun, away from any other Crusaders. Making his way from the remains of his Basilisk, Mandalore soon found himself surrounded by a number of dangerous beasts native to Dxun's jungles. Even though he prepared to fight off the creatures, they eventually managed to overcome and kill the Mandalorian warlord."}, {"tag": "h4", "text": "The Mandalore tradition"}, {"tag": "p", "text": "Following Mandalore's orders to retreat from Onderon and head for the moon of Dxun, the remaining Mandalorian Crusaders made their way to the established rallying point. Upon arriving on the moon, and losing the pursuing Beast Riders and Republic starships, several warriors initiated searches of the jungles to find their missing leader. During one such search, one Crusader stumbled across the mask of Mandalore the Indomitable, which had become tangled in a patch of nearby foliage and was all that remained of the warlord. In accordance with the rules and traditions of his people, this warrior placed the mask upon his head and became the new Mandalore."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mandalore the Indomitable was an accomplished warrior, who had earned the title and position of Mand'alor through his skill as a warrior, charisma as a leader, and intuition in war. Though his original Taung name was forgotten, upon claiming the title of Mandalore his warriors began to call him the \"Indomitable\" due to his prowess in battle. Like the Mandalores who came before him, Mandalore the Indomitable understood what it meant to be Mando'ade and he used his skills as a warrior and as a commander to lead the Mandalorian Crusaders to victory in numerous successful military campaigns. As a leader, Mandalore possessed a natural charisma which he used to inspire his Mandalorian clans in battle, such as during the Battle of Onderon near the end of the Great Sith War. Likewise, Mandalore possessed a rather simplistic view of galactic affairs, lacking any type of political guile, a trait which was well liked by the Crusaders who followed him."}, {"tag": "p", "text": "His prowess in battle was well known among the Mandalorian clans, and he continued to demonstrate these skills throughout the Great Sith War in numerous battles. To those outside the Mandalorian Crusaders, Mandalore established his skills as a warrior when he challenged the Sith Lord Ulic Qel-Droma to a duel. Even though Mandalore was eventually defeated by the Sith, Qel-Droma was impressed with the way which the Mandalorian chieftain conducted himself in battle and chose not to kill him—instead, Qel-Droma made Mandalore his personal warlord. Mandalore would continually demonstrate his skills as a warrior in future battles, such as those fought at Foerost, Coruscant, and Onderon."}, {"tag": "p", "text": "Mandalore the Indomitable was also known to have been loyal to those persons who had demonstrated their power to him. During the Great Sith War, following his defeat at the hands of Ulic Qel-Droma on Kuar, Mandalore would swear an oath of loyalty to the Sith Lord—an oath which would drive Mandalore to extreme actions later in the war. When Qel-Droma was betrayed at the hands of the Krath Aleema Keto, causing him to be captured by the Jedi during his invasion of Coruscant, Mandalore remembered his oath and sought a way to rescue the Dark Lord from the Jedi Order. Eventually gaining the help of Exar Kun, the Dark Lord of the Sith, Mandalore was instrumental in helping free Qel-Droma from the Republic's Inquisition. Touched by the loyalty that Mandalore continued to show towards him, Qel-Droma rewarded his warlord with the chance to lead the invasion of Onderon—a campaign which had the potential to give both Mandalore and his Crusaders the honor which they inherently craved."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Appearing in the Wizards of the Coast sourcebook for the Knights of the Old Republic comic series, there is an illustration depicting Mandalore the Indomitable and his successor Mandalore the Ultimate. Even though one can visually distinguish the two based on previous visual representations of them, the picture's caption mistakenly identifies Mandalore the Ultimate as Mandalore the Indomitable and vice versa. The mistake is repeated in The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "In the first issue of the Sith War story arc, published in August 1995, Mandalore the Indomitable attempts to entice Ulic Qel-Droma into dueling him. In this conversation Mandalore says that Qel-Droma should meet him on \"my own world\" for the duel. It is then shortly thereafter shown that the duel takes place on the planet of Kuar, on the Plains of Harkul. This initially implied that Mandalore the Indomitable's homeworld, or even birth world, may have been Kuar. Later, in March 2005 for an article appearing in Star Wars Insider 80, author Abel G. Peña would explain why such a random planet was considered the homeworld of a Mandalore. Peña wrote that, historically, the Mandalorian clans would often make conquered worlds their home, citing the planet of Kuar during the Great Sith War as an example. Peña would continue by stating that the \"home\" of a Mandalore was acknowledged simply by wherever they chose to hang their mask. Peña's explanation of Mandalorian tradition explained the story behind Mandalore the Indomitable calling Kuar his \"own world.\""}, {"tag": "p", "text": "With the first actual appearance of the Battle of Kemplex IX in The Sith War 4: Jedi Holocaust, there arose some confusion surrounding a previous set of orders given by Aleema Keto to Mandalore the Indomitable regarding an \"attack\" that he was supposed to have carried out against Kemplex IX. In the third issue The Trial of Ulic Qel-Droma, following her order to withdraw from Coruscant, Keto speaks with Mandalore and orders him to lead his Mandalorians in an attack against the jump station at Kemplex IX. In The Trial of Ulic Qel-Droma Keto says to Mandalore, \"We will do a double-feint and strike the Kemplex Nine jump-station after all! The Republic forces thought it was a diversion of Ulic's, and now they will have left it virtually unguarded!\" Immediately after this statement by Keto, the comic's narration says that, \"Mandalore sets Aleema's orders in motion, following them to the letter. He knows his warriors will see that they are carried out.\" Even though the comic's narration states that Mandalore followed Keto's orders, there is, however, absolutely no information regarding the Mandalorians in action at Kemplex IX, either in the actual comics or source books which were published later. Even though an apparent attack by Mandalore the Indomitable and his warriors was to have taken place, the first actual appearance of the jump station in Jedi Holocaust shows the destroyed jump station at Kemplex IX, with the comic narration stating, \"Kemplex Nine was a bustling city in space…the only inhabited station in a hot, unstable cluster of ten stars known as the Cron Cluster. After Aleema's attack, though, it is no longer inhabited.\" Specifically, it is the last line regarding Aleema Keto that has caused confusion regarding exactly who was responsible for the destruction of the Kemplex IX jump station—Aleema Keto and her attack fleet, or Mandalore the Indomitable and his Crusaders. When asked about the order of events he wrote about for the Battle of Kemplex IX, and about the possibility of two different battles actually happening, Kevin J. Anderson, author of Star Wars: Tales of the Jedi — The Sith War, replied that he probably knew at the time he wrote the story, but was now unsure of the correct answer. Anderson went on to comment that anything he said now regarding the series of events would simply be guesswork on his part. To date, there has been no official statement from Lucasfilm Ltd. regarding this situation, nor has there been offered any sort of explanation for Aleema Keto's initial order to Mandalore the Indomitable."}, {"tag": "p", "text": "The Hasbro toy company released an evolutions three-pack entitled The Fett Legacy. In the pack included alongside Jango Fett and Boba Fett is Mandalore the Indomitable, implying that the Fett's descend from Mandalore the Indomitable. However, this can be considered non-canon, since there is no direct canon source confirming this to be true."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}