{"url": "Mandalore_the_Ultimate", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Males", "Category:Mandalores", "Category:Mandalorian Crusaders", "Category:Mandalorian Neo-Crusaders", "Category:Sith military personnel", "Category:Taung"], "nodes": [{"tag": "h1", "text": "Mandalore the Ultimate"}, {"tag": "p", "text": "Mandalore the Ultimate led the Mandalorians during the Mandalorian Wars. One of the last Taung to claim the Mandalore title, and known to some as the Great Shadow Father, he sought to lift his people from the hole of betrayal and humiliation that plagued them since the Great Sith War. And beyond that, prevent the Mandalorian ways from vanishing forever as the Taung species neared extinction. The Ultimate went on to regroup Mandalorian forces into the Mandalorian Neo-Crusaders and slowly began to conquer fringe worlds that had been left defenseless in the wake of the Great Sith War. Mandalore took full advantage of the Galactic Republic's halfhearted efforts to oppose his aggression and personally led his forces as they invaded Republic territory. Under his command, the Neo-Crusaders nearly defeated the Republic during the Mandalorian Wars, and it was only through the leadership of the Jedi Knights Revan and Malak that the tide of the war was ultimately turned against Mandalore. In a valorous battle, Revan killed Mandalore in single combat, ending the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Mandalore the Ultimate's past was shrouded in mystery. Some believed he was the Taung warrior who claimed the mask of Mandalore the Indomitable; others doubted this story. Regardless of background, the Ultimate swept a massive change across Mandalorian culture."}, {"tag": "p", "text": "In the last days of the Great Sith War, a Taung warrior was part of the Mandalorian invasion force that attacked the planet Onderon. This assault was led by Mandalore the Indomitable and pitted Basilisk war droids against Beast Riders led by the Onderonian king Oron Kira, who overcame the Mandalorians and drove them onto the dreaded jungle moon Dxun. When Mandalore the Indomitable had gone missing in the beast-infested jungle, the Taung warrior served as part of the party that searched for him. He found the Mandalore's Mask lying in the undergrowth, and did not doubt that the Mandalore had perished. This Taung upheld the ancient traditions and put on the helmet, thereon claiming his right as leader of the Mandalorians."}, {"tag": "h3", "text": "Lord of the clans"}, {"tag": "p", "text": "In the years following the death of Mandalore the Indomitable, the new Mandalore went on to prove himself worthy of the title \"Ultimate,\" and, in the wake of the clans' defeat, set about the removing the stains of their past failures and guiding his Mandalorians into a new golden age. Mandalore understood the value an environment such as Dxun's would have for training warriors, and he built a great complex among its forests. Mandalore the Ultimate thus established the inhospitable moon as the clans' new forward base of operations and from there recalled the disparate clans."}, {"tag": "p", "text": "Though few remained to heed his summons, Mandalore was undeterred, for he caught a glimpse of the future and realized something far greater. On the supernatural planet of Shogun, he'd experience a vision. His own species, the Taung, had suffered the worst from the Great Sith War and would soon go extinct. It was a terrible fate, and not one that even the \"Ultimate\" could change. Instead, he bore this burden with honor, and kept Mandalorian tradition alive by recruiting whole new species into the fold, thereby forming a new generation of Mandalorian warriors known as the Neo-Crusaders. In time, the Mandalorian ranks swelled with warriors from countless worlds. Humans made up the majority, but species as diverse as Rodians, Twi'leks, Togorians, Kerestians, and Mandallian Giants were well represented. Under Mandalore the Ultimate's direction, the term \"Mandalorian\" began to signify more than just a species; it referred to a warrior culture that defined itself by its devotion to the ideal of earning honor and glory through combat."}, {"tag": "h3", "text": "The Mandalorian Wars"}, {"tag": "h4", "text": "Prelude"}, {"tag": "p", "text": "About 3978 BBY, a pureblood member of the Sith species approached Mandalore, stated that he was the emissary of a powerful Sith Lord, and persuaded Mandalore to help him in his search for the tomb of the enemy of his master's ancestor. They came to the world of Rekkiad, where they discovered the tomb, and inside a crypt where the Sith took the remains for his master. Afterwards, the emissary told Mandalore of a vision his master had of the Mandalorians waging war on the Republic and conquering it. And although the Sith was influencing Mandalore's mind with the dark side, the warrior chieftain had already wanted a grand war to occur. Mandalore the Ultimate's goal was to build the greatest mass of warriors the galaxy would ever see, and he had no ties to the rather famed Republic. This made it all the more easier for the Sith to convince Mandalore into invading the Republic and test their might. As a result, Mandalore started a new crusade in 3976 BBY. He led his renewed forces into the Outer Rim Territories, along the edge of Republic territory, sacking independent worlds and colonies such as Althir III. The Mandalorian Neo-Crusaders were able to carve out a clan territory greater than that ruled by the Hutts in the span of little more than a decade. During this time, Mandalore appointed Cassus Fett as his top strategist and allowed him to lead an army of Basilisk war-mounts in the subjugation of Cathar."}, {"tag": "p", "text": "The Republic Senate initially failed to respond, refusing to join in the conflict unless the Mandalorians threatened to invade the Republic itself. Meanwhile, Mandalore prepared to do just that. He reordered his conquered provinces to better serve as warehouses and foundries for his growing armadas. The Mandalorian clans grew more powerful than ever before, as they accumulated a huge slave labor-force and conscripted subject peoples into their ranks. As world after world was conquered by their advancing fleets, swarms of refugees began to pour into Republic space."}, {"tag": "p", "text": "It was not until Mandalore's army approached Taris that the Republic senators chose to make a stand and defend the Republic's extensive commercial investment in the planet. Taris was granted Republic membership, and the annexed world soon became the heart of the Republic's defense of the region. Between the years 3965 and 3964 BBY, the first minor skirmishes between Neo-Crusader and Republic forces took place along the Republic border between Taris and the Mandalorian homeworld. For months, the two galactic powers sparred with each other within the neutral Republic frontier, as the Mandalorians systematically probed the strength and resolve of the Republic military in preparation for a full-scale attack."}, {"tag": "h4", "text": "Invasion of the Republic"}, {"tag": "p", "text": "In 3963 BBY, Mandalore started his invasion of the Republic with a rapid conquest of Onderon, staged from nearby Dxun. Then, taking advantage of the chaos that had consumed Taris, Mandalore unleashed his long-prepared forces. His fleets poured into Republic space through three invasion corridors in adjacent sectors and caught the Republic Navy completely off-guard. The main Mandalorian fleet, commanded by Mandalore himself, began a major push towards the Republic security cordon around Taris. Splitting his forces, Mandalore simultaneously attacked Taris and the nearby planet Vanquo, thereby forcing the Republic defenders, under the command of Admirals Jimas Veltraa and Noma Sommos, to divide their efforts, causing them both to be defeated. It was during this time that Republic intelligence agents sought to determine whether Mandalore the Ultimate was the same Mandalore who had arisen after the death of Mandalore the Indomitable, but they could not come to any firm conclusion."}, {"tag": "p", "text": "In the midst of Rohlan Dyre, aka the Questioner's death at Flashpoint, Mandalore added a dying speech to his last words and made him the model for a wide spread use of Neo-Crusader armor."}, {"tag": "p", "text": "Under Mandalore the Ultimate's direction, the Neo-Crusaders used nuclear devices to completely annihilate several cities on Serroco during the Battle of Serroco, dismissing any Republic delusions that the Mandalorians would not use \"appropriate force\" against military bases within and adjacent to major civilian population centers. Soon after, Mandalore—along with most other leaders involved in the Mandalorian conflict—was invited by Arkoh Adasca, head of the Adascorp corporation, to a meeting aboard Adasca's flagship, the Arkanian Legacy, on being contacted by Demagol, under the guise of Rohlan Dyre. Mandalore told \"Rohlan\" of his glorious \"death\". Thus, he gave \"Rohlan\" a new set of armor so that his name would stay dead."}, {"tag": "p", "text": "Adasca wished to sell controllable exogorths, capable of inflicting immense damage, to the highest bidder. Mandalore expressed interest in the offer, even going so far as claiming it would ensure the Mandalorians would win the war. Furthermore, Mandalore believed that the exogorths were important enough to the Mandalorian war effort that he was prepared to offer Adascorp immunity when the Mandalorians declared victory in the war, and thus absorbed every other galactic corporation. Likewise, Mandalore extended to Adasca the lucrative option of becoming the sole weapon smith of all the Mandalorian clans, thus essentially being the steward of the entire Mandalorian war production effort. Adasca, however, believed that he was in a position to barter for the entire control of the Mandalorian army, effectively making him the clans' leader and boss of Mandalore. The meeting, though, was interrupted by the arrival of the Jedi Zayne Carrick and Lucien Draay, who had escaped from their captivity by Adasca aboard the Arkanian Legacy. Under the direction of Draay, the Jedi created a farce through which they made it seem that Adasca had only lured Mandalore aboard the Legacy so that the Jedi could capture the Mandalorian leader. Powerless to stop the ensuing chaos, Adasca was forced to watch as Mandalore and his warriors retreated back to their ships. Following Mandalore's withdrawal, Adasca was killed when he lost direct control of his exogorths and they plunged into the Arkanian Legacy, thus destroying the ship; despite the turn of events, Mandalore was satisfied since the slugs were not controlled by anyone."}, {"tag": "p", "text": "In the opening battles of the war, the Republic armadas proved to be entirely outmatched by the sheer ferocity of the Mandalorian attacks. Time and again, the Republic Navy was soundly beaten, and though the Jedi were still forbidden from entering into the conflict by the Jedi High Council, Mandalore and his warriors believed it was only a matter of time before they came to the Republic's aid, likely under the leadership of Kavar, a famed Council member."}, {"tag": "h4", "text": "Defeat and death"}, {"tag": "p", "text": "Yet, it was not Kavar that led the Jedi to war, but a Jedi Knight named Revan. He and a fellow Jedi Knight, named Alek Squinquargesimus, had rallied a significant portion of the Jedi Order beneath their banner, and were soon in full command of a third of the Republic army. Mandalore, by now used to victory, was taken aback by how Revan turned the Mandalorians' own tactics against them, and soon the Republic Navy began to push the Mandalorians back. Following Revan's liberation of Taris from the Mandalorians, Cassus Fett led Mandalore's forces to victory at Jaga's Cluster, only to find a significant portion of the Mandalorian army destroyed at Althir. The war was turning in the favor of the Republic."}, {"tag": "p", "text": "Though Revan forced a final confrontation with the Mandalorians above Malachor V in the year 3960 BBY, a scouting party saw to it that Revan himself was delayed out of system. Revan soon thereafter arrived at the battle, and as their personal fleets clashed, the two commanders met in single combat. The Jedi's greatest warrior eventually overcame Mandalore, slaying him. In Mandalore the Ultimate's final moments of death, he unmasked himself, coughing up the blood welling in his lungs. Realizing that he was manipulated by the Sith all along, he told Revan about their involvement."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Revan not only stripped the surviving Mandalorians at Malachor V of their armor and weaponry; he took the mask of Mandalore as well, effectively fragmenting the Mandalorian clans. The Mandalorian fleets were all but destroyed at Malachor V by the Mass Shadow Generator, an experimental Republic-engineered weapon. Without leadership and direction, many went on to find work as bounty hunters or mercenaries. Subsequently, there were at least two who claimed the title of Mandalore in attempts to reunify the clans. The first attempt, headed by an unidentified Mandalore, posed a threat to Revan's new Sith Empire, but many Mandalorians were unaware of this, believing that no new Mandalore had been chosen. Mandalore the Ultimate's mantle eventually fell to Canderous Ordo, who had some success in his attempt to reunite the clans at Dxun."}, {"tag": "p", "text": "Several planets were devastated during the Mandalorian Wars, for which Mandalore the Ultimate was responsible. Notable examples included Serroco, which was thoroughly bombed with nuclear devices, and Cathar, whose native species was all but wiped out. In the end, no Mandalorian in history made such a profound and lasting effect as Mandalore the Ultimate. The ferocity of his tactics had pushed Revan and his Jedi to such lengths that they turned to the dark side. The Mandalorians were no longer a species under his rule, but a culture that anyone could be a part of. Mandalore the Ultimate's Crusades would later go on to inspire a ritual duel called the \"Geroya be Haran,\" where the loser would have their entire memory and legacy erased from history, as if they never existed. Such a ritual was used mainly to settle disputes of honor, and particularly devastating for glory-seeking Mandalorians."}, {"tag": "h2", "text": "Skills and Abilities"}, {"tag": "p", "text": "Mandalore the Ultimate was considered a warrior of unrivaled skill and strength. Physically imposing, he was no stranger to fighting, participating in battles just as commonly as he ruled. His fighting prowess likely stemmed from the intense training of a Taung, where one must constantly train themselves mentally and physically in combat before reaching adulthood. A weapons master, he was the fastest Mandalorian to ever perfect the use of the Basilisk war droids. His mastery of weapons was further shown when Alek had challenged him with a lightsaber, only for Mandalore to defeat the Jedi Order's second-best with one blow of his cortosis mythosaur axe. But while Mandalore was a valiant fighter, he could not overcome the Jedi's greatest champion of all, having died in his last stand against Revan. Being a Taung, Mandalore also possessed extreme amounts of physical endurance."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Mandalore the Ultimate's equipment was few, but powerful. While seen with a double-sided spear, Mandalore's primary weapon was his cortosis mythosaur axe, its height rivaling even its wielder's. Due to it being weighted at the head, it could hook around limbs, ram forward in bulldozing fashion, or be used for great kinetic destruction when swung in full force. Forged from an alloy of cortosis and other metals, it was very lightsaber-resistant, and contained an energy cell that allowed it to deliver strong electric charges. The Ultimate was also known for his heavy blaster rifle, which was clipped to his waistline when not in use. Technically wearing Neo-Crusader assault armor, Mandalore the Ultimate was shielded with heavy, energy-ablative beskar plating, provided with a jetpack and in-built commlink, and was given 24 hours of life support."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mandalore understood what it meant to be Mando'ade, and upon becoming Mandalore the Ultimate set out rebuilding the society. Gaining a vision that the Taung were to go extinct, Mandalore knew the fate of the Mandalorians were in his hands, and bore this burden with honor. He would establish a new army, and began by recruiting species from numberless worlds, which demonstrated a willingness to break established ways if it meant keeping his culture alive. Through his leadership and ambition, the term Mandalorian took upon a new significance; they had become more than just a single race, but a unique warrior culture anyone could be part of."}, {"tag": "p", "text": "In addition to recruiting non-Taungs into the clans, Mandalore the Ultimate also broke Mandalorian norms in other matters. Unlike previous Mandalores, Mandalore the Ultimate would often take political considerations into account, deeming it a necessary part of warfare. Mandalore even considered parlaying with his enemies if it would achieve victory, as seen by his presence at the negotiations at Omonoth. But his uniqueness among past Mand'alore didn't stop there. The Ultimate used his new Neo-Crusader movement as a standard to hold other Mandalorians up to, as opposed to the fanatics its members had once been regarded as. In fact, Mandalore even went so far as to standardize the armor of the Mandalorian Neo-Crusaders. Both of these decisions, however, were at the suggestion of his right-hand man Cassus Fett, who himself was interested in reforming Mandalorian ways of battle. In the end, Mandalore saw Neo-Crusaders as useful in purpose and function, but visually distasteful. The Taung was still a warrior at heart, after all."}, {"tag": "p", "text": "Another trait of Mandalore's was his pride and boldness. Mandalore was not afraid to taunt others on what he perceived to be incompetence or foolishness, such as calling Jedi Alek a child for confronting him or jeering Admiral Karath on his naval defeat. This wasn't to say the Ultimate wasn't a serious and authoritative individual, however. He ruled with a stern hand and had no tolerance for insubordination from his inferiors, seeing it as one more tactical problem to be solved. To make up for such strictness, he was generous in his rewards, known for appeasing others by giving them high ranks in his Neo-Crusader movement."}, {"tag": "p", "text": "During the Mandalorian Wars, Mandalore the Ultimate established his reputation as a brazen strategist who was capable of immense destruction. He led a merciless campaign in the Outer Rim Territories, authorizing the devastation of such planets as Cathar and allowing his armies to sack the world of Althir. Even as the Republic began to respond to his aggressions, he continued to lead his Mandalorians with brutal efficiency. As the war escalated, it was clear Mandalore was willing to do anything to win his cause, even to the point of using nuclear devices to destroy entire cities."}, {"tag": "p", "text": "Lastly, the Mandalore was known for his cunning intelligence. In times of battle, he displayed a willingness to use \"soft weaponry\" alongside deadlier implements of warfare; proving there was no measure he wouldn't take to conquer his adversaries. But Mandalore also knew the pen could be mightier than the sword. When a fellow Mandalorian had suddenly vanished, he — most deceptively— turned his disappearance into a false tragedy that scared others into accepting his own authority. Of course, the Mandalore's knack for deception was also used devastatingly on the battlefield. In the beginning of the Mandalorian Wars, the Ultimate successfully fooled the Republic; harassing Republic worlds to test their strength, while giving off a false impression of the Neo-Crusaders' own might, only to hold back the full bulk of his forces in secret. In that way, they'd never see the true war coming until it was too late."}, {"tag": "p", "text": "Mandalore the Ultimate spoke Mando'a, Arkanian, Galactic Basic, and Basiliskan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An unidentified Taung soldier appears in Tales of the Jedi – The Sith War 6, taking up the mask of Mandalore the Indomitable and establishing himself as the new Mandalore. Later, an unidentified Mandalore was mentioned several times in both Knights of the Old Republic video games by various characters and was said to have fought in the Great Sith War and led the Neo-Crusaders during the Mandalorian Wars. Eventually, this ambiguous Mandalore was identified as \"Mandalore the Ultimate\" in the Star Wars Insider article The History of the Mandalorians; The New Essential Chronology later established that the Taung soldier and Mandalore the Ultimate were indeed the same character."}, {"tag": "p", "text": "The character of Mandalore the Ultimate would go on to be a major character in the Star Wars: Knights of the Old Republic comic series, which expounded on events surrounding the time of the Mandalorian Wars. Nevertheless, there was some confusion among fans following the release of the Star Wars: Knights of the Old Republic Handbook in the fall of 2007. In the Handbook, there is provided a brief explanation of the title \"Mandalore,\" followed by an ambiguous statement about the history of Mandalore the Ultimate. In the entry entitled \"Mandalore,\" it was stated that some Republic officials were unsure if this Mandalore was actually the Taung soldier who replaced Mandalore the Indomitable following the Great Sith War, or if he was yet another successor who took the name and mask of Mandalore. The Knights of the Old Republic Campaign Guide, released in August 2008, would continue this ambiguity."}, {"tag": "p", "text": "In the original cover art of Knights of the Old Republic 15, Mandalore sported a red mask. This was changed to a golden color for unknown reasons, although author John Jackson Miller noted that \"it is the case that the redder it is, those raised lines make it look more like the movie Spider-Man's mask.\""}, {"tag": "p", "text": "In the Knights of the Old Republic Campaign Guide, there is an illustration depicting Mandalore the Ultimate on the left and Mandalore the Indomitable on the right beside him. However, the caption mistakenly identifies the one on the right as Mandalore the Ultimate. The Complete Star Wars Encyclopedia repeated this mistake, using the half of the image with Mandalore the Indomitable, and captioning it as Mandalore the Ultimate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}