{"url": "Mandalorian", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Mandalorians", "Category:Mandalorian culture", "Category:Mandalorian organizations", "Category:Outer Rim Territories organizations"], "nodes": [{"tag": "h1", "text": "Mandalorian"}, {"tag": "p", "text": "The Mandalorians were a clan-based cultural group that was composed of members from multiple species all bound by a common culture, creed, and code. They originated on the planet Mandalore in the galaxy's Outer Rim Territories and had a particularly important role in galactic history as legendary warriors against the Jedi. From their homeworld, Mandalorians had flourished across Mandalorian Space and the galaxy at large, colonizing worlds such as Kalevala, Krownest, and Concord Dawn."}, {"tag": "p", "text": "Mandalore had a largely martial history, but since the Mandalorian Civil War, pacifist sentiment had begun to emerge, and by the time of the Clone Wars, the Mandalorians had been reformed under the New Mandalorian regime led by Duchess Satine Kryze of House Kryze while the Old Mandalorians scattered across the galaxy as mercenaries. Under the New Mandalorian government, Mandalore remained neutral and participated in the Council of Neutral Systems as a leading member. Despite enjoying decades of peace, conflict persisted between the New Mandalorian government and factions such as Death Watch, a group of exiled Mandalorian warriors who wanted Mandalore to return to the traditional warlike ways of the past. Such conflict led to another civil war by 19 BBY that toppled the ruling New Mandalorian regime and restored the old Mandalorians, but the conflict culminated in the occupation of Mandalore by the Galactic Republic and its subsequent government, the Galactic Empire."}, {"tag": "p", "text": "Following the rise of the Empire, Bo-Katan Kryze was made Regent of Mandalore, but she refused to follow Emperor Sheev Palpatine. As a result, she was replaced with Gar Saxon, a Death Watch Mandalorian super commando, who was installed as Viceroy over Mandalore, his rule enforced by the Imperial Super Commandos. As with many worlds in the galaxy, Mandalore was oppressed under Imperial rule, with weapons such as the Arc Pulse Generator being developed to pacify and reign in the war-like civilization. Clan Saxon eventually came into conflict with Clan Kryze, Clan Wren, and the former leader of the Mandalorian Protectors Fenn Rau. After the deaths of Gar Saxon and his brother and successor, Governor Tiber Saxon, and with the support of the early Rebellion, Bo-Katan Kryze claimed the Darksaber and took the title Mand'alor. Kryze united the Mandalorian resistance as another civil war erupted on Mandalore, a part of the galaxy-wide struggle against Imperial rule."}, {"tag": "p", "text": "After the fall of the Empire and the rise of the New Republic, and following the Empire's Great Purge of the Mandalorians, some Mandalorians went into hiding. One such group was called \"the Tribe,\" who hid in a covert on the planet Nevarro. However, the Tribe were forced to relocate after revealing themselves to protect one of their own. The Tribe was eventually wiped out by an Imperial remnant, but some of its members survived."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "The Mandalorian people"}, {"tag": "p", "text": "Mandalorians were some of the most feared warriors in the galaxy. As prideful warriors, they held combat as the cornerstone to their culture, their individual identity, and spirit. They also use the Rising Phoenix training to enable to use their jetpacks to enhance their abilities. Mandalorians shared a strong code of honor that could be invoked to settle disputes with one-on-one combat that would conclude with the death of one opponent. This affinity and tradition for single combat extended beyond justice, however, as Mandalorians even sought single combat simply for the glory of fighting a great opponent, such as a Jedi Knight, and even used it to settle leadership disputes. However, some in House Vizsla refused to accept non-Mandalorians like Maul from ever becoming ruler of Mandalore via such traditions. Maul himself had Prime Minister Almec lie to the Mandalorian people by claiming that Satine Kryze had killed Pre Vizsla, Maul's predecessor. The Darksaber was appropriated by House Vizsla as a symbol of authority and leadership used to unify the Mandalorians. The weapon became revered and was passed down to new leaders who defeated the previous leader in combat, with claiming the weapon in any other way being considered illegitimate. As well as Galactic Basic Standard, Mandalorians spoke Mando'a, whose written form was also known as Mandalorian."}, {"tag": "p", "text": "Mandalorian clan structure was like a pyramid, with the ruler, or Mand'alor, at the top and the Protectors enforcing their rule. Below them were the political factions known as houses, which were made up of family clans. One example was House Vizsla, which was comprised of Clan Vizsla and Clan Wren. Under the rule of Duchess Satine Kryze and the New Mandalorian government during the Clone Wars, the Mandalorians had mostly rejected their martial ancestral ways but maintained a police force and secret service, who wielded electropoles and shields."}, {"tag": "p", "text": "Though the Mandalorians were usually distinctly human, one did not need to be human to become one. Instead, what one needed to do was follow the Mandalorian Creed. Thus, some non-human individuals could be adopted into the Mandalorian creed. One such individual was a member of Yoda's species, who was inducted as a member of Clan Mudhorn."}, {"tag": "h3", "text": "Gear, combat, and art"}, {"tag": "p", "text": "Mandalorian armor developed a legendary reputation that was feared across the galaxy and was visually distinctive with its honeycomb plate patterns and menacing T-shaped visors. The armor was made of beskar, a metal extremely resistant to  damage and malleable enough to be forged into armor. An ancient tradition and vital part of Mandalorian culture was forging the beskar into armor, which was carried out by Mandalorian Armorers, who could also forge beskar into other gear like whistling birds. On top of the fabled armor, Mandalorian warriors were equipped with anti-Jedi tools such as jetpacks, magnetized boots, tactical displays, and armed gauntlets that featured weaponry and tools designed to combat the abilities of the Jedi. Some of this weaponry not only helped combat but outright mimicked Jedi abilities, such as their wrist-mounted sonic repulsors that knocked objects away like a Force push would. They generally favored WESTAR-35 blaster pistols and Z-6 jetpacks, which could project missiles. The archetypal Mandalorian starfighter design was called the Kom'rk-class fighter/transport."}, {"tag": "p", "text": "Mandalorian warriors possessed advanced combat training from their many wars that dated to before the Republic's existence. However, it wasn't until their conflicts with the Jedi that they developed their signature combat style. This style entailed a Mandalorian utilizing a mix of melee, ranged, and hand-to-hand techniques while incorporating the technology in his or her vambraces to surprise a Jedi Knight in combat, allowing the Mandalorian to finish the Jedi off. Mandalorian warriors continued to utilize this style of combat against the Jedi for some time as well as against other opponents."}, {"tag": "p", "text": "The Darksaber became a feared weapon in the days of the Old Republic as Mandalorian warriors of House Vizsla used it to slay many Jedi.  When the Jedi claimed the weapon and stored it in the Jedi Temple, Mandalorian warriors would raid the Temple to reclaim the weapon that had become a symbol of their warrior ways. During the Clone Wars, the weapon also came to symbolize leadership of Death Watch as well as House Vizsla."}, {"tag": "p", "text": "Cubism was a popular Mandalorian art movement during the Clone Wars. After the war, the paintings that had depicted the awfulness of war were used to promote and glorify it instead. Mandalorians typically trended towards strong angled and hexagonal lines, such as diamond and honeycomb shapes, in their architecture, vehicles, clothing, and even haircuts. The Darksaber notably reflected this style, with an angular pommel, hand guard, and blade emitter. Sabine Wren, a Mandalorian and a member of the Spectres, was a talented graffiti artist who personalized and painted her armor. A statue of Tarre Vizsla was erected on Mandalore and became a symbol for hope and Mandalorian history. When the Empire constructed an outpost on the statue, some Mandalorians saw this as offensive, eventually destroying the outpost to restore the emblematic statue's appearance."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Mandalorian crusades and early expansion"}, {"tag": "p", "text": "Originating from the planet Mandalore in the Outer Rim, the Mandalorians' history was one of warriors who would become feared throughout the galaxy, gaining a reputation as mercenaries and bounty hunters. They were also known to ride mythosaurs. Even prior to the formation of the Old Republic, war dominated their way of life."}, {"tag": "p", "text": "This life of war eventually turned to dreams of expansion, and a group of Mandalorian warriors known as the Mandalorian crusaders began waging war against other peoples to conquer their worlds. Armor-clad and wielding swords, the crusaders laid waste to many worlds during their wars. The crusaders conquered several worlds and systems beyond their own, among them the planets of Krownest as well as Concord Dawn, a planet that bore the scars of a hundred wars, with almost a third of its planetary mass fractured and reduced to space rubble. These early conquests remained part of the Mandalore sector during the later years of the Galactic Republic and into the reign of the Galactic Empire.[source?] At some point, Mandalorian rally masters, who wore distinct red armor, served as battlefield commanders during a set of wars known as the Mandalorian expansion."}, {"tag": "p", "text": "Eventually, the crusaders' expansion spread to the Inner Rim, where they devastated the planet Ubduria out of contempt for the native Ubdurians, whom they viewed as dishonorable cowards."}, {"tag": "h3", "text": "War against the Jedi"}, {"tag": "p", "text": "The Mandalorian crusaders' expansion eventually brought them into conflict with the Jedi Order and the Republic they protected. Their first confrontations with the Jedi Knights took the Mandalorians by surprise: their use of the Force and the powers it granted them was a challenge that they had never seen before. However, the prideful nature of the Mandalorians would not allow that disadvantage to stand, and they began to devise ways to overcome the powers of the enigmatic Jedi. The result was a major advancement in the development of Mandalorian technology, specifically of their arsenal and their infamous armor. They also developed a fighting style that combined their entire arsenal and skills to allow them to counteract the Jedi's supernatural abilities. With these new technologies, the Mandalorians began to win their share of conflicts with the Jedi, and their warriors earned the reputation of being capable of confronting and defeating Jedi Knights. The generations-long conflict ensured an enmity that lasted for several wars and was remembered by the wider galaxy even millennia later during the Clone Wars. These clashes between the Mandalorians and the Jedi Order became immortalized through cubist murals displayed in Mandalore's capital city of Sundari and on the moon Concordia."}, {"tag": "p", "text": "Despite their near-continuous conflicts, the Mandalorians and the Jedi were not always in conflict. The most prominent[source?] example of this was when the Mandalorian-born Tarre Vizsla, a member of the powerful House Vizsla, was inducted into the Jedi Order as a child. True to his Mandalorian nature, Vizsla distinguished himself from his Jedi peers by creating a unique lightsaber: the Darksaber. At some point in his life, Tarre Vizsla became the Mand'alor, the sole ruler of Mandalore and a revered figure among his people. Following his death, the Jedi recovered the Darksaber and returned it to the Jedi Temple on Coruscant. Mandalorians later honored him by building a large statue of him on Mandalore to cement his legacy."}, {"tag": "p", "text": "During the last centuries of the Old Republic, the Mandalorians struck at the very heart of their enemies' power: members of House Vizsla infiltrated the Jedi Temple on Coruscant and stole Tarre Vizsla's Darksaber. They used the saber to conquer the entirety of Mandalore, and united the diverse houses and clans throughout their territory."}, {"tag": "h3", "text": "Decline"}, {"tag": "h4", "text": "The devastation of Mandalore"}, {"tag": "p", "text": "Despite the unity that House Vizsla had brought to Mandalore, such was the warrior temperament of the Mandalorians that it did not last. Constant warfare and relentless campaigns of conquest ravaged Mandalore. Warlords from various clans emerged to fight the Jedi, but also to fight among themselves. The last great struggle between the Mandalorian warlords and the Jedi occurred on Mandalore itself, and caused a cataclysmic event that devastated the planet, scorching much of its surface into a lifeless, white desert."}, {"tag": "p", "text": "This event ended the war between the Mandalorians and the Jedi, as well as the Mandalorians' dreams of expansion. As a result of their homeworld's devastation, a major focus on reconstruction occupied the warriors for a time; the uninhabitable conditions of Mandalore's surface forced them to adapt, just as they had adapted to the Jedi's use of the Force. Instead of abandoning Mandalore, they constructed sealed dome cities, such as the capital city of Sundari. Other Mandalorian clans chose to settle on worlds of the Mandalore sector, such as Clan Wren on the snow planet of Krownest, while the Protectors established a base on the moon of Concord Dawn."}, {"tag": "p", "text": "As the victorious Jedi helped establish the new Galactic Republic as the dominant galactic government, the Mandalorians remained isolated in their sector, their warrior ways and desire of conquest still alive though they would eventually fall into civil conflict."}, {"tag": "h4", "text": "Pacifism"}, {"tag": "p", "text": "During the Battle of Kur in the High Republic Era, Admiral Pevel Kronara of the Republic Defense Coalition noted that the Mandalorians had been relatively peaceful since before his birth. In the years prior to the Invasion of Naboo, another conflict broke out between the Mandalorian people: the Mandalorian Civil War. The civil war was fought between competing ideals within Mandalorian society, including those who supported Mandalore's warrior past and the New Mandalorians, led by Satine Kryze. Also involved were the Protectors of Concord Dawn, an elite group of warriors sworn to defend the Concord Dawn system. At the end of the civil war, Satine Kryze ruled as the Duchess of Mandalore, and the warrior clans were exiled to Concordia. Some of these clans became the Death Watch, plotting their coup against the new regime, while others left Concordia and resettled in other parts of the galaxy, becoming the Old Mandalorians. These Old Mandalorians started working as private mercenaries, with no interest in revenge."}, {"tag": "p", "text": "Satine gradually rebuilt following the damages caused by the war. The considerable number of deaths had left Satine with a fierce hatred of violence, and she became a staunch pacifist. She reformed Mandalorian way of life. She also established a Ruling Council that had several Ministers, a cabinet which was led by a Prime Minister. By the time of the Clone Wars, the position was occupied by Almec. Under her rule, Mandalore prospered and turned into a modern and peaceful society. This new government also eventually joined the Galactic Republic."}, {"tag": "p", "text": "In the final years of the Republic, a Mandalorian mercenary named Jango Fett was considered the best bounty hunter in the galaxy."}, {"tag": "p", "text": "When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Satine made sure that Mandalore was neutral and continued to prosper. She then became leader of the Council of Neutral Systems, a Galactic Senate conglomerate of 1,500 star systems who wished to stay out of the conflict."}, {"tag": "h3", "text": "Resurrection"}, {"tag": "p", "text": "Unknown to the New Mandalorians, the Concordian governor Pre Vizsla revived the Mandalorian culture as the Death Watch. Among the leadership of the group was Duchess Satine's sister, Bo-Katan Kryze, the leader of the Nite Owls, a group of elite female warriors. Death Watch began committing terrorist acts against the pacifist regime, including attacks on Mandalore, on a Republic cruiser, and on Kalevala, a planet in the Mandalore sector that had been colonized by Mandalorians. Vizsla longed to restore the warrior heritage of the  Mandalorians, and conspired with Count Dooku of the Confederacy of Independent Systems, Vizsla hoped the Republic would believe an intervention was necessary, so Death Watch could fight their invasion and be hailed by the Mandalorians as heroes. However, the plot failed, and the Galactic Senate rejected the Mandalore Defense Resolution."}, {"tag": "p", "text": "The outcasts of Death Watch fled to become mercenaries, constructing a base on Carlac. The group began plotting for revenge, allying first with Separatist senator Lux Bonteri to plot Dooku's downfall, and then with the renegade Sith Lord Maul's Shadow Collective to win back the support of Mandalore's people. However, after Vizsla betrayed Maul, Maul killed him and became Death Watch's leader, prompting Bo-Katan Kryze to rebel against him, forming the Mandalore resistance."}, {"tag": "p", "text": "Jedi Master Obi-Wan Kenobi investigated the coup, but was captured, and Maul killed Satine to spite him. Kenobi escaped and returned to inform the Galactic Republic; in the meantime, Supreme Chancellor Sheev Palpatine, secretly the Dark Lord of the Sith Darth Sidious, captured Maul and imprisoned him in the Spire on Stygeon Prime. Maul's Mandalorian super commandos proved to be loyal and freed him, but nevertheless Maul's hold on Mandalore collapsed. Following the Siege of Mandalore, Bo-Katan was named Regent of Mandalore. Eventually Kryze was ousted out by Clan Saxon when she refused to follow Emperor Palpatine, and the planet was ultimately occupied by the Galactic Empire.\nMeanwhile, the Protectors, who regarded Death Watch as traitors, assisted the Grand Army of the Republic in training clone troopers. Skull Squadron, commanded by Fenn Rau, assisted the Republic by training clone trooper pilots and fought in the Third Battle of Mygeeto."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "After the Imperial occupation of Mandalore, Rau's Protectors established a base on the third moon of Concord Dawn, getting paid by the Empire to protect their system on their behalf, while other Mandalorians under the leadership of Gar Saxon, the Imperial Viceroy of Mandalore, would go on to serve the Empire, with some joining in the Imperial Military as Imperial Super Commandos."}, {"tag": "p", "text": "In 2 BBY, Saxon and his Imperial Super Commandos wiped out the Mandalorian Protectors; as a result, Rau decided to join the rebellion. Later that year, Sabine Wren found the Darksaber on Dathomir after she, Kanan Jarrus, and Ezra Bridger fought a battle there against Maul. At the urging of Fenn and the rebel leaders Hera Syndulla and Jarrus, Sabine agreed to begin training with the Darksaber so that she could reunify her people and rally them to help the rebellion."}, {"tag": "p", "text": "Following Sabine's training, she, Rau, Jarrus, and Bridger returned to Krownest to Clan Wren's Stronghold. There, Sabine attempted to convince the clan's leader and her mother, Countess Ursa Wren, to join the rebellion. At first, Ursa decided to surrender the Jedi to Viceroy Saxon and his Imperial Super Commandos in exchange for the Darksaber and sparing her daughter. When Saxon branded her and Clan Wren enemies of the Empire, Ursa and her son Tristan fought Saxon and commandos alongside Rau and the Jedi. When Saxon tried to kill Ursa with the Darksaber, Sabine took Bridger's lightsaber and fought Saxon. Sabine was then able to reclaim the Darksaber and subdue Saxon. When Saxon tried to shoot Sabine, he was killed by Ursa. His death created a power vacuum among the Mandalorians. Sabine then decided to stay behind and help her mother, clan, and Rau find Mandalore's true leader, to whom she would give the Darksaber."}, {"tag": "p", "text": "Soon afterward, Bridger returned to Krownest, having escaped from the Battle of Atollon, to request help from Clan Wren for the rebels against Grand Admiral Thrawn, who was attacking the rebel base on Atollon. Although unable to send a full force, due to their current struggles against Clan Saxon, Ursa agreed to allow Sabine, Tristan, and Rau to lead several Mandalorian volunteers and ships to accompany Ezra and Chopper back to Atollon. The Gauntlet and several Fang fighters traveled back to Atollon, where they destroyed the Interdictor vessel that was preventing the rebels from escaping. Able to escape, the remaining rebels fled the system, while the Mandalorians returned to Krownest."}, {"tag": "p", "text": "In 1 BBY, Clan Wren under the leadership of Ursa and Sabine fought on Mandalore against Clan Saxon and the Empire. At some point during the Mandalorian civil war, Sabine and her younger brother, Tristan, arrived at the statue of Tarre Vizsla and discovered that the Empire had built an outpost situated on it. Sabine and Tristan destroyed the outpost and restored the statue to its original state. Clan Wren was joined by several other factions and clans including the sole Journeyman Protector Rau, Lady Bo-Katan's Clan Kryze, Clan Vizsla, Clan Rook, and Clan Eldar. Sabine and the Rebel Alliance's Spectres Jarrus and Bridger also attacked an Imperial prison hoping to find Alrich Wren, although Alrich had been moved."}, {"tag": "p", "text": "Sabine then offered Kryze the Darksaber, but she refused knowing she was not the leader her sister, Satine, had been. Together they attacked a convoy guarded by the super commandos. They were then able to rescue Alrich. However, the commandos and the Empire then deployed an AT-DP armed with the \"the Duchess\" weapon prototype that disintegrated numerous warriors of Clans Wren and Kryze. Only Tristan and Ursa survived the onslaught. The survivors then regrouped. Sabine and Bo-Katan then planned to destroy it by sneaking aboard Governor Tiber Saxon's Star Destroyer near Sundari to atone for her role in creating the weapon."}, {"tag": "p", "text": "The combined Mandalorian and rebel forces managed to infiltrate Saxon's Star Destroyer. Following a skirmish, they destroyed the Duchess and Saxon's vessel. After the battle, Lady Bo-Katan assumed the Darksaber and the mantle of leadership over the Mandalorian clans. The Vizslas, Wrens, Kryzes, Rooks, Eldars, and the sole remaining Protector, Fenn Rau, pledged allegiance to the new Mand'alor. Kryze's reign as Mand'alor was short lived[source?] when the Empire started the Great Purge and the Darksaber was taken by ISB officer, Moff Gideon."}, {"tag": "p", "text": "Additionally, at the time, Boba Fett, the clone son of Jango Fett, kept the Mandalorian legacy alive by working as an infamous bounty hunter in Mandalorian armor."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "Following the Great Purge, surviving Mandalorians went into hiding, and the Mandalorian people were believed to have perished completely. By circa 9 ABY, one tribe was hiding in a covert on Nevarro, a world in the outer reaches of the galaxy. One of its members was the bounty hunter Din Djarin, known as \"The Mandalorian.\" After Djarin did business with an Imperial remnant, it caused a disturbance within the covert, with one member, Paz Vizsla, calling Djarin a coward for dealing with the Imperials. Soon after the confrontation as well as a conversation with a Mandalorian known as \"The Armorer,\" Djarin decided to go against the remnant and rescue Grogu, whom he had captured and turned over to them. However, after he performed a rescue, he was stopped by the Bounty Hunters' Guild, who sought good relations with the local Imperials. Then, Mandalorians from the covert emerged from hiding and fought against the Bounty Hunters' Guild, protecting one of their own. Djarin escaped, but, as a result of openly fighting, the tribe was forced to relocate the covert."}, {"tag": "p", "text": "Despite the attempts of the Tribe to relocate the covert, a large majority of them had been killed by Gideon's Imperial remnant. The Armorer was among those who survived, and it was speculated that others escaped Nevarro. The Armorer later established Din Djarin's clan, which consisted of both Djarin and Grogu, an infantle member of Yoda's species, when Djarin returned to Nevarro."}, {"tag": "p", "text": "During this time, Lady Kryze and two of her followers highjacking Imperial shipments on Trask. Their goal was to use the shipments to reclaim Mandalore and have Kryze reinstated as the Mand'alor. Kryze also enlisted the aid of Djarin in echange for locating surviving Jedi. With Djarin's help, Kryze and her followers were able to take the cruiser and it's cargo. Unfortunately, the cruiser's captain refused to reveal the location of the darksaber and took his own life."}, {"tag": "p", "text": "Kryze eventually caught up with Darksaber's current owner, Moff Gideon when Djarin asked for help in boarding Gideon's light cruiser. With help from New Republic Marshal Carasynthia Dune, bounty hunter Boba Fett, and assassin Fennec Shand, Kryze was able take control of the cruiser. However, Djarin had taken the darksaber from Gideon, but could not to give it to her freely."}, {"tag": "h2", "text": "Mandalorians in the galaxy"}, {"tag": "p", "text": "Mandalorian armor struck fear in the hearts of many across the galaxy. The Trandoshan hunter Garnac kept a Mandalorian Neo-Crusader helmet as a trophy. Boba Fett, a human male bounty hunter of Mandalorian heritage, wore armor inherited from his father Jango Fett, a bounty hunter raised as a Mandalorian foundling, keeping the memory of the Mandalorians alive well into the Galactic Civil War. Jango's armor inspired those of the soldiers cloned from him, starting a design lineage that continued down to the stormtroopers of the First Order."}, {"tag": "p", "text": "Following the Great Purge, the majority of the Mandalorians had been killed, making them a rare sight in the galaxy. One group known as \"the Tribe\" survived and hid on Nevarro, though later they were mostly exterminated by an Imperial remnant. Afterward, Din Djarin was tasked with searching the galaxy for Grogu's species as their own clan. Several Mandalorian war banners decorated the entrance of Maz Kanata's castle on the planet Takodana."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When The Empire Strikes Back was in pre-production, there was an idea for a squad of \"supercommandos\" from the Mandalore system armed with weapons built into their white suits. The costume prototype was repainted for Boba Fett, and the idea of the Mandalorians was paid lip service to in The Empire Strikes Back novelization by Donald F. Glut. As mentioned in the novelization, the Mandalorians were now imagined as \"a group of evil warriors defeated by the Jedi Knights during the Clone Wars.\" Fett's popularity inspired a wealth of Expanded Universe literature about him, which assumed he and his father were Mandalorian like their armor."}, {"tag": "p", "text": "When it came time to introduce the Mandalorians in season two of  The Clone Wars, George Lucas and Dave Filoni looked at Mandalore in the Expanded Universe and decided to keep the broad strokes of their history. Much of the Mandalorian history referenced was subsequently rebranded Legends, and not considered canon."}, {"tag": "p", "text": "Filoni wanted to give the Mandalorian people's appearance a \"Nordic flavor.\" The Clone Wars art department looked at Fett's armor and translated its angles, particularly the diamond shape on the breastplate, into every aspect of the Mandalorian aesthetic. Filoni and Lucas felt it should be made clear that the ancient Mandalorians were an army, not a ragtag band of warriors wearing customized armor, so Death Watch would look uniform. (The decision also kept Boba Fett's armor unique.) Filoni hoped to eventually show how the Mandalorians became mercenaries who supplied Fett with his unusual armor. When Death Watch reappeared in season four's \"A Friend in Need,\" the characters were given a greater variety of gear, lending them what Lucas described as a \"biker gang feel.\""}, {"tag": "p", "text": "Before its cancellation, The Clone Wars was to depict the Siege of Mandalore. Writer Henry Gilroy said Mandalore was likely occupied by the Republic before it turned into the Empire. He speculated due to Mandalore's importance, it was likely a \"soft occupation,\" with a new Mandalorian puppet leader ruling the planet. Star Wars Rebels has since confirmed that the Mandalorian named Bo-Katan Kryze became Regent of Mandalore following the Siege, and was deposed by Emperor Palpatine following the end of the Republic. The siege was later depicted in The Clone Wars revival on Disney+."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}