{"url": "Mandalore_the_Uniter", "categories": ["Category:Legends articles", "Category:Clan Awaud", "Category:Individuals of unspecified species", "Category:Males", "Category:Mandalores", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Mandalore the Uniter"}, {"tag": "p", "text": "Aga Awaud was a male Mandalorian mercenary who lived during the tumultuous era of the New Sith Wars. On a journey back to the planet Mandalore in the final century of the galaxy-spanning conflict, Awaud discovered that Mandalorian space was under attack by raiders from the surrounding sectors, and most of his clan had perished from the widespread Candorian plague. Spurred to action, Awaud sent out a call for Mandalorians throughout the galaxy to rally in the defense of the Mandalore sector in what became known as the Return. He claimed the mantle of Mand'alor, the traditional leader of the Mandalorians, and upon assuming the title of Mandalore the Uniter, set about to ensure the Mandalorians survived the New Sith Wars. Under the leadership of Mandalore the Uniter, Mandalorian space emerged from the wars as a significant industrial power in the galaxy, offering protection to the sectors that surrounded it, and becoming a symbol of stability in the Outer Rim Territories."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Mandalorian, Aga Awaud was a member of Clan Awaud on Mandalore, the traditional homeworld of the Mandalorian people, located in the Outer Rim region of the galaxy, during the time of the New Sith Wars, waged between the Galactic Republic and the forces of the Sith. Awaud eventually came to earn a living as a mercenary, and had a family who lived on Mandalore."}, {"tag": "p", "text": "It was during this time that the galaxy had suffered a wide-spread outbreak of the Candorian plague that ravaged entire worlds, and when Awaud returned home to Mandalore in 1058 BBY, he made the sad discovery that his family and much of Clan Awaud had been killed as a result of the disease. His own personal tragedy, in addition to the revelation that the Mandalore sector was under attack by raiders from the lawless sectors that surrounded it to such a degree that Mandalorian starships were forced to form defensive caravans, led Awaud to found a movement that came to be known as the Return. The Return called upon Mandalorians living throughout the galaxy to rally to the defense of Mandalorian space, and many heeded the call. In 1051 BBY, Awaud claimed the title of Mand'alor, the traditional leader of the Mandalorian clans, and took on the sobriquet of Mandalore the Uniter."}, {"tag": "p", "text": "Under the reign of Mandalore the Uniter, the Mandalorians not only survived the chaos of the New Sith Wars, but flourished. The Mandalore sector became a regional industrial power, and a symbol of much-needed stability in the galaxy's Outer Rim Territories, offering protection to neighboring star systems and sectors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aga Awaud was first introduced into Star Wars canon in The Essential Guide to Warfare, a military-based reference book authored by Jason Fry and Paul Urquhart, published April 3, 2012. Fry developed Awaud with the intention of the character being a celebrated transitional figure in Mandalorian history, and his story was part of a larger attempt to explain and integrate canon changes introduced in the Star Wars: The Clone Wars television series with existing continuity. Mandalore the Uniter was later referenced and visually depicted for the first time in the reference book The Bounty Hunter Code: From the Files of Boba Fett."}, {"tag": "p", "text": "Awaud's title of Mandalore the Uniter had been used by the real-life leader of the Mandalorian Mercs Costume Club, Tom Hutchens, for his costuming character \"Novall Talon\" since 2008. When asked if the use of the title in The Essential Guide to Warfare had been in reference to Hutchens' character and the Mandalorian Mercs, Fry admitted that it hadn't been intentional, but noted that it was a \"lucky accident\" and approved of it in retrospect, noting \"[Novall Talon] and the Mercs are awesome folks, and I'm very glad it worked out the way it did.\" When the canonical Mandalore the Uniter was pictured in The Bounty Hunter Code reference book, the character's armored appearance was significantly different than the costume armor worn by Hutchens."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}