{"url": "Mandalorian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Move protected articles", "Category:Articles in need of updating", "Category:Mandalorian culture", "Category:Mandalorian organizations", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Mandalorian"}, {"tag": "p", "text": "The Mandalorians—known in Mando'a as the Mando'ade, or \"Children of Mandalore\"—were a nomadic group of clan-based people consisting of members from multiple species, all bound by a common culture."}, {"tag": "p", "text": "In their early years, Mandalorian culture revolved around battle, with war being a source of honor and pride in their community. The leader of the Mandalorians was known as the Mand'alor, translating to \"Sole Ruler\" and was rendered as \"Mandalore\" in Basic. Throughout their history, the Mandalorians were frequently allied with the Sith, perhaps most notably the Sith Lord Exar Kun, and held a certain distrust and general dislike for the Jedi Order. However, they would not hesitate to cooperate with the Jedi if a partnership between the two groups was mutually beneficial. In later years, the Mandalorians moved away from their obsessively war-like and conqueror ways and instead, most became bounty hunters and mercenaries, selling their skills to various individuals and factions in the galaxy. However, the Mandalorian Protectors sided with the Alliance to Restore the Republic ever since about 3 ABY and even continued to serve the Alliance of Free Planets, the New Republic, and finally the Galactic Alliance."}, {"tag": "p", "text": "When Boba Fett took the title of Mandalore years later, they were approached by the powerful unknown empire of the Yuuzhan Vong to aid them as wealthy mercenaries, and while the offer was accepted (mainly because the other option would have been enslavement of the Mandalorian homeworld), Boba managed to feed information to the New Republic, and while the Mandalorians continued to fight for the Vong in the early Yuuzhan Vong War, they soon betrayed them and fought with the many other factions defending the galaxy. After the war ended, the Second Galactic Civil War began, and Jaina Solo, daughter of Han and Leia, came to Fett asking to be trained, given the Mandalorians' famous reputation as legendary warriors against the Jedi. The Mandalorians ironically fought alongside the New Jedi Order, their former enemies in the crusades many years before and the Alliance-in-exile in this conflict. With training from Fett, and from others, Jaina killed her brother Darth Caedus, ending the war. Ultimately, in the span of over four thousand years, Mandalorians slowly changed from the feared Mandalorian Crusaders of the Sith Empires, to the elite soldiers of the Jedi Coalition and later the reorganized Galactic Alliance, fighting for a cause rather than mainly for credits and the destruction of worlds."}, {"tag": "p", "text": "Mandalorians wore very distinctive battle armor, including helmets with T-shaped visors that covered the entirety of their faces, and would provide inspiration for the helmets of the Republic's clone troopers. These helmets would eventually become strongly associated with the Mandalorian people."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Mandalorians began as the humanoid Taung species from the planet Coruscant. Intense fighting with the thirteen Human nations of Coruscant known as the Battalions of Zhell began millennia before the Republic, and when a powerful volcano nearly wiped out the humans and darkened the skies over Coruscant, the Taung came to call themselves the Dha Werda Verda—the \"Warriors of the Shadow\". Despite the volcano's devastating effect, the Taung were eventually driven off Coruscant and took refuge on the world of Roon. Led by the warlord known as Mandalore the First, they would conquer another planet in the Outer Rim in 7000 BBY, which they named Mandalore after their leader. The Taung took on the name Mandalorians and were seen by many as the most skilled fighters in the galaxy, thriving in battle. These Mandalorian Crusaders were known for their use of cutting-edge weaponry and held to a strict code of honor, and wore armor known simply as \"Crusader Armor\" that differed from one soldier to the next."}, {"tag": "p", "text": "For thousands of years, Mandalore's new inhabitants would not stray far from the Mandalore sector, instead venturing on a series of further conquests to capture the worlds of Ordo, Gargon, and Shogun. When the Mandalorians came to the nearby Mandallia, though, the Mandallian Giant natives not only repelled the invaders' assault, but many came to join the Mandalorian culture, having impressed the Mandalorians with their strength and prowess. But nearly three thousand years after Mandalore's conquest, at a point prior to 4000 BBY, the Mandalorians began to expand their ongoing crusade outward and engaged the Nevoota species in a conflict that would lead to the extermination of the Nevoota and the deification of war in the Mandalorian culture, personified as the destroyer god, Kad Ha'rangir. Shorty before 4000 BBY, the Mandalorians were led by a new Mand'alor, Mandalore the Indomitable, and in their continuing campaign of expansion, the Mand'alor led a raid on the planet Iskadrell. There, the Mandalorians freed the slaves of the Iskalloni, taking many of them into their culture, including a young Antos Wyrick. Another victim of the Mandalorian crusade was the planet Basilisk. As the Mandalorians invaded, the Galactic Republic sent a relief force, under the command of Jedi Master Sidrona Diath, to the aid of the Basiliskans. Even with Republic support, the Basiliskans found their lines being overrun by the more numerous Mandalorians, and upon realizing that the they were going to lose the battle, the Basiliskans decided to poison their own planet so that the conquerors would not be able to use the world. Basilisk fell, but because the planet's surface was virtually destroyed, the Mandalorians decided to abandon the world and move on, though not before pillaging a sizable number of Basilisk war droids for future use. The Mandalorians also captured a large number of the reptilian Basiliskans, and through centuries of warfare they degenerated into little more than war mounts and beasts of burden, becoming known as \"Lagartoz War Dragons\"."}, {"tag": "h3", "text": "The Great Sith War"}, {"tag": "p", "text": "Seeking further challenges, the Mandalorian Crusaders moved toward the Deep Core. Setting their sights on the Empress Teta system, the Mandalorians conquered the rocky world of Kuar, and utilized the ruined underground cities as a staging ground for their attack on Empress Teta. When the Mandalorians destroyed a carbonite smelting station, it caught the attention of the fallen Jedi Knight-turned-Sith Lord Ulic Qel-Droma, who'd usurped control of the Krath forces in command of Empress Teta. Challenged to a duel by the Mand'alor, Qel-Droma traveled to Kuar where he faced off against Mandalore the Indomitable on the plains of Harkul. Despite the use of his Basilisk war droid, the Mand'alor was defeated, and in the duel's aftermath, swore fealty to Qel-Droma and his own Sith Master, Exar Kun. Thus was forged the first Mandalorian-Sith alliance, but while Mand'alor had accepted his defeat at the hands of Qel-Droma, several of his supporters had not, including the Zeltron Antos Wyrick; Mand'alor's defeat at the former Jedi's hands would drive Wyrick to try and unlock the mysteries of the Jedi's power and the secrets of the Force."}, {"tag": "p", "text": "Now allied with the Sith and Krath forces, the Mandalorian Crusaders joined in an attack on the Republic shipyards in orbit around Foerost. Mandalore the Indomitable led his warriors through the corridors of Foerost's command station, destroying all opposition before him. With the combined coordination of the space forces and the Mandalorians, Qel-Droma was able to quickly and decisively capture the Foerost shipyards, as well as the three hundred Republic starships that had been docked there. With their newly-acquired flotilla and the Republic fleet chasing false leads to the jump station at Kemplex IX, Qel-Droma and the Mandalorians invaded Coruscant. Basilisk war droids rained down on the planet from space, and the Mandalorian Crusaders poured into Galactic City. Qel-Droma was betrayed by the Krath witch Aleema Keto, who ordered a retreat of their forces and abandoning Qel-Droma to the Jedi; claiming the Sith Lord had died, Keto was able to sway Mandalore the Indomitable to pledge his loyalty to her. Upon finding out the truth of Keto's betrayal, the Mand'alor feigned loyalty and sent his Crusaders with her latest attack force while he personally boarded his shuttle and journeyed to Yavin 4 to seek the aid of Exar Kun. Arriving at the jungle moon, Mandalore explained to Kun what Aleema had done, and asked the Dark Lord of the Sith to lend him aid in rescuing Ulic from execution. Though Kun had warned Ulic that attacking Coruscant would end badly, he agreed to help Mandalore in rescuing his apprentice. Storming the Senate Building with Kun, Mand'alor rescued Qel-Droma and warned him of Keto's treachery."}, {"tag": "p", "text": "After Keto had been dealt with by Qel-Droma, Mandalore the Indomitable had been tasked with capturing the Iziz Royal Palace on Onderon for the Sith. Ordering his fleet carriers to hold position in orbit over the planet, the Mandalorian Crusaders swarmed down atop their war droid mounts toward the city of Iziz. A vicious aerial battle ensued as the Crusaders and their Basilisks clashed against the Onderonian Beast Riders and their flying Drexls. During the fight, the Beast Riders managed to get a call out to the Republic, explaining that the Mandalorians were attacking and requesting immediate assistance. It wasn't long before a Republic fleet, led by Fleet Captain Orley Vanicus, arrived to combat the Crusader attack. Realizing that the fight was over when he witnessed the destruction of his orbiting fleet carriers, Mand'alor wagered that there was still a chance to lead his Crusaders to safety; ordering his warriors to retreat from Onderon and make their way to the moon of Dxun—the atmosphere of which was currently touching Onderon's—Mand'alor planned to lose their pursuers in the moon's dense jungle. During their retreat, Mand'alor's personal Basilisk war droid was hit by enemy fire and he crashed on the surface of Dxun, separated from the other Crusaders. Pulling himself from his war droid's wreckage, the Mand'alor soon found himself surrounded by a number of dangerous beasts native to Dxun's jungles. Though he fought the creatures, Mandalore the Indomitable was eventually overcome and slain by the beasts. While combing the jungles for their downed leader, a Mandalorian Crusader came upon the Mand'alor's mask and, in accordance with Mandalorian tradition, claimed the mask as his own to become the new Mand'alor."}, {"tag": "h3", "text": "The Mandalorian Wars"}, {"tag": "p", "text": "During the next twenty years, peace prevailed and the galaxy began to slowly recover from the damage inflicted during the war, entering an era of rebuilding and renewal known as the Restoration Period. On the Mandalorian side, the new Mand'alor—going by the title of \"Mandalore the Ultimate\"—undertook the task of rebuilding the Mandalorian clans that had been greatly diminished in the war. With many of the original Mandalorian species, the Taung, now dead, Mandalore the Ultimate aggressively expanded his recruiting efforts, welcoming members of all alien descent into the Mandalorian culture. To this end, the Mandalorians established bases such as Unity, constructed under the planetary crust of Caillte. While primarily built to serve as a forward supply post, under Feruun Lern it also became a recruitment center where numerous individuals were invited to learn the Mandalorian ways and become new Mandalorian warriors. As a result, the Mandalorian ranks swelled with an influx of warriors from countless worlds. In an effort to help cohesion and uphold order among the motley ranks, a new generation of more uniform armor was implemented at the suggestion of the Mand'alor's closest advisor, Cassus Fett, thus forming a powerful new generation of warriors known as the Neo-Crusaders. However, as many Mandalorians rebuilt, ten years after the end of the Great Sith War, dozens of Mandalorians were unjustly arrested and executed after a psychotic bounty hunter named Jigger Wraith preyed upon innocents using rare Mandalorian weaponry. At the same time, Antos Wyrick continued his research into the Jedi and the Force, constructing the New Generation Academy on Osadia where he attempted to form a sect of Force-using Mandalorians called the Mandalorian Knights. In a deal with the Crucible slave-trading organization, the ruthless Zeltron traded his own daughter for more test subjects. But the Crucible would return while Wyrick was away, raiding the school and capturing its students. His experiments ruined, Wyrick rejoined the Mandalorians under the pseudonym of \"Doctor Demagol\"."}, {"tag": "p", "text": "In the decades since their defeat in the Great Sith War, many Mandalorians had become convinced that their once-prophesied \"Great Last Battle\" was soon to be at hand. Emboldened by an element of the \"True Sith\" in hiding, Mandalore the Ultimate launched a campaign into the Outer Rim, on the edge of Republic space. Conquering several independent planets outside of the Republic's interests, the Mandalorian Neo-Crusaders were able to amass a clan territory larger than that ruled by the Hutts in the short span of a decade. During this period of aggressive expansion, the Neo-Crusaders conquered the planet Cathar in an operation headed by Cassus Fett. Though already defeated, Fett herded what remained of the Cathar species after the battle, out into the sea and—although he was opposed by the outcry of a single Mandalorian female—gave the order to kill them all, and the Mandalorian traitor with them, as retribution for the Cathar's actions against the Mandalorians in the past. In the end, the Mandalorians had wiped out over ninety percent of the species. As the Republic refused to get involved in the Mandalorians' conquests, wary of being dragged into another war so soon after the last, the Mandalorians plundered resources from conquered worlds and stockpiled them in order to fuel the growing campaign. With each victory in this ongoing series of proxy wars and border skirmishes, the Mandalorian clans grew more powerful, conscripting conquered species into their ranks as they probed the Republic's military strength and resolve. Just as it appeared as though the Neo-Crusaders' appetite for conquest had been satisfied, with the Mandalorians having failed to conquer a populated system in over a year by 3964 BBY, the Mandalorians struck out in force against the Republic. Striking swiftly from their outpost on Dxun, Onderon quickly fell to the Mandalorians, and it wasn't long before the likes of Vanquo and Taris soon joined it. The victory on Suurja gained several Jedi prisoners that were taken to a research station on Flashpoint to be experimented on by Demagol. The Jedi would be freed, although Demagol managed to escape in the guise of the renegade Mandalorian known as Rohlan Dyre, leaving Dyre behind for capture in his stead."}, {"tag": "p", "text": "On the planet Serroco, the Republic military made the mistake of placing its defensive fortifications within the cities of the native Stereb, believing that the Mandalorians would not attack their bases housed amidst a civilian population. Unfortunately, the Mandalorians soon dissuades them of this notion; disgusted by what he deemed a \"defense without honor\", Mandalore the Ultimate ordered a full-scale bombardment with nuclear weapons, destroying twenty-seven population centers. Neither Duro or Eres III would fare much better in the face of the continuing Mandalorian onslaught. Lord Arkoh Adasca of Arkania and the head of Adascorp, offered to sell a devastating bioweapon to the Mandalorians in the form of the enormous exogorths, under the agreement that the Mandalorians would spare Arkania from their crusade and adopt Adascorp as their main weapon supplier. Before the Mand'alor could arrange the deal, the exogorths were drawn out to Wild Space by Gorman Vandrayk, where neither the Mandalorians nor the Republic would be able to use them. Setting their sights on Alderaan as the target of their next conquest, the Mandalorians amassed their forces on the recently conquered planet of Jebble. At the same time, Demagol's former assistant, Pulsipher, had come into possession of the ancient Sith amulet known as the Muur Talisman. With it, Pulsipher unknowingly unleashed the Rakghoul plague across their base, transforming Neo-Crusaders into the beastly Rakghouls. In order to prevent the spread of the plague to other worlds, Cassus Fett ordered the base on Jebble to be destroyed, ordering a nuclear bombardment not unlike that which occurred on Serroco."}, {"tag": "p", "text": "The Mandalorians seemed on the verge of victory, with the Republic outmatched and overwhelmed by the sheer ferocity of the Mandalorian tactics. Finally, when the Jedi Revanchists unveiled the true events of the Cathar genocide in a tragic vision, hundreds of Jedi followed the Knights Revan and Malak into the war against the Mandalorians, no longer able to stand back and watch without action. Revan proved to be an extremely capable commander in the field, masterminding a string of military victories, and rose swiftly through the ranks of the Republic Military; with his new-found authority to spearhead the Republic war effort, Revan spurred the all-but-defeated Republic Navy to push the Mandalorians back. In relatively short order, the Mandalorians were forced off of Taris, driven from Dxun—even Cassus Fett's victory at Jaga's Cluster could do little to halt the Republic's growing momentum. The year 3960 BBY would usher in the ultimate battle of the Mandalorian Wars, as Revan forced a confrontation with the Mandalorians in orbit over Malachor V. Drawing upon the dark side energies of Malachor, Revan faced off against Mandalore the Ultimate in single combat, slaying the Mand'alor. The experimental superweapon known as the Mass Shadow Generator was activated by one of Revan's Jedi Generals, destroying the Mandalorian fleet, but at the cost of a significant amount of the Republic fleet as well. With their fleet in ruins and their leader dead, the Mandalorians transmitted their unconditional surrender."}, {"tag": "h3", "text": "The Dark Wars"}, {"tag": "p", "text": "Following their defeat at the end of the Mandalorian Wars, Revan stripped the Mandalorians of their armor and destroyed their stockpiles of weaponry, along with the war droids they'd ridden into battle upon. He also took the mask of Mand'alor, the relic that had been passed from one Mand'alor to the next and without it, a new leader could not be declared. With no Mand'alor, the Mandalorian clans fragmented and scattered throughout the Outer Rim. Beaten and embittered, many of the scattered Mandalorians took up professions as bounty hunters and mercenaries in order to make a living. Known informally as Mandalorian Mercs, these Mandalorians sold their skills to the highest bidder with morality a distant second-thought to credits. Some, like Gorse Bendak, became gladiators on worlds such as Taris, and Geonosis. Worse still, others became pirates and bandits, troubling settlers on worlds such as Dantooine."}, {"tag": "p", "text": "But far too soon after the last, the galaxy found itself entangled in another war, one featuring Revan's return to the galactic scene as a newly-turned Sith Lord, with his apprentice, Darth Malak, at his side. The rechristened \"Darth Revan\" turned the galaxy on itself in his attempt to claim the power of the Rakatan artifact known as the Star Forge. Revan would be captured by the Jedi, however, and his memories of his days as a Sith erased. It was during the travels of this redeemed Revan, that he met the Mandalorian warrior by the name of Canderous Ordo. Ordo was a former Mandalorian Crusader who had survived the Great Sith War, joined the Neo-Crusader ranks as a battle tactician, and went on to become a mercenary following the end of the Mandalorian Wars. Tired of his mercenary life on Taris, Ordo traveled with Revan on his mission to stop Darth Malak and his Sith Empire, seeking greater battle worthy of his skill. During their travels, Ordo came upon Sherruk and his group, Mandalorian warriors who had descended into a lowly bandit, harassing settlers on Dantooine; Sherruk and his companions would fall to Revan's blade, though not without putting up a substantial fight. They would also come upon Mandalorian poachers on Kashyyyk, preying on Wookiees in the region known as the Shadowlands, and a small Mandalorian contingent on Lehon. Revan would go on to succeed in stopping Darth Malak, destroying the Star Forge and ending the war in the process. But afterward, Revan would disappear from the galaxy, seeking out the \"True Sith\" that he believed lurked in the Unknown Regions. Before he did, though, Revan—his memories of who he was and had been, returned—gave the mask of Mand'alor that he had claimed upon defeating Mandalore the Ultimate, to Ordo, with instructions to reunite the scattered Mandalorian clans. Revan also informed Ordo that it had been the Sith behind Mandalore the Ultimate's decision to go to war with the Republic."}, {"tag": "p", "text": "With the Mand'alor's mask now back in Mandalorian hands, Canderous Ordo became the new Mand'alor, taking the name \"Mandalore the Preserver\". During his quest to reunite the clans, Ordo came upon what may have been one of the last remaining Taung in the galaxy. This Taung, already dying when Ordo found him, claimed that Mandalore the Ultimate had usurped the title of Mand'alor with Sith assistance, and that he was the true heir of Mandalore the Indomitable. Before succumbing to death, this Taung warrior consigned his armor and clan to Ordo, asking that he carry on their traditions; Ordo wore the armor as his own and incorporated the mask of Mand'alor into the Taung's helmet. As Mand'alor, Ordo summoned the Mandalorians to the old Neo-Crusader outpost on Dxun, intent on rebuilding their forces there under the banner of Clan Ordo. However, not all would heed the Mand'alor's call: Esok, the leader of a Mandalorian clan living on Dantooine at the time, tried to overthrow Ordo with the intention of becoming Mand'alor himself, though he would fail to defeat Ordo and die at the Mand'alor's hand. Following the battle, the remainder of Esok's clan agreed to follow Ordo, joining the likes of such warriors as Kelborn, Bralor, and Xarga on Onderon's jungle moon. Ordo and his Mandalorians would host a former Jedi General of Revan's, known at this point as the Jedi Exile, when her ship was forced to land on Dxun after being attacked over Onderon. Ordo agreed to provide the Exile with transport to Onderon, and later allied with her in her battle against the Sith Triumvirate, in order to combat the threat they posed to his efforts to reunite the Mandalorians. The Mandalorians would enter the Onderon Civil War during the Second Battle of Onderon, siding with Queen Talia's forces and defeating the rogue general, Vaklu and his troops. They also took control of Freedon Nadd's tomb from the Sith presence sent by Darth Nihilus to back Vaklu's coup. The Mandalorians and Mand'alor Ordo would come to the Republic's aid again during the Battle of Telos IV, engaging the Sith fleet alongside Admiral Carth Onasi. The Mandalorians boarded Darth Nihilus' flagship, the Ravager, and Ordo fought the Sith Lord at the Jedi Exile's side. Once Nihilus was dead, the Mandalorians detonated proton charges they'd planted, destroying the ship."}, {"tag": "h3", "text": "The Great Galactic War"}, {"tag": "p", "text": "Despite Canderous Ordo's attempts to unite the scattered clans during his time as Mand'alor, the Mandalorians would remain fragmented for nearly three centuries. Mandalore the Infernal who held the title prior before the conflict would request out designs for missiles that had involved thermounclear fusion. That would change in the year 3661 BBY, after the reconstituted Sith Empire made its return to the galaxy. In their war against the Republic, the Sith turned to the Mandalorians for aid, attempting to recruit the galaxy's most infamous mercenaries and bounty hunters to their cause. However, when most refused these offers, the Sith Empire decided upon a different course of action: on Geonosis, a successful young Mandalorian gladiator was chosen by Imperial Intelligence agents as a potential pawn. Working the crowds with whispers of \"Mandalore\" that grew into thunderous cheers, and drugging his opponents into submission, the Empire ensured that their chosen warrior would win every bout until the title of Mand'alor was thrust upon him. When the new Mand'alor called, many of the Mandalorians living in diaspora rallied to him as their culture's tenets dictated, following him in his fight against the knights of the Jedi Order. But even as the Mandalorians gathered to serve their new leader, their leader still served the Sith Empire and it was under their orders that he led a Mandalorian blockade of the Hydian Way. The Hydian Way was a major supply lane for the Republic, and blockaded, the Republic lost its ability to provide military support to its forces in the Outer Rim and to bring in raw goods to the Core Worlds. The Jedi answered the Mandalorians' challenge, striking back at the blockade, but the Mandalorian cruisers overwhelmingly crushed the Jedi forces and would continue to choke the Republic until a large undertaking of smugglers led by Hylo Visz managed to finally break the blockade and deliver goods to Coruscant."}, {"tag": "p", "text": "With the blockade broken, the new Mand'alor—later known pejoratively as \"Mandalore the Lesser\"—sought to restore his support among the clans by calling for a galaxy-spanning competition for glory known as the Great Hunt. The champion of the Hunt, a Mandalorian warrior by the name of Artus, challenge the Mand'alor to a duel where he shot and killed the Imperial puppet. Taking his place as Mand'alor, Artus adopted the title of \"Mandalore the Vindicated\". In the process of consolidating his new power, Mand'alor quelled an uprising by a group of Mandalorians led by Jicoln Cadera, who believed that the Mandalorians should follow in the footsteps of Mandalore the Preserver, supporting the Republic rather than the Sith Empire. Under Mandalore the Vindicated, the Mandalorians would continue to be the well-paid, but cautious allies of the Sith."}, {"tag": "h3", "text": "Cold War and the Galactic War"}, {"tag": "p", "text": "Despite the standing Alliance however, this did not stop some Mandalorians or even whole Clans from fighting against the Sith Empire during the Cold War to even during the Galactic War."}, {"tag": "p", "text": "The violent Mandalorian clan known as Clan Varad would break off from Mandalore the Vindicated's leadership, declaring Akaan'gaan-the search for battle, they would steal the prototype Allusis from the Republic Fonder shipyards. They began attacking both Republic and Sith worlds, demanding tribute from them as they continued to raid and loot as they pleased, but it wasn't until they were finally stopped by task forces from the Empire and the Republic when they assaulted the Allusis, besiging and fighting through Varad's clan warriors, Tech Commandos, Fire Commandos, Shield Commandos, and killing their champions such as Braxx the Bloodhound and his war-beasts, Battle Team Royal, and Gil. Up until at last they had faced Mavrix Varad himself, who had been waiting for them but eventually he was killed, he considered it a good death and that he would see the team in hell as he gave out his last breath before dying. The remaining members of Clan Varad would be captured and re-accepted into the other Clans lowest ranks for their dishonorable betrayal."}, {"tag": "p", "text": "Tarro Blood after being humiliated in the last Great Hunt, was determined to see that he would be the one victorious in the new Great Hunt. He would threw away everything that his mentor, the famed Great Hunt champion Hedarr Soongh, had taught him about honor and disregarded the notion of it in favor of sabotaging all of his rivals that stood in his way, bribing fellow Mandalorians with the promises of glory and wealth that lured members like Sedyn Kyne in following him with great loyalty as they saw Tarro as their way to fame, dishonoring everything that meant to be a Mandalorian. They would kill one of their rival's team on Nal Hutta that would prove to be their eventual downfall as the Hunter and his partner Mako would be determined to see Tarro Blood die for the murder of Braden and Jory, no matter how many times Tarro and his followers sought to sabotage their efforts throughout during the Great Hunt. Sedyn and Blood's followers would meet their end when they were lured into a trap on Nar Shaddaa by the Hunter and Mako with the assistance of Hedarr Soongh, who was now disgusted by the actions of his former students, he made Sedyn and the Hunter accept a Taung blood duel that would result in Sedyn and Rellu's deaths and the Hunter victorious. But Tarro's followers would refuse to honor the duel, the Mandalorian lieutenant made it clear that their pledge to Tarro Blood still stood and without warning he shot Hedarr in the chest, fatally wounding the elder Mandalorian who declared the followers as 'no Mandalorians'. The Hunter would kill them all and listened to Hedarr Soongh's final words as he told the Hunter that Tarro must not win the Great Hunt, wanting the Hunter to try keep the Resol'nare  and the Mandalorian code alive amongst the Mandalorians or else Tarro's example would led to more of them falling down out of path of honor, he gave the Hunter parting words before dying. Tarro Blood would be the first to reach the final target, Kellian Jarro who was credited for killing over one-hundred battle-hardened Mandalorian commandos during the Sacking of Coruscant, Tarro was quickly subdued by a mind trick and held for questioning where he would claim the Hunter was his accompse in the hopes of at least ensuring his rival would be dead, it would prove unsuccessful when the Hunter got aboard on the Aurora, coming face to face with Tarro with only a forcefield to separate them. He would goat the Hunter into releasing him so that they may have their final confrontation but Mako would state that Tarro doesn't deserve a warrior's death and that they should just leave him to die in his cell. In either case, Tarro Blood would meet his end as the Aurora would fall apart, the Hunter successful in killing Kellian Jarro and he would return to Dromunad Kass to be crowned as the new Great Hunt champion and even later being adopted into Mandalore's Clan Lok."}, {"tag": "p", "text": "The Terror Brigade, a group of former Mandalorian thrill seekers, would go on to capture Imperial Moff Yoren and offered him to the Republic if they could survive a series of challenges. They would be successful, even besting their Force-sensitive/Legends member Geden, leaving the Fight Master greatly impressed by their performance, fulfilling their word as Yoren was taken away by them."}, {"tag": "p", "text": "A group of Mandalorian mercenaries would set up camp on Arkanis, thus someone was hired to investigate what their intentions were on the world."}, {"tag": "p", "text": "A Mandalorian warlord known as Varek Tarn stole plans for the Sovereign Forge and attempted sell them to the Republic, but was killed by Imperials before he could. His actions would be copied by fellow Mandalorian warlord Rimark when he tried to steal the construction plans for the Void Anvil to sell them to the Empire but alike to Varek, Rimark was tracked and killed in the Thanium sector."}, {"tag": "p", "text": "During the Cold War, Mandalorian armor and weapons found their way to the hands of Outer Rim pirates, resulting in someone being hired to investigate where they had gained the armor and weapons from."}, {"tag": "p", "text": "Mandalorian mercenaries would be heavily involved in the Empire's attempts to stop the Taris Resettlement Initiative and the Battle of Balmorra during the Cold War. Commander Vorten Fett commanded thousands of Mandalorian mercenaries contracted by the Empire to help eliminate threats such as the Cathar settlers and the Nikto, including even the feared Morgukai warriors, but General Farvin would discredit their efforts as sloppy and believing them to have no respect for a 'clean victory'. The Mandalorian Raider known as Duran Gorr would lead his band of Mandalorian raiders in stealing a shipment of Republic warheads but he and his forces would be killed by the Republic taskforce that came looking for the warheads. Jicoln Cadera continued to remain alive on Taris during the Cold War until he's son, Torian Cadera, would attempt hunt him down to restore Clan Cadera's honor, being assisted by the Great Hunt champion, as a result Jicoln would issue them the Geroya be Haran challenge and the two would track his achievements across Taris, Jicoln always being a step ahead of them until at last the two were able to finally confront and defeat him in combat but he would request a final word with his son, after which the Hunter would take his body to Mand'alor and Torian Cadera learning more of the truth of his father's reasons in starting the Crusader's schism, his honor restored. Jekiah Ordo would gain recognition during a series of operations he conducted on Balmorra, fighting to re-establish Mandalore the Preserver's legacy but was only successful in removing the stigma for himself and his two younger siblings, though fellow clanmate Corridan Ordo is a respected alor'ad within the Mandalorian community."}, {"tag": "p", "text": "A Mandalorian slaver named Monta Drai who was a prominent mercenary for the Empire, had used his side business in slavery to conduct work for the Empire by capturing Balmorran villagers and preparing them to be sold into slavery, however though Ambassador Alya Selray was able to hire and task a Republic spacer into rescuing the villagers, storming into the Mandalorian bunker and fighting through their mercenaries, overseers, battle droids, until at last confronting Monta Drai himself. He would be killed by the spacer and the villagers being freed."}, {"tag": "p", "text": "Elsewhere, the Mandalorian mercenaries were hired by the Empire in stumping out the Balmorran resistance, their units capturing the resistance's sensor arrays for their communications and successfully defended off their attempts in recapturing and repairing the arrays. It would not be until arriving Republic assistance that the Mandalorians were driven off from the arrays, but their forces still maintaining a presence within the territory."}, {"tag": "p", "text": "Mandalorians would gain a large presence on the desert world of Tatooine with several Clans dotting across its territories. The Clan of Outpost Rennar would maintain a tensed alliance with the Empire but one that continued to be tested and pushed by the Imperials, the Clan was also in constant conflict with the Tusken Raider tribes, some of their recruits/untested warriors getting killed by them while trying to pass their trials or challenges, reaching to the point when the fearsome chieftain Bloodgouge began marshaling his people to attack and destroy Outpost Rennar but he would be killed by a Imperial team before he could. Elsewhere a Unidentified Mandalorian leader of a group had planned a preemptive attack on the Republic Outpost Thorazan but were stopped by an Republic team hired by Security Chief Barret. But not every Mandalorian bowed or was willing to work with the Empire, a Local warlord took heavy offense to the Imperial troops moving through into his terrority, he turned his cannons on their forces and would have Mandalorian troops guard the emplacements, one team of mercenaries hired by Commander Vames would fail in destroying the emplacements but the next team would be successful in marking them for bombardment and they were destroyed. A famed War-Master named Rhigoth who was famous for hunting Trandoshans, rancors, and even Jedi, would act dishonorably by having his Mandalorian mercenaries/raiders shake down merchants in Anchorhead, cripping three security officers when local magistrate name Ledo Melnic had tried to have them run out of town, but he would hire outside help to storm their bunker and Rhigoth would be killed by them."}, {"tag": "p", "text": "The Zabrak Mandalorian warrior Akaavi Spar fought alongside the Republic privateer known as the Voidhound after her entire clan was framed by the Mandalorian pretender Tayari Rook, in the hopes of gaining a favorable contract with the Empire. He slandered their name by claiming that they had failed a contract in destroying a cargo ship full of Jedi Padawans. The Empire would gas Clan Spar in order to avoid a bloody battle and have them captured as they lay unconscious, Clan Spar would be executed following afterwards. Akaavi Spar was devastated by the loss of her family and had tried to rally her husband's Clan to support hers, but they refused. Disgusted by them Akaavi, left them and her husband behind and traveled throughout in the galaxy for the next 5 years, becoming an outcast from the Mandalorians, though she still continued to follow the Resol'nare proudly. She would have her vengeance for the death of her clan when she tracked down those responsible for framing them. Clan Rook, who were made up of slavers and pirates, were not true Mandalorians and were only using the reputation for profit, killing or dishonoring any that would try to expose them. Even worse, Clan Lone, who were dishonored by the Mandalorian community for not aiding Clan Spar, would join the ranks of Clan Rook. But Akaavi Spar would learn of their location and assaulted their encampment, any that didn't escape were killed along with their leader Tayari but not before he confessed his crimes to Akaavi. Their destruction brought her some comfort and she would find peace being a part of the Voidhound's crew."}, {"tag": "p", "text": "Around this time, an unidentified Mandalorian invited scientists from across the galaxy to study the bones of several mythosaurs in the hopes of repopulating the extinct species."}, {"tag": "p", "text": "On Nar Shaddaa, the multiple-species Mandalorian clan Sharratt were testing a new Imperial combat adrenal and would issue a challenge to the Galactic Republic's embassy, if their defenders could not defeat or face them, they would destroy Republic property at randomly. They would be defeated however, their leader Kassor Quade killed and theenclave destroyed."}, {"tag": "p", "text": "The Mandalorians in their stronghold of Geonosis would grow anxious to face new challenges that they would hired out anyone that could bring them dangerous beasts to satisfy their hunger for challenge in the gladiator arenas and their fighting pits."}, {"tag": "p", "text": "Ceta Farr would lead Clan Farr as a part of the secretive Order of Revan, wanting to honor and preserve Revan's legacy out of respect for being able to defeat her ancestors during the Mandalorian Wars."}, {"tag": "p", "text": "During the Galactic War, the Mandalorians would be hired by the Sith Empire to help in the Battle of Corellia, largely fighting in Axial Park or handling the hunting of Jedi. A elite squad of Mandalorian Rocket troops would halt Republic efforts in Axial Park, their jetpacks allowing them to be one step ahead of the REpublic soldiers and causing a morale drop for the garrison after capturing and shutting off the Republic memorial statues dedicated to Revan and the Ebon Hawk crew during the Jedi Civil War, they would eventually be driven off however and the memorial statues being turned back on. Mandalorians also fought in the Blastfield Shipyards, a group of them captured the Rusty Freighter Cantina to corner the Nautolan Jedi Bengel Morr, but were unsuccessful and were defeated. The Mandalorians efforts in the Battle would end up proving all for nothing when the Republic would win the Battle and the Empire driven off of Corellia."}, {"tag": "p", "text": "The Mandalorian known as Jindo Krey was among the first to join Darth Malgus's New Sith Empire with his own army of Mandalorian followers, fighting against both the Republic and Sith Empire during the Battle of Ilum."}, {"tag": "p", "text": "A Mandalorian Kingpin/mercenary known as Kreegan Ramar would begin terrorizing on Tatooine, him and his followers constantly raiding the Jawa Meerko Clan, dishonoring the Mandalorian reputation. Resulting in Meerko would hire the Bounty Brokers Association to send someone to kill the renegade Mandalorian. Kreegan Ramar would send the hired help a message, questioning their intent and reasoning in helping Meerko, promising to pay the Jawa's Clan a visit after dealing with the spacer."}, {"tag": "p", "text": "A famed Mandalorian warrior would seek help in identifying a masked opponent he had fought to a draw on the planet Circarpous V, in the hopes of facing this unidentified opponent once again."}, {"tag": "h3", "text": "Revolt against the Eternal Empire"}, {"tag": "p", "text": "During the Eternal Empire conquest, the Mandalorians would meet them head on, refusing back down against the invaders. However despite the good fighting they gave, they ultimately find themselves on the defense. Mand'alor the Vindicated himself had been killed when clan members of Lok saw him being swarmed by skytroopers. Because of this event, more grudges were formed against droids than ever before, going far that it became somewhat dishonorable be beaten by a droid."}, {"tag": "p", "text": "While the Mandalorian veteran, Khomo Fett, was placed as a possible choice to become new Mand'alor, he had refused, preferring fight battles then planning them. It would be the legendary Mandalorian bounty hunter, Shae Vizla who would take the title. Despite not having much experience leading people besides a clan, much less a culture. Shae had proven be the leader that Mandalorians had needed for times of war, her introductory battle as Mandalore the Avenger was the clans' first victory in six months in the war."}, {"tag": "p", "text": "The young Mandalorian warrior Torian Cadera, would finally now have chance prove himself to his fellow Mandalorians in new war. After the Grand Hunt Champion had disappeared, Torian would return to his people when Mandalore had called, though he had to leave his partner Mako on Carratos. Torian would volunteered for the most dangerous strikes against the Eternal Fleet, leading very successful infiltration and surveillance missions. Because of his skill and loyalty to his people, Torian would become new clan chieftain of Cadera and become Mandalore's right hand man with Khomo Fett. Mako would then go on to partner up with the Mandalorian outcast Akaavi Spar, becoming a skilled bounty hunter team."}, {"tag": "p", "text": "When in need of an army to help take GEMINI Prime, Theron Shan had contact the new Mand'alor and offered her a chance of payback against the Eternal Throne and the spoils of Zakuul droid factory on Darvannis. Mandalore the Avenger accepted and brought her loyal clans to Darvannis, where she would fight alongside the Outlander. While the former Sith Intelligence Minister Lana Beniko would share her concerns regarding the Mandalorians rearming themselves and did suggested to the Outlander to make sure they would suffer heavy loses, but Lana as a Sith, was thinking more in lines of how Sith Empire preferred to control their people, something she displayed by allowing Theron be captured by the Order of Revan on Rishi."}, {"tag": "p", "text": "In any case, the raid proved to be successful and the clans were now ready for war against the Eternal Empire. To ensure Mandalorian interests, Mandalore the Avenger granted Torian's request to join the Eternal Alliance, Outlander accepted this after seeing his courage and skill in battle."}, {"tag": "p", "text": "Mandalore the Avenger would eventually join the Alliance and the Mandalorian Clans loyal to her would followed her in as well, assisting the Alliance in battles against the Eternal Empire, including Empress Vaylin's Invasion of Voss where Vaylin had planned to kill her brother and mother who were hiding on the world. Mandalorian warriors lead by Torian Cadera assisted the Outlander and Lana Beniko against Skytroopers and Zakuul Knights on the ground."}, {"tag": "h3", "text": "The Third Galactic War"}, {"tag": "p", "text": "After the war was finally over, Mandalore continue to assist the Alliance in the rebuilding of the galaxy, leading the clans to ironically work alongside the former enemy of the Mandalorians, Hylo Visz, who had broken their blockade decades prior. Together, they helped secure supply runs from pirates or others greedy enough during the resource crisis that began to grip the galaxy. However, during this time, with the Republic and Empire now embroiled in the Third Galactic War, Shae Vizla would encounter challenges to her leadership. Before the raid on Darvannis, surviving members of Clan Lok and other like-minded Mandalorians chose to abandon the Avenger's leadership. Led by Mirli Lok, they traveled to Onderon and formed the Ash'ad, hunting for honor and glory, while ensuring an agreement with the current King of Onderon, Regalun Petryph. However, Mand'alor would soon discover their location. Setting up her people in the city of Iziz, Shae Vizla would task the Outlander into seeking them out and stripping of their armor to finally clean this stain on the honor of the previous Mand'alor."}, {"tag": "p", "text": "Elsewhere, on the mining station of Mek-Sha, a group of ex-Mandalorians going by the branded title Dar'manda, led by the mysterious yet ruthless Indigo, established themselves with a feared reputation on the rest of the station. Unlike the Ash'ad, who still identified themselves as Mandalorians despite breaking one of the Resol'nare tenets, the Dar'manda disconnect themselves entirely from the culture, wearing their Mandalorian armor in mocking pride. Their reasons for their exile are unknown, but no matter the cause, it still warranted strong dislike from Mandalorians such as Torian Cadera, Mand'alor herself, and even that of Akaavi Spar, despite herself being an outcast after her clan was destroyed by Clan Rook and turning against the Sith Empire."}, {"tag": "p", "text": "But what would stand out would be Mand'alor's actions during the Meridian Complex assault, which would signify where her people would stand in this new conflict."}, {"tag": "p", "text": "A new Mandalorian Civil War would break out when the Dar'manda, Clan Varad, and the Ash'ad would band together within the hidden group known as the Hidden Chain under the leadership of Field Marshal Heta Kol who had came under the belief that the Mandalorians had lose sight of their honor and culture under Mandalore the Avenger's rule who continued to help the Alliance's efforts in stabilizing the galaxy. They would attack Mandalorian cargo ships that would begin to draw Shae's attention and that of her advizor Jekiah Ordo, not revealing themselves until they raided the Spirit of Vengeance II to steal priceless artifacts."}, {"tag": "p", "text": "The attack was repelled however when Mand'alor with the assistance of the Outlander and Rass Ordo stormed the Hidden Chain's ships, Varad's Champion's Glory, the Dar'manda's Fortune's Folly, and the Ash'ad's Seeker's Vigil until they had last freed the Spirit of Vengeance from their ADH but the Hidden Chain had still accomplished what they had came for, Clan Cadera's banner, Heta Kol retreated soon after and later held a meeting between the Mandalorian outcast factions where she displayed her full commitment to her cause that reminded everyone of their place."}, {"tag": "p", "text": "Jekiah Ordo would be named as Arbiter by Mandalore the Avenger and the Clans still loyal to the reigning Mand'alor would prepare themselves for war. Shae Vizla would end up descending on Mek-Sha and wipe out half the Dar'manda on the station, before she would come under negolations with the leader Indigo, learning more upon that he had known nothing about Bask's involvement with the Hidden Chain, coming to an agreement for his survival and though Shae referring him as a 'grumbingly mynock', she left with the knowledge that she had needed."}, {"tag": "h3", "text": "The New Sith Wars"}, {"tag": "p", "text": "During the New Sith Wars, the Mandalorians would break from what many perceived to be a long-standing alliance, and waged war against the Sith. During the first quarter of the New Sith Wars, one group of Mandalorians was approached by Jedi Master Murrtaggh. Murrtaggh offered a large amount of credits in order to enlist the Mandalorians' help in assaulting the camp of the mysterious Dark Lord of the Sith known as the Dark Underlord. The Mandalorians attacked the Sith camp on Malrev IV with a force of Lagartoz War Dragons, and numerous soldiers equipped with Mandalorian battle harnesses. The Mandalorians would draw the forces of the Dark Underlord's general, allowing Master Murrtaggh to infiltrate the Underlord's fortress where he slew the Sith Lord in combat, but fell to the dark side in the process."}, {"tag": "p", "text": "At another point during or prior to the New Sith Wars, the Mandalorian training master, Jaing—a former Neo-Crusader Shock Trooper from the Mandalorian Wars—found a young Gen'Dai by the name of Durge. Jaing took Durge into his care, becoming a mentor to the Gen'Dai and teaching him the ways of the Mandalorians. Sometime later, after Jaing had abandoned the Mandalorians due to what he felt was a lack of honor, Jaing and Durge came into contact with a cyberneticist who offered to implant the two with advanced cybernetics, restoring Jaing's youthful strength and speed, while simply increasing Durge's own incredible physical capabilities. The operation was a success for each, turning the two warriors into powerful cyborgs, and in return for this upgrade, the doctor who had performed the surgery asked only one thing in return: protection from the Mandalorians loyal to Mand'alor Ung Kusp, Mandalorians in the employ of a Sith faction seeking to re-obtain the Sith artifact the doctor had stolen from them. These Mandalorians attacked the doctor's laboratory moments later, during which the doctor's assistant was killed, and Jaing mortally wounded by a thermal detonator. Before the Mandalorian leading the assault could finish Jaing, Durge brutally massacred the Mandalorians responsible for nearly killing his mentor, even going after the Mandalorians once they retreated. As Jaing lay dying, the doctor revealed to him that together they had set the stage for a war between the Mandalorians and the Sith."}, {"tag": "p", "text": "During the tail end of the New Sith Wars, the Mandalorian people were in disarray. By 1058 BBY, the Candorian Plague had ravaged their population, and their ships had to form caravans to defend themselves from raiders dwelling in neighboring sectors. Upon seeing the state of his people, Aga Awaud, a mercenary, claimed the title of Mandalore the Uniter and began a movement called the Return, urging Mandalorian diaspora across the galaxy to return to their homeworld. Under his rule, Mandalorian space thrived, emerging as a regional power in the Outer Rim."}, {"tag": "h3", "text": "Cultural shift"}, {"tag": "p", "text": "In 738 BBY, following a significant growth in Mandalorian militancy that alarmed the Republic and its Jedi protectors, a brief and targeted conflict broke out between the Republic and the Mandalorians that brought devastation to the Mandalore sector despite the Mandalorians involvement in defending the galaxy against both Eternal Empire and the New Sith. Portions of the planet Mandalore were reduced to barren white-sand deserts. While many of the warrior clans scattered, out of the ashes rose the New Mandalorian faction. Doing away with many of the old warrior codes the Mandalorians had historically followed, the New Mandalorians put forward the idea that the best opportunity for Mandalorian survival and prosperity would come through being peaceful, neutral, and tolerant. Clinging strongly to this belief in pacifism, nonviolence became a central tenet in their society. The New Mandalorians constructed grand cube cities in the desert wastes, using their talents as inventors and builders. Upon instituting these changes, any of the Mandalorians in their society who refused the reform and insisted upon carrying on their warrior ways, were banished to Mandalore's moon, Concordia. Traditional Mandalorian armor became a rare sight in the New Mandalorian capital city of Sundari, and on the neighboring world of Kalevala, known to be a stronghold for the New Mandalorians."}, {"tag": "p", "text": "Although a large number of Mandalorians joined in the New Mandalorian movement, other clans chose to continue on the path they'd walked for centuries. The ancient traditions survived in Mandalore's countryside, with the traditionalist Mandalorians calling themselves the Aka'liit (\"Faithful\" in Mando'a). The title of Mand'alor subsequently passed to members of the Aka'liit. Approximately 200 BBY, the Mandalorian Faithful were responsible for the genocide of the Ithullan race. Almost a hundred years later, the reigning Mand'alor of the time was murdered by the Gen'Dai bounty hunter, Durge, in his ongoing quest of vengeance against the Mandalorians for the death of his mentor, Jaing. In retaliation, the Mandalorians captured and tortured Durge to the edge of insanity; the bounty hunter managed to escape his Mandalorian captors, but it would take him the better part of a century to regenerate from his wounds. At some point in this era, Ranah Teh Naast became Mand'alor, known by the sobriquet of \"Mandalore the Destroyer\". She led a siege of Luon, giving the Consul of Luon a final chance to surrender before attacking. It was also likely around this time that a group of Mandalorians killed the family of a Wookiee by the name of Ryyk."}, {"tag": "p", "text": "In the year 60 BBY, a charismatic Mandalorian warrior by the name of Jaster Mereel ascended to the position of Mand'alor. In this role, he began to institute a cultural reform that many had been calling for since the Ithullan genocide nearly a century and a half earlier, eventually laying out a new guideline for Mandalorian behavior known as the Supercommando Codex. He asserted that the Mandalorians who still wished to fight should act as highly-paid soldiers, and should conduct themselves as honorable mercenaries. However, not all would agree with the Codex or Mereel's reforms. He was opposed by the followers of the barbaric Tor Vizsla, who desired a return to brutal savagery and the instigation of another galactic war of conquest. Skilled but undisciplined, these soldiers rallied to Vizsla and formed a splinter group that came to call itself the Death Watch, while those supercommandos who remained loyal to Mereel recast themselves as the \"True Mandalorians\". While Death Watch's goals were quite opposite to those of the New Mandalorians', they could not support Mereel's faction either, for despite his reforms, any act of Mandalorian violence was fundamentally against what the New Mandalorians stood for. While they remained neutral and removed from the conflict, the Aka'liit schismed and the True Mandalorians and the Death Watch became embroiled in a bitter civil war."}, {"tag": "h3", "text": "The Mandalorian Civil War"}, {"tag": "p", "text": "The Mandalorian Civil War, as it came to be known, swallowed up Mandalore's full-time army and several prominent clans, but the two factions were relatively small in comparison to the overall Mandalorian population. Mandalorians living away from Mandalore were scarcely affected, even those in the Mandalore sector. However, the ideological differences between Tor Vizsla and Jaster Mereel were central to the war and the path the Mandalorians would take for the foreseeable future. In the year 58 BBY, the Mandalorian Civil War spilled onto the agricultural world of Concord Dawn. During the fighting, Jaster Mereel and his soldiers were forced to retreat and seek refuge from the Death Watch on the farm of a local Journeyman Protector by the name of Fett. When the Death Watch found out Fett had been hiding their enemies, Vizsla brutally interrogated the man in front of his young son, Jango. Before Vizsla could kill the farmer, who refused to give up Mereel and his men, Fett's wife opened fire on the Death Watch with a blaster rifle. In the resulting chaos, both Fett and his wife were killed, although Mereel managed to rescue young Jango from the Death Watch. As the True Mandalorians fled into the fields, Vizsla ordered that they be burned to the ground in attempt to kill Mereel as he ran. Jango showed the Mandalorians to a large irrigation pipe that allowed them to escape the blaze, while Vizsla and his men ransacked Fett's home and kidnapped Jango's sister, Arla. Believing their enemies dead, the Death Watch moved into a nearby town for a celebratory raid before moving on to their next target. Unfortunately for them, the True Mandalorians had regrouped in the town and sprang an ambush on the unsuspecting Death Watch. Striking from protected alleyways and second-story windows, the True Mandalorians struck down nearly every Death Watch soldier there. However, Vizsla would manage to survive an attack on his armored speeder and escape Concord Dawn. His parents dead, Jango Fett was taken in by Jaster Mereel, joining the Mandalorians as Mereel's adopted son."}, {"tag": "p", "text": "Six years later, in 52 BBY, the True Mandalorians believed the threat of the Death Watch to be over and returned their focus to acting as a mercenary army. Contracted by the Korda Defense Force, the True Mandalorians journeyed to Korda Six to extract a team of rookie security personnel pinned down under fire by a group of local hostiles, supposedly poorly armed and with no formal army. Unfortunately, the intelligence reports were grossly inaccurate: when the Mandalorians landed, they came under heavy fire from the Kordan natives and in the resulting battle, took heavy casualties. Jaster Mereel ordered a retreat, but his second-in-command, Montross, refused and insisted they press on. When he was injured in a grenade strike, it was up to Mereel to provide rescue, killing no less than three enemy Kordan in the process. At the same time, Jango had used Montross' ill-guided attack as a diversion in order to move on the location of their original objective, the Kordan security team. But when he and his squad reached the site, they instead found a Death Watch ambush awaiting them. As Jango's troops fought back the Death Watch, Mereel and Montross came under attack from Vizsla himself. Mereel was wounded in a grenade blast that Montross used his jetpack to avoid, but when the injured Mand'alor called to him for an air lift, Montross turned his back on Mereel and left him to die on the battlefield, stating that he no longer wished to take orders from Mereel. Betrayed and abandoned, Mereel was helpless to defend himself and perished as Vizsla rained down laser cannon fire from his four-wheeled tank, killing his hated rival. At the Mandalorians' landing zone, Montross now urged the Mandalorians to heed Mereel's final orders and pull out, claiming that Mereel was dead and that Jango had perished trying to save him. However, Fett returned to the landing zone carrying with him Mereel's body, exposing Montross as a liar and a traitor. When Montross insisted that Mereel would have wanted him to take command, the other Mandalorians denounced Montross at blaster point and declared that they would only follow Fett, Jaster Mereel's chosen heir. Montross was grudgingly allowed to leave, slipping off into exile, while Jango became the new Mand'alor and leader of the True Mandalorians."}, {"tag": "p", "text": "Under Fett's leadership, the True Mandalorians scored a significant victory against the Death Watch in the years leading up to 44 BBY, that left the Death Watch severely crippled. But rather than concede defeat, Vizsla turned to the Governor of Galidraan for refuge and his assistance in rebuilding the Death Watch. As per Vizsla's plan, the governor contracted the True Mandalorians to put down a local insurrection. The True Mandalorians traveled to Galidraan where they dealt with the rebels, and upon completion of their task, Fett went to the governor's estate to collect their payment; by that time, however, the governor had already contacted the Jedi Council with a request for aid, claiming that the Mandalorians were murdering \"political activists\" along with innocent women and children. In response to the governor's concerns over the lack of evidence, Vizsla assured him that his own men would supply the necessary body count. Fett had become aware of the governor's involvement with the Death Watch and while there, demanded to know the whereabouts of Vizsla. At that moment, Vizsla revealed himself there in the castle and attacked Fett with a cadre of Death Watch soldiers, forcing him to flee. Fett rushed to make it back to base camp, trying unsuccessfully to comm his second-in-command, Myles, and warn him of the inbound Jedi ships he'd spotted, but he arrived at the same time as a Jedi strike team lead by Jedi Master Dooku. Demanding that the Mandalorians stand down on charges of suspected murder, the innocent Mandalorians indignantly opened fire on the Jedi. In the ensuing shootout, eleven Jedi were killed—six of which were felled by Fett himself, following the death of Myles—along with every other True Mandalorian there, save for Fett himself."}, {"tag": "p", "text": "In the battle's aftermath, the Jedi delivered the subdued Fett into the custody of Galidraan's governor, who in turn sold Fett into slavery. Though it seemed the Death Watch had won the war—successfully manipulating the Jedi into destroying their enemy for them—after several years spent aboard a spice transport in bound servitude, Fett managed to escape, recover his armor from the Governor of Galidraan, and track Vizsla's ship to Corellia where he killed Vizsla after a lengthy fight, avenging the True Mandalorians and dealing the final blow of the war. The remaining Death Watch members scattered, vanishing from the galaxy at large under the Mandalorian principle of ba'slan shev'la, or \"strategic disappearance\". Fett, scarred by the loss of his True Mandalorian compatriots and his years as a slave, grew distant from the rest of his people and his role as Mand'alor, turning instead toward the solitary life of a bounty hunter. As such, Mandalore's post-war reconstruction fell largely upon the New Mandalorian government, now under the leadership of Kalevala native, Duchess Satine Kryze. The Mandalorians who chose to retain their traditional lifestyles, but also rejected the Death Watch's ideals came to be known as Old Mandalorians. Some of the Old Mandalorians chose to leave the Mandalore sector to Vlemoth Port, under leadership of Nam Beroya."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "The Grand Army of the Republic"}, {"tag": "p", "text": "In 32 BBY, Jango Fett was recruited by Darth Tyranus—in truth the former Jedi Master Dooku, now a Count of his homeworld of Serenno and a Sith Lord—to be the genetic template for an army of clones being grown on Kamino for the Republic. In addition to donating his genetic material, Fett would stay on with the Kaminoans as a military consultant for the Grand Army of the Republic, passing on many aspects of the Mandalorian culture to his clones; he assisted in the design of the armor worn by the clone troopers, evident in the similarities between their armor and Fett's own, including the distinctive T-visor of their helmets. Fett also helped to create the flash training regimen used to instruct all of the young clones, including in it the traditional Mandalorian song Vode An as a useful tool to help instill within them a sense of purpose, modifying it slightly in order to give it meaning for soldiers serving the Republic. While Fett trained the Alpha-class ARC troopers personally, he recruited a team of one hundred other training sergeants collectively known as the Cuy'val Dar—seventy-five of whom were other Mandalorians—to train the Grand Army's clone commandos. These Mandalorian sergeants, including the likes of Walon Vau, Kal Skirata, and Rav Bralor, were responsible for a massive influx of Mandalorian culture into the clone ranks. Several clones took Mandalorian names for themselves, while others appropriated Mandalorian slang and curses. Others took to Mandalorian songs and chants, like the Dha Werda Verda, as morale boosters. Kal Skirata made a point of teaching his clones about their Mandalorian heritage, and even adopted the six Null ARC troopers and several commandos as his sons per Mandalorian custom. Some clones, however, did not take to their Mandalorian heritage and even came to resent it after Mandalore aligned itself with the Confederacy of Independent Systems and began fighting against the Republic and its clone army. In addition to those clones produced professionally for the Grand Army, Jango Fett had also commissioned a single clone for himself, possessing none of the genetic modification found in the standard clone troopers, who would act as his son and heir. Fett's son, Boba, would go on to have a major impact on Mandalorian history."}, {"tag": "p", "text": "Mandalorian influence within the Grand Army began to wane with the production of Supreme Chancellor Palpatine's second clone army. Created on Coruscant and it's moon, Centax-2, these troopers were bred using Spaarti cloning cylinders, reaching maturity within a year and received a shortened flash-training regime which resulted in the loss of their Mandalorian heritage and less proficiency in key areas such as marksmanship. Under the Galactic Empire, the clones' Mandalorian heritage was gradually phased out as future clones were grown from a variety of other genetic templates. However, following the Clone Wars' end, many clones deserted and fled to Mandalore, where Kal Skirata had set up a haven for clones who wished to leave Republic/Imperial service for a new life."}, {"tag": "h4", "text": "Mandalorian peace under fire"}, {"tag": "p", "text": "By 22 BBY, the Republic had come to accept the peaceful New Mandalorian government as the dominant Mandalorian faction, and Mandalore had been welcomed as a Republic member world, represented in the Senate by Senator Tal Merrik. Under the New Mandalorian government, many areas of Mandalore including the New Mandalorian capital of Sundari, had flourished, yet some more neglected provinces still remained destitute and starving for funds. When the Clone Wars had broken out between the Galactic Republic and the Confederacy of Independent Systems, the leader of the New Mandalorians, Duchess Satine Kryze, declared Mandalore neutral. Over a decade after the loss of their leader and their subsequent fragmentation at the end of the Mandalorian Civil War, it was into this environment that the Death Watch made a return to the galactic scene. Unlike the other clans who merely stood apart from the New Mandalorians, the Death Watch despised the peace-loving government the New Mandalorians had established, viewing it as weak, and Kryze as a disgrace to all Mandalorians for her pacifist views. They allied with Count Dooku—now leading the Confederacy of Independent Systems—to gain the means necessary to remove them from power. The Death Watch sent an operative to conduct an attack on a Republic cruiser, while spreading rumors that the New Mandalorians were secretly raising an army to fight for the Separatists. When these rumors reached Republic ears, the Jedi Council dispatched Jedi Master Obi-Wan Kenobi to Mandalore to investigate the validity of these claims. Landing in Sundari, Kenobi met with Duchess Kryze and the New Mandalorians' Prime Minister, Almec, to discuss Mandalore's stance in the war."}, {"tag": "p", "text": "Kenobi and Kryze were old friends, having met years earlier when Kenobi and his master had been sent to Mandalore in the months after the end of the Mandalorian Civil War, to protect the Duchess from lingering Death Watch insurgents and bounty hunters. During the course of his investigation, Kenobi bore witness to the Death Watch's bombing of the memorial shrine at the heart of Sundari. When he attempted to apprehend the culprit, the man chose to commit suicide by leaping from a balcony Kenobi had trapped him on. As he lay dying, Kryze stooped to comfort him and listened to his final words; spoken in the Concordian dialect, Kenobi turned his investigation toward Mandalore's moon, Concordia. While welcomed by Concordia's governor, Pre Vizsla, Kenobi arranged for Kryze to distract Vizsla while he investigated the moon's abandoned mines. There, he found that the mines were not abandoned at all, but actually quite active, churning out helmets, jetpacks, and sets of Mandalorian armor for the Death Watch. Kenobi was attacked by a pair of Death Watch soldiers, and knocked unconscious. Though Kryze managed to rescue Kenobi, they inadvertently stumbled upon the Death Watch's hideout where the benevolent Governor Vizsla revealed himself to be leading the Death Watch. A battle ensued between Kenobi and Vizsla, ending with Kenobi and Kryze's retreat when Vizsla's troops stepped in to attack the Jedi Master."}, {"tag": "p", "text": "With the Death Watch's plot revealed, the Republic Senate began to draft a defense initiative that would send a contingent of the Republic's Grand Army to occupy Mandalore as a peacekeeping force. The New Mandalorian government was highly opposed to the idea, wishing to maintain its neutral status instead of becoming a military target in the war, and Kryze journeyed to Coruscant aboard her private starship with Senator Merrik and a retinue of other sympathetic senators—along with an escort comprised of Kenobi, his former Padawan Anakin Skywalker, and a detail of clone troopers—to plead the case before the Senate that the Death Watch was a rogue element, and did not speak for the whole of Mandalore's population. During the trip, Merrik proved himself a traitor to the New Mandalorian cause and an ally of Pre Vizsla when he attempted to have Kryze killed, although this plan was foiled by her protectors, and Merrik slain by Skywalker."}, {"tag": "p", "text": "On Concordia, Death Watch soldiers new and old rallied to Pre Vizsla and, in conjunction with Confederacy forces donated by Count Dooku, formed an army poised to \"defend\" Mandalore against the Republic's occupation, believing that the Republic's unwanted presence would sway the population in support of the Death Watch. On Coruscant, things seemed grim for Kryze as falsified testimony from New Mandalorian Deputy Prime Minister Jerec turned the Senate against her, and a Death Watch assassin made repeated attempts on her life. But when Jerec's genuine testimony, proclaiming the truth of the situation on Mandalore, was uncovered and brought before the Senate, the occupation initiative was overturned and Mandalore allowed to remain an independent and neutral world. When the news reached Pre Vizsla he prepared to launch an attack in spite of these events, intent on overthrowing the New Mandalorian government, but Dooku was able to convince him to instead wait and bide his time, knowing that to strike then would be to endure another devastating Death Watch defeat."}, {"tag": "h4", "text": "New Mandalorian corruption"}, {"tag": "p", "text": "In spite of their victory in the Senate, neutrality would come at a price for the New Mandalorians. Having separated themselves from the Republic, much of the Republic's hierarchy viewed Mandalore now on the outside of Republic concerns; Republic trade routes to Mandalore were largely shut down, forcing the New Mandalorian people to turn to a black market network of trade established by none other than their own Prime Minister Almec in order to obtain the supplies they so desperately needed. But with the illegal nature of their imports came the threat of corruption, corruption and greed that seeped into the government and swept among its police force and officials. Moogan smugglers were allowed to import tea laced with the dangerous chemical slabin into the New Mandalorians' capital city, Sundari, so long as the customs officer in charge was sufficiently bribed. When Duchess Satine Kryze invited Senator Padmé Amidala to Mandalore for her assistance in dealing with the issue, the two politicians discovered the poisoned tea being distributed to Sundari schools, putting hundreds of New Mandalorian children in the hospital. Together, Kryze and Amidala—with the aid of the New Mandalorian police force—were able to put an end to the smuggling ring and distributed the antidote to the poisoned children. Prime Minister Almec was confronted by Kryze at the conclusion of her investigation—though she did not yet know of his involvement—and in response, he was prompted to form a committee to look into the corruption lurking amidst the New Mandalorian government."}, {"tag": "p", "text": "After Amidala's departure, she requested the Jedi Council send a Jedi agent to aid in investigating the New Mandalorian government's corruption. In response, the Council dispatched Padawan Ahsoka Tano to Mandalore. Arriving in Sundari, Tano lectured at the New Mandalorian Royal Academy of Government on the perils of corruption, instructing aspiring cadets in the ways of lawful and public-serving conduct. Inspired by the young Jedi, cadets Amis, Lagos, Soniee, and Korkie—Duchess Kryze's own nephew—investigated a food shortage at a government warehouse in the Sundari warehouse district. Infiltrating the facility, the four New Mandalorian youths discovered a secret meeting between a group of New Mandalorian officers, several Gotal smugglers, and an unknown being draped in a concealing cloak. They informed Duchess Kryze of the meeting they had witnessed, only to be met with a warning of caution. Instead, the cadets turned to Prime Minister Almec with their find, unaware that he was in fact the cloaked man from the warehouse. Threatened with exposure, Almec used the New Mandalorian Secret Service to have the cadets arrested, in addition to their Jedi ally, Padawan Tano, and even the Duchess herself upon learning that she had been informed of his involvement, as well. He attempted to have the Duchess sign a confession of conspiracy, but upon being denied, Almec used a shock collar as a means of persuading her. When Kryze would not yield, he turned his attention to her nephew, Korkie; Tano and the cadets fought back, managing to overpower Almec and his guards until he could be fitted with a shock collar himself, forcing the Prime Minister to surrender. Almec and his conspirators were placed under arrest and subsequently imprisoned, leaving the black market trade network in ruins."}, {"tag": "p", "text": "In 20 BBY, the former Onderonian Separatist Lux Bonteri solicited the help of Pre Vizsla and his Death Watch, who had set up camp on the planet Carlac. The Death Watch soldiers had earlier raided a local Ming Po town and kidnapped several local woman including Chieftain Pieter's daughter Tryla as servants. When Pieter demanded that the Mandalorians leave, Pre Vizsla and his followers destroyed the village and killed the inhabitants. This brought them into conflict with the Jedi Padawan Ahsoka Tano and the astromech droid R2-D2, with the latter managing to convince the Death Watch's droids to rebel against their masters. Disillusioned with the Death Watch's violence, Lux abandoned his plan to join the Death Watch and escaped offworld with Ahsoka and R2-D2."}, {"tag": "h4", "text": "New Mandalorian defeat"}, {"tag": "p", "text": "The New Mandalorian regime would again come under attack again when the Death Watch, under Pre Vizsla, allied with Darth Maul and Shadow Collective, would stage a successful coup to dethrone Duchess Kryze. To discredit Kryze's rule, Maul and Vizsla hired several criminal organizations including the Black Sun, Hutt Cartel, and the Pyke Syndicate to ravage Mandalore. The Death Watch then won the Mandalorian people's support by apprehending the criminals. Pre Vizsla had Kryze imprisoned, and made himself the Prime Minister of Mandalore. Soon, however, he was killed in a duel with Maul, and Almec was freed from prison and reinstated to be a puppet ruler for Maul."}, {"tag": "p", "text": "Obi-wan Kenobi later came to Sundari, hoping to rescue Kryze from the clutches of the Death Watch. He was able to break Kryze out of the Sundari prison, but Maul's forces stopped them as they were trying to escape, and Maul murdered Kryze and imprisoned Kenobi. He was rescued by Bo-Katan Kryze and the Nite Owls, a Death Watch faction who refused to submit to Maul. This began a battle between the Nite Owls and those in the Death Watch who had become loyal to Maul, the Mandalorian super commandos. Kenobi assisted Bo-Katan in the battle, and then left in order to return to the Republic and inform the Galactic Senate of the situation on Mandalore. During the battle, Darth Sidious came to Sundari and confronted Darth Maul and Savage Opress as rivals. He fought in a lightsaber duel with them in the Sundari Royal Palace and killed Opress and forced Maul into submission."}, {"tag": "h4", "text": "Resurrection"}, {"tag": "p", "text": "In the years leading up to the Republic's clone army first being deployed at the Battle of Geonosis, an elite ARC trooper known as Alpha-Ø2 began to experience headaches, backaches, and, most extraordinarily, memories of Jango Fett's life—or so he claimed. Whether he possessed the memories of Fett or not, the ARC trooper known by the nickname \"Spar\", developed a friendship with Doctor Mij Gilamar after repeated visits to his Tipoca City offices. Gilamar, one of the Mandalorian Cuy'val Dar training sergeants and a medic who also tended to the clones, learned of Spar's interest in deserting the Grand Army and getting off Kamino. To that end, he called in a favor owed to him by Fett, and Spar was smuggled off-world in the cargo hold of Fett's ship, Slave I. While at first taking odd jobs as he traveled the galaxy, specializing in capturing live bounties, when Jango Fett was killed at Geonosis, Spar journeyed to Mandalore. There he met a local constable and clan chieftain by the name of Fenn Shysa. Shysa, who saw Jango Fett as a symbol of Mandalorian strength due to his infamous history as a bounty hunter and Jedi killer, convinced Spar to act as Fett's heir, a claim given credence by Spar's status as a clone and one Shysa spread across Mandalore. Winning out over the New Mandalorian faction, Spar became the new Mand'alor in 20 BBY, taking the sobriquet \"Mandalore the Resurrector\". Spar overturned the New Mandalorians' position of neutrality for Mandalore, instead allying with the Confederacy of Independent Systems in order to oppose a Republic he viewed as oppressive, and the Jedi Order whom he blamed for their part in destroying the True Mandalorians at Galidraan and their willingness to lead the Grand Army. The New Mandalorians would never manage to reclaim their lost dominance, and under Spar, dwindled in power while the other clans and Jaster Mereel's Supercommando Codex returned to prominence on Mandalore."}, {"tag": "p", "text": "As Mand'alor, Spar turned to the teachings of the Supercommando Codex and forged a new army of supercommandos in the image of the fallen True Mandalorians, which he dubbed the \"Mandalorian Protectors\". Numbering two-hundred and twelve-strong in total, the Protector army was comprised of recruits from the local police forces—including among them Shysa and Shya's lifelong friend, Tobbi Dala—even a dozen former members of the Death Watch. Spar and his Protectors captured the facilities of the MandalMotors company in the Mandalorian capital city Keldabe for the Separatists, and put the Pursuer-class enforcement ship into use among his forces. In memory of the Mandallian Giants that had been used by the Mandalorians on the front lines of the New Sith Wars, as well as Fenn Shysa's encounter with the droid C-3PX, Spar also commissioned the Separatist droid foundries to produce a run of one thousand BL-series Battle Legionnaire droids to supplement his army. Spar and the Mandalorian Protectors clashed with the Republic on several worlds. On New Holstice, the Protectors faced off against the Grand Army's 327th Star Corps and although they were driven to retreat, they brought the 327th down to 60 percent strength. They fought on the planet Null, where they defeated the Republic soundly, and on the snow-covered world of Zaadja. When a prominent Separatist commander was killed, the Mandalorians and their Battle Legionnaire droids retaliated at New Bornalex and with an attack on Kamino that devastated a portion of the cloning facilities."}, {"tag": "p", "text": "Their deadly blitzkrieg came to an end when the Protectors were selected for a special mission. Darth Sidious, the secret leader behind the Confederacy, ordered the Protectors on a mission to the planet Norval II. The group's objective was to capture Senator Padmé Amidala of Naboo, but after arriving they were ambushed by Republic forces as part of a great deception engineered by Republic Supreme Chancellor Palpatine—the public alter-ego of Darth Sidious. The Mandalorians were almost entirely wiped out, including nearly all their Battle Legionnaire droids. Of their entire force, only three Mandalorians escaped the slaughter: Shysa, Dala, and Spar. Shysa and the others returned home to Mandalore where a shell-shocked and psychologically scarred Spar stepped down from his position as Mand'alor, though Shysa would make repeated attempts to persuade Spar to reclaim the title. Shysa believed that without a proper Mand'alor, the Mandalorians would look weak in the eyes of the galaxy, and he didn't want to create another gap that the Death Watch might attempt to fill. However, his attempts to sway Spar would be unsuccessful."}, {"tag": "h3", "text": "The Dark Times"}, {"tag": "p", "text": "As the Republic made its transformation into the Galactic Empire and the Great Jedi Purge began, the newly-crowned Emperor Palpatine turned his sights on Mandalore. Appearing to forgive the Mandalorians for their actions during the Clone Wars, the Empire had begun offering mercenary work to the people and even offered a large sum of credits in order to lease land for the creation of an Imperial base with a garrison on the planet. Although there were those who believed any deal with the Empire to be a bad idea—such as Kal Skirata, who had gained a certain understanding of Palpatine's manipulative capabilities during his time in service to the Republic's Grand Army, and cited Palpatine's carefully planned destruction of the Jedi as proof that \"Palpatine never did anything temporary in his life\"—the Mandalorian clan leaders met and decided in favor of leasing the land to the Empire. However, as Imperial forces began to arrive, the post of Mand'alor that had been vacant since Spar stepped down, was reluctantly assumed by Fenn Shysa. Shysa had been a favorite among the Mandalorian people for becoming the next Mand'alor, but it was his negative feelings toward the Empire that influenced his decision: Shysa had been against allowing the Imperial garrison, but felt that should the clans turn the Empire's offer down, they would lose much-needed credits and the Empire might well have come to Mandalore anyway, under much less friendly circumstances."}, {"tag": "p", "text": "In the months prior to the Empire's arrival on Mandalore, an enterprising Mandalorian believed the planet had an untapped potential for adventure tourism. With that in mind, he constructed an oversized replica of a mythosaur skeleton on the outskirts of Keldabe, intending to build an amusement park in and around the structure. The park, which came to be known as the \"City of Bone\", never opened, but the Imperial commander in charge of the Mandalore operation—a human male from Kemla—was convinced by the creator of the park's brother, Hayar, and his friend Jarkyc, that the failed amusement park was actually an ancient Mandalorian temple of great spiritual importance to the people. Wishing to make a show of dominance toward the Mandalorian population, the Imperial commander actually bought the worthless structure and decided to locate the garrison within the Mandalorian \"temple\". While the Mandalorians who'd profited from the exchange found the situation quite hilarious, the Empire now had it's base and began to move in the garrison. They were helped in this effort by the former Cuy'val Dar members Dred Priest and Isabet Reau. Priest and Reau had been hardliners for years, believing in Mandalorian supremacy and the need for the Mandalorians to regain their lost martial strength through conquest, but now they had found a place for their radical views among the ranks of the Death Watch, now in the employ of the Empire and on the return yet again. As Reau and Priest helped the Imperials secure their base outside Keldabe, the Empire offered MandalMotors eight hundred million credits for exclusive mining rights in the Tokursh region, an area rich in beskar ore. In addition, the Empire was interested in acquiring prison ships with beskar enhancements, refurbishing older model prison ships, and obtaining special beskar equipment, including beskar manacles and cages, for the ongoing Jedi Purge. Priest was killed not long after his Death Watch ties became known; he was stabbed to death and his body dumped in the Kelita River by fellow ex-Cuy'val Dar Mij Gilamar, who believed that the Death Watch could not be allowed to return to Mandalore."}, {"tag": "p", "text": "It was around this time that the Empire showed itself as a true threat during a dispute with the planet Gibad. Gibad, a world that had been aligned with the Separatists prior to the Clone Wars' end, had refused to accept the new Empire. In response, Emperor Palpatine authorized the use of the FG36 nanovirus. Created by Gibadan native, Doctor Ovolot Qail Uthan, during her time working with the Separatists, the FG36 virus had been designed to kill the Republic's clone troopers by targeting the Fett genome and the inherent rapid-maturation gene they possessed. Captured during the Clone Wars by a Republic commando squad, Palpatine had kept the virus as insurance should he ever need to remove the Grand Army. But he found that in its unfinished state, the virus could be released onto a world, killing every sentient being, and leaving its infrastructure intact—Gibad's ultimate fate. In order to ensure that Mandalore wouldn't share that same end, the Mandalorians of Clan Skirata—already holding Doctor Uthan for her assistance in reversing the rapid-aging of the clones who'd deserted to Mandalore and become a part of the clan—developed an immunogen for the virus, communicable by airborne transmission, and which with the Mand'alor's permission, they spread throughout Keldabe and eventually across Mandalore."}, {"tag": "p", "text": "As the Empire slowly consolidated its holdings on Mandalore, Shysa began to covertly assemble a resistance force to \"respond in kind\" should the Imperial presence turn hostile. Shysa's fears were realized as the Empire's foothold on Mandalore became an iron grip; the Imperials began to strip-mine the planet's beskar deposits, and enslaved large portions of the Mandalorian population to do the work. Shysa's resistance—a reborn sect of Mandalorian Protectors including the first-generation Protector, Tobbi Dala—fought against the Imperial occupation for close to twenty years, drawing the ire of the Empire. The Shimholt known as the Suprema, had replaced the Imperial commander from Kemla, and under his leadership, the Empire's grip on Mandalore only tightened. Around 3 ABY, Tobbi Dala undertook a mission to infiltrate the City of Bone, where many of his enslaved kinsmen were being held, with the intent to rescue them. However, the mission proved to be a disaster, and Dala was captured by the Imperials. Although his comrade was now out of action, Shysa continued the fight, utilizing hit-and-run operations against the slavers. A bounty was placed on Shysa's head, one that the bounty hunter Dengar came to Mandalore in order to collect. Dengar was unable to capture Shysa, however, and soon found himself in the clutches of the Protectors. In an effort to retrieve Dala, Shysa made a deal with the Imperials: he would turn Dengar over to them in exchange for the release of his friend. The slavers agreed to the deal, but before the exchange could be made, there was another unexpected arrival to the planet. By this point in time, the Empire was in the midst of a war with the rebellious Alliance to Restore the Republic. Princess Leia Organa, one of the Alliance's most prominent leaders, came to Mandalore chasing rumors that Dengar had aided Boba Fett in capturing Han Solo, another Alliance leader. She landed on the planet and became immediately involved in a shoot out between the Mandalorians and Imperial slavers. After initially confusing Shysa with Fett, Organa learned of the Mandalorian's true identity and his purpose on Mandalore. Shysa mistook Organa for her mother, Padmé Amidala, whom he had been sent to capture during the war, though that, too, was shortly cleared up."}, {"tag": "p", "text": "After giving Organa a false testimony as to his exploits in the Clone Wars, including mentioning that Boba Fett had been his commander and not Spar, Shysa brought Organa and her droid, C-3PO, back to his base camp, lodged deep within the Mandalorian forest. Upon finding Dengar as their prisoner, Organa to bring the bounty hunter back to the Alliance for questioning, but Shysa would hear nothing of it, determined to get his friend back from the Imperials. Taking Shysa for a walk away from the camp, Organa left C-3PO to free the bounty hunter. On their walk, Organa seduced Shysa, using a kiss to put him off guard before knocking him unconscious. With Shysa incapacitated, Organa released Dengar, hoping that he would repay her with information about Fett. However, the bounty hunter double-crossed her, betraying her to the Imperials for the bounty on her head. As the princess was taken into the City of Bone, Shysa took out one of the perimeter guards and assumed his identity, donning his stormtrooper armor and infiltrating their base. Shysa freed Organa from her cell and made a deal with her: if she would help him free Dala, he would help recapture Dengar and let her take the bounty hunter back to the Alliance. After Organa agreed, they managed to free Dala and Shysa gave the order for his troops to attack; Mandalorian slaves rioted, striking back at their Imperial captors as stormtroopers rushed to defend the base. During a confrontation with the Suprema, Dala was mortally wounded. Shysa viciously attacked the Suprema, but before he could kill him, Organa convinced the Mand'alor that they may yet need him. Wounded beyond saving, Dala directed his friend to leave him, and ensured that Shysa and Organa escaped the base in a stolen airspeeder. When the Imperial forces gave chase, Dala slammed the hangar doors shut; moving too fast to break off their pursuit, the Imperials crashed headlong into the blast doors, creating a massive explosion that ignited nearby fuel and ammunition, and consumed the entire city in flames, killing all the Imperials, the Suprema, and Dala himself. Though Shysa mourned the loss of Dala, the Mandalorians celebrated their regained freedom and a large number of the former slaves joined the ranks of the Mandalorian Protectors. With the Suprema dead and their numbers bolstered, the Protectors took their fight to Imperial Grand Admiral Miltin Takel, who had been placed in charge of the Mandalore sector, and drove him from Mandalorian space."}, {"tag": "h3", "text": "After the Empire"}, {"tag": "p", "text": "With the destruction of the second Death Star at the Battle of Endor in 4 ABY, a year after Mandalore's own liberation, the Alliance to Restore the Republic formally became the Alliance of Free Planets, an interim government on the way to a new Republic. As Mand'alor, Shysa led the Mandalorians as an ally of the Alliance of Free Planets during the Nagai invasion of the galaxy after a few battles in the Mandalore system. However, when it became clear that the Nagai were looking to escape from under the heel of the barbaric Tof, the Mandalorian Protectors agreed to help the Nagai liberate their own homeworld, Nagi. Although Mandalore was not part of the New Republic that was formed shortly after, the Mandalorian Protectors and Fenn Shysa would again offer their aid during the Battle of Mindor against Lord Shadowspawn. Shysa's stint as Mand'alor would come to an end in 21 ABY. When an aging Boba Fett returned to Kamino to attain a cloned replacement for a near-cancerous leg, the Kaminoan named Taun We sought to enlist Fett in her revenge against the last living Mandalorian Protector who'd been responsible for the attack on her world during the Clone Wars: Shysa. Fett hunted Shysa to the planet Shogun, but before Fett could kill Shysa they were surrounded by Sevvets. Shysa, still of the belief that a member of the Fetts would make the best Mand'alor, saved Fett's life but received severe wounds in the process. Rather than leave Shysa to the Sevvets to die what he felt was a \"rotten death\", Fett killed Shysa out of mercy, but not before agreeing to Shysa's dying wish that Fett succeed him as Mand'alor. Taught from a young age that his word was his bond by his father, Jango, Fett returned to Mandalore with Shysa's helmet and took over as the new Mandalorian leader. Under Fett, the Mandalorian Protectors would cease to be a force strictly for home defense, and became a mercenary army, while Shysa was memorialized in the Keldabe suburb of Bralsin."}, {"tag": "p", "text": "Nearly thirty years after the Battle of Yavin, the Mandalorians would be among the first groups to become aware of the extra-galactic invaders known as the Yuuzhan Vong. This interaction all began in 24 ABY, when the Mandalorian bounty hunter Goran Beviin met with an individual by the name of Udelen at Bar Jaraniz on Nar Shaddaa about a job. Udelen was in fact a spy for the Yuuzhan Vong, disguising his true appearance and looking to use the bounty hunter's skills to destabilize the government on Ter Abbes by assassinating the politician Tholote B'Leph. Though Beviin normally stayed away from political hits and kept to the domain of arresting criminals, his farm was having trouble making ends meet, and he agreed to take the job. Beviin was well paid upon accomplishing his task, but his actions had attracted the Mandalorians further attention from the Vong and Nom Anor offered work to other interested Mandalorian mercenaries, even speaking with Boba Fett on at least one occasion. A year later, Nom Anor—still operating under the identity of \"Udelen\"—traveled to Mandalore to meet with Boba Fett in person. Arriving in Keldabe, Fett and Nom Anor arranged a rendezvous in the Outer Rim; although Fett disliked Nom Anor's tendency to withhold information and his subtle threats, he did not wish to deny the Mandalorians needed credits and agreed to Nom Anor's request. Arriving at the rendezvous point with six of his supercommandos including Beviin, Tiroc Vhon, Cham and his brother Suvar Detta, and Briika with daughter Dinua Jeban, Fett and his forces bore witness to the arrival of the massive Yuuzhan Vong fleet. Invited aboard one of the miid ro'ik warships, Fett and Beviin learned the true identity of \"Udelen\" as Nom Anor, a Vong Intendant. Nom Anor would also share the Yuuzhan Vong's plans for the galaxy with the two Mandalorians, even brutally demonstrating the fate of those individuals who might oppose them. Knowing that the Mandalorians stood no chance against the Vong in a direct confrontation, Fett made a deal with Nom Anor: using clever word games to circumvent his own moral code, Fett agreed to continuing Mandalorian service in return for the Mandalore sector being spared, when in actuality, Fett planned to sabotage the Vong from the inside at every available chance while buying Mandalore time for the Vong's inevitable betrayal."}, {"tag": "p", "text": "Having acquired sample's from the living miid ro'ik ship's internal walls, and records of everything they could see from recorders in their helmets, Fett and Beviin planned to make contact with the New Republic, but knowing that the Vong could disguise themselves as human, they would have to tread cautiously. One week after the fall of Helska IV and the beginning of the Yuuzhan Vong War, Fett and his commandos traveled to Birgis, the next target the Vong had given the Mandalorians. Equipped with the data Fett and Beviin had gathered on the Vong ship and information on their next two assignments, the Mandalorians stormed a spaceport and did enough damage to appear convincing while they were really looking for someone to relay the information to the New Republic. Finding a female pilot still in the main complex, the Mandalorians managed to subdue her and give her the information to pass on to her superiors. When asked whose side the Mandalorians were on, Briika Jeban stated that they were on their own side, offering the data to the New Republic because no one stood to benefit from a galaxy under Vong control. Though the pilot would escape Birgis and deliver the data to her superiors, the New Republic would believe the information provided by the Mandalorians to be false and New Holgha fell to the Vong. However, another opportunity would arise when, while on New Holgha, Fett was contacted by the Vong subaltern Bur'lorr, in pursuit of a Jedi. Knowing the Jedi's Force senses would allow him to detect the truth of the Mandalorians' intentions, Fett told the Vong to leave the Jedi to them; Beviin was ordered to stall the subaltern, while the others tracked and managed to incapacitate the already injured Jedi with a stun dart. The Jedi accused Fett of delivering misinformation to the New Republic, but the Mand'alor explained that he was trying to save his and had to make the Vong believe he was on their side; with the Force's assurance, the Jedi—introducing himself as Kubariet—believed Fett's claims and was rushed to his vessel with the data. No sooner had Kubariet departed, Subaltern Bur'lorr arrived, suspicious of the Mandalorians. With no other option, Beviin attacked, destroying the subaltern's villip and burying his beskad saber in the Vong's jaw. Still thrashing, Beviin leaped on top of the Vong, crushing its throat with the illegal Mandalorian crushgaunts he wore. In all the thrashing, however, Briika had been pierced in the chest by one of the spikes on the Vong's armor and although the Mandalorians fought desperately to save her, she died in Fett's ship, Slave I; her now orphaned daughter, Dinua, was adopted on the spot by Beviin."}, {"tag": "p", "text": "Two weeks later, Fett met with Kubariet on Vorpa'ya. There, they solidified the terms of the impromptu partnership, with the Mandalorians forced to continue to act as the New Republic's enemy and the New Republic to respond in turn. Fett handed over what information and bio-samples he had available, with the only thing he asked in return being the recognition that a Mandalorian had died to save a New Republic citizen. In order to secretly build Mandalore's forces against the Vong, Fett established a Mandalorian training ground on Raxus Prime for the Mandalorian Protectors. A few months into the war, Han Solo came to Raxus Prime to investigate a rumor, and was shot down by one of the Mandalorians. Fett sent his new recruits—at first mistaken to be Fett by Solo—after the New Republic hero in order to test them, leaving Solo to weed out the weaker ones. Eventually Solo was confronted by the real Fett, who told Solo to return to Coruscant and tell his wife that the Mandalorians were working for the highest bidder, the Yuuzhan Vong, furthering their cover. But the deception would not last forever. When the Vong discovered that the Mandalorians had betrayed them, they brought their vengeance down on Mandalore, ravaging the world: bombarding the planet, flattening its woods, poisoning its soil, and even killing a third of its population. Many Mandalorians took shelter in the underground tunnels of the planet's countryside, allowing them to survive the initial stages of the Vong attack and eventually fight off the invaders. The ruse brought to light, Fett now led the Mandalorians to strike directly at the Vong, liberating Tholatin and crushing the Vong forces on Gyndine. The Mandalorians also helped to defend Caluula, headquartering themselves in the orbiting Caluula Station. A month of Vong attacks passed, until Han Solo and Leia Organa Solo arrived on the station aboard the Millennium Falcon. With the Solos' arrival, Vong interest in the planet was redoubled and they struck heavily at Caluula Station. The Mandalorian Protectors fought back, with Fett even saving Solo, his one-time enemy and rival, from the Vong. Several of the Mandalorians scalped the Vong they killed, as they went; meanwhile, the Vong sent out alerts that the Mandalorians were warriors worthy of captivity, and they strengthened their focus on Fett and his soldiers. Two Mandalorians fell as the rest were backed into the corner of a hold, and Fett shot up on his jetpack toward the ceiling, firing on the Vong below, before an amphistaff knocked him down and against a bulkhead. As the Vong closed in on him, Fett was in turn saved by Han Solo. With more reinforcements on the way, the Mandalorians blew a hole in a bulkhead and retreated through it, with the Solos and Caluula's soldiers following, although the Mandalorians would soon split off from the others. Fett eventually reached Slave I, and along with four Mandalorians in Gladiator-class assault fighters, he once again came to the rescue of the Solos, blowing apart a Vong coralskipper pursuing the Falcon. Fett and Han exchanged jibes over the comlink before parting ways. Though Caluula was ultimately lost to the Vong, the Mandalorians and the new Galactic Alliance would prove victorious in the Yuuzhan Vong War."}, {"tag": "h3", "text": "Restoration"}, {"tag": "p", "text": "Ten years after the end of the Yuuzhan Vong War, Mandalore was still recovering from the damage dealt by the vengeful Vong. Many of their best soldiers had fallen to the Vong attack, and even after ten years, much of Mandalore's soil remained poisoned and its infrastructure in disarray. At the same time, Boba Fett, who was still the reigning Mand'alor but had been living on Taris, found that he was dying: the tumors in his old leg, a result of his time spent in the Sarlacc and worsened by his nature as a clone, had begun to spread. His doctor, a man by the name of Beluine, gave him a prognosis of a year or two to live, possibly less with overexertion. Determined not to die without a fight, Fett set out on a quest to find long-missing Kaminoan scientist, Ko Sai, and her data in order to combat the spread of his degenerating tumors. Enlisting the help of Goran Beviin—who had become something of an unofficial second-in-command to Fett—the Mand'alor found that rumor held Ko Sai was dead, but that her data had never surfaced. Shifting his focus, Fett planned to track down another Kaminoan, his childhood acquaintance, Taun We. Before he could leave Taris, however, Fett was confronted by a girl named Mirta Gev who possessed the heart-of-fire gemstone Fett had given to his dead ex-wife, Sintas Vel, when they were married. Like Fett, Mirta was a bounty hunter, claimed that she'd retrieved the stone for Fett's estranged daughter, Ailyn Vel, and for a fee, would bring him to her. Agreeing to the deal, Fett took Mirta along with him as he tracked Taun We to Arkanian Microtechnologies on Vohai; during the trip, Mirta revealed that she had met another clone recently, one who had apparently managed to halt his accelerated aging. His hope renewed that Ko Sai's research was still out there, Fett was left with a third target: a Mandalorian clone with grey leather gloves. Upon infiltrating Arkanian Micro's headquarters, Fett met with Taun We and stole a copy of her data, using the threat of selling it in order to ransom information about Ko Sai from her. Taun We informed Fett that Ko Sai had fallen victim to Kal Skirata and the Null ARCs during the Clone Wars, information that fit well with Mirta's tip that the clone she'd encountered bore the clan name \"Skirata\". With this new lead, Fett was about to continue his search when he was contacted by Corellian President, Thrackan Sal-Solo."}, {"tag": "p", "text": "Sal-Solo informed Fett that he wished to enlist the aid of the Mandalorians in order to defend Centerpoint Station as it underwent reconstruction. Fett had Beviin gather what supercommandos he could to meet him on Drall. Although many were unable to get away from their farms as it was now harvest time on Mandalore, when Fett arrived at Zerria's Bar on Drall, he was joined by six Mandalorians: Ram Zerimar, Briike, Novoc Vevut and his son Ghes Orade, Isko Talgal, and Beviin. The general consensus among the commandos was against taking up arms for Corellia in the growing tensions between Corellia and the Galactic Alliance, stating that they were less interested in credits as they were in tending to their farms, and in a private conversation with Beviin, Fett learned that a Mandalorian known as \"Kad'ika\" was spreading the sentiment that Mandalorians should stop fighting outsiders' wars and strengthen themselves, though he wasn't looking to replace Fett as Mand'alor. Despite the Mandalorians' general disinterest in the prospective Corellian contract, Fett had other motives for traveling to Corellia: Sal-Solo had put a bounty on the head of his cousin, Han Solo, and Fett's daughter Ailyn had taken the job, tracking Solo to Corellia. The Mandalorians in their Gladiator-class assault fighters would distract the Alliance blockade around Corellia, allowing Fett to land on the planet's surface and meet with President Sal-Solo. Although the two came to no agreement—Fett demanding more money for his commandos than Sal-Solo was willing to pay—on the way out, Fett was approached by Dur Gejjen with a proposal to assassinate Sal-Solo. Fett took the job, and with the help of a vengeful Han Solo and Mirta Gev, killed Sal-Solo and escaped the presidential offices to await Ailyn's arrival. Unfortunately, Ailyn had been killed by Solo's son, Jacen, a fact revealed after the arrival of Solo's wife, Leia, and one that drove Mirta to out herself as Fett's granddaughter before trying to kill him for her now dead mother. Her attack was blocked by Leia, and Mirta would give up her desire to kill her grandfather after Fett demanded the return of Ailyn's body. The two would develop an uneasy peace between them as they brought Ailyn to be buried on Mandalore, with Fett stopping briefly on Geonosis to collect his father's remains as well."}, {"tag": "p", "text": "Soon after Fett's return to Mandalore, a gathering of the clans was called at MandalMotors Hall, a stone communal building donated by MandalMotors CEO, Jir Yomaget. There, the leaders of the clans looked to Fett as Mand'alor, to determine whether or not the Mandalorians were going to get involved in the escalating war, and which side they would fight for if they did. After a lengthy discussion, Fett decided upon a compromise: while Mandalore took no official position in the war, individuals who wished to sell their services as private mercenaries were free to fight for whichever side they desired. The idea was derided by the Mandalorian known as Graad, a proponent of kadikla—the name of the \"Mandalore-first\" movement that was being spread by Kad'ika—and who felt that a situation that could have Mandalorians fighting each other on opposite sides was the last thing that Mandalore needed. He was opposed in this view by Baltan Carid, who was a strong supporter of Fett's idea, and felt that kadikla was too far in opposition to the Mandalorians nomadic roots. But when Graad suggested that some Mandalorians out in the galaxy be called to return to help rebuild Mandalore, Fett latched onto the idea and made it policy, asking for two million Mandalorians to come back to Mandalore in order to raise the population back to pre-Yuuzhan Vong War levels. In order to help with the economical deficit brought on by the need to import outside food, Jir Yomaget pledged half of MandalMotors' profits to the restoration effort, and Fett added an additional multimillion credit offering from his own accumulated wealth. As the meeting wound down, Fett declared Goran Beviin as acting Mand'alor during the period of time he would be gone, back on the hunt for the gray-gloved clone named Skirata. Fett would eventually find this clone—who turned out to be the former Null ARC Jaing Skirata—on Kuat, after a brief skirmish at the Tekshar Falls Casino in Kuat City. Skirata agreed to help the ailing Mand'alor on the condition that he listen to Kad'ika's advice and forge Mandalore into a stronger, more stable state, just as Shysa had done before him. In Fett's absence from Mandalore, a large deposit of beskar ore was discovered to the north of Enceri by two off-world Mandalorians, a geologist and a minerals engineer, returning to Mandalore on Fett's order. By the time Fett made his own return to the planet, drilling had already commenced under site foreman Herik Vorad, and samples were being taken. Since the beskar had been found on land with no owner, Fett decreed that the lode would be a resource for all of Mandalore."}, {"tag": "p", "text": "Soon after the discovery of the beskar lode, MandalMotors began producing a prototype starfighter that began as the Kyr'galaar, but would ultimately become the Bes'uliik assault fighter, planing to incorporate the new beskar in the airframe and armor of the powerful vessel. When Jir Yomaget unveiled the prototype to Fett, he was given full approval to begin production, with fifty-percent to be marked down in performance and weaponry for export, while the other fifty-percent was for the Mandalorians themselves, and to be built top of the line. Fett also decided that the fighters would be sold to the fledgling Confederation or the Galactic Alliance, or anyone else who could pay. When word of the Mandalorians' new supply of beskar got out, the Verpine speaker for Roche, Sass Sikili, got in contact with the Mand'alor to acquire a shipment of the metal and to see if the resurgent Mandalorian economy might lead to aggressive outward expansion. Glimpsing an opportunity, Fett proposed a pact between the Mandalorians and the Verpine: exclusive Verpine weaponry for exclusive beskar shipments, and use of Verpine facilities in exchange for military aid in times of need. Sikili agreed to the pact on behalf of the Roche hive, and a Mandalorian–Verpine alliance was forged. At the same time, Fett's granddaughter Mirta had entered into a romantic relationship with Ghes Orade. Mirta and Fett had developed a more normal, albeit strained, relationship by this point, with Mirta even attempting to help Fett connect with his Mandalorian heritage that he'd been estranged from for nearly his entire life. As Mandalore's economy surged, Jaing Skirata felt that Fett had fulfilled his end of their deal and sent a cure for Fett's condition to be delivered by Skirata's nephew, Venku Skirata, who was in fact none other than Kad'ika and the son of a clone deserter from the Clone Wars, making him the equivalent of Fett's own nephew as well. Fett was treated by a local veterinarian, and during his recovery, the Mandalorians were offered twenty million credits per month by the government of Bothawui to provide the services of an assault fleet and infantry force, in addition to offering a premium price in order to obtain exclusive purchasing rights for the new Bes'uliik fighters. Shortly after Fett had regained his strength, he led a Mandalorian assault on the factory complexes on Murkhana as part of their agreement with the Verpine, protecting the copyrights established by Roche."}, {"tag": "p", "text": "In 41 ABY, Mandalore would play host to Jedi Knight Jaina Solo when she came to the planet to seek the help of Boba Fett in order to capture her brother, Jacen, who had embraced the dark side and become Darth Caedus. Fett agreed to Jaina's request, and began training her in bounty hunting and anti-Jedi combative techniques. Thousands of Mandalorians were also arriving on Mandalore, heeding the Mand'alor's call. Baltan Carid's clan was put in charge of allocating unused farmland to any of the returning Mandalorians who wished to farm it. At the same time, Mirta Gev had been able to locate her grandmother and Fett's ex-wife, Sintas Vel, who wasn't dead, as previously believed, but frozen in carbonite. Upon recovering Vel, Mirta and Fett brought her back to Mandalore where they released her from her carbonite prison, and at the advice of Jaina, enlisted the help of the former Jedi turned Mandalorian, Gotab, to heal her carbonite-induced blindness and repair her damaged memory. Meanwhile, MandalMotors continued mass-production of the Bes'uliik fighters, and also introduced the considerably more low-tech vehicle known as the Tra'kad—or the \"Star Saber\", a veritable flying tank that could be operated entirely by manual controls—in a move that left Mandalore's new Verpine allies baffled. On his way back from inspecting one of these vessels at MandalMotors headquarters, Fett received a transmission from Admiral Natasi Daala, who had an offer of mercenary work for Fett and his commandos: with Admiral Gilad Pellaeon's forces moving to Fondor to support Darth Caedus' campaign there, Daala wished for Fett and the Mandalorian supercommandos to act as a standby team should Pellaeon require assistance. Fett agreed, and within twenty-four hours, the Mandalorians Fett had chosen, in addition to Mirta, Jaina Solo, and himself, were stationed near the Tapani sector awaiting word from Daala. Things would not go according to plan, however, as Caedus' Sith apprentice, Tahiri Veila, murdered Pellaeon aboard his vessel, Bloodfin, in the middle of the Second Battle of Fondor. The Mandalorians were then re-tasked by Daala with taking the Bloodfin back from the onboard coup of Moffs and Imperial officers loyal to Caedus, and so they assaulted the Star Destroyer, breaching the hull and killing every stormtrooper and officer who opposed them until finally reaching the Moffs at the ship's inner sanctum. During the commando raid, Mirta and Jaina engaged Tahiri Veila as she attempted to flee the besieged Star Destroyer, in a skirmish that left Tahiri retreating while bleeding profusely from a severed femoral artery after Mirta stabbed her in the leg. Caedus managed to rescue his severely wounded apprentice, but not before being caught by Baltan Carid and Novoc Nevut; Carid crushed Caedus' ankle with a Mandalorian crushgaunt before shooting the Sith Lord in the knee, letting Caedus go only due to Fett's orders. Fett believed that Caedus should be dealt with by his sister, Jaina, alone, not by the Mandalorians despite his own hatred for Caedus spawned from the loss of his daughter. With Caedus and Tahiri's escape, the Mandalorians finished their work and returned to Mandalore following a brief discussion between Admiral Daala and Fett on the nature of galactic politics and the involvement of Force-user therein."}, {"tag": "p", "text": "A week later, Mirta and Ghes Orade were married and a celebratory feast was held in Keldabe with several dozen guests turning out to congratulate the young couple. Jaina Solo continued her training under Fett, even journeying with him to Roche when the Mandalorians took up arms for the Verpine again as the Galactic Alliance forces loyal to Darth Caedus moved to conquer the Verpine. Mandalorian casualties were high, with losses including the deaths of Vatok Tawr and Roegr, and the capture of Mirta by Caedus. During the fighting, Jaina faced off against Caedus aboard the Anakin Solo, using her training under Fett to defeat and kill her Sith brother. Mirta was soon rescued, but before Caedus' death, he'd ordered a nanovirus designed to kill Fett and any who shared his genes be released on Mandalore. While it appeared that Fett and Mirta would never be able to return to Mandalore, because the nanovirus used was derived from the FG36 nanovirus developed years earlier, the immunization that had been spread across Mandalore in secret by Clan Skirata during the early days of the Galactic Empire put this in doubt. When Natasi Daala was instated as the new Galactic Alliance Chief of State, her old alliances and working relationships with Boba Fett proved beneficial for the Mandalorians as they were\nprovided with a greatly increased role in government and galactic affairs as elite security and intelligence operatives. Daala also used them as Galactic Alliance forces against rogue Jedi, such as Seff Hellin in 43 ABY, much to the concern of Grand Master Luke Skywalker and the Jedi Order."}, {"tag": "h3", "text": "Sith–Imperial War"}, {"tag": "p", "text": "By the year 127 ABY, the Sith–Imperial War had broken out, with the Fel Empire turning on the Galactic Alliance. The Mandalorians, now under the leadership of Mand'alor Chernan Ordo, had been contracted by the Galactic Alliance to hold the planet Botajef and its shipyards against the Imperial Army until the Galactic Alliance Fleet arrived with reinforcements. However, there was a traitor in their midst by the name of Yaga Auchs; Auchs served an unknown master and it was in his service that he sabotaged communication with the Alliance fleet and betrayed his comrades, leading to the Mand'alor's death. Usurping the title for himself, Auchs used his authority as the new Mand'alor to order a retreat, leaving Botajef to the Empire and taking his people out of the war. As Auchs pulled out, Hondo Karr and Vevec—the father of Karr's wife, Tes―were left stranded on Botajef. With Imperial soldiers closing in, Karr removed his Mandalorian armor and replaced it with the armor of a dead stormtrooper. Vevec refused to hide in the enemy's armor, and instead gave his life to help establish Karr's cover as the last survivor of his unit."}, {"tag": "p", "text": "Karr masqueraded as a stormtrooper for ten years, until the Battle of Borosk in 137 ABY, where he attacked the Sith Lord Darth Maleval in defense of a superior officer. Maleval was killed by another trooper in Karr's unit, and Karr abandoned the Empire to join the Galactic Alliance Remnant, becoming a member of Rogue Squadron. During a mission to Napdu, Tes Vevec finally tracked down her now ex-husband. Tes believed Karr had been the Mandalorian traitor, and that he was the one responsible for her father's death. The two engaged in a brawl, during which Karr was able to disarm Tes and convince her of the truth. Reunited with his wife, Karr left Rogue Squadron and donned a new set of Mandalorian armor painted in black and gold—the traditional Mandalorian colors for justice and vengeance—with the intention of hunting down Auchs and gaining his revenge."}, {"tag": "h3", "text": "Prophesied end"}, {"tag": "p", "text": "Several centuries prior to the fall of the Republic and the rise of the Galactic Empire in its place, approximately 3951 BBY, the former Jedi Kreia—and once the Sith \"Lord of Betrayal\", Darth Traya—used her great insight into the Force to foresee the end of the Mandalorians, an event that she believed would take place long after her own death. In her vision, Kreia revealed that following their defeat in the Mandalorian Wars at the hands of Revan, the Mandalorians would never wage another crusading war of conquest. Instead, they would grow weaker and experience a slow decline that would span thousands of years until only their history, their code, and a single male Mandalorian remained. This male, whom she foresaw as a broken man in Mandalorian armor, would meet his end in battle with a Jedi, thus marking the final end of the Mandalorian people."}, {"tag": "h2", "text": "Culture"}, {"tag": "h3", "text": "Daily life and death"}, {"tag": "p", "text": "Early Mandalorian culture, originating with the ancient Taung species, was believed to have begun as a religious warrior society, with sophisticated laws and customs that went on to become the Canons of Honor. War was practiced as a form of ritual worship to their multiple gods, but following the destruction of the Nevoota, war itself became a god, personified by Kad Ha'rangir the destroyer god. In Mandalorian mythology, Kad Ha'rangir represented the opportunity for change through destruction, and was eternally opposed by Arasuum, the personification of stagnation and inactivity. Because of this, many of the Mandalorians' earliest conflicts were seen as holy wars and their warriors known as the Mandalorian Crusaders. As time went on and the majority of the Taung had perished by the end of the Great Sith War, the Mandalorians began accepting beings of other races and species into their fold, viewing those who joined them on equal footing to those who had been born into the culture, and transforming what it meant to be a Mandalorian. Having become a mixed group of beings from numerous worlds and species, those who considered themselves Mandalorian were bound by a single, unifying culture rather than any one race, and they believed that an individual was defined by their actions rather then the circumstances of birth."}, {"tag": "p", "text": "Central to the Mandalorian culture were the Resol'nare, or the \"Six Actions\". These six tenets defined what it meant to be a Mandalorian, and any who wished to be considered as such was expected to abide by them. The Resol'nare consisted of wearing armor, speaking the Mandalorian language, defending oneself along with one's family, contributing to the welfare of your clan, rallying to the Mand'alor when summoned, and raising one's children in the Mandalorian ways. In order to retain their heritage in the face of outside influence, Mandalorians placed a high value on rigorously carrying out the Resol'nare's tenets in a daily manner. However, interpretation of the Resol'nare differed, and at least one group of Mandalorians, the New Mandalorians, potentially followed an alternate interpretation of the Resol'nare by doing away with personally-owned sets of armor and refusing to aid the Mand'alor."}, {"tag": "p", "text": "The Mandalorians are a nomadic people, with the roots of this tradition tracing back to the Mandalorian Crusader's tendency to make conquered worlds their home. Even long after the conquest of Mandalore, the Mandalorians would hold on to these nomadic traditions, partially out of attachment to the old ways, but also as a means to avoid presenting a single target to any enemy who would wish to wipe them out. Thus, Mandalorian communities have cropped up across the galaxy, and there are many Mandalorians who have never even stepped foot on Mandalore. Mandalorian families never expect their current home to be permanent, nor do Mandalorian soldiers. Portability is desired over a large number of material possessions, and even the traditional Mandalorian dwelling known as a vheh'yaim was designed to be set up for temporary occupation and easily deconstructed or abandoned. While many cultures with a settled location celebrated events and festivals that were derived from the changing seasons of their homeworld, the Mandalorians' nomadic customs have left them largely disconnected from these sorts of cycles as they traveled from world to world. Though Mandalorians who come from Concord Dawn generally still mark the end of the planet's harvest, on the whole, most Mandalorians have taken to celebrating mainly the events of the life cycle such as birth, a coming of age, marriage, and death. Burials for the dead are also uncommon, due to the inability for nomads to sustain cemeteries and the impracticality of bringing bodies with them on the move. The Mand'alor would be given a proper burial as a sign of respect, unless they chose otherwise. Mass graves and cremation were common when a body could be recovered, with the ashes of those cremated, scattered, and one of the fallen's possessions—often their armor—kept in memorial; if a full set of armor couldn't be recovered, it was commonplace to retrieve smaller parts such as helmets, gloves, or plates instead. It was also Mandalorian custom to recite the names of loved ones and friends who have passed each night before sleep as a means of keeping their memory alive. The uncertainty of life meant that most Mandalorians celebrated the time they had at every opportunity, taking part in communal singing, drinking, and enjoying time with family. The concept of aay'han was a Mandalorian term that encompassed the joy of time spent with loved ones while remembering those who were no longer among the living, relatively similar to the Basic term \"bittersweet\"."}, {"tag": "p", "text": "The ancient Mandalorian Crusaders and their Neo-Crusader replacements lived and thrived on war, seeking conflict, and attaining glory through conquest. But following the end of the Mandalorian Wars, many Mandalorian soldiers would become bounty hunters and mercenaries, selling their services to the highest bidder. This mercenary trend would become a part of the culture for thousands of years to come, and many in the galaxy saw the Mandalorians as little else. However, while mercenary work and bounty hunting would be a primary means of income for the Mandalorians, there were a wide assortment of other jobs Mandalorians typically took on. Several Mandalorians earned their living as weaponsmiths, or bodyguards for the host population of the worlds they lived on. Others remained in the Mandalore sector, toiling in workshops and factories, or working the land as farmers. Several Mandalorians on Mandalore worked what might be considered \"domestic\" occupations, tending bars and running shops, as well as working as doctors and veterinarians. Despite the wide array of professions Mandalorians took, every Mandalorian was combat trained and they could band together into an army on short notice. In addition to the general misconception that all Mandalorians were mercenaries, Mandalorians were also considerably more sociable than many would expect. As long as individuals spoke their mind and said what they meant, accepted a meal when offered—as an offered meal was a great compliment for a nomadic society that ofttimes lived hand to mouth—looked them straight in the eye or the horizontal section of their visor when wearing a helmet, took off their boots when entering their home, paid their debts, fussed over their children, never made a pass at a Mandalorian of the opposite sex unless the individual planned to become part of the culture, and respected the elderly—as any Mandalorian who has reached such an age would be an exceptional warrior—anyone who encountered a Mandalorian outside of combat was unlikely to come to harm."}, {"tag": "h4", "text": "Cuisine"}, {"tag": "p", "text": "Like most other ethnic groups, Mandalorians had their own distinctive cuisine, unique to their culture. As a society of nomadic soldiers, many Mandalorian dishes developed out of the necessity for their food to be both portable and requiring little cooking, while still offering nourishment. Haarshun bread was a staple in Mandalorian field rations; made into sheets thin enough to nearly see through, the dough would be rolled and baked hard, then wet with water to soften it again before eating. Gihaal was a dried fishmeal that could last several years without refrigeration, and was a nutritious mix of fat and protein. However, it possessed a pungent, clinging aroma that most found unpleasant. More pleasing to the masses was uj'alayi, or \"uj cake\". Made from ground or crushed nuts, dried fruits, spices, and sticky uj'ayl syrup, uj cake was dense, flat, and extremely sweet."}, {"tag": "p", "text": "A dish better suited for a sit-down meal was tiingilar, a spicy casserole made of meat and vegetables. When most beings think of Mandalorian alcoholic drinks, it's Mandallian Narcolethe that comes to mind. However, tihaar was a potent, and often colorless spirit, distilled from a variety of fruits, often whatever was available at the time. Many Mandalorians also preferred to partake of a pint of ne'tra gal, a black-colored sweet ale. The Mandalorians also possessed several drinking songs, including Buy'ce gal, buy'ce tal, and Naasad'guur mhi – Mhi n'ulu. In the case of non-alcoholic beverages, shig was a hot drink made from any infusion of herbs or spices much like tea, and was often made from behot, a fast-growing, citrus-flavored herb. The New Mandalorians of Sundari were avid consumers of tea from the Ardees Beverage Company, even offering it to school children during their lunch periods."}, {"tag": "h3", "text": "Society"}, {"tag": "p", "text": "Mandalorians placed little importance on birthplace or citizenship, and so had no official \"state\" as understood by galactic politics. Unlike most cultures where ethnic or racial identity are the defining characterics, Mandalorians do not place much emphasis on species. Mandalorian society was a classical meritocracy, where rank and status meant nothing in comparison to a being's actions and achievements. Mandalorian clans were led by chieftains—usually senior members of the clans chosen for their wisdom—and the loose affiliation and cooperation between them was the closest the Mandalorians had to a standard government; the clans and their chieftains were all subordinate to the Mand'alor, the one individual recognized as sole ruler of the Mandalorians and the nearest Mandalorian parallel for a proper head-of-state. In keeping with their aversion to a centralized government, Mandalorians also had no palaces or offices for their leaders to occupy, and most business on Mandalore was conducted at the Oyu'baat tapcafe in Keldabe, usually over drinks. The society of the New Mandalorians differed from these ideals, in that they employed a more centralized government, a council of ministers overseen by the offices of a Prime Minister and Deputy Prime Minister. While the Mandalorians held a general dislike for a system of hierarchy, and—with the exception of the changes instituted for the Neo-Crusaders by Cassus Fett, and the pacifist New Mandalorians—held no interest in ranks, they were extremely cooperative when in battle. Their signature individuality is set aside in the pursuit of a common goal, and Mandalorians will do anything to achieve that goal. When drawn together as an army, Mandalorians easily settle into an informal command structure, arranging their priorities on outcome rather than personal ambition, and it was this flexibility that contributed to their success as mercenaries."}, {"tag": "p", "text": "Gender meant little in Mandalorian society, and there was scarcely any distinction present in their language. Males and females were on equal footing, although they often took different roles. Mandalorian males were all expected to be warriors, and were responsible for training their sons to be the same. Females were expected to have the same martial skills as males, and were responsible for the training of daughters. They were also expected to be able to cook, and to care for any young children and defend the home if the men were away. But if they had no children dependent on them, females would fight side-by-side with the men on the battlefield and the couple would be expected to share the responsibilities in the home. In accordance with this mentality, the desired Mandalorian female was not so much beautiful or graceful, as physically strong and enduring. In fact, the word laandur, or \"delicate\", was a common insult among Mandalorian women. To imply that a Mandalorian woman was delicate, a poor mother, or a bad fighter, was a sure way to start an unwanted confrontation. When a Mandalorian was down on their luck or in need of a place to stay, it was expected of his neighbors or friends to give them sanctuary and offer them a meal, whether that individual was a common soldier or the Mand'alor himself. This state of mind also extended to businesses, with the Mandalorian corporation MandalMotors freely contributing half of their profits on one occasion, to help in the rebuilding of Mandalore following the Yuuzhan Vong War. It was also common for Mandalorians to offer support to their fellows in a dangerous situation, even if they were not familiar with the individual on a personal level; simply being Mandalorian was the only pre-requisite for assistance."}, {"tag": "p", "text": "Mandalorians were a conservative people, and it was not uncommon for individuals to amass sizable fortunes. While most put their faith in modern banking practices, putting their credits into savings accounts and stock market shares, a large portion is still invested on armor and weapons. Jewelry was rarely worn, though it was to be plain and functional when it was. Even betrothal tokens from Mandalorian suitors were recommended to be easily portable, easily converted into credits in case of emergency, and unimpeding in combat. Any worn rings with gemstones were set in a shallow, rub-over setting so as to be easily worn under gauntlets. Often, Mandalorian jewelry would feature as a heavy belt of precious metal or a collar. Earrings and long chains were avoided, due to the possibility of being caught on something or, in the case of earrings, being violently pulled out. It was said that if an individual were ever to come upon a Mandalorian who was removing their ear piercings, it was a good idea to move away as they are likely about to fight. On the other hand, tattoos were somewhat popular, stretching back to the time of the Mandalorians under Canderous Ordo, who himself possessed a tattoo upon his left shoulder. Baltan Carid possessed a tattoo of a long, violet vine, and it appeared that tattooing one's knuckles was a popular choice, as both Jarkyc and Briika Jeban sported the design during their lifetimes."}, {"tag": "p", "text": "Mandalorian architecture was as varied as the people who built it. Keldabe, the capital of Mandalore, contained buildings of various shapes all constructed in close-quarters and from a variety of materials such as wood, stone, durasteel and granite. Other Mandalorian domains were built in the branches and trunks of trees. Sundari, the New Mandalorian capital city, was constructed inside of an enormous black dome, likely as a means of protection against the harsh conditions of the surrounding desert, and within, New Mandalorian aesthetic favored a cube shape, appearing in both building design and landscaping. The New Mandalorians also constructed several grand cube-shaped cities that dotted the white-sand deserts of Mandalore. Straight roads were a rarity on Mandalore, in order to make it easier to pin down and ambush any foreign invaders. Underground tunnels were also quite common, and entire networks of tunnels would be formed between groups of surface buildings. They made for good places to hide, and secure means of secondary escape should a location come under attack."}, {"tag": "p", "text": "Many Mandalorians were avid fans of bolo-ball, known in their language as meshgeroya or \"the beautiful game\". This love for the sport extended to both spectating—occasionally in a social setting such as a local cantina, or even while in the field—and participating, sometimes played in full armor. Jokingly referred to as \"our other national pastime\" and \"our game\" by members of the culture, Mandalorians of all ages seemed to enjoy the sport. Another Mandalorian favorite was the game of cu'bikad. Unlike meshgeroya, cu'bikad was an indoor game, played using short-handled blades that were stabbed into a checkered game board. Capable of being played by up to at least four players simultaneously, cu'bikad was thought to be unsuited for non-Mandalorians."}, {"tag": "h3", "text": "Family"}, {"tag": "p", "text": "In direct opposition to their infamy as a ruthless enemy, Mandalorians cherish family and shower affection upon those they love and care for. In Mandalorian society, marriage is expected to be life-long and usually takes place shortly after a Mandalorian turns sixteen-years-old. A marriage itself was usually a private ceremony between only the two involved, where the entered into a legal commitment by reciting the following pledge: \"Mhi solus tome, mhi solus dar'tome, mhi me'dinui an, mhi ba'juri verde.\"—translating as \"We are one when together, we are one when parted, we share all, we will raise warriors.\" These vows could be exchanged in person, in a text communication, or over a comlink from anywhere across the galaxy. Though the ceremony itself was private, following the wedding, it was customary to celebrate the new couple's union with drinks and festivities among family and friends. Despite the importance placed on chastity and fidelity prior to marriage in species that practiced such, a partner who acted unfaithfully during a long separation would be forgiven so long as any child that resulted from the indiscretion is raised together by the couple. In certain rare circumstances, such as abandonment or a failure to live up to responsibilities, partners could divorce one another with a declaration that they were shuk'la riduurok, \"a broken love.\" Marriage on Mandalore was not limited by gender; for instance, Goran Beviin and Medrit Vasur were two men who were a married couple."}, {"tag": "p", "text": "Adoption was extremely common in Mandalorian culture, to the point where even adults could be adopted. Because of the Mandalorians' constant connection to war, widows and orphans became an inescapable fact of life and adult males became not only welcome, but necessary. Like marriage, the Mandalorian ritual for adoption was rather simple. Known as the gai bal manda—\"name and soul\"—the adoption is carried out by the adopting parent stating \"ni kyr'tayl gai sa'ad\" to the intended child—\"I know your name as my child.\" In addition to following the Resol'nare, this simple adoption ritual is all that it took to make an individual a Mandalorian. Adoption of war orphans was quite common, even children of a defeated enemy whereas other species might kill them. Examples of this tradition include Jango Fett being taken in by Jaster Mereel, and Kal Skirata adopting the Null ARC troopers and the commandos of Omega Squad just as he had been adopted by his father, Munin. To Mandalorians, there was no difference between a biological child or one who was adopted. Although the Mandalorian custom of adoption has done away with specific ethnic types, the tendency for adoption had accidentally formed a population of family-oriented warriors by reinforcing those common genes with those desired characteristics of beings they take in, with the instinct the be a protective parent especially strong."}, {"tag": "p", "text": "However a couple chooses to have children, they are an integral part of Mandalorian families. When naturally conceiving, if the first born is a son, parents will typically wait until the boy's eighth birthday before having another child so that by that point the boy will be old enough to accompany his father and begin his five years of military and survival training until the age of thirteen. If the first born is instead a girl, the couple will often try for a son soon after. While girls tended to stay with their mothers until marriage, a family with only daughters will train them in the same manner as they would a son. Both girls and boys learn their earliest lessons from their mother, meaning that her own fighting prowess is critical; the pledge to raise warriors in the Mandalorian marriage vow is a joint commitment. It was the job of a parent to prepare their children to train the next generation of Mandalorians. Elders educated Mandalorian children with the Mandalorian ideals of loyalty to clan, discipline, courage, and respect for their heritage. At the age of thirteen, children of both genders face the rite of passage known as the verd'goten, where their skills are tested and they are declared adults in Mandalorian society. Family bonds were a large part of the Mandalorian culture, and as a result, they felt more comfortable around each other than they did around outsiders, or aruetiise. Though there were thousands of Mandalorian families or clans, some of the more prominent included Clans Fett, Skirata, Ordo, Bralor, Beviin, Vevut, and Vizsla."}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "The thing most often associated with the Mandalorians was their armor. In Mando'a, it was known as beskar'gam, or \"iron skin\", a show of just how central it was to a Mandalorian's life. Armor was greatly valued, especially if made from the near indestructible metal beskar, and was often passed down through generations. Aside from its defensive capabilities, armor served another function: in a group formed from so many different species, often times it was only the armor that displayed an outward sign of the culture that bound these individuals together. The paint scheme of a Mandalorian's armor occasionally represented a soldier's state of mind, or their personal mission. For instance, sand-gold represented a quest for vengeance, while black indicated a desire for justice. This was not always the case, however, and Mandalorians would sometimes decorate their armor in colors they simply held a preference for; blue and green were common choices. Whereas many soldiers preferred the inconspicuousness afforded by camouflage, Mandalorians believed in the saying, \"It's one thing to see us coming, it's another to do something about it.\""}, {"tag": "h3", "text": "Language"}, {"tag": "p", "text": "As was the case with many defined cultures, the Mandalorians had a language distinct from Basic, known as Mando'a. The origins of the language were unclear, possibly drawing roots from the ancient Taung dialects, though it possessed aspects not found in other galactic languages. Mando'a was not all that complex and was easy to learn, a great benefit to a group that often took in adults from other races. Although this was their main language, the Mandalorians were often acquainted with several others, including Huttese and Basic, and more that had been picked up while fighting on countless planets. In spite of this influence from other languages, Mandalorians preferred to draw new words for outside concepts from Mando'a's inherently flexibly vocabulary; the Mandalorian term for \"Sith\" was dar'jetii, translating as \"no longer a Jedi\". The Mandalorians also had no word for \"hero\", believing that being ready to die for your loved ones and your beliefs was required for a Mandalorian and not worth a separate word, though the word for coward, or hut'uun, was derived from the Mandalorian distaste for Hutts. The term aruetiise is used to refer to non Mandalorian and is perceived as a term of distaste. Mandalorians also referred to their family with the first two or three letters of their name followed by the \"ika\". This was similar for children referring to their fathers, with the two or three first letters of the fathers name followed by \"Buir\"."}, {"tag": "h3", "text": "Religion"}, {"tag": "p", "text": "The ancient Taung waged war for their gods before deifying war itself. But as time went on, the Mandalorians became disillusioned with the fanatic worship of war and developed a much less zealous system of beliefs. These more pragmatic warriors looked for a philosophical meaning to be gleaned from myths such as the Akaanati'kar'oya, or \"War of Life and Death\", and the stories of the stars representing fallen Mandalorian leaders, rather than interpreting them literally. Most Mandalorians now believed in the manda, a collective state of being Mandalorian best described as an oversoul. To be a part of the manda after death, a Mandalorian must understand their culture and act in a way that embodies the ideals of the Mandalorian kar'ta, a term that usually means \"heart\", but also stands for \"soul\". A person ignorant of their heritage or one who denies it, was considered dar'manda, or soulless, and has no place in the Mandalorian afterlife."}, {"tag": "h3", "text": "Mercenaries"}, {"tag": "p", "text": "With the devastating end to the Mandalorian Wars, the Mandalorians were left without a leader and their Neo-Crusader army fragmented. While some Mandalorians returned home to the Mandalore sector, a number of embittered others turned to ruthless mercenary work. Informally known as the \"Mandalorian Mercs\", these Mandalorian soldiers sold their services to individuals and factions alike, working for whoever could offer the most money. This mercenary tradition would last for thousands of years, over which there would be several attempts to reunite the clans into a single army by the likes of Mandalore the Preserver or Mandalore the Lesser. As time went on, the ethics of these mercenaries steadily declined until the time when Jaster Mereel ascended to the position of Mand'alor. A man of strong morals, Mereel reformed the Mandalorian clans and instituted the Supercommando Codex, a set of rules that would turn the Mandalorians away from savage raiders and into highly paid soldiers who conducted themselves as honorable mercenaries. Though this would eventually lead to the formation of the Death Watch and the outbreak of the Mandalorian Civil War, Mereel reforms would have a lasting impact on the Mandalorians, defining the way Mandalorian mercenaries would act for decades to come."}, {"tag": "p", "text": "Most Mandalorian mercenaries acted independently, although during his reign as Mand'alor, Jaster Mereel would lead his True Mandalorians as a mercenary army when not battling the Death Watch. Also, the Mandalorian Protectors acted as a mercenary army after Boba Fett assumed leadership of the Mandalorians. Fett, a bounty hunter himself, overturned former Mand'alor Fenn Shysa's idea that the Protectors be a force for the defense of Mandalore."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Many of the Mandalorians on Dxun (in Star Wars: Knights of the Old Republic II: The Sith Lords) speak with a New Zealand accent, following Temuera Morrison, who played Jango Fett. By the same token, Boba Fett and all the Mandalorian characters in Star Wars: Legacy of the Force novels' audio adaptations are given approximate New Zealand accents by reader Marc Thompson."}, {"tag": "p", "text": "Mandalorians have an idiosyncratic culture and were the first species/people in Star Wars to have their own fully-constructed language. Most of those elements were created and developed by Karen Traviss. Their idiomatic character and culture have their own fan following called Fandalorians."}, {"tag": "p", "text": "The Mandalorian warrior culture is based of the ancient Celts, as said by Karen Traviss on the FAQ part of her web site."}, {"tag": "p", "text": "Boba Fett—the first named Mandalorian—was not going to be a Mandalorian at all, but simply wear the armor. This idea might have been adapted with Jodo Kast."}, {"tag": "p", "text": "In the Star Wars Episode V: The Empire Strikes Back novelization, the Mandalorians are referred to as \"a group of evil warriors defeated by the Jedi Knights during the Clone Wars.\" This discrepancy was later retconned with the explanation that, although many Mandalorians were killed, they were not completely destroyed, nor did the massacre occur during the Clone Wars, but rather, a decade previously."}, {"tag": "p", "text": "When writing his X-Wing novels and comics in 1996, author Michael A. Stackpole was interested in involving the Mandalorians in one of the series. The idea was vetoed by Lucasfilm Ltd., however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}