{"url": "Mandalorian_(writing_system)/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Alphabets", "Category:Mandalorian culture", "Category:Writing systems"], "nodes": [{"tag": "h1", "text": "Mandalorian  (writing system)"}, {"tag": "p", "text": "The Mandalorian writing system consisted of twenty-six characters and was used to provide a written analog to the spoken Mando'a. Despite there being no F, X, or Z equivalents in the verbal Mando'a, these letters were included in the written alphabet for greater ease in transliterating foreign words. Mando'a also allowed for use of a base 10 number system with numbers denoted 0 through 9."}, {"tag": "h2", "text": "Traditional Mandalorian use"}, {"tag": "p", "text": "Traditional Mandalorian groups, such as the True Mandalorians, used Mando'a  to record and display written information on personal datapads and ship-board display screens. They also painted sigils on their helmets to signify status or condition. The Mando'a.  characters for M and S were often painted to identify Mandalorians suffering mir'shupur (brain damage). This served to inform other Mandos of their condition and also as a form of battle commendation."}, {"tag": "p", "text": "Jango Fett relied heavily upon written Mando'a to display relevant information on his ship-board displays."}, {"tag": "p", "text": "Use of Mando'a in this form was continued by traditional Mandalorian groups such as the Mandalorian Protectors."}, {"tag": "h2", "text": "New Mandalorian use"}, {"tag": "p", "text": "The New Mandalorians used written Mando'a frequently in their everyday lives, particularly for scientific applications. However, they relied little on Mando'a, if at all, to communicate amongst themselves and as such, instances of written Mando'a by the New Mandalorians could often be translated directly into Basic. There were a few differences in the script used by the New Mandalorians as opposed to that used by traditional Mandalorians such as Jango Fett. New Mando'a numerology also differed from that used by traditional Mandalorians. New Mandalorians used Aurebesh numerals to denote the numbers 0 through 9."}, {"tag": "p", "text": "The Mandalorian Secret Service displayed Aurebesh numerals on their riot shields while displaying a crest on their left shoulder that read In Defense of Mandalore. The phrase, while written using the Mando'a alphabet, was not in Mando'a; instead it was able to be directly translated into Basic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Prior to 2002, a typeface consisting of narrow vertical characters was developed to represent the written form of the Mandalorian language. It was developed by Philip Metschan at the request of George Lucas to be used throughout Star Wars: Episode II Attack of the Clones. This typeface, erroneously named \"Mandelorian\" by Metschan, was created in conjunction with the further development of Joe Johnston's Star Wars '76 (originally developed during the Original trilogy) as well as a Geonosian typeface that can be seen woven into the Geonosian Death Star plans and display screens throughout the movie. Metschan's typeface is often seen as using the same character for \"C\" & \"U\". This is not the case and upon closer inspection it can be seen that there is a subtle difference between these two characters."}, {"tag": "p", "text": "A common misconception is that the written form of Mando'a was developed by Karen Traviss and Jesse Harlin for the Star Wars: Republic Commando multimedia project. While they did develop the Mando'a spoken language and its associated grammatical rules, they are not responsible for its original written visual depiction. Karen Traviss often credits a 23-letter alphabet to Jesse Harlin. However, at the time, it is highly likely that he was simply working from an incomplete version of Metschan's typeface licensed to them by Lucasfilm. The 23-letter alphabet may in fact be Ancient Mandalorian as named by Jesse Harlin. The absence of 3 characters supports that Ancient Mandalorian was utilized \"in-universe\" prior to the need for the current 26-letter Mandalorian alphabet."}, {"tag": "p", "text": "The typeface was originally featured on displays within Jango Fett's Slave I and is now used throughout Star Wars: The Clone Wars to denote instances of written Mandalorian."}, {"tag": "p", "text": "For the 2004 Original Trilogy DVD release, artist Van Ling incorporated the Mandalorian typeface into a number of transitional screens within the DVD's menu system."}, {"tag": "p", "text": "Many fan-made typefaces have been created and distributed via the internet throughout the years, inconsistently varying and containing numerous fan-made characters. None of the freely available typefaces accurately represent the original \"Mandelorian\" typeface available on Philip Metschan's website that was officially used throughout Star Wars Episode II: Attack of the Clones. When compared to the official version of the Mandalorian alphabet, common characters that are often incorrectly depicted (allowing fan-made fonts to be identified) include the letters \"C\", \"M\", \"N\", \"P\", \"Q\", \"V\", \"X\" & \"Z\"."}, {"tag": "p", "text": "The Star Wars Insider 117 article, \"The Duchess and the Jedi\", has further compounded the issue by erroneously using a fan-made font instead of Philip Metschan's typeface used in Star Wars: Attack Of The Clones. The publishers at Insider have in fact used one of the oldest and most widely known fan-made fonts by Erik Schroeder (alias Erikstormtrooper.com). Erik has developed two fan-made fonts based upon his own research: Version 1 - Mandalor_old & the updated Version 2 - Mandalor. The telltale sign that the older fan-made font has been used in Issue 117 are the letters \"M\" & \"C\". They match those developed by Erik exactly. Erik himself has noted that the original characters were incorrect and had subsequently updated them for version 2 of his font. Even more telling is that Erik's character \"C\" is entirely his own design and does not appear in any other official media. While closer to Metschan's work, Erik's version 2 font is still not 100% screen accurate as seen by the letter \"C\" and the numerals \"1\", \"2\" & \"0\" when compared to Philip Metschan's official type-face. Why the publishers of Star Wars Insider have chosen to use an old fan-made font instead of the officially licensed font by Metschan is unknown."}, {"tag": "p", "text": "In the Star Wars: The Clone Wars episode, The Academy, the Mandalorian Secret Service crest reads \"In Defense of Mandalore\". Curiously in this version, the letter \"M\" differs from that developed by Metschan for the Slave I display screens in Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "The differing scripts used throughout Star Wars: The Clone Wars may be the written form of Concordian, however, as this particular script is still translatable directly into basic it is more likely that it is simply a new iteration of Mandalorian adopted by the New Mandalorians and revived Death Watch. This has yet to be confirmed in an official source."}, {"tag": "p", "text": "The Mandalorian inscriptions on page 25 and 26 of Star Wars Insider #86 translate as \"Jango Fett lost his head\" and \"akod oya akod oya akod oya\" respectively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}