{"url": "Mandalorian_Civil_War", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of the Mandalorian Civil War", "Category:Civil wars", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Mandalorian Civil War"}, {"tag": "p", "text": "The Mandalorian Civil War, also known as the Great Clan Wars, was a conflict fought between the New Mandalorian peace movement and martial traditionalists for control of the Mandalorian homeworld of Mandalore around the year 42 BBY. The New Mandalorians won the war and Duchess Satine Kryze became leader of Mandalore, while the surviving traditionalists were exiled to the planet's moon of Concordia."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The planet Mandalore, homeworld of the Mandalorian people, was once a lush, verdant world. However, centuries of war against enemies internal and external eventually reduced its surface to a featureless desert. Survivors relocated to scattered settlements built around what few remaining sources of potable water remained on Mandalore or retreated to the planet's moon of Concordia, which was also capable of supporting life. Food exports from Concordia helped keep many of those still living on Mandalore alive. The city of Sundari rose up from the desert beneath a massive bio-dome and birthed the New Mandalorians, a peace movement that sought to channel the energies and inventiveness of the Mandalorian people into rebuilding their society along peaceful, creative lines. They realized that mercenary expertise in warfare had brought no lasting benefits to the majority of Mandalorians and gradually grew in strength to eventually challenge Mandalore's minority of martial traditionalists, who used violence to hold on to power by the time Duchess Satine Kryze led the movement. Around the year 42 BBY, civil war broke out between the two groups for control of Mandalore. This conflict was referred to as the Mandalorian Civil War, and alternatively as the Great Clan Wars."}, {"tag": "h2", "text": "The war"}, {"tag": "p", "text": "During the war, Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, spent a year on Mandalore to protect Kryze from the traditionalists, who sent bounty hunters after the trio and forced them to live on the run. Their time together led Kryze and Kenobi to fall in love. Mandalore's already-damaged surface was decimated and the planet's capital of Keldabe was devastated by the fighting."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The death toll during the war became a primary reason for why Kryze was averse to violence, a pacifist belief she held for the rest of her life. At the end of the war, Kenobi chose to return to the Jedi Order, though he would have left had Kryze asked him to. The duchess returned and set about rebuilding Mandalore herself and ruled over Mandalore up to the Clone Wars twenty years later. The surviving traditionalists were exiled to Concordia, where they turned on each other in a pointless battle for dominance and were believed to have died out. Meanwhile, Mandalore was rebuilt and thrived under the leadership of the New Mandalorians, who moved the planet's capital to Sundari, their center of influence. A monument to those who died on all sides of the war was built in the city's Peace Park. Retaining governance of Concordia, Mandalore became an active participant in the senate of the Galactic Republic while remaining neutral throughout the Clone Wars. However, the traditionalists quietly regrouped under the leadership of Pre Vizsla, governor of Concordia, and formed into the Death Watch. An underground splinter group that sought to return their people to the \"glories\" of their martial pasts by usurping the New Mandalorians, they had sympathizers seeded at all levels of Mandalorian society."}, {"tag": "p", "text": "Violence ultimately gripped Mandalore once again when Death Watch made itself known by allying itself with Sith Lord Count Dooku and the Confederacy of Independent Systems during the Clone Wars. After a falling out with Dooku, Death Watch then entered an alliance with Darth Maul and the Shadow Collective to usurp from the pacifist New Mandalorian government. Kryze was then killed by Darth Maul during the ensuing conflict, bringing an end to her pacifist rule and bringing forth another civil war. Subsequently, the Galactic Republic laid siege to Mandalore to capture Maul and during that time, Bo-Katan Kryze became Lady of House Kryze and Mandalore's Regent. She, however, was removed by the Galactic Empire when she refused to obey them during their occupation of Mandalore and was replaced by Gar Saxon, who acted as Viceroy and the Emperor's Hand on Mandalore. Seventeen years later, a third civil war began between the Imperial-backed Clan Saxon and Rebel Alliance-backed Clan Wren which erupted in a larger scale with Bo-Katan creating the Mandalorian resistance and taking the title of Mand'alor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The civil war on Mandalore was first referenced in \"Voyage of Temptation,\" a second season episode of the Star Wars: The Clone Wars television series."}, {"tag": "p", "text": "The Episode Gallery on StarWars.com references the threat of the insurgents and the civil war as two separate events. The guide does say Qui-Gon Jinn and Obi-Wan Kenobi protected Satine Kryze from insurgents, but it states that she returned after \"a\" civil war."}, {"tag": "p", "text": "The 2015 reference guide Ultimate Star Wars identified the conflict as the Mandalorian Civil War. In doing so, the authors utilized an event that, in the Star Wars Legends continuity, served as a separate conflict from the Great Clan Wars, the event during which Obi-Wan Kenobi and Satine Kryze first met and fell in love."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}