{"url": "Mandalorian_Civil_War_(True_Mandalorians)", "categories": ["Category:Legends articles", "Category:Battles of the Mandalorian Civil War", "Category:Civil wars", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Mandalorian Civil War  (True Mandalorians)"}, {"tag": "p", "text": "The Mandalorian Civil War was a conflict that erupted prior to the Clone Wars, following a schism in the Mandalorian clans that stemmed from a fundamental difference in ideology over the Mandalorians' place in the greater galaxy. Fought between Mand'alor Jaster Mereel's True Mandalorians, who believed that the Mandalorians should act as honorable mercenaries, and Tor Vizsla's splinter group known as Death Watch, which advocated that the Mandalorians return to their savage roots as raiders and brigands, the war lasted over a decade with victories and losses on both sides. Jaster Mereel would fall on Korda Six as a result of a comrade's betrayal, while Jango Fett succeeded him as the new Mand'alor and leader of the True Mandalorians until the devastating defeat at the Battle of Galidraan against the Jedi Order. There, a Death Watch scheme unfolded that brought a contingent of Jedi Knights led by Master Dooku to the planet under the false pretenses that the True Mandalorians were murdering civilians. When the Jedi attempted to take them into custody, fighting broke out that left eleven Jedi and every True Mandalorian on Galidraan dead, save for Jango Fett."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Division"}, {"tag": "p", "text": "In the year 60 BBY, a charismatic Mandalorian warrior by the name of Jaster Mereel ascended to the role of Mand'alor, leader of all the Mandalorian clans. In this role, he began to institute a cultural reform that many had been calling for since the Ithullan genocide nearly a century and a half earlier, eventually laying out a new guideline for Mandalorian behavior known as the Supercommando Codex. He asserted that the Mandalorians who wished to fight would simply be highly-paid soldiers, and should conduct themselves as honorable mercenaries."}, {"tag": "p", "text": "However, not all would agree with the Codex or Mereel's reforms. The New Mandalorians—a reformist political faction in existence following the aftermath of a devastating conflict with the Galactic Republic approximately 678 years earlier—operated under a separate government out of their capital city Sundari, and believed in pacifism and non-violence above all. More dangerously, though, were the followers of the barbaric Mandalorian soldier Tor Vizsla, who dreamed of a goal opposite of the New Mandalorians: a return to the ways of the ancient Mandalorians as raiders and conquerors, aiming to eventually wage a second war of conquest across the galaxy. Skilled but undisciplined, these soldiers rallied to Vizsla and formed a splinter group that came to call itself the Death Watch. The supercommandos loyal to Jaster Mereel recast themselves as the \"True Mandalorians\" and war soon broke out between the two factions."}, {"tag": "h3", "text": "Early days of war"}, {"tag": "p", "text": "One of the war's earliest battles occurred on the Outer Rim agricultural world, Concord Dawn. In 58 BBY, fighting broke out between the Death Watch and the True Mandalorians not far from the farm belonging to the local Fett family. After a firefight that turned in favor of the Death Watch, Jaster Mereel and his men fled into the fields of the Fett farm. While the farm's owner offered the Mandalorians refuge, a vengeful Tor Vizsla tracked Mereel through the fields where he came upon the farmer's son, Jango Fett. Using the boy as leverage, Vizsla demanded the location of the True Mandalorians from his father, brutally beating the man when he refused to give up Mereel. When Vizsla threatened to kill the elder Fett in front of his son, Fett's wife attempted to save her husband, shooting and killing one of Vizsla's men with a blaster rifle. The Death Watch struck back and in the fighting, both of young Jango's parents were killed, although Mereel and his troops were able to intervene and save Jango's life before retreating back into the field of crops. Vizsla ordered the fields be burned, attempting to kill Mereel as he ran, but as the fire spread all around them, Jango showed the True Mandalorians to an irrigation tube that led them to safety. His family gone—his parents dead and his sister, Arla, taken captive—Jango chose to join the Mandalorians."}, {"tag": "p", "text": "The Death Watch moved into a nearby town following their perceived victory over the True Mandalorians, intent on a celebratory raid before moving on to Moonus Mandel. However, the True Mandalorians had regrouped in the town with the intent of staging a retaliatory strike. When Vizsla and his men arrived with their armored speeder, Mereel's second-in-command Montross opened fire from a second-story window while the other True Mandalorians struck from protected alleys. Death Watch soldiers fell to blasterfire, while others died when Jango placed a bomb on the underside of their speeder. While the True Mandalorians attempted to finish off their Death Watch foes, Jango confronted the man who'd murdered his parents, shooting him and avenging his dead mother and father. Nearly all of the Death Watch soldiers were killed in the firefight, although Tor Vizsla managed to somehow escape. As the True Mandalorians prepared to leave the planet, Jango was taken in by Mereel, who raised the boy as he would his own son."}, {"tag": "h3", "text": "Return of the Death Watch"}, {"tag": "p", "text": "Despite Vizsla's escape, the True Mandalorians believed the Death Watch threat to be over in the wake of the events on Concord Dawn. Years later in 52 BBY, the Death Watch would prove to still be very much active when they lured the True Mandalorians into a trap on the planet Korda Six. Hired by the Korda Defense Force, the True Mandalorians journeyed to Korda Six to extract a team of rookie security personnel pinned down under fire by a group of local hostiles, supposedly poorly armed and with no formal army. When they arrived on the planet in several Meteor-class drop ships, they found that the intelligence reports were grossly mistaken and were overwhelmed by superior Kordan forces even before the Death Watch revealed themselves. As Mereel gave the order to retreat, the Death Watch soldiers sprung their trap, attacking Jango Fett—now fourteen years old, and an adult in Mandalorian culture—and the squad under his command, while Jaster Mereel and Montross came under attack from Vizsla himself. Mereel was wounded in a grenade blast that Montross used his jetpack to avoid, but when the injured Mand'alor called to him for an air lift, Montross turned his back on Mereel and left him to die on the battlefield, stating that he no longer wished to take orders from Mereel. Betrayed and abandoned, Mereel was helpless to defend himself and perished as Vizsla rained down laser cannon fire from his four-wheeled tank."}, {"tag": "p", "text": "With Mereel dead, Montross returned to the True Mandalorians' landing zone and urged them to heed the Mand'alor's final orders and pull out, producing the false claim that not only was Mereel was dead, but that Jango had fallen trying to save him. However, Fett returned to the landing zone carrying with him Jaster Mereel's body, exposing Montross as a liar and a traitor. When Montross insisted that Mereel would have wanted him to take command, the other Mandalorians denounced Montross at blaster point and declared that they would only follow Jango, Jaster Mereel's chosen heir. Montross was grudgingly allowed to leave, slipping off into exile, while Jango became the new Mand'alor and leader of the True Mandalorians."}, {"tag": "h3", "text": "War's end"}, {"tag": "p", "text": "In the years that followed the Battle of Korda Six and those leading up to 44 BBY, the True Mandalorians scored a significant victory that left the Death Watch severely crippled. But rather than concede defeat, Vizsla turned to the Governor of Galidraan for refuge and his assistance in rebuilding the Death Watch. As per Vizsla's plan, the governor contracted the True Mandalorians to put down a local insurrection. The True Mandalorians traveled to Galidraan where they dealt with the rebels, and upon completion of their task, Jango went to the governor's estate to collect their payment; Jango had also become aware of the governor's involvement with the Death Watch and while there, demanded to know the whereabouts of Vizsla. At that moment, Vizsla revealed himself there in the castle and attacked Jango with a cadre of Death Watch soldiers, forcing him to flee through a large window. By that time, however, the governor had already contacted the Jedi Council with a request for aid, claiming that the Mandalorians were murdering \"political activists\" along with innocent women and children. In response to the governor's concerns over the lack of evidence, Vizsla assured him that his own men would supply the necessary body count."}, {"tag": "p", "text": "Jango rushed to make it back to the True Mandalorians' base camp, desperately trying without success to comm his second-in-command, Myles, and warn him of the inbound Jedi ships he'd spotted, but he arrived at the same time as a Jedi strike team lead by Jedi Master Dooku. The Jedi had taken Galidraan's governor at his word and ordered the True Mandalorians to surrender on charges of suspected murder, with Dooku's Padawan Komari Vosa adding that should they resist, they would be killed. Innocent of the charges and indignant toward the Jedi, Jango ordered his troops to open fire, even giving specific orders to target Vosa. Their blasters quickly proved ineffective against the Jedi's lightsabers and Jango called for the use of projectiles instead, and the provision of air cover via jetpacks. Myles attempted to provide air support for the group, but was killed in midair by one of the Jedi while Jango could only watch. During the battle, Jango personally killed six Jedi—including the one responsible for Myles' death—with no weapon beyond his own hands, feet, and armored body. But his actions were not enough to turn the tide: eleven Jedi lay dead at the battle's end, but Silas & Jango were the only True Mandalorian soldier there to survive the battle. Jango was finally subdued by the Jedi and delivered into the custody of Galidraan's governor, only to be stripped of his armor and sold into slavery by the planet's ruler."}, {"tag": "p", "text": "After several years spent aboard a spice transport in bound servitude, Jango managed to escape, recover his Mandalorian armor from the Governor of Galidraan, and track Vizsla's ship to Corellia where he killed Vizsla after a lengthy fight, avenging the True Mandalorians and dealing the final blow of the war. Those Death Watch members that still remained scattered, disappearing from the galaxy at large until the Clone Wars where, now that the True Mandalorians were gone and Jango Fett dead, they turned their attention on the pacifistic New Mandalorians."}, {"tag": "h2", "text": "Legacy and impact"}, {"tag": "p", "text": "The Mandalorian Civil War had been fought over ideology, how the Mandalorians would conduct themselves in the future, and poeticized by some as a battle for the very heart of the Mandalorians. Although the Death Watch succeeded in destroying their True Mandalorian foes, Jaster Mereel's Supercommando Codex would live on under his adopted son Jango's reign as Mand'alor and for generations after. In spite of its philosophical and ideological importance, the war had been fought between two relatively small factions, in what was seen by some as little more than a common power struggle. Mandalore's full-time army had been swallowed by the conflict, along with several prominent clans, but it had barely touched Mandalorians living off-world, even those in the Mandalore sector."}, {"tag": "p", "text": "After the war, Jango Fett, scarred both by the loss of his True Mandalorian compatriots and his years as a slave, grew distant from the rest of his people and his role as Mand'alor, turning instead toward the solitary life of a bounty hunter until his death at the First Battle of Geonosis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}