{"url": "Mandalorian_Royal_Guard", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Mandalorian organizations", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "Mandalorian Royal Guard"}, {"tag": "p", "text": "The Mandalorian Royal Guard was a group of Mandalorians charged with the protection of Duchess Satine Kryze. They were Mandalorian fighters trained to show restraint in most situations, but could remain a formidable fighting force. The Royal Guard wielded force staffs capable of blocking blaster fire which they used against enemies and heavy armor, a gorget, and an elaborate helmet to protect their body. This armor and the uniform associated with it represented Mandalore's traditions of gallantry and discipline, while simultaneously rejecting the bloody and violent past of the warrior clans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This unit of bodyguards were operating by the years of the Clone Wars where they served in the New Mandalorians government and served as protectors of Duchess Satine. They were present aboard the Coronet during an attempt to kidnap the Duchess. With the help of Jedi Knight Anakin Skywalker, they managed to defeat the Separatist battle droids that boarded the ship. Following this incident, at least three members of the guard were with the Duchess during her visit to Coruscant. Whilst there, these guards protected Satine when the Death Watch sabotaged the navigation system of her airspeeder. The guardsmen managed to jump out of the airspeeder and take the Duchess to safety when the craft crashed into a building."}, {"tag": "p", "text": "Afterwards, they were present as part of an honor guard detachment where they received Senator Padmé Amidala who arrived on Mandalore to meet with Duchess Satine. The Royal Guard later escorted the pair as they entered into the capital of Sundari. When a number of children around Mandalore began to suffer from signs of poisoning, all signs pointed to contaminated tea that was arriving on the planet. After seeing her government failing to stop the outbreak, Satine along with Amidala called upon the Royal Guard to help in the investigation of this matter where they uncovered a black market operation run by Moogans who had bribed corrupted dock workers to allow the shipments to continue. When they discovered the warehouse storing the poisoned tea, the Royal Guard came under fire from the smugglers, resulting in two being killed. However, a few moments later the Guard managed to defeat the smugglers due to the aid of the Naboo Senator's help."}, {"tag": "p", "text": "Numerous members of the Royal Guard watching over Satine were later murdered and the Duchess arrested on charges of treason by Prime Minister Almec, who was after her nephew Korkie and his classmates, who witnessed him arranging black market deals with smugglers. After Almec was subdued, Satine called in the surviving Royal Guard members to arrest Almec and the corrupt policemen of the Mandalorian Secret Service."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Satine's guards were a based on a Sith concept by Iain McCaig for Star Wars: Episode I The Phantom Menace. Satine herself was also based on a McCaig concept for Queen Amidala."}, {"tag": "p", "text": "The Encyclopedia hosted on StarWars.com provides an informational entry for the Mandalorian Guard. Oddly, the Encyclopedia entry mistakenly makes reference to both the policing Mandalorian Guard and the Mandalorian Royal Guard, tasked with protecting Duchess Satine, as though they were interchangeable. In fact, despite picturing the Mandalorian Guard, the Encyclopedia links incorrectly to the Wookieepedia article for the Mandalorian Royal Guard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}