{"url": "Mandalorian_heavy_blaster", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Heavy blaster pistols", "Category:Mandalorian weapons"], "nodes": [{"tag": "h1", "text": "Mandalorian heavy blaster"}, {"tag": "p", "text": "An improvement by the Mandalorians upon standard heavy blaster pistol designs, the Mandalorian heavy blaster was a weapon in use during the latter years of the Old Sith Wars. The mercenary Calo Nord used a pair of the blasters, and examples of the weapon were available for purchase from Czerka merchant Greeta Holda and Mandalorian quartermaster Kex on the planet Tatooine and the moon of Dxun, respectively."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Mandalorian heavy blaster was an improvement over the standard heavy blaster pistol design. A major refinement made by its Mandalorian creators was that the weapon could fully accommodate aftermarket upgrades. The blaster dealt slightly more energy damage than the standard design, although it had a similar range. Mandalorians claimed that the blaster was capable of crippling a starship with a single shot, but this assertion became widely known as an exaggeration. The blaster was colored blue and gray while shots fired were red in color."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Created by the nomadic Mandalorians, the eponymous heavy blaster was in use during the years leading up to the conclusion of the Old Sith Wars. The mercenary Calo Nord used a modified pair of the blasters when he ambushed the then–Jedi Padawan Revan on the planet Tatooine in the year 3956 BBY. However, Nord and his companions were killed by Revan in the resulting fight. At the same time, in the town of Anchorhead, Czerka Corporation storekeeper Greeta Holda retailed a Mandalorian heavy blaster for 2,000. Five years later, another heavy blaster was sold by Kex, a Mandalorian quartermaster on the moon of Dxun, for the sum of 5,000."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mandalorian heavy blaster first appeared in the 2003 video game, Star Wars: Knights of the Old Republic, and appeared again in its 2005 sequel, Star Wars: Knights of the Old Republic II: The Sith Lords. The blaster also received entries in the Prima Games strategy guides for both games. Due to the close-range combat system used in the games, the weapon had a maximum firing range of twenty-three meters, which was the same as the games' other heavy blaster pistols. The attack modifier granted by the weapon is reduced between the two games, but no other game mechanic regarding the blaster changes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}