{"url": "Mandalorian_marauder", "categories": ["Category:Legends articles", "Category:Mandalorian titles", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Mandalorian marauder"}, {"tag": "p", "text": "Mandalorian marauder was a title and position held by members of the Mandalorian Neo-Crusaders. These lethal warriors wore Neo-Crusader armor and wielded deadly dire vibroblades, focusing on stealthy combat to engage and terrify their foes. Whether through skill or with the aid of a stealth field generator, Mandalorian marauders were often invisible to the targets they stalked, assassinating lone targets with trained precision."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mandalorian marauders were specialized warriors within the ranks of the Mandalorian Neo-Crusaders. They focused upon stealth tactics, and preferred one-on-one engagements, stalking and isolating targets they could then silently eliminate. Most Mandalorian marauders relied on their skill, alone, though some would occasionally make use of stealth field generators to operate unseen even during the day."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mandalorian marauders were a part of the Mandalorian Neo-Crusader army, serving under Mandalore the Ultimate as he opposed the Galactic Republic and attempted to conquer the known galaxy during the Mandalorian Wars. Dispatched to hunt down and assassinate singular targets, Mandalorian marauders earned a terrifying reputation. Their tradition as hunters lived on for millennia, and the later Mandalorians' affinity for working as bounty hunters was seen by some as the legacy of the marauders."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Mandalorian marauders were outfitted in the armor of the Mandalorian Neo-Crusader faction, adorned with the red color scheme assigned to Mandalorian Rally Masters. Marauders were armed with dire vibroblades and heavy blaster pistols, and were equipped with a utility belt. Mandalorian marauders were also known to use stealth field generators to operate under a cloak of invisibility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mandalorian marauders first entered Star Wars canon with the release of the Knights of the Old Republic line of Star Wars Miniatures."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}