{"url": "Mandalorian_religion", "categories": ["Category:Legends articles", "Category:Mandalorian culture", "Category:Religions"], "nodes": [{"tag": "h1", "text": "Mandalorian religion"}, {"tag": "p", "text": "The Mandalorian religion was the accumulated spiritual and mythological beliefs of the Mandalorian warrior culture. Like the Mandalorians themselves, their religion saw numerous changes throughout the course of history, with several concepts evolving or falling out of popular practice over time. The ancient Mandalorians and the culture's Taung founders were intensely devout in their beliefs, forming a deeply religious society. Creation myths such as the Akaanati'kar'oya—the \"War of Life and Death\"—were viewed literally, and ritual combat was waged in worship of Kad Ha'rangir the destroyer god, who the Mandalorians believed represented change and was opposed by Arasuum, the stagnant sloth-god. This obsession with battle reached its pinnacle when the Mandalorians came to deify war itself, and believed that to wage war was to be divine."}, {"tag": "p", "text": "However, this zealotry did not last. Over time, the Mandalorians grew disillusioned with their former fanaticism and war-worshiping ways. Mandalorian beliefs became more secular and pragmatic: their ancient myths of warring gods, and stories portraying the fallen rulers of Mandalore as the nighttime stars, were viewed as philosophical parables. Modern Mandalorians sought to derive allegorical insight from these tales rather than fact, as their ancestors did. The belief in a literal afterlife waned in favor of a belief in the manda, a collective oversoul described as the very essence of being Mandalorian. A Mandalorian ignorant of their heritage and culture was considered to be dar'manda—soulless—and would have no place in the manda after death; to be dar'manda was considered a terrible fate by Mandalorians, and a great importance was placed upon knowing and living their culture as defined by the Resol'nare, the culture's six tenets."}, {"tag": "h2", "text": "Beliefs"}, {"tag": "h3", "text": "Foundations of the faith"}, {"tag": "p", "text": "The ancient founders of the Mandalorian culture, the Taung, formed a religious warrior society governed by elaborate laws that evolved into the Canons of Honor. They believed in the creation story of the Akaanati'kar'oya—the \"War of Life and Death\"—and attributed the stars shining in the night sky, the Ka'ra, to the fallen rulers of the planet Mandalore. These early Mandalorians believed in a pantheon of deities including Hod Ha'ran, a trickster god viewed as an agent of the fickle nature of fortune. The one they truly worshiped, however, was the destroyer god Kad Ha'rangir, who represented the opportunity for change and growth that destruction provided, in opposition to the sloth-god Arasuum, who stood against Kad Ha'rangir as an avatar of stagnation. The Mandalorians engaged in ritual combat in Kad Ha'rangir's name to win favor with their god, defying the temptations of idle consumption offered by Arasuum."}, {"tag": "p", "text": "This struggle between idleness and change was further reflected in the ancient Mandalorian belief in the afterlife. Existing as a plane of spiritual energy in constant conflict between stagnation and growth, every Mandalorian who perished was believed to join the army of the afterlife, defending their families that dwelled in the eternal, peaceful homestead. Ancient Mandalorians believed that this home beyond death was the only place they could truly reach a non-transitory existence."}, {"tag": "h3", "text": "Era of the Crusaders"}, {"tag": "p", "text": "One of the first notable changes to the Mandalorian religion came circa 4000 BBY. Legend claimed that the reigning leader of the Mandalorians, Mandalore the Indomitable, journeyed to the planet Shogun, and there he received a vision that inspired a revelation. Returning to the clans, Mandalore the Indomitable led his people to cease their worship of old gods like Kad Ha'rangir, Arasuum, and Hod Ha'ran, instead elevating the very act of war itself to the heart of their religion. War was revered, and to wage war was thought to be divine. It was from that point that the Mandalorians became infamous as Crusaders, a reflection of their view that the making of war was a holy crusade."}, {"tag": "p", "text": "Mandalore the Indomitable was not the last of the Mandalorians' many leaders thought to have received a vision while on Shogun. Following his ascent to the role after the Indomitable's death, Mandalore the Ultimate traveled to Shogun, where he claimed to have been shown a new vision. Mandalore the Ultimate's revelation led him to allow members of other species to become members of the Mandalorian culture alongside the founding Taung. Assuming they proved themselves worthy in combat and swore to uphold the tenets of the Resol'nare, it was the Ultimate's decree that they be treated as equals among the Mandalorian clans. Under Mandalore the Ultimate, the Crusaders recast themselves as Mandalorian Neo-Crusaders, adopting a new sigil for their movement that symbolized their leader's ability to interpret the will of the old war gods. It was also under his rule that the Mandalorians were certain of the approach of the mythic Ani'la Akaan, the so-called \"Great Last Battle.\" The warrior culture later believed they found the Ani'la Akaan at Malachor V, where the Neo-Crusaders clashed with the Jedi-led forces of the Galactic Republic, only to be defeated as Mandalore the Ultimate fell to the Jedi Knight Revan."}, {"tag": "h3", "text": "A new spiritual age"}, {"tag": "p", "text": "As time passed, the Mandalorians became disillusioned with the religious fanaticism of their ancestors and their war-worshiping ways. Their belief system moved further away from the supernatural, and a greater importance was placed on secular pragmatism. Where creation myths such as the Akaanati'kar'oya had once been regarded literally, later generations viewed these stories instead as allegory, seeking to glean philosophical insight from them rather than truth. The ancient gods, while remembered, went largely unworshipped in contemporary times. Common wisdom suggested divine masters were to be tolerated only if they were able to pull their own weight for the culture."}, {"tag": "p", "text": "The concept of a literal afterlife also waned over the centuries in favor of a belief in the manda. The manda was described as an oversoul, a collective consciousness, and the very essence of being Mandalorian. To join with the manda after death, a Mandalorian was required to be knowledgeable of their culture, and practice its tenets in their daily lives. For a Mandalorian to be ignorant of their heritage was to be dar'manda—without a soul—and to be without a place both in their culture and the collective afterlife. The concept of being dar'manda was greatly feared in Mandalorian society, and was considered a terrible fate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}