{"url": "Mandalorian_warrior", "categories": ["Category:Canon articles", "Category:Mandalorian stubs", "Category:Incomplete lists", "Category:Mandalorian culture", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Mandalorian warrior"}, {"tag": "p", "text": "Mandalorian warriors, also known as Mandalorian commandos, were soldiers of Mandalorian warrior clans that were active throughout Mandalorian cultural history. Many Mandalorian warriors were part of Mandalorian organizations such as Death Watch, Mandalorian Protectors, Nite Owls, and the Children of the Watch, where they served as saboteurs, assassins, infantry, and bounty hunters."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mandalorian warriors, also referred to as Mandalorian commandos, were Mandalorian soldiers that embodied Mandalore's warrior heritage and served warrior-centric Mandalorian clans. They used various types of Mandalorian armor, including Mandalorian rally master armor. Mandalorian warriors used the military rank of rally master, and the group Death Watch used a rank insignia. Jaig Eyes were a combat honor that adorned the helmets of Mandalorian warriors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Mandalorian Civil War, the New Mandalorians led by Duchess Satine Kryze adopted and created a pacifist society, a sharp turn from Mandalore's warrior culture. Those who did not accept were exiled to Concordia, and by the time of the Clone Wars were thought to have died out. In reality, however, warriors were still active and grouped into the organization known as Death Watch, which was secretly led by Pre Vizsla. The Mandalorian bounty hunter and foundling Jango Fett was a famous individual who wore the armor of a Mandalorian warrior, although the New Mandalorian government did not know how he obtained it. Death Watch was active throughout the Clone Wars, eventually joining the Shadow Collective led by Darth Maul and overthrew the New Mandalorian government and civil war erupted once again."}, {"tag": "p", "text": "After the rise of the Galactic Empire, Imperial Super Commandos were formed and served the Empire, while other Mandalorian warriors were active in their respective clans. The Mandalorian Protectors remained active in the Concord Dawn system. After the Great Purge against the Mandalorians and the fall of the Empire, at least one group of Mandalorian warriors known as the Tribe operated in secrecy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}