{"url": "Mandalorian_vambrace", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Mandalorian culture", "Category:Mandalorian weapons"], "nodes": [{"tag": "h1", "text": "Mandalorian vambrace"}, {"tag": "p", "text": "Mandalorian vambraces were devices designed to combat the abilities of a Jedi, but were also utilized for many other combative purposes. Vambraces could be equipped with a large array of different weapons. The Mandalorians developed these vambraces alongside their armor as a reaction to the Jedi's Force abilities encountered during the Mandalorian-Jedi War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mandalorian vambraces were combat gear designed to counteract the Force abilities of a Jedi. As such, they were equipped with various weapons that also proved useful against other foes. Sabine Wren's pair of Mandalorian vambraces, given to her by the Protector of Concord Dawn, Fenn Rau, came equipped with a repulsor, grappling line, paralyzing darts, a shield emitter, paired blaster barrels, and a flamethrower. The vambraces of Mandalorian bounty hunter Din Djarin were equipped with whistling birds and small automated projectiles. Boba Fett had a chain code encoded into his armor's vambraces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Mandalorians' war against the Jedi, they developed vambraces to work in tandem with their armor to combat the Jedi's abilities. Bounty hunters, such as Jango Fett and later his son Boba used them in their line of work. Death Watch leader Pre Vizsla and his followers such as Bo-Katan Kryze used vambraces during Death Watch's exile from Mandalore. Vizsla used vambraces when he fought Jedi Padawan Ahsoka Tano, forces of the Hutt Clan, and when he dueled the renegade Sith Lord Maul for control of the Shadow Collective. The post-Great Purge Mandalorian group known as the Tribe also used vambraces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mandalorian vambrace first appeared with Boba Fett in Star Wars: Episode V The Empire Strikes Back. They were later identified in the Star Wars Rebels Season Three episode Trials of the Darksaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}