{"url": "Mandalorians_(Clan_Ordo)", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Mandalorian organizations", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Mandalorians  (Clan Ordo)"}, {"tag": "p", "text": "The Mandalorians under Mandalore the Preserver were a group of Mandalorian warriors reunited after the Jedi Civil War under the banner of Clan Ordo. Made up of many survivors of the Mandalorian Wars and some newcomers, the group was motivated towards reestablishing the Mandalorian identity and ultimately regain their place in the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Mandalorian Wars concluded above the planet Malachor V, the Mandalorian survivors once again scattered across space. Some returned to Mandalore and even more became soldiers for hire, becoming known as Mandalorian mercenaries. Unlike their predecessors these warriors were mostly concerned with earning a living, and as such worked without regard for honor or morals."}, {"tag": "p", "text": "Due to his help in defeating Darth Malak's Sith Empire, the warrior and mercenary Canderous Ordo received the traditional mask of Mandalore from the former Sith Lord Revan. Canderous began a quest of reuniting the surviving Mandalorians and restoring their honor. During this task, he met an ill Taung who claimed to be the true Mandalore, calling Mandalore the Ultimate a usurper with ties to the Sith. Before dying the Taung gave Canderous his armor and handed over his clan, asking Canderous to preserve the old ways. Canderous accepted the Taung's request, and integrated the mask into the helmet and began wearing the armor as Mandalore the Preserver. Mandalore reclaimed the abandoned outpost previously used by the Mandalorian forces during the war, and used it as headquarters for his rebuilding effort."}, {"tag": "p", "text": "Five years after the Jedi Civil War, Meetra Surik was forced to land on Dxun by Colonel Tobin's space forces when searching for Jedi Master Kavar on Onderon. She was found by a Mandalorian sentry and taken to the Mandalorian base. Mandalore agreed to give her safe passage to Onderon if she proved herself worthy. After completing various tasks, such as stopping Tobin's scouts from uncovering the base and rescuing the lost warrior Kumus, Mandalore agreed to help her. Shortly before they could leave, however, Sith assassins, who had been tracking her progress since an incident on Peragus, attacked the base. Surik helped defend the base from the invaders before leaving."}, {"tag": "p", "text": "After their business on Onderon was done, Mandalore stated that he would accompany Surik on her journey for two reasons; the Sith would eventually dominate the Mandalorians if they were allowed to defeat the Jedi once and for all, and he had been meaning to leave to search for more clans. He found such clans on Nar Shaddaa and Dantooine. When the Battle of Telos IV began, the Mandalorians helped battle against the Sith, particularly aiding in the destruction of the Ravager, Darth Nihilus' personal vessel. Having restored much of their honor in the battle, the Mandalorians began reestablishing their place in the galaxy again."}, {"tag": "h2", "text": "Armor and Equipment"}, {"tag": "p", "text": "Although Mandalore didn't reintroduce the same hierarchy as the Neo-Crusaders, all known warriors he managed to draw in used Neo-Crusader armor. The golden armor of the Field Marshals was used by the drill instructor Xarga and the champion of the Battle Circle Bralor. Mandalore's right hand man Kelborn on the other hand used the crimson armor of the Rally Masters, as did a guard captain and a sergeant in the camp."}, {"tag": "p", "text": "They had at least one Basilisk war droid, which had been salvaged from the war. This type of droid resembled a starfighter more than a droid, and it was modified to allow three people to fly in it. They also frequently used a G-Type light shuttle, which Mandalore used to take Meetra Surik to Iziz."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The banner used by the Mandalorians under Clan Ordo is similar to that of the Infinite Empire. This could be due to the fact that Canderous Ordo, the head of Clan Ordo, took part in the battle for the Star Forge, and he simply wanted acknowledgement of that."}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic II: The Sith Lords, during the attack where Sith Assassins invade the camp, it is possible for any of the named Mandalorians (probably besides Kelborn, who has a later role in the game) to die as a corpse if their health is extremely low and they are damaged several times. This is highly unlikely however, as the Mandalorians will usually gang up on a single target and overwhelm it quickly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}