{"url": "Mandator_III-class_dreadnought", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Mandator III-class dreadnoughts", "Category:Star Dreadnought classes"], "nodes": [{"tag": "h1", "text": "Mandator III-class dreadnought"}, {"tag": "p", "text": "The Mandator III-class dreadnought was a dreadnaught-scale warship in the Imperial Navy, as well as the third class of Star Dreadnought developed under the Mandator series, alongside the Bellator-class dreadnought."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Mandator III-class was based on the Mandator-class and Mandator II-class Star Dreadnaughts. Unlike the Bellator-class dreadnought, another Mandator successor design, the Mandator III-class dreadnought was specifically designed to be a hulking weapons platform and was both longer and more heavily armed than its predecessors and its contemporary \"cousin\". At 12,000 meters in length, it was essentially a scaled-up version of the Mandators."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mandator III-class was one of several heavy capital ship classes made after the Executor-class Star Dreadnought. Several participated in the campaign leading up to the Imperial Civil War.\nDuring the in-fighting, one of these vessels, the Panthac, was destroyed in battle with the Executor-class Star Dreadnought Whelm. Its sister-ship, the Aculeus, was destroyed by squadrons of TIE/D automated starfighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Jason Fry's Endnotes, he explained that the out-of-universe reason for the different scales between the Mandator III and the Bellator was because the text and art for the famous humpbacked starship in Dark Empire, when including the vessel in The Essential Guide to Warfare, were given separate numbers without consultation, and thus resulted in an accidential combined design."}, {"tag": "p", "text": "In addition, according to Ansel Hsiao on Stardestroyer.net forums around the time The Essential Guide to Warfare was released, both he and Jason Fry planned to make all the Mandator-series, in addition to the Bellator-class, humpbacked vessels similar to the one that appeared in Dark Empire, although nothing of the sort made it into the final cut by the time of its release. However, the intended humpbacked hulls of the Mandator-series was nonetheless implied in Jason Fry's endnotes for the book."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}