{"url": "Arkanian_Offshoot", "categories": ["Category:Legends articles", "Category:Arkanian culture", "Category:Colonies species", "Category:Human and Near-Human species", "Category:Sentient subspecies"], "nodes": [{"tag": "h1", "text": "Arkanian Offshoot"}, {"tag": "p", "text": "The Arkanian Offshoots were a sub-species of the Arkanian race, genetically engineered by the famed Arkanian scientists and genetic researchers of the Old Republic era."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Known to be unscrupulous when it came to the bounds of scientific exploration, the geneticists of Arkania began to experiment on their own species, mixing the blood of other races with their own to create offshoots of the Arkanian species. These offshoots were first bred to excel at specific industrial tasks such as mechanical or technical work in order to relieve pure-blooded Arkanians of physical labor. One particular sub-species were bred as workers for the famed Arkanian gem mines. These people had five-fingered hands and eyes resembling those of the Human race with which their blood was mixed. With stark white skin, the offshoots were easily distinguished from the pure-bloods and were often shunned, even if covertly. Among the other races the Arkanians experimented with were the Sephi of Thustra, a species of humanoids with pointed ears."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developed in the era surrounding the Great Sith War, the offshoots were bred as an answer to the need for laborers to mine the vast diamond stores of Arkania. This race was especially vulnerable to minor Arkanian illnesses. The Offshoots were treated as second-class or non-citizens by the baseline Arkanians, and the question over what to do with them was termed the \"Offshoot question.\" Arkoh Adasca planned to use Adascorp's genetic engineering expertise to solve the problem in a generation. Indeed his grandfather, Argaloh Adasca, attempted to exterminate the Offshoots with a plague that ravaged those of advanced age."}, {"tag": "h2", "text": "Arkanian Offshoots in the galaxy"}, {"tag": "p", "text": "Many Arkanian Offshoots became known across the galaxy for their heroism during the Great Sith War and the Mandalorian Wars. The Arkanian-Sephi hybrid, Arca Jeth, was a famed Jedi Master of the era who trained many students of the Jedi Order during his lifetime. Jeth's DNA was eventually used to create the fierce warrior Jarael, though she had the white skin of a Human-Arkanian and the pointed ears of a Sephi-Arkanian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}