{"url": "Arkanian_Revolution", "categories": ["Category:Legends articles", "Category:Battles of Arkania", "Category:Civil wars", "Category:Conflicts of the Colonies"], "nodes": [{"tag": "h1", "text": "Arkanian Revolution"}, {"tag": "p", "text": "The Renegades' army, whose number included Gorm the Dissolver, butchered the Dominion's forces in early skirmishes. The desperate Dominion appealed to the Republic and Jedi Order to intervene on their behalf. Republic police squads were eventually deployed to Arkania, supplemented by Jedi forces including Mace Windu, Aqinos, and the Iron Knights. The Renegades were soundly defeated by the reinforcements, and those not killed in battle were executed for their treason. Some of their cyborg creations, including Gorm the Dissolver, survived, becoming bounty hunters and hired killers. The Arkanian Revolution, although unsuccessful, contributed greatly to the escalating public fear of droids."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Based on their adopted homeworld of Arkania in the Colonies, the Arkanian species considered themselves the pinnacle of evolution, and were one of the most advanced species in the galaxy by the time of the formation of the Galactic Republic. Known for their scientific and medical breakthroughs, the Arkanians were keen geneticists, eager to carry out any genetic modification research, even that which the Republic had outlawed. One of the earliest and best known experiments performed by Arkanian scientists was when they relocated a group of Xexto from their homeworld of Troiken to the Outer Rim world of Quermia, in order to perform genetic modifications on the species in a secluded and out-of-the-way environment. The experiment was cut short when the Arkanians ultimately decided to abandon the project out of fear of Republic repurcussions, leaving the newly-altered Xexto to develop on their own, eventually becoming the Quermian species."}, {"tag": "p", "text": "Thousands of years later, in 490 BBY, the Arkanians discovered the Yaka species in the nearby Yaka system. The Arkanians considered the Yakas feebleminded and weak, and took it upon themselves to use their knowledge of genetics and technology to improve the species' intelligence, implanting high-tech cyborg brains into the Yakas. Some Arkanians were distressed by their compatriots' actions, considering them to be morally questionable, but their objections were ignored. The Yakas adapted quickly to their alterations, developing mental abilities considered to be at a genius level. However, the cyberetic implants caused an apparent loss of emotion in the modified Yaka, along with a twisted, often cruel sense of humor. The Arkanians' genetic experiments were considered by some portions of galactic society to be some of the greatest atrocities ever performed."}, {"tag": "h2", "text": "Revolution"}, {"tag": "h3", "text": "Conflict"}, {"tag": "p", "text": "Several centuries later, the issue came to the forefront some fifty years before the Battle of Yavin. A faction calling themselves the Arkanian Renegades intensified the objections to the still-ongoing modification of the Yakas, but the Dominion government once more turned a blind eye to the issues being raised and continued to fit Yaka offspring with enhancements."}, {"tag": "p", "text": "The Renegades decided to take matters into their own hands and formulated a plan to launch a coup and overthrow the Dominion, establishing a new order. Like their political opponents, the Renegades possessed an intimate knowledge of genetics and technology, and they opted to use this expertise to their advantage. They set about building a spliced-together, patchwork army, ultimately performing experiments not unlike those they opposed. Using arcane and forbidden practices, they constructed a half-mechanical, half-organic mercenary army, created with parts of various different alien species and droids, who possessed a determined, warlike attitude. This army would fight the Renegades' conflict, and they were confident it would topple the Dominion."}, {"tag": "p", "text": "The army—whose number included Gorm, a formidable warrior who would achieve much greater notoriety in later decades—proved almost invincible against the forces of the Arkanian Dominion in combat. The cyborgs slaughtered thousands of pro-Yaka-modification Arkanians, and the Renegades soon had the upper hand over their helpless opposition. The desperate Dominion eventually pleaded for the Republic and Jedi Order to intervene."}, {"tag": "h3", "text": "Intervention"}, {"tag": "p", "text": "The Republic eventually acquiesced to the Arkanians' entreaty, consenting to send Republic police squads and a number of Jedi, including a young Mace Windu, the Padawan Squire Kinning, as well as Aqinos, a heterodox Sunesi Jedi Master. Aqinos had controversially spent the previous ten years training a group of Force-sensitive Shard as to use the Force as Jedi, and these, encased within Uulshos justice droid bodies and known as the Iron Knights, accompanied him to Arkania."}, {"tag": "p", "text": "The arrival of the combined Jedi/Republic task force quickly turned the tide in the conflict, though Kinning lost her arm in battle. Mace Windu did battle with Gorm, though both individuals survived. Eventually, the Arkanian Revolution was crushed with the eventual defeat of the mercenary army at the hands of the Jedi. The surviving Renegades were executed and the Dominion remained in power. The ultimate death toll was high, with thousands of pro-Yaka-modification scientists, the Arkanian Renegades, and the majority of their cyborg army dead."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The surviving cyborgs fled Arkania and spread out into the wider galaxy, with many pursuing a career in bounty hunting. Gorm became the most infamous of the cyborgs, quickly acquiring a fearsome reputation as well as the sobriquet \"the Dissolver.\" He was still in active bounty hunting service over sixty years after the Revolution, having learned to update and maintain himself through the decades. It was believed that, assuming he continued to patch himself up as necessary, Gorm the Dissolver could in theory continue to exist indefinitely."}, {"tag": "p", "text": "Mace Windu went on to become one of the most famous Jedi of the era, ultimately becoming Master of the Order until his death in 19 BBY. Squire Kinning was brought back to the Jedi Temple to heal. Once she recovered, the loss of her arm was considered by the Jedi High Council to be her passing of the Trial of the Flesh, and she soon went on to become a Jedi Knight. Aqinos' future was less bright; he was excommunicated from the Order for his unauthorized training of the Iron Knights, though he ultimately joined Luke Skywalker's New Jedi Order but perished in the Yuuzhan Vong War."}, {"tag": "p", "text": "The Dominion remained in power, continuing their experiments and earning a reputation as \"mad scientists\" during the time of the Galactic Empire. Though the existence of the Arkanian Renegades was suppressed to the extent that few had heard of them, knowledge of the Revolution itself was commonplace. The conflict greatly revived a public fear of droids originating in the much larger-scale Great Droid Revolution on Coruscant thousands of years before. The conflict was also the first in a string of local uprisings to afflict the Republic during this period, one of many factors that weakened it and ultimately laid the foundations for Palpatine's coup in 19 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Arkanian Revolution was created by Daniel Wallace for The Essential Guide to Droids (1999), tying into the backstory of bounty hunter Gorm the Dissolver from Tom Veitch's Dark Empire 3 (1992). Ann Margaret Lewis's The Essential Guide to Alien Species (2001) later briefly expanded upon the conflict, before Wallace made references to it in his New Essential Guide to Characters (2002), New Essential Chronology (2005), and New Essential Guide to Droids (2006). Abel G. Peña also referenced it in Droids, Technology and the Force: A Clash of Phenomena, a Hyperspace article published in 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}