{"url": "Mantellian_Separatist_Movement", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Mantellian Separatist Movement"}, {"tag": "p", "text": "The Mantellian Separatist Movement was an organization formed on Ord Mantell during the Cold War in opposition to the Galactic Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Treaty of Coruscant, many planets seceded from the Galactic Republic to join the Sith Empire or pursue independence. The corrupt planetary government of Ord Mantell opted to remain loyal to the Republic. However many on the planet desired the independence of their world. The resulting separatist movement sparked a civil war on the planet, with the government receiving backing from both the Republic and elements of the criminal underworld."}, {"tag": "p", "text": "The Ord Mantell separatists established a network of underground bases from which they launched guerrilla attacks on the Ord Mantell government and Republic targets. The attacks resulted in the destruction of the Ord Mantell landscape and the destabilization of the local governments. A primary base of the separatists was a large volcano. Located on the island of Avilatan, the heart of the volcano was a Separatist stronghold used to conduct meetings and organize separatist forces. Separatist leaders often met in the stronghold. Another major base was the island of Mannett Point. After invading the island, Separatist forces captured large amounts of Republic munitions, and used it against government and Republic forces. Such munitions captured included small arms and rocket launchers."}, {"tag": "p", "text": "The Separatist movement held large portions of the island of Avilatan. Separatist forces fought for control of several villages on the island, including Drelliad and Talloran villages. In addition, the Avilatan Badlands were a hotly contested area. Separatist forces claimed much control of the Badlands, and led raids against Republic convoys. The Separatists used the Badlands as an ambush point, planting bombs along it."}, {"tag": "h2", "text": "Political Backing"}, {"tag": "p", "text": "Investigation into the the separatist movement's roots revealed that it shared financial backing with the Justicars' Brigade paramilitary group—the backers being the reconstituted Sith Empire. The Sith Empire contributed propaganda, munitions, and financial aid to the Separatist cause. The Sith Empire also maintained a Listening Post on Ord Mantell. It provided intelligence on Republic movements to the Separatists."}, {"tag": "p", "text": "At the end of the civil war, a portion of separatists led by General Ortol moved to Cademimu V. Cademimu governor Chornarov declared independence from the Republic, while Ortol and his men helped him take control of the planet and its missile defenses. The action was met with resistance from Cademimu's population. When the Republic and Empire intervened, most of the separatists were killed along with their commander, General Ortol."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The separatist military virtually included the whole movement, and was well organized and equipped, being able to deploy armor-piercing missiles and signal jammers on the battlefield. It was mostly reliant on infantry militia, sometimes supported by heavy battle droid units (\"liberation droids\"). They used various tactics, from mass assault to guerrilla, and didn't hesitate to kill civilians."}, {"tag": "h2", "text": "Navy"}, {"tag": "p", "text": "The separatist movement managed to opposed some resistance to the Republic Navy in Ord Mantell space, being able to deploy freighters and starfighters. Those nearly managed to end the career of one of the most fierce soldier of the Republic before it truly started."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}