{"url": "Mantis_Syndicate", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Bounty hunter houses"], "nodes": [{"tag": "h1", "text": "Mantis Syndicate"}, {"tag": "p", "text": "The Mantis Syndicate, or Mantis Bounty Hunter Syndicate, was a corporation of bounty hunters and one of the houses belonging to the Bounty Hunters' Guild. Officially specializing in hunting big groups of criminals such as swoop gangs or pirate organizations, the Mantis Syndicate gathered great numbers of hunters in battalions of military units to carry out assignments. Detractors considered the Mantis Syndicate to be a company of mercenaries."}, {"tag": "p", "text": "The Mantis Syndicate was active from at least 10 BBY. During the Galactic Civil War, the Mantis Syndicate was owned and managed by Lady Marina Mantis. By then, the Mantis Syndicate worked mostly as a private army for Imperial Governor High Lord Jaris Affric of the Sarin sector, although the Syndicate also reached the Revkinn and Socorro systems. By the end of the war, Affric had suffered a loss of income, and the Mantis Syndicate terminated its working relationship with him. Lady Mantis then made deals with other customers, including the New Republic and Provisional Governor Valis Lorn of Andasala."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Mantis Bounty Hunter Syndicate, commonly known as the Mantis Syndicate, was a private company working in the business of bounties legally issued by either corporate or government interests. The Mantis Syndicate was one of the ten principal houses forming the Bounty Hunters' Guild. The owner and chief executive officer of the Syndicate was Lady Marina Mantis from at least 0 ABY to 11 ABY, and the Syndicate's offices were established on the planet Santarine. The Syndicate's logo was a white stylized \"M\" within a black circle."}, {"tag": "p", "text": "Professionals were able to join the Mantis Syndicate either by passing a selection process, or by being personally chosen and recruited by Lady Mantis. The Syndicate, like the other houses, offered training and support to its members. In exchange, every bounty hunter paid the Syndicate a fee, including 3–5% of any collected bounty, depending on the value of the bounty and the seniority of the hunter, plus an annual fee of 150 credits. Hunters recruited by Lady Mantis were exempt from the annual fee."}, {"tag": "p", "text": "The Syndicate worked on general-purpose bounties, but its members specialized in high-risk missions and in paramilitary operations requiring literally a battalion of professionals to track down and capture collective prey such as a gang or a military unit. One of the main appeals of the Syndicate was the fact that it gathered specialized soldiers, all of them experienced as bounty hunters, in large numbers and in little time for a given assignment. Detractors believed that this feature blurred the difference between a bounty hunter syndicate and a mercenary company."}, {"tag": "p", "text": "Some members of the Mantis Syndicate operated solo, but as a norm they made four- to eight-person units. Those groups offered a teamwork synergy that the Syndicate found valuable. The Mantis Syndicate succeeded in seventeen out of every twenty assignments."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mantis Syndicate was active circa 10 BBY. At that point, Mantis sent a prominent bounty hunter, Fenn Rizaar, to track down Kaine Paulsen, a pirate and member of the criminal organization Black Bha'lir. During the chase, Rizaar accidentally shot an Imperial stormtrooper dead and, shortly afterward, was apprehended by his victim's platoon along with Paulsen. Paulsen and Rizaar escaped together and went to the Bha'lir headquarters on Socorro. The Mantis Syndicate then refused to acknowledge Rizaar as one of its members and offered a bounty of 70,000 credits for his head. Some members of the Black Bha'lir wanted to cash in Rizaar, but Paulsen convinced them not to. Rizaar believed he was indebted to the Bha'lir and eventually became a Bha'lir himself. He also swore revenge on the Mantis Syndicate."}, {"tag": "p", "text": "The Mantis Syndicate was still active and a member of the Bounty Hunters' Guild as of 3 BBY. Soon after the Battle of Yavin, the Galactic Empire showed a sudden interest in criminal and fringe organizations, including bounty hunter houses. Scay Danson, a member of the Imperial Security Bureau, wrote a report on the possible threat posed by the Bounty Hunters' Guild, including the Mantis Syndicate. At that point, the Trandoshan sociopath Cradossk, not affiliated with Mantis, was identified as the maximum authority of the Guild."}, {"tag": "p", "text": "Circa 1 ABY, the Black Bha'lir had infiltrated one agent into the Mantis Syndicate. Thus, when Mantis decided to send a bounty hunter after Karl Mathieu Ancher, a smuggler and member of the Bha'lir, the informant reported to The Tribunal, the leaders of the Bha'lir. According to the tip, the hunter, known only as Kael, planned to approach Ancher during the funeral service of a notorious Corellian smuggler on Socorro. The Tribunal knew nothing about Kael save for the individual's name, and as such Kael could easily approach Ancher undetected as a part of the crowd that was expected to attend. Additionally, The Tribunal wanted to solve the situation without Ancher's knowledge, so it asked a small group to find and stop Kael."}, {"tag": "p", "text": "At approximately the same time, High Lord Jaris Affric, Imperial Governor of the Sarin sector and owner of several inherited, corporate, and criminal assets in that area, hired and kept on retainer most of the Syndicate. Although the Syndicate still tracked criminals wanted by either the Empire or private corporations, most of its business came from bounties posted by Affric either directly or indirectly through any company under his control. Affric used the Syndicate as his private army of special operatives. He sent its members to track criminal organizations, units of the Alliance to Restore the Republic active in his area, pirate groups, swoop gangs, outlaw mercenary units, and any other collective hampering Affric's activities. As Affric controlled most of the sector, there were many such groups in his sights."}, {"tag": "p", "text": "This situation centered the range of the Syndicate in the Sarin sector, allowing it to offer only a company of troops, similar to a special operations unit, for operations outside the sector. The group was successful in serving Affric and, within two years, had defeated four mercenary units, three swoop gangs, and one group of unauthorized slavers operating in the Suhuurmin system."}, {"tag": "p", "text": "While under Affric's control, the Syndicate was contacted by Imperial prefect Dengless Rinn of the planet Kallistas. Rinn wanted to hire a company of mercenaries, including specialists in demolitions, to stage a coup against his boss, Governor Linrec, in a scheme also involving weaponry and fission bombs. Mantis arranged a meeting between Rinn and the Twi'lek smuggler Tarquin Zian, who was able to provide him with the weapons. Rinn and Mantis then started a three-week negotiation to make a deal. Once they had reached an agreement, Mantis sent its troops to Kallistas while Rinn prepared a secret camp for them in a Kallistas desert. Rinn's revolution was botched, and the prefect became a fugitive of the Empire."}, {"tag": "p", "text": "Serving Affric, the Mantis Syndicate obtained wealth, power, and political influence within the Empire, to the point of not having to worry about the legality of its own activities. In addition, Affric did not care about the legality of the assignments he gave the organization. The Syndicate's prestige did not impress non-member bounty hunters, who considered the group to only be Affric's thugs-for-hire. Other bounty hunter guilds admitted that the Mantis Syndicate was specialized in \"acquiring\" big groups, but still considered the Syndicate to be more a mercenary unit than a bounty hunter syndicate. This was a widespread opinion even outside the Guild. Due to their closeness with Affric, the guild kept a close watch on the Mantis Syndicate."}, {"tag": "p", "text": "In the following years, Affric began to use the Mantis Syndicate in regular fights against troops of the Alliance, and also against the mercenary group Churhee's Riflemen in an attempt to capture Maydla Churhee, the wife of the organization's leader. Circa 4 ABY, Affric was short of money and got into debts with the Syndicate. When Lady Mantis noticed that Affric was unable pay her, she withdrew her men against his wishes. Lady Mantis managed the Syndicate as it continued to operate in Sarin, although its members were more prone to work for anyone paying her fees instead of working for Affric. She also reduced the fees to appeal to a wider range of potential clients."}, {"tag": "p", "text": "One of the new customers was Valis Lorn, a crime lord and the Provisional Governor of the planet Andasala. Lorn wanted to establish Andasala as a neutral ground welcoming both agents of the Empire and of its rival government, the New Republic, as long as they did not use Andasala to fight. Needing more strength than his usual minions, Lorn hired Mantis mercenaries as his own law enforcement corps. The Mantis Syndicate was not enough to cement Lorn's position, but the Governor had already planned several other measures that helped him reach that goal."}, {"tag": "p", "text": "During the following years, the New Republic took control of the Sarin sector and occasionally hired the Mantis Syndicate to track wanted Imperial agents. The New Republic was satisfied with the talent, professionalism, and political apathy of the Syndicate, although the government was still wary about the organization. In 11 ABY, Captain Zgorth'sth of the New Republic's Department of Threat Assessment filed a detailed report on the Mantis Syndicate. Zgorth'sth recommended high-ranking officers to keep contact with the Syndicate, because he felt the Syndicate was useful should the Republic need to obtain trained bounty hunters. He also believed that the Syndicate would observe the law if it was monitored."}, {"tag": "h2", "text": "Notable members"}, {"tag": "p", "text": "The owner and manager of the Syndicate was the amoral Lady Marina Mantis, who offered the services of her troops to anyone paying. Individual bounty hunters in the Syndicate included Fenn Rizaar and Kael. During the height of the Galactic Civil War, however, the Syndicate employed no less than 985 professional hunters, 845 people as support personnel, and 220 administrative staff. Its assets were valued at fifty-four billion credits, including seven billion credits in cash. The Syndicate was bigger than many of its peer houses, such as the Ragnar Syndicate, but it also focused on bigger-scale activities."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mantis Syndicate was first mentioned in the roleplaying guide Galaxy Guide 9: Fragments from the Rim (1993), written for West End Games' Star Wars: The Roleplaying Game. Information on it was expanded in Galaxy Guide 10: Bounty Hunters (1994), another role-playing guide, which included a role-playing adventure, Two for the Price of One, in which the Mantis Syndicate played a part. The Mantis Syndicate was further explored in later roleplaying supplements."}, {"tag": "p", "text": "Only one source, Galaxy Guide 10, uses the longer name \"Mantis Bounty Hunter Syndicate,\" with all the others systematically calling the organization the \"Mantis Syndicate\" even in formal situations. None of the sources specify whether either of the names is more formal than the other, so this article therefore makes use of the more widely used \"Mantis Syndicate\" name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}