{"url": "Mantooine_(CR90_corvette)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:CR90 corvettes", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Mantooine (CR90 corvette)"}, {"tag": "p", "text": "The Mantooine, named for the planet of the same name, was a Corellian Engineering Corporation CR90 corvette serving the New Republic Defense Fleet. In 9 ABY, it took part in the assault on the planet Ciutric IV, against the forces of former Imperial warlord Prince-Admiral Delak Krennel. Working in cohesion with other corvettes, it struck against the Victory-class Star Destroyer Emperor's Wisdom, eventually sustaining significant damage in the battle, which was won by the New Republic through the use of the Thrawn Pincer tactic of utilizing the enemy's gravity wells to bring a fleet of reinforcements out of hyperspace."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Mantooine was a Corellian Engineering Corporation CR90 corvette that served with the forces of the New Republic during the later years of the Galactic Civil War. It was one of a number of corvettes named for Republic planets, in this case, Mantooine, a world located in the Atrivis sector of the Outer Rim Territories with a long history of resisting the Galactic Empire. Other such ships included the Chandrila and the Mrlsst. The Mantooine was equipped with a hyperdrive and armed with double turbolaser cannons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 9 ABY, the Mantooine was part of a New Republic task force led by Mon Calamari Admiral Gial Ackbar against the forces of former Imperial warlord Prince-Admiral Delak Krennel of the Ciutric Hegemony at the battle of Ciutric IV. The task force was spearheaded by the MC80 cruiser Home One and the Imperial II-class Star Destroyer Emancipator, with support provided by three EF76 Nebulon-B escort frigates and six CR90 corvettes, including the Mantooine. Having received intelligence on expected Hegemony forces, this task force was thought to have been sufficient to successfully complete the mission; however, on arrival in-system, Krennel's forces were found to have two additional Victory-class Star Destroyers, giving them a numerical advantage."}, {"tag": "p", "text": "Together with the corvettes Dantooine and Ryloth, the Mantooine engaged the Victory-class Star Destroyer Emperor's Wisdom, flying over the top of the starship and attacking its dorsal deflector shield with double turbolaser cannon fire. The combined salvos overloaded the shields, enabling a number of supporting Republic frigates to score direct hits on the capital ship, although not enough to cause significant damage. As the battle continued, the Mantooine sustained heavy damage, along with its sister corvette, the Sullust. At this point of the battle, with the Hegemony activating their gravity well projectors, Ackbar launched a Thrawn Pincer, a tactic devised by the Imperial Grand Admiral Thrawn: using the enemy's gravity well, he brought his own reinforcements in behind the Hegemony forces, to strike at their vulnerable rear. Led by General Garm Bel Iblis, the two Victory-class Star Destroyers, Corusca Fire and Selonian Fire, jumped into the system and attacked Krennel's forces, targeting the flagship, the Imperial II-class Star Destroyer Reckoning. The assault killed Prince-Admiral Krennel, and effectively ended the Hegemony resistance. The Mantooine managed to survive the encounter, but only barely."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mantooine was created by Michael Stackpole in his novel X-Wing: Isard's Revenge (1999), the eighth novel in his X-Wing series. It was one of a number of starships named for previously established planets in the Expanded Universe. It was later given an entry in the The Complete Star Wars Encyclopedia, which clarified a couple of details left unclear in the original source, such as its class and its survival of the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}