{"url": "Mantooine_Medallion", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic awards"], "nodes": [{"tag": "h1", "text": "Mantooine Medallion"}, {"tag": "p", "text": "The Mantooine Medallion, also known as the Mantooine Medal of Bravery, was the fourth highest decoration that was awarded by the Alliance High Command. It was awarded to Alliance Military personnel for demonstrating exceptional bravery in the face of an enemy force, and was first issued to survivors of the Mantooine resistance after the battle on Mantooine. It was often issued to combatants for courage under fire and exceptional gallantry, as well as non-combatants who provided exceptional support to the Alliance Military. It was below the Illudium Star and above the Star of Alderaan."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview and requirements"}, {"tag": "p", "text": "The Mantooine Medallion, also known as the Mantooine Medal of Bravery, was the fourth highest decoration that was awarded by the Alliance High Command to Alliance personnel for exhibiting exceptional bravery in the face of an enemy force. It was first issued to survivors of the Mantooine resistance after the disastrous battle on Mantooine against the Imperial garrison. It was awarded to individuals who served in any capacity within the Alliance Military who distinguished themselves with exceptional and meritorious service, and although it was commonly issued for courage under fire or exceptional gallantry in a situation that did not warrant a higher merit, the medallion could also be awarded for exceptional contributions to the overall readiness of the Alliance."}, {"tag": "p", "text": "It was one of the few decorations that was awarded during peacetime, and was often issued to non-combatants such as supply officers, intelligence agents, and others who provided support to the Alliance Military. It was below Illudium Star and above the Star of Alderaan."}, {"tag": "h3", "text": "Physical description"}, {"tag": "p", "text": "The decoration was issued as a ribbon-rack bar and as a wearable medal, and was considered a more simple award compared to other, more prestigious, awards. The medallion consisted of two overlapping diamonds of copper-colored alloy that formed a sharp-edge figure eight shape. At the center of the medallion was a cast of a flaming torch with a red-faceted gemstone that represented the torch's flame. It was connected to a broad, rectangular, deep blue ribbon with a large red Rebel Alliance starbird printed at the middle. Similarly to most decorations, the Mantooine Medallion could be awarded numerous times, with each subsequent award represented as a small red-enameled starbird pinned to the medallion's ribbon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mantooine Medallion was first mentioned in the new Star Wars canon in the 2016 Fantasy Flight Games sourcebook Lead by Example. It previously first appeared in Star Wars Legends in Star Wars: X-Wing, a LucasArts computer game that was released in 1993."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}