{"url": "Maoi_Madakor/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Judicial Forces officers"], "nodes": [{"tag": "h1", "text": "Maoi Madakor"}, {"tag": "p", "text": "Maoi Madakor was a Human female who served as captain in the Judicial Forces during the waning years of the Republic Classic era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 32 BBY, Madakor was the captain of the Radiant VII, and flew it during the Battle of Galidraan. The purpose of this mission was to transport Jedi on the planet. It was during this mission she met and befriended Lieutenant Antidar Williams, a pilot of the Acceptance. Together, they flew together again at the Battle of Uhanayih, where Williams' ship was destroyed, and he was reduced to flying shuttles for senators."}, {"tag": "p", "text": "The next year, recalling their friendship and previous mission to Galidraan, she specifically chose Williams to be her copilot in a mission taking Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi to the Naboo system so they could negotiate with the Trade Federation due to their Blockade of the planet Naboo. Upon arriving at the system, she then made contact with the Neimoidian head of the Trade Federation, Nute Gunray, requesting that the Jedi, identified as ambassadors to Supreme Chancellor Finis Valorum, be allowed to board the Saak'ak immediately, with Gunray heeding the request. Although they succeeded in delivering them, they were ultimately forced to wait until the Jedi returned. However, they then discovered a turbolaser turret descend from the ceiling, poised to fire at the Radiant VII. Unable to escape, she was killed when the Trade Federation's turbolaser fire destroyed her ship. Her last words were to raise the deflector shield, but it was too late."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maoi Madakor was portrayed by Bronagh Gallagher in The Phantom Menace. In the opening cutscenes of the Episode I portion of LEGO Star Wars: The Video Game and LEGO Star Wars: The Complete Saga, she and Williams were replaced by Royal Naboo Security Forces figures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}]}