{"url": "Map_to_Skywalker", "categories": ["Category:Canon articles", "Category:Stub", "Category:Holographic technology", "Category:Maps"], "nodes": [{"tag": "h1", "text": "Map to Skywalker"}, {"tag": "p", "text": "The map to Skywalker was a holographic star map of part of the galaxy that showed the location of the first Jedi Temple on Ahch-To, where Luke Skywalker was hiding in exile. Kylo Ren described it as a transgalactic navigational chart."}, {"tag": "p", "text": "During their conflict with the Resistance, the First Order recovered part of the map from the Archives of the Empire, while Lor San Tekka was able to get part of a map. Skywalker's droid, R2-D2, also received a portion of the map from his master, then went into low-power mode to protect the data. It was impossible to distinguish where the map led without both portions."}, {"tag": "p", "text": "The First Order only needed Tekka's portion to find Skywalker and complete the map. Ren, Gideon Hask, and a detachment of stormtroopers went to the aquatic planet Pillio on a report that Jinata Security had found a mysterious man they had found in the Emperor's Observatory. It turned out to be Del Meeko, Hask's former squadmate from Inferno Squad. After forcing Meeko to tell him where Tekka was, Ren let Hask confront and kill Meeko. They eventually found Tekka on Jakku, although they didn't find the map."}, {"tag": "p", "text": "After the Battle of Starkiller Base, R2 was awakened from his low-power mode. The Resistance combined R2's portion with Tekka's (who was now dead at the hands of Ren) portion to reveal the completed map. Rey, Chewbacca and R2-D2 followed the map to Ahch-To, where they found the self-exiled Jedi Master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An idea intended by J.J. Abrams, Lawrence Kasdan and Michael Arndt for the 2015 film Star Wars: Episode VII The Force Awakens was that R2-D2 got valuable data from the Empire and the locations of Jedi Temples when he plugged into the information base of the Death Star during Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}