{"url": "Mapo", "categories": ["Category:Canon articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Refugees"], "nodes": [{"tag": "h1", "text": "Mapo"}, {"tag": "p", "text": "Mapo was a young refugee displaced by the Galactic Civil War. He and his parents lived on Golus Station above the Mid Rim planet of Golus during the Galactic Civil War. After the Galactic Empire bombed the planet, Mapo's parents were killed and the boy was badly burned and disfigured. Mapo survived the massacre and ended up as a refugee on the planet Naboo around the time of the Battle of Jakku. There, he encountered the Gungan street performer Jar Jar Binks. After Mapo befriended Binks, he asked the Gungan outcast to teach him how to become a clown like him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mapo lived on Golus Station, a space station above the Mid Rim planet of Golus. The Galactic Empire used Golus Station as a refueling depot during the Galactic Civil War. Mapo's mother and father were killed when the Empire bombed the fuel tanks as part of a scorched earth tactic. Mapo survived the bombardment but sustained hideous burns to half of his face and lost half of one of his arms. Mapo ended up at an orphanage for refugee children on the planet Naboo in 5 ABY. Due to his disfigurement, Mapo found it difficult to find anyone who would adopt him or even talk to him. At the urging of one of his minders Kayana, Mapo went to meet a Gungan street performer who frequented Theed's Plaza of the Catalan."}, {"tag": "p", "text": "This Gungan turned out to be Gungan outcast Jar Jar Binks, a former Bombad General and Junior Representative who was ostracized by both his people and the Naboo for his role in aiding the rise of Galactic Empire. Exiled by his people, Binks now worked as a street performer who entertained children by juggling glombo shells, spitting and catching fish, and dancing in the fountains. After exchanging greetings, Binks offered Mapo a piece of pik-pok fish but the boy declined. After Binks juggled the fish with his hands and tongue, Mapo laughed. Binks then took the opportunity to chat with the boy. Mapo told Binks about the loss of his parents and his ordeal on Golus. Taking pity on the boy, Binks did another trick by swallowing water and spraying it out through his flopping ears."}, {"tag": "p", "text": "After Mapo told Binks that nobody talked to him, Binks was able to empathize with the boy by telling him that he was an outcast. Binks related to Mapo that both his people and the Naboo looked on him with scorn because he had made mistakes that had helped lead to the rise of the Galactic Empire. Indeed, Binks had proposed the emergency executive powers that allowed Supreme Chancellor Palpatine to launch the Clone Wars and ultimately transform the Galactic Republic into the Empire. Though Binks was ostracized by the adults, Mapo took a liking to him and suggested that they were both outcasts."}, {"tag": "p", "text": "Finding a kindred spirit in the boy, Binks decided to befriend Mapo. While Mapo did know what the word \"Bombad\" meant, he thought it meant something good and asked if the Gungan could teach him to be a clown. Binks agreed to teach the boy how to be a clown so that they could make the galaxy \"smile again.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mapo was a young boy whose childhood on Golus Station was disrupted by the Galactic Civil War. He suffered serious injuries from an Imperial bombardment which left half of his face burnt. Mapo also lost one ear and the hair follicles had been burned off on one side of his head. One of his arms was badly damaged and reduced to a stump. Due to the loss of his parents, Mapo became an orphan and refugee who lived at an orphanage on Naboo."}, {"tag": "p", "text": "Due to his disfigurement, Mapo found few people who were willing to befriend him. Mapo found an unlikely friend in the form of the disgraced former Gungan Bombad General and Junior Representative Jar Jar Binks. Finding happiness in Binks' antics as a clown, Mapo decided to apprentice himself to the bumbling Gungan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mapo first appeared as a point-of-view character in an interlude chapter in Chuck Wendig's 2017 novel Aftermath: Empire's End, the final installment in Star Wars: The Aftermath Trilogy. The polarizing prequel trilogy character Jar Jar Binks also appeared in the chapter. According to book reviewer and author Chris Taylor, Mapo's interlude chapter with Binks was a subtle commentary on the polarizing attitudes towards the latter within the Star Wars fan community."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}