{"url": "Mapper", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Advanced Recon Commandos", "Category:Galactic Republic intelligence personnel", "Category:Republic Army enlisted personnel"], "nodes": [{"tag": "h1", "text": "Mapper"}, {"tag": "p", "text": "Mapper was the nickname of an Advanced Recon Commando who served the Galactic Republic during the Clone Wars. Mapper was one of the ARC troopers assigned to the attack on Pengalan IV, which turned out to be a Separatist trap. Mapper's leg was badly injured when the LAAT/i gunship he was in was shot down. Although it was suggested that Mapper be put down due to his injury, the accountant Joram Kithe, who had been sent to evaluate the clone troopers' performance, came up with a plan that allowed the unit to complete the mission while taking Mapper with them."}, {"tag": "p", "text": "While recovering from his injury, Mapper was served as the partner and bodyguard of Kithe, who had now accepted a commission as a lieutenant in Republic Intelligence. Following his recovery, Mapper and Kithe were assigned a mission to the planet Tarhassan where they were tasked to a team of agents assigned with rescuing Edbit Teeks. Kithe and Mapper were able to successfully complete their assigned mission with help from Tinian Hanther, the most competent member of the group to which they were attached."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Pengalan IV"}, {"tag": "p", "text": "Mapper was an ARC trooper who served the Grand Army of the Republic during the Clone Wars. Like other clone troopers, he was a clone of the Human male bounty hunter Jango Fett. Mapper was assigned to a Republic attack on Pengalan IV. The accountant Joram Kithe was assigned to evaluate the clone troopers' performance, unaware that the soldiers in the unit were all ARCs. However, the attack turned into a rout when the factory the Republic was targeting turned out to be a Separatist trap. The ARCs' LAAT/i gunship was shot down, and Mapper's leg was badly injured in the ensuing crash."}, {"tag": "p", "text": "His wounds would have slowed the other troopers down, and Kithe, who was now in command of the unit, was told that Mapper might have to be put down. However, Kithe found that avenue of approach unacceptable, and instead rigged an ambush for a CIS patrol which had been dispatched to locate the downed clone troopers. The ambush turned into a success for the ARC's and the squad managed to gain control of an airspeeder that would allow them to carry Mapper with them to Tur Lorkin, which was the nearest village. Mapper, who happened to have a working datapad with detailed maps of the area, was appointed navigator, thus giving him his nickname."}, {"tag": "p", "text": "Mapper had the best infiltration skills of the unit, but his splinted leg limited his usefulness, keeping him sidelined for much of the action in Tur Lorkin. Instead, while his fellow clones and Kithe attacked Tur Lorkin's hidden diamond boron missile factory, Mapper waited outside on a modified STAP, where he was able to provide crucial support fire as the team exited the factory, destroying most of the droids that were laying in ambush."}, {"tag": "p", "text": "From there, the unit was able to flee the planet on a stolen starship, confident that their mission was complete."}, {"tag": "h3", "text": "Tarhassan"}, {"tag": "p", "text": "The injury that Mapper sustained on Pengalan IV required time to heal, and in the process, kept him away from the rest of his unit. During this time he was assigned to Kithe who had now accepted a full-time commission as a lieutenant in Republic Intelligence. Serving as his partner and bodyguard, Mapper took the alias Mapper Gann, and grew a beard to pass himself off as a non-clone. Following his recovery, Mapper and Kithe were assigned a mission to the planet Tarhassan where Mapper was able to put his considerable skills to good use, and during which he and Kithe were tasked to a team of agents assigned with rescuing Edbit Teeks."}, {"tag": "p", "text": "Unfortunately, Kithe's success as an accountant-turned-intelligence agent had spawned a Republic program to duplicate his success. As a result Mapper and Kithe were assigned to three bureaucrats on their first intelligence mission. Kithe had to intervene several times to correct blunders from the other agents, and had to resort to going behind mission commander Cherek Tuhm's back in order to save the life of a prisoner and get information on Teeks. Mapper served very well as backup to Kithe, and the other agents became rather fond of him, concentrating their ire on Kithe instead."}, {"tag": "p", "text": "Nonetheless, Mapper considered them idiots, and wasn't above knocking Tuhm unconscious during their jailbreak of Teeks in order to keep the man from fouling up the operation. Ultimately, Kithe and Mapper were able to successfully complete their assigned mission with help from Tinian Hanther, the most competent of the group they were attached to."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mapper was a talented soldier who was known to have been quite adept at the art of infiltration. He was also known to have always carried a datapad within his kit which he constantly kept up to date with maps concerning the planets of any mission he found himself on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mapper was created by author Aaron Allston and illustrated by Tommy Lee Edwards for the short story The Clone Wars: The Pengalan Tradeoff which was originally published Star Wars Insider 65 in 2003, and was later published as Hyperspace Fiction on January 27, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}