{"url": "Mar_Tuuk/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Males", "Category:Neimoidians", "Category:Separatist officers"], "nodes": [{"tag": "h1", "text": "Mar Tuuk"}, {"tag": "p", "text": "Mar Tuuk (pronounced /mɑɹ tuk/) was a male Neimoidian captain in the Navy of the Confederacy of Independent Systems. A shrewd tactician noted for his study of military history, he was charged by Emir Wat Tambor with overseeing the Separatist blockade of the planet Ryloth during the Clone Wars. Tuuk commanded a fleet of Munificent-class star frigates from his flagship, the Lucrehulk-class Droid Control Ship Procurer, deploying the vessels to thwart any attempt by the Galactic Republic to liberate the world."}, {"tag": "p", "text": "During the Battle of Ryloth, Tuuk went up against Jedi General Anakin Skywalker and his forces, luring them into a trap that destroyed one of Skywalker's three Venator-class Star Destroyers and forced the remaining two to flee. After realizing that the Resolute, Skywalker's flagship, had been present, Tuuk studied the Jedi Knight's history of accomplishments and began to respect him. Knowing that the Jedi would attempt another attack, Tuuk believed that should he defeat Skywalker, he would earn much prestige in the eyes of his comrades in the Confederate Navy."}, {"tag": "p", "text": "Skywalker later returned to Ryloth aboard the Defender, one of his two remaining Star Destroyers, and offered to surrender himself, his crew, and his ship in exchange for the transportation of medical and food supplies to the captive Twi'lek natives on the planet below. However, a scan of the incoming Defender indicated that Skywalker was the only one aboard, and that its forward shields were activated. Realizing that he had himself fallen into a trap, Tuuk abandoned the Procurer before the Defender collided with it in an explosion that obliterated both warships. The Separatist fleet, suddenly without a leader, was unable to counter the Republic attack and was subsequently destroyed, paving the way for the Republic to liberate Ryloth."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Ryloth blockade"}, {"tag": "p", "text": "Mar Tuuk was a male Neimoidian who hailed from the planet Neimoidia. A shrewd, veteran officer and a studier of military history, Tuuk served as a captain in the Navy of the Confederacy of Independent Systems during the Clone Wars, becoming a trusted naval commander in the eyes of Separatist leader Count Dooku. In 22 BBY, Emir Wat Tambor, the Skakoan Foreman of the Techno Union, tasked Tuuk with commanding the Separatist blockade of Ryloth, an Outer Rim world that had been occupied by Tambor and a force of battle droids. Commanding from his flagship, the Lucrehulk-class Droid Control Ship Procurer, Tuuk deployed his vessels to keep Republic forces from penetrating the blockade and landing on Ryloth. As added insurance against any Republic or Jedi attack, he opted to leave four Munificent-class star frigates in reserve, to be called upon when needed."}, {"tag": "p", "text": "As Tuuk anticipated, the Republic launched an attempt to liberate the captive Twi'leks on Ryloth. A force of three Republic Venator-class Star Destroyers—the Defender, the Redeemer, and the Resolute—under the command of Jedi General Anakin Skywalker and Admiral Wullf Yularen arrived in the Ryloth system to destroy the blockade. As a squadron of Republic V-19 Torrent starfighters, led by Skywalker's Padawan, Ahsoka Tano, attempted to destroy the Procurer and the two Munificent-class frigates in Ryloth's orbit, Tuuk called upon the four frigates he had kept in reserve to enter the fray, springing the trap. The warships' combined complements of Vulture droids overwhelmed the Republic forces, destroying many Republic fighters and launching suicidal attacks on the three Venator-class Star Destroyers. The Resolute and the Defender managed to escape into hyperspace, but the Redeemer was destroyed. Victorious, Tuuk reported on the engagement to Emir Tambor via hologram."}, {"tag": "p", "text": "Despite the success, Tambor warned the Neimoidian captain not to underestimate Skywalker, whom Tuuk had deduced was leading the engagement due to the presence of Skywalker's flagship, the Resolute. Intrigued by his encounter with the famed Jedi Knight, Tuuk sought to know every bit of information that the Separatists had on him. Impressed with the Jedi's accomplishments, the Neimoidian hoped to gain prestige for defeating him. Though Tambor doubted the Republic would risk making a second offensive, as the Republic's forces were spread too thin throughout the sector, Tuuk suspected Skywalker would return and decided to be prepared should the Republic renew the attack."}, {"tag": "p", "text": "Again, just as the Separatist captain had predicted, Skywalker returned to Ryloth aboard the damaged Defender. However, Tuuk had failed to correctly predict why the Jedi had returned. Skywalker contacted Tuuk aboard the Procurer, informing the Neimoidian that he was willing to surrender himself and his entire crew in exchange for food and medical supplies to be delivered to the captive Twi'leks on the planet below. Initially unbeknownst to Tuuk, Skywalker was the sole person aboard the Defender; with the help of his astromech droid, R2-D2, he had set the damaged Star Destroyer on a collision course with Tuuk's Droid Control Ship. When the Captain was informed that a scan of the incoming cruiser revealed that the Jedi was the only living being aboard, Skywalker told Tuuk that he could keep the Defender, just before he and R2-D2 evacuated their doomed ship in an escape pod."}, {"tag": "p", "text": "Realizing the danger he was suddenly in, Tuuk ordered all batteries to open fire on the incoming Star Destroyer. When the cannons were unable to destroy the damaged cruiser, Tuuk relinquished command of his flagship to a battle droid and managed to likewise evacuate in an escape pod before the Defender collided into the Procurer, destroying both warships. Suddenly leaderless, the droid commanders of the six Munificent-class frigates were unable to defend themselves against the BTL-B Y-wing and V-19 Torrent starfighters launched from the newly-arrived Resolute. The destruction of the Separatist blockade paved the way for the Republic's planetary assault force, and in time, the Twi'leks were liberated by a clone trooper force led by Generals Obi-Wan Kenobi and Mace Windu."}, {"tag": "h3", "text": "Separatist dealings"}, {"tag": "p", "text": "Some time following the conclusion of the Ryloth engagement, Tuuk met with Count Dooku's representative, Asajj Ventress, on the planet Tatooine. The two traveled to the Neimoidian world of Cato Neimoidia to conduct talks, only to be followed by a Jedi Knight seeking to uncover what Ventress was up to. After his meeting, Tuuk was confronted by the Jedi, who questioned him on the assassin's recent actions. Following their conversation, the Jedi departed to continue his investigation, leaving the Neimoidian behind."}, {"tag": "p", "text": "Tuuk later became involved in the Hutt crime lord Ziro Desilijic Tiure's plot to captured several shaaks from the planet Naboo and sell them on the Rodian black market. The Neimoidian hired the Trandoshan criminal Gha Nachkt to transport the shaaks aboard his freighter, the Vulture's Claw, and deliver them to Tatooine. The plot was uncovered by the Jedi Knight who had previously interrogated Tuuk on Cato Neimoidia, and the Knight proceeded to the Tatoo system, where he captured Tuuk aboard his Munificent-class star frigate. The Captain bargained for his release, supplying the Jedi Knight with knowledge of Ziro's involvement in the scheme. As it turned out, this was not the last encounter between Tuuk and the Jedi. On the trail of the Duros bounty hunter Cad Bane, the Knight learned from a gang of pirates that his quarry had fled to Cato Neimoidia to meet with the Captain. In their third encounter, Tuuk surrendered and informed the Jedi that Bane had departed to the Kaliida Shoals Medical Center, a Haven-class medical station near the Ryndellia system."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A veteran officer who had earned the trust of Count Dooku, Mar Tuuk was a capable fleet commander and tactician who studied up on military history. Having prepared his blockade of Ryloth for a Republic assault, he lured the enemy into a false sense of hope, springing the trap when they were right where he wanted them. At Ryloth, this tactic saw the destruction of one Star Destroyer and the retreat of the remaining two. In the interlude between the Republic attacks, Tuuk analyzed his opponent, Anakin Skywalker, developing a respect for the general. The Neimoidian believed that, once he defeated Skywalker, he would become a celebrated commander in the Confederate Navy. However, he underestimated the Jedi's resolve and fell for Skywalker's own trap. Realizing he had been duped, and rather than attempt some last-minute maneuver when his cause was a lost one, Tuuk abandoned ship to save himself."}, {"tag": "p", "text": "A cool-headed yet vain Neimoidian, Tuuk took pride in his appearance, savoring it more than a well-developed battle plan. Tuuk possessed a blaster pistol as his personal weapon, and he wore data goggles, equipped with a rotating scope, that connected him to many of his flagship's systems. His skin was green in color, though it could change under stress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Captain Mar Tuuk first appeared in \"Storm Over Ryloth,\" episode nineteen of Season One of the Star Wars: The Clone Wars television series, and was voiced by Corey Burton. Though unnamed in the episode itself, he was given the name \"Mar Tuuk\" in the \"Storm Over Ryloth\" episode guide published on StarWars.com. Concept art from both the episode guide and The Art of Star Wars: The Clone Wars indicates that he was originally named \"Martuk.\" Tuuk was named by Series Writer Henry Gilroy after Series Director Dave Filoni's cat."}, {"tag": "p", "text": "Tuuk was originally supposed to die when his flagship was destroyed, but his life was spared because he proved to be an interesting character to George Lucas and the crew of The Clone Wars. As a result, a scene was added showing him fleeing from the bridge of the Procurer, and a line given to a battle droid revealed that he had fled in an escape pod. However, the original version of events featuring Tuuk's death was later depicted in the young readers book The Clone Wars: The Battle for Ryloth, conflicting the TV series. Tuuk later appeared in the \"Card Commander\" mini-game found in the online game Star Wars: Clone Wars Adventures, and he was an unlockable character in the PSP and Nintendo DS versions of LEGO Star Wars III: The Clone Wars."}, {"tag": "p", "text": "In addition to establishing Mar Tuuk's homeworld as Neimoidia, and providing a pronunciation for his name, a featurette regarding \"Storm Over Ryloth\" in the Star Wars: The Clone Wars The Complete Season One DVD set reveals several details regarding the Neimoidian's creation. In the featurette, concept artist Kilian Plunkett compares Tuuk to Trade Federation Viceroy Nute Gunray; in fact, Tuuk's original character model was that of Gunray's, but with a different hat, shoulder pads, and data goggles. However, Plunkett was not impressed with the design, which still bore a considerable resemblance to Gunray, so he made some changes to the concept, including giving Tuuk a \"Mick Jagger, Donald Rumsfeld\"–like mouth. The featurette also introduces some confusion regarding the Neimoidian's rank—it refers to Tuuk as both a general and an admiral."}, {"tag": "p", "text": "An image of Tuuk, taken from \"Storm Over Ryloth,\" was included on several holoscreens in the Cato Neimoidia level of the video game Star Wars: The Force Unleashed II. A War Portrait of Tuuk was to be included with information on the Separatists in 2012's The Essential Guide to Warfare, but it was among the content cut before the book's publication."}, {"tag": "h3", "text": "Homages to The Last Starfighter"}, {"tag": "p", "text": "Elements of Mar Tuuk's character are references to the 1984 science fiction film The Last Starfighter, a favorite of Dave Filoni's. The rotating scope device on Tuuk's data goggles, as well as his command chair, was inspired by the gear of a Ko-Dan fleet officer, Lord Kril, from the film."}, {"tag": "p", "text": "In the original version of the episode, with the Defender about to ram the Procurer, a panicked battle droid asks Tuuk, \"What should we do?\" The Neimoidian merely replies \"We die,\" before the Star Destroyer rams his flagship. This whole scene was intended as another homage to The Last Starfighter, but neither the dialogue nor Tuuk's death made it into the final episode when Lucas decided to spare the Captain. This dialogue was used for Tuuk's non-canon death in the young readers book The Battle for Ryloth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}