{"url": "Marauder-class_corvette", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Confederation starship classes", "Category:Corvette classes", "Category:CSA starship classes", "Category:Galactic Empire starship classes", "Category:Marauder-class corvettes", "Category:Marauder-class missile cruisers", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "Marauder-class corvette"}, {"tag": "p", "text": "The Marauder-class corvette was a 195-meter-long light capital ship introduced prior to the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Marauder-class corvettes were equipped with eight double turbolasers and three tractor beam projectors, and could optionally support four more turbolasers if a larger power generator was installed. They had space for 12 starfighters, and capacity for 80 troops for use in boarding actions or planetary landings. Their very accurate tractor beams allowed them to capture ships with little collateral damage, and they were sometimes paired with ships equipped with gravity well projectors for this purpose. Some Marauder-class ships were equipped with four diamond-boron missile launchers in place of their heavy turbolasers."}, {"tag": "p", "text": "Sometimes called a \"Pocket cruiser,\" the Marauder's sublight speed was faster than a Victory I-class Star Destroyer. Although not powerful enough for engagements against warships such as those used by the Imperial Navy, they were excellent as patrol and interdiction vessels."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built by the profitable Sienar Technologies division of Republic Sienar Systems, a precursor to Sienar Fleet Systems, the Marauder-class was intended for use as a patrol and escort ship by the Galactic Republic. When the Republic declined to purchase them, mainly due to the Republic's inefficient bureaucracy and not any problems with the ship itself, Sienar managed to sell some to other small governments and organizations such as the Kathol Republic. Orders were slow, and the Marauder was considered one of Sienar's rare failures, so RSS finally sold production rights to the Corporate Sector Authority to be produced and used in the Corporate Sector."}, {"tag": "p", "text": "The ship was used extensively by the forces of the Corporate Sector Authority, where they could often be found in use as escorts for Victory-class ships in the Corporate Sector Authority Picket Fleet, or employed for law enforcement or anti-piracy actions. They eventually came into use by private individuals and a few outlaw groups."}, {"tag": "p", "text": "The Corellian Resistance owned a Maurauder-class corvette, Retribution commanded by Bria Tharen participated in the Battle of Ylesia."}, {"tag": "p", "text": "The Rebel Alliance also employed a few of the ships, which were mostly acquired from the Corporate Sector through piracy. Many Alliance Marauders had their turbolasers replaced with Diamond boron missile launchers, turning them into much more capable combat vessels able to handle most targets from range."}, {"tag": "p", "text": "Some Rebel Marauder-class ships continued to serve in the New Republic Defense Fleet. Imperial forces also utilized Marauders."}, {"tag": "p", "text": "Marauders remained in use in the Corporate Sector through at least 19 ABY, and the Diamalan Commerce Ministry purchased twelve of the ships approximately three months prior to the Caamas Document crisis. Pirate captain Zothip tried to buy the same ships, but was outbid by the Diamala. Around the same time, the crime lord Rei'Kas lost three Marauders against the Aing-Tii at Exocron. Some groups were known to employ Marauders as late as the Yuuzhan Vong War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Marauder-class corvette first appeared in Han Solo at Stars' End during the Corporate Sector Authority's attack on an outlaw tech base and later during the evacuation of Stars' End, but it was only identified as an \"Authority corvette\" in the former case and an \"Espo assault ship\" in the latter. A \"pocket-cruiser of the outmoded Marauder class\" later appeared in Han Solo and the Lost Legacy, but no connection between this particular vessel and the previous two was made until the publication of the Han Solo and the Corporate Sector Sourcebook, where it was also given specifications and a visual depiction for the first time."}, {"tag": "p", "text": "While a Marauder-class corvette did appear in the Darth Maul comic series, its size was inaccurate. It was drawn smaller than Darth Maul's Scimitar, only about the size of a starfighter."}, {"tag": "p", "text": "The same problem as stated above has occurred in Crimson Empire II: Council of Blood—pirate Sol Mon's ship that is attacking and intercepting Draisini looks exactly like a Marauder-class corvette, but is too small. Draisini, as a Xiytiar-class transport, should be shorter than the Marauder-class corvette; in the comic, it is much larger (about four times) than the attacker."}, {"tag": "p", "text": "While there are no explicitly-stated dimensions for the Marauder's width and height, measurements derived from scale-matching the dorsal and anterior schematic views in The Essential Guide to Vehicles and Vessels show the craft to have a calculated width of just over 131 meters, and a height of just over 22 meters."}, {"tag": "p", "text": "In Star Wars: Empire at War, the Marauder is equipped with four diamond-boron missile launchers instead of the eight double turbolasers and are used exclusively by the Rebel Alliance. These are intended to counter the Broadside-class cruiser. The version with the eight double turbolasers does appear in the expansion, but it is used exclusively by the campaign-only and non-playable Hutt Cartel."}, {"tag": "p", "text": "There are some inconsistencies regarding the speed of this vessel. While some sources describe it as being rather slow, others portray it as fast. In Star Wars: X-Wing Alliance, it operated at the lower end of starfighter speeds. This is comparable to the various reported speeds of the Lancer-class frigate, although in the case of the Marauder it is likely the result of the vessel's deceiving lines."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}