{"url": "Arkay-Nine", "categories": ["Category:Canon articles", "Category:Aqua droids", "Category:Security droids", "Category:Separatist droids", "Category:Separatist military members"], "nodes": [{"tag": "h1", "text": "Arkay-Nine"}, {"tag": "p", "text": "Arkay-Nine was a rebuilt aqua droid that acted as the personal security droid of Chadkol Gee, advisor to General Nossor Ri on the planet Mon Cala. The droid had once fought in a battle during the Clone Wars on Mon Cala, and was reconstructed by the time of the war between the First Order and the Resistance. When Gee took the Resistance operatives Rey, Rose Tico, and Chewbacca to court after they were attacked by Quarren in Dac City, he requested to settle the debate through the ancient rite of challenge, which was accepted by Rey, who believed she would have to fight Gee himself. However, Gee instead presented Arkay-Nine as his champion for the rite of challenge, which was held in the Sacred Arena of Salka'a. During the combat, Arkay-Nine overpowered Rey, but endangered a number of bystanders, leading Tico to interfere in the challenge, destroying Arkay-Nine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 20 BBY, during the Clone Wars, Arkay-Nine was one of many aqua droids deployed by the droid army of the Confederacy of Independent Systems during the Battle of Mon Cala, fought on the planet Mon Cala against the Galactic Republic. Arkay-Nine was destroyed in the battle, but was rebuilt, eventually serving as the personal security droid of Chadkol Gee, the advisor of the Quarren General Nossor Ri."}, {"tag": "p", "text": "Sometime between 34 and 35 ABY, a number of Resistance operatives visited Mon Cala in order to request assistance in their fight against the First Order. However, after an incident involving a brawl with a number of Quarren attackers, Resistance members Rey, Rose Tico, and Chewbacca were put on trial in the Mon Cala Court of Justice, in front of King Ech-Char. Gee suggested settling the debate by invoking the ancient rite of challenge, which involved a fight to the death. Rey accepted the challenge, believing Gee wished to fight her himself, but the Quarren presented Arkay-Nine as his champion for the combat."}, {"tag": "p", "text": "The rite of challenge was performed in the Sacred Arena of Salka'a, with Arkay-Nine and Rey facing off amidst a number of spectators. Rey managed to dodge Arkay-Nine's attacks, and managed to remove a portion of the droid's plating, uncovering its processor. However, Arkay-Nine struck Rey with its arm, shooting its laser cannon at her once she had been knocked to the ground. The shot missed, landing close to several bystanders. The droid fired another blast, almost hitting a member of the Mon Calamari Guard. Rey attempted to distract Arkay-Nine, calling for the bystanders to leave. Arkay-Nine prepared to fire at Rey, who had been knocked down, but Tico used a blaster spear taken from a Mon Calamari Guard to shoot the aqua droid's head off. While Rey survived the combat, Tico's interference in the challenge meant that the Resistance members were to be exiled."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Arkay-Nine was an aqua droid, an advanced type of battle droid manufactured by the Techno Union for use on aquatic planets. After it was rebuilt following the Battle of Mon Cala, Arkay-Nine served as a security droid. Arkay-Nine had a red photoreceptor and gray plating, which had become rusted by the time of its destruction. The aqua droid was equipped with a retractable laser cannon on its right arm, which could also serve as a circular spinning blade. As an aqua droid, Arkay-Nine stood at a height of 2.83 meters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arkay-Nine appeared in the comic Allegiance 3, written by Ethan Sacks, illustrated by Luke Ross, and published by Marvel Comics on October 23, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}