{"url": "Marblewood_Estate_heist", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Core Worlds", "Category:Heists and robberies"], "nodes": [{"tag": "h1", "text": "Marblewood Estate heist"}, {"tag": "p", "text": "The Marblewood Estate hiest was a high stakes theft that occurred on the planet Wukkar in 0 ABY. Bounty hunter Boba Fett, in disguise as local businessman Eanjer Kunarazti, requested that smuggler Han Solo break into the Marblewood Estate belonging to Black Sun Sector Chief Avrak Villachor and retrieve the 163 million credits that had been taken from Kunarazti. Later, the mission of the heist would include several blackmail files that Black Sun Vigo Qazadi was temporarily storing in Villachor's safe. Solo accepted the job and was able to have local Wukkar aristocrat Rachele Ree join him and help in recruiting a team that would include Chewbacca, Lando Calrissian, Bink Kitik, Tavia Kitik, Dozer Creed, Zerba Cher'dak, Winter and Kell Tainer. The heist was planned to be carried off during the Festival of Four Honorings part of which was being held on the Marblewood Estate. At the same time, Imperial Intelligence Agents Dayja and d'Ashewl were tracking Vigo Qazadi in an attempt to bring him down. Dayja provided information to Kunarazti (Boba Fett) on certain facts concerning Villachor's estate. After playing several cons to set up their heist and fighting their way out of a kidnapping attempt by Black Sun thugs and corrupt Iltarr City police officers, they were able to enter the estate, causing several confusing situations and distractions, enter the safe, and steal it contents. At the end, Boba Fett killed Vigo Qzadi and later waited (as Kunarazti) waited for Solo to show up to the meeting site so that Fett could take him in for the bounty. However, though Solo did not know it was Fett, suspected that Kunarazti was not who he was and did not show. The money taken from the safe turned out less than was originally promised, and the group broke up. Agent Dayja and d'Ashewl were able to convince Villachor to join them and reveal information on Black Sun in turn for the Empire's protection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}