{"url": "Marcus_Speedstar", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Racers"], "nodes": [{"tag": "h1", "text": "Marcus Speedstar"}, {"tag": "p", "text": "Marcus Speedstar was a human male and the brother of Jarek Yeager. Speedstar was known as one of the most famous racers in the galaxy, and had won the Five Sabers three times. The two were estranged, and had not seen each other in some time until Speedstar came to the Colossus platform to compete in the Platform Classic. He planned to use the prize money to pay off his debt to Guavian Death Gang, but also came to the Colossus to see his brother again. Following the race, Yeager did not forgive his brother for what happened in the past, but told Speedstar that he would forgive him one day."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A brother wronged"}, {"tag": "p", "text": "Marcus Speedstar was the younger brother of Jarek Yeager, a former New Republic starfighter pilot who became a professional racer following the Galactic Civil War. Speedstar followed his older brother into the racing industry and the two became skilled racers. However, Marcus was unable to beat his older brother Yeager during the races."}, {"tag": "p", "text": "In an attempt to beat his older brother, Marcus once refueled his racer with hyperfuel. However, Speedstar underestimated the effect that the hyperfuel would have on his ship. During the final leg of the race, Speedstar opened up the throttle when his racer was neck in neck with Yeager's racer. This caused his racer to spiral out of control and crash into the stands, killing Yeager's wife and daughter. Marcus' role in the deaths of Yeager's family poisoned the relationship between the two brothers. Yeager cut off Marcus from his life, refusing to speak with him for several years."}, {"tag": "h3", "text": "Racing celebrity"}, {"tag": "p", "text": "While Yeager ended his racing career and became a mechanic at the Colossus platform on the ocean planet Castilon, Speedstar continued his racing career and became a successful racer, winning the Five Sabers three times and achieving galactic fame in his racer Galaxy's Glory. His most loyal friends with the Esral'sa'Nikto Oplock and the astromech droid R4-D12, the former of who accepted his shortcomings and forgave him. Despite his racing successes, Marcus racked up debts after losing two races. On one occasion, he incurred the wrath of the Guavian Death Gang when he interfered with one of their starships on Rishi."}, {"tag": "h3", "text": "An unhappy reunion"}, {"tag": "p", "text": "Due to rising debts, Speedstar decided to contest the Platform Classic on the planet Castilon. Speedstar managed to convince the Colossus' administrator Captain Imanuel Doza to allow him to compete in the Platform Classic. However, Yeager refused to race his younger brother due to his lingering bitterness towards Marcus for his role in his family's deaths. Speedstar tried to speak with his brother during their meeting with Commander Doza but Yeager responded that he was not ready until another decade."}, {"tag": "p", "text": "Speedstar, Oplock, and R4-D12 later visited Yeager's garage. While Yeager's employees Tamara Ryvora, Neeku Vozo, and Kazuda Xiono welcomed their presence, Yeager was hostile and rejected Marcus' attempts at mending bridges. Misjudging Speedstar's motives, Yeager told his brother that he was obsessed with fame. Taking offense, Speedstar remarked that he would win easily since Yeager was unwilling to take part in the Platform Classic."}, {"tag": "p", "text": "Speedstar later visited Aunt Z's Tavern with his team. There he bought several patrons drinks. Shortly later, two Guavian security soldiers arrived and confronted Speedstar for touching one of the Guavian Death Gang's ships. Speedstar promised to pay them back using the 100,000 credits prize money from the Platform Classic. To ensure Speedstar's compliance, the Guavian enforcers took his friend Oplock hostage."}, {"tag": "p", "text": "Shortly later, Yeager arrived at Aunt Z's Tavern in an attempt to intimidate Speedstar into quitting the race by taking part. Determined to save his friend, Speedstar refused to give up and said he needed the money to save Oplock. As a result, Aunt Z placed bets on both Yeager and Speedstar, forcing Yeager to take part in the Platform Classic."}, {"tag": "h3", "text": "The Platform Classic"}, {"tag": "p", "text": "After leaving the cantina, Yeager \"loaned\" one of his mechanics Xiono to Speedstar. While Xiono tried to repair Speedstar's ship Galaxy Home, the two took the opportunity to get acquainted with each other. When Xiono complimented Speedstar by telling him he was one of the greatest racers in the galaxy, Speedstar described Yeager as the best racer in the galaxy. After recounting Yeager's background, Speedstar told Xiono about the fateful accident that destroyed his relationship with Yeager. When Xiono asked why he had come to Castilon, Speedstar told him about his financial troubles and his attempts to repair relations with Yeager."}, {"tag": "p", "text": "Unaware of the full details of the accident, Xiono told Yeager that he needed to reconcile with Speedstar. Yeager revealed that he lost his wife and child during the accident. Xiono tried to tell Yeager that Speedstar loved him but Yeager dismissed Speedstar as someone who was only concerned with fame; not believing that Speedstar's intentions were genuine."}, {"tag": "p", "text": "While waiting for the race to start, Speedstar and Yeager traded barbs with each other via comlink. During the first leg, Speedstar, Yeager, and the pilots of Ace Squadron flew through a series of rings. Yeager led the race with Speedstar holding second place. For the second phase, the contestants did an atmospheric climb into space. During the ascent, Speedstar told Yeager he had tried to talk to him numerous times."}, {"tag": "p", "text": "While re-entering Castilon's atmosphere, Yeager blamed Speedstar for the loss of family. Yeager and Speedstar managed to fly their ships through a ring which reactivated their engines. During the final leg of the race, Yeager taunted Speedstar that he could not beat him and demanded to know why he kept trying. A distraught Speedstar said that he was not seeking fame or money but was trying to save the life of a friend. Speedstar also reaffirmed his love for his brother and apologized for the hurt that he had caused him. Realizing that Speedstar's intentions were benign and genuine, Yeager made the decision to pull out of the race, allowing Speedstar to win."}, {"tag": "h3", "text": "Reconciliation with Yeager"}, {"tag": "p", "text": "Following the race, Speedstar paid the prize money to the Guavian Death Gang, freeing his friend Oplock who was delighted to see him. A charitable Yeager also helped Speedstar to pay the ransom. Later, Speedstar and Yeager embraced each other at Yeager's garage. Yeager said that it was good to have Speedstar back. While he was still unable to forgive Speedstar for the deaths of his family, Yeager said he would be able to forgive him one day. Speedstar and his team then departed on Galaxy's Glory."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Marcus Speedstar was a human male with brown skin, brown eyes, and black hair. In his younger days, Speedstar was had a close relationship with his older brother Jarek Yeager, whom he regarded as his only family. As noted by his older brother, Speedstar had the habit of of not staying in one place for too long. Speedstar was also ambitious and had dreams of becoming the best racer in the galaxy but was unable to beat his older brother Yeager. Speedstar attempted to gain an edge over his brother by injecting hyperfuel into his racer's engine. However, this backfired and Speedstar's racer caused an accident which claimed the lives of Yeager's wife and daughter."}, {"tag": "p", "text": "Yeager refused to forgive Speedstar, spurning the latter's efforts to reconcile with him for years. One of Speedstar's most loyal friends was the Nikto mechanic Oplock, who had a forgiving nature and was able to overlook Speedstar's flaws. Speedstar's friendship with Oplock led him to compete in a race in order to pay the ransom needed to free his friend. Despite his successes as a racing champion, Speedstar had a habit of racking up debts. His financial woes led him to take out loans from unsavory creditors like the Guavian Death Gang."}, {"tag": "p", "text": "Though Speedstar initially cared about fame and fortune, he came to regard family as more important due to his financial woes. Despite Yeager's hostility and bitterness, Speedstar persisted at his attempts in repairing relations with Yeager. Yeager relented after realizing that Speedstar genuinely wanted to save his friend Oplock from the Guavian Death Gang. While Yeager subsequently reciprocated Speedstar's attempts at reconciliation, he was still unable to forgive him fully at the moment for his role in his family's deaths."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Marcus Speedstar was a skilled racer who was regarded as one of the best in the galaxy, winning the Five Sabers three times. He was second only to his older brother Jarek Yeager, a veteran of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Marcus Speedstar was created for the Star Wars Resistance episode \"The Platform Classic.\" He is voiced by Keston John. Marcus' role was originally intended to be filled by Han Solo, as the episode's original outline had Solo coming to visit the Colossus, but the idea was soon changed to have the character being someone important to Jarek Yeager's past."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}