{"url": "Mareena", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Females", "Category:Mechanics", "Category:Tholothians"], "nodes": [{"tag": "h1", "text": "Mareena"}, {"tag": "p", "text": "Mareena was a female Tholothian mechanic who lived on the river moon of Al'doleem."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mareena married Jogg at some point in her life and had two children, Colli and her sibling. Years before the Imperial Era, Jedi Master Kirak Infil'a paid them to take care of his ship during his time under the barash vow."}, {"tag": "p", "text": "In 19 BBY, she and Colli were busy at work when Infil'a came back. She expressed her shock and said that she hadn't seen him in years. He requested that she give him back his ship. She said that she had to fix it up, but it wouldn't take too long and asked if he was in a rush.. Infil'a said that he was a Jedi, and that the Galactic Empire was hunting them down. Mareena replied that she heard about that and that was why they weren't sure if he was ever coming back and said that she never believed that the Jedi were traitors."}, {"tag": "p", "text": "Infil'a told them that he had an encounter with a Sith Lord, who tried to hunt him down, but Infil'a eliminated him himself. Then, he told them he wanted to also eliminate the Emperor and restore peace to the galaxy. Just then, Jogg came out with their other child and asked if everything was all right as he had heard voices. Mareena replied that everything was good and that Infil'a had come back. After Jogg expressed his surprise, Infil'a told them to get started fixing the ship. Mareena replied that she would, but asked Infil'a if the Sith would come to them, but Infil'a gave his assurances that Vader was dead."}, {"tag": "p", "text": "While Mareena and Jogg fixed the ship, Infil'a entertained them by using the Force on several materials. He told them of his plan to rebuild the Jedi Order and how he might come back to tell them of its mysteries. Then, he felt Vader coming and dropped the materials, worrying the family. When Mareena asked what had happened, Infil'a replied that he was sure it was nothing and that he'd come and check."}, {"tag": "p", "text": "Vader challenged him to a lightsaber duel. At first, Mareena couldn't figure out who the figure was, but then Colli suggested to her that it was the Sith. Infil'a told them all to get back to the garage and fix the ship, but Mareena asked what he was going to do, and he replied by taking out his lightsaber and said that he was going to end Vader. Mareena raced back to the garage and continued fixing the ship. She and her family were killed when Vader flooded the city by destroying a dam."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mareena had blue eyes and light skin. She wore a Tholoth headdress. She didn't believe that the Jedi were traitors and was in good terms with Kirak Infil'a."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Mareena specialized in mechanics, opening a garage and helped fix Infil'a's ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mareena first appeared in Darth Vader: Dark Lord of the Sith 4, a 2017 canon comic written by Charles Soule and penciled by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}