{"url": "Mari_Amithest/Legends", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Bear Clan", "Category:Females", "Category:Humans", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Mari Amithest"}, {"tag": "p", "text": "Mari Amithest was a four-year-old female Human Jedi Initiate enrolled in the academy in the Jedi Temple at the beginning of the Clone Wars. A member of the Bear Clan, she was one of its brightest members."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After she was taken by a recruiter of the Jedi Order's Acquisition Division, Amithest was sorted into the Bear Clan upon her arrival. As she entered the academy at the Temple, she received her early education from her clan leader, Grand Master Yoda. During one of the clan's daily lightsaber instructional courses on the Temple's veranda, Master Obi-Wan Kenobi approached Grand Master Yoda with a question. It appeared the Temple's Archives were incomplete and missing a system. One of Amithest's peers, J. K. Burtola, suggested that someone had erased the files, thereby explaining the archives' incompleteness."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "The Jedi hopeful Mari Amithest was portrayed by Phoebe Yiamkiati in Attack of the Clones."}, {"tag": "h3", "text": "Original script"}, {"tag": "p", "text": "Originally, Mari Amithest was one of the Jedi children that was given a speaking part and was merely identified as \"Jedi Child May\" in the script. Her brief speaking role in the drafts took place after Jedi Master Yoda asked the Bear Clan to give possible reasons regarding the planet Kamino's absence from the archive maps. Her reply to Obi-Wan Kenobi's question was: \"If the planet blew up, the gravity would go away.\" However, these lines were cut from the final version of the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}