{"url": "Maridun/Legends", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Galactic Empire planets", "Category:Infinite Empire planets", "Category:Rolion sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Maridun"}, {"tag": "p", "text": "Maridun was the grassy and forested homeworld of the Amanin species. Maridun went unnoticed for many millennia, and so was considered a haven by those who knew of of its existence. The planet came to support a colony of Lurmen who sought to escape the Clone Wars, and was the site of a battle when Confederate General Lok Durd arrived on the planet to test an experimental weapon. Amani could be found on the planet of Utapau, where many of them were refugees from Maridun."}, {"tag": "p", "text": "The planet was officially discovered by the Galactic Empire around 11 BBY after the Amanin made contact with them. The Empire created several mining colonies on the planet. When the Empire reduced its presence following the Battle of Maridun, the Hutts moved in and enslaved much of the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A temperate world of rolling, grassy plains and forested meadows, the planet Maridun remained largely devoid of permanent settlements until the rise of the Galactic Empire. Wildlife native to Maridun included birds, herd animals, dangerous predatory animals called charnoqs, mastiff phalones, carrier butterflies, fwits, and enormous lumbering corinathoths."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Maridun was a subject world of the Infinite Empire, though any and all traces of that long-forgotten government had disappeared by the time explorers first came upon the planet during the millennium surrounding the blazing of the Hydian Way. Those who first visited the planet quickly found the native Amanin to be frightening and vicious, and no known colonies were established during the time before the Ruusan Reformation of the Galactic Republic. While not directly involved in any early conflicts with the Republic, Maridun was located in space controlled by the Mandalorians during the Mandalorian Wars and later the Sith Empire during the Jedi Civil War."}, {"tag": "p", "text": "During the Clone Wars, a conflict between the Confederacy of Independent Systems and the Republic, a colony of Lurmen was established on the planet. As the Lurmen were pacifists, Maridun's neutrality and independence offered them a haven from the war, which had quickly spread to their species' homeworld of Mygeeto, a Republic target because of its affiliation with the InterGalactic Banking Clan. Led by village elder Tee Watt Kaa, the Lurmen erected a strongly pacifist society; nevertheless, the war was brought to them when a Republic cruiser carrying members of the Jedi Order crash-landed on the planet after a hyperdrive malfunction. In hopes of aiding an injured Jedi Knight named Anakin Skywalker, Padawan Ahsoka Tano and Jedi Knight Aayla Secura sought out the Lurmen settlement. As the Jedi began the recovery process, Confederate General Lok Durd landed on the planet and claimed to represent a peaceful government interested in saving the Lurmen from the Jedi Order and the Republic. Maridun was, in fact, a prime location to test fire the Defoliator weapon the Confederacy had just constructed. Kaa nearly accepted the Lurmen \"destiny\" to be destroyed by this weapon, but the recovered Jedi went against his orders to leave the planet and set up a shield defense around the village. During the ensuing battle, the Jedi disabled the Defoliator and captured Durd."}, {"tag": "p", "text": "Years after the war, using old data files on the planet, the Empire officially annexed the world in 11 BBY and established a mining operation on the planet. While the Imperial occupation went unperturbed for its first decade, the tribal Amanin rose up in defiance of the Imperial invaders and attacked the colony. As the casualties mounted, Imperial officer Janek Sunber, who had taken the command of the Imperial forces following the death of General Ziering, discovered the Amanin concept of takital and that they were an intelligent species capable of negotiating. Following a bloody battle, the Imperials made a deal with an Amanin lorekeeper in which his tribe would help slave traders capture Amanin from other tribes as slaves."}, {"tag": "p", "text": "Following the Imperial victory on Maridun, the battle became something of a legend amongst Imperial infantry, the Imperial propaganda machine having made the battle into a heroic struggle for survival—and of course, a success—from the display of officer ineptitude it had in fact been. After the Empire moved its attention towards other systems, smaller private interests, especially those associated with criminals like the Hutts, began to take control of the slave trade. After only a few years of Imperial and private slave trading, Amanin were spread through much of the galaxy. Some of these Amanin returned to Maridun with blasters and other advanced technology, taking control of local tribes. As cities began forming around old Imperial spaceports, the planet quickly became a hideout for those hoping to avoid local law enforcement in neighboring star systems."}, {"tag": "p", "text": "Following the fall of the Empire, Maridun was located in space controlled by Zsinj's Empire. When the Yuuzhan Vong invaded the galaxy, Maridun was cut off from the rest of civilization and controlled by the Yuuzhan Vong empire from 27 to 29 ABY until the Yuuzhan Vong were defeated and driven from the worlds they had conquered."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}