{"url": "Marilite", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gemstones", "Category:Lightsaber crystals"], "nodes": [{"tag": "h1", "text": "Marilite"}, {"tag": "p", "text": "Marilite was a type of gemstone that could be used as an energy source. Around the time of the Cold War between the Galactic Republic and the Sith Empire, crystals for lightsabers and blasters were sometimes made using marilite, which was also used in the construction of other weapon components. Around 18 BBY, a Jedi Knight named Jax Pavan hoped to get a crystal for building a lightsaber from one of Baron Vlaçan Umber's Ves Volette light sculptures, thinking that the sculpture could be powered with marilite. However, Baron Umber adamantly refused Pavan's request due to the fact that a light sculpture would be destroyed if its crystal was removed."}, {"tag": "h2", "text": "Properties"}, {"tag": "p", "text": "Marilite was a type of dark gray-colored gemstone that could be used as an energy source."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Cold War and the Galactic War between the Galactic Republic and the Sith Empire, marilite was used to make crystals for lightsabers and blasters, as well as to construct other weapon components. During that time, marilite gemstones could sell for fifteen credits each."}, {"tag": "p", "text": "Many years later, around 18 BBY, Jax Pavan, a Jedi Knight-turned-investigator, went to question Baron Vlaçan Umber at the baron's apartment in the Manarai Hills district of the Galactic Empire's capital planet of Coruscant regarding the murder of the light sculptor Ves Volette. When Pavan arrived at the baron's home, his droid companion, I-5YQ, noticed that the baron's Ves Volette light sculptures contained compressed energy crystals similar to those used in lightsabers, a traditional Jedi weapon that Pavan was trying to construct. Hoping to obtain one of the crystals, Pavan asked for one and suggested that the baron could replace one of the sculpture's crystals with another energy source such as marilite or pressure-treated halurium grains. However, the baron was shocked by the request and refused on the grounds that removing the crystal would destroy the sculpture."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Marilite was first mentioned in Coruscant Nights II: Street of Shadows, a 2008 novel written by Michael Reaves. Marilite first appeared in Star Wars: The Old Republic a 2011 MMORPG produced by BioWare as a grade-two gemstone that players with the treasure hunting crew skill can receive by sending their companions on missions. The treasure hunting missions that can have marilite as a reward are \"Going Once…,\" \"Map or Trap?,\" \"Pugilism,\" \"Retrieve This,\" \"Riddled by Riddles,\" \"Stolen Trophy,\" and \"Unclaimed Inheritance.\""}, {"tag": "p", "text": "In the game, marilite is used to construct higher-quality, low-level weapon upgrades, crystals, and lightsabers using the Artifice crew skill. Marilite's properties in The Old Republic potentially conflict with information provided in Street of Shadows, given that the gemstone can be used to construct a lightsaber crystal in the game, while in the novel Jax Pavan wanted to trade marilite for a crystal that could be used in constructing a lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}