{"url": "Marines_(SpecForce)", "categories": ["Category:Legends articles", "Category:Alliance Special Forces personnel"], "nodes": [{"tag": "h1", "text": "Marines  (SpecForce)"}, {"tag": "p", "text": "The Marines, also known as SpaceOps, were a division of the Alliance to Restore the Republic's Special Forces operating during the Galactic Civil War. Comprised of tough, hardened soldiers, the Marines were specially trained to fight aboard starships and space stations, and in zero-gravity. Equipped with light weaponry so as not to cause undue damage to their environment during combat, Marines generally wore light armor, or armored spacesuits."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Marines, also referred to as \"SpaceOps,\" were a military speciality within the Alliance to Restore the Republic's Special Forces. The first regiment of each of the ten SpecForce divisions was designated as the Marine Regiment. Marines were trained for combat aboard starships and space stations, with typical mission profiles including boarding and capturing enemy vessels, repelling invaders aboard their own craft, or as the vanguard of a spaceport landing assault. In addition to their combat role, Marines were deployed as security personnel throughout the ships on which they were assigned, posted to critical areas when the likelihood of enemy boarders was probable. Marine units relied on fast-moving assaults, using firepower and numbers to overwhelm the enemy, and were not above withdrawing in the face of stiff opposition."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, SpecForce Marines were deployed as part of Operation Cobolt, a mission to retrieve a Scandoc decoding computer from an orbital base over the planet Mantooine. A Marine unit using an assault boat breached the cargo doors on the station after an Infiltrator team disabled the base's deflector shields. The Marines established an airlock to allow more Marines—White Team, Black Team, and Red Team—in a Wolden-class shuttle to enter the station to retrieve the decoding computer and sabotage the base's power station. Once the objectives had been achieved, the survivors withdrew and the station fell into Mantooine's atmosphere. Marines commanded by BL-1707 and Basso were deployed via YM-2800 limpet ship to take control of an Imperial cargo convoy."}, {"tag": "p", "text": "As the Galactic Civil War moved from a state of insurgency and hit and run guerrilla assaults, the Marines were expected to be attached to standard line divisions, alongside Heavy Weapons Specialists units to assist in spearheading planetary assault and landings."}, {"tag": "h2", "text": "Personnel"}, {"tag": "p", "text": "SpecForce Marines were generally beings who were already comfortable with living in space; having either grown up around ships and ports, or spent a significant portion of their life in space. They were able to cope with the confinement inherent in space travel and living amongst the stars, and were used to the boredom that came with journeying through space on long voyages. Despite being around ships, the Marines almost never developed skills like piloting starships, or even astrogation. Because of their background, when the beings joined the Alliance, they were assigned ship-board duties until they requested a transfer to Special Forces, where they were inducted into the Marines due to their experiences. After completing drop camp, Marines were transferred directly to vessels throughout the Fleet and were trained on the job. Additional training was achieved through drills on moons or in deep space. Training in ship boarding, space combat and assaults were conducted in remote locations, such as deep space or remote planetoids, often against derelict and stripped hulks. Training in space weapons was conducted alongside Heavy Weapons Specialists squads."}, {"tag": "p", "text": "Marine life was tough, and the personnel were fighters at heart, thick-skinned and hard-headed with a reputation for charging into the fray. They were considered to be thick-headed by other Specs, although not directly, and were often referred to as \"vacheads.\" Officially, the nickname was derived from their operational environment. Marines also had a reputation for being vicious in combat, a result of the long periods spent aboard ship and in close company throughout the duration of their tour of duty. A Marine's goal was simple. Complete the mission, stay alive, protect their squadmates, and make it intact to the next shore leave."}, {"tag": "p", "text": "During the Galactic Civil War, Colonel Anena Seertay was the Alliance High Command Special Forces Regimental Marine Commander. Seertay was killed in action during the Primtara Offensive. Colonel Anna Seertay commanded the Marine boarding force that assaulted the Imperial orbital base over Mantooine during Operation Cobolt, while Gideon and Toombs led the follow-up Marine assault teams. Seertay and Toombs were killed in action during the mission."}, {"tag": "p", "text": "Team 19 was a platoon-sized unit based aboard the Mon Calamari Star Cruiser Mantan Wanderer, which was part of the 14th Roving Line. Under the command of Lieutenant Miko Beski, Team 19 was comprised of three Marine squads, a Heavy Weapons Specialists squad, and a squad of Technicians. They were utilized as the main boarding party force, and the core of the planetary assault force."}, {"tag": "h2", "text": "Skills"}, {"tag": "p", "text": "Marines were trained in close quarters fighting, hand-to-hand combat, and zero-gravity engagements. Marines spent the majority of their time developing and honing the combat skills and tactics required to fight aboard starships and other confined structures in space. Technical skills were given a secondary emphasis, while stealth training was kept to a bare minimum. Marines also had access to the Alliance's small collection of armored spacesuits and battle suits, and received training in their operation. Marines were able to identify which weapons were suitable to be deployed in certain areas of a ship to prevent undue damage to the vessel during combat operations. They were also trained in sabotage of shipboard systems. All Marines were capable of speaking Galactic Basic Standard."}, {"tag": "p", "text": "Marines were combat experts; they were trained to use blasters and grenades, and were skilled in both unarmed combat and melee combat, especially in zero-gravity. Marines had survival training with an emphasis on space survival, and were capable of applying first aid. In their role as shipboard security troops, Marines were trained to use the weapons aboard both capital ships and space transports, and could also assisting in repairs to the vessels if needed. Marines were also able to bypass security systems."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Marines were generally armed with light weapons to avoid causing damage to the interior of the starship they were in, but did use heavier weapons when attacking an enemy vessel. Armor-wise, Marines wore either a blast vest and blast helmet, or an armored spacesuit or battle suit. Marines also liked Karflo Corporation thinsuits due to their utility. Standard weapons included blaster pistols, blaster rifles, blaster carbines, grenades,—including fragmentation grenades—and a vibroknife. Marines also had access to either a light or medium repeating blaster, although the weapons were generally impractical to deploy aboard starships, and Czerka Arms flame carbines. An encrypted comlink allowed the Marine to remain in contact with their unit."}, {"tag": "p", "text": "Marine forces were commonly deployed through use of Katarn-class boarding shuttles, or Aegis-class combat shuttles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}