{"url": "Maris_Brood%27s_Master", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Jedi Guardians", "Category:Jedi Purge victims", "Category:Pilots", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Maris Brood's Master"}, {"tag": "p", "text": "A male Jedi warrior served as the Master of the Zabrak Padawan Maris Brood, teaching her aboard the starship Gray Pilgrim. Stationed in the Outer Rim Territories at the end of the Clone Wars in 19 BBY, he and Brood did not fall victim to Order 66, which saw many Jedi killed. Feeling the deaths of many of his comrades in the Force, the Master took a starfighter and set off to find out what had happened, never to return again."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Jedi warrior served the Jedi Order and the Galactic Republic during the Republic's waning days. The Jedi was the Master of the Zabrak Padawan Maris Brood, whom he tutored aboard the starship Gray Pilgrim. In 19 BBY, during the closing stages of the Clone Wars between the Republic's clone trooper army and the Confederacy of Independent Systems, the Jedi and Brood were stationed in the Outer Rim Territories. Because of that, they were not affected by Order 66, which dictated that the Republic's clone troopers kill their Jedi Generals. However, Brood's Master felt ripples in the Force caused by the deaths of other Jedi. After all of his transmissions to the Jedi Temple on the galactic capital of Coruscant were met with silence, the Jedi warrior took his personal starfighter and set off to find out what had happened. He discovered that the Jedi Order had been nearly exterminated by the Dark Lord of the Sith Darth Vader and relayed this information to Brood. However, he was not seen or heard from again after that. Seeking revenge, Brood began to search for Vader, but was soon found herself by Jedi Master Shaak Ti. Ti took the young Zabrak as her apprentice and spirited her away to the planet Felucia, where they sought refuge with the native Jungle Felucian species."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Maris Brood's Master was known as a Jedi warrior, indicating that his talents laid in battle. However, he also had a deep connection to the Force, able to sense the deaths of his Jedi brethren. He was a capable pilot and possessed his own starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maris Brood's Master was first mentioned in Brood's databank entry in the Star Wars: The Force Unleashed video game, which was released on September 16, 2008. The same entry, word-for-word, was repeated in the game's Prima Guide, The Complete Star Wars Encyclopedia, and in Maris Brood's entry in the now-defunct Databank on StarWars.com."}, {"tag": "p", "text": "According to early drafts of Brood's backstory, her Master was an unorthodox Jedi who roamed the fringes of the galaxy, using his power and influence to help those in need, often in ways that conflicted with the Jedi way. During Order 66, he was overwhelmed by the feeling of deaths of so many Jedi and left in search for answers. He never returned, leaving Brood without proper guidance, which resulted in her becoming the leader of a pirate gang. These elements were ultimately dropped in favor of Brood's current backstory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}