{"url": "Mark_Coulier", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Articles needing illustration", "Category:Star Wars production staff", "Category:Star Wars: Episode I The Phantom Menace actors"], "nodes": [{"tag": "h1", "text": "Mark Coulier"}, {"tag": "p", "text": "Mark Coulier is a British make-up artist and special effects designer who worked in Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "Coulier began his career at the end of the 1980s, working as a special makeup technician for Clive Barker's Hellbound, the first sequel to his popular Hellraiser horror saga."}, {"tag": "p", "text": "During the first half of the 1990s, Coulier worked mainly in horror and science-fiction movies: He was one of those responsible for the creature effects on Alien³ (BAFTA Award as a part of the team), plus he worked as the makeup special effects senior artist on another of Clive Barker's movies, Candyman. He was also a makeup effect designer or assistant in three movies about Frankenstein."}, {"tag": "p", "text": "He also began working with Jim Henson's Creature Shop."}, {"tag": "p", "text": "He founded Coulier Creatures, Ltd. in London in 1996, and the company won him an Emmy Award on 1997."}, {"tag": "p", "text": "Coulier returned to horror with spectacular Event Horizon (1997), replacing Sam Neill's eyes with empty sockets. He would work with Neill again the following year in the TV movie Merlin (Emmy Award for Outstanding Makeup for a Miniseries). He worked on TV again in 1999 with Nick Willing's Alice in Wonderland."}, {"tag": "p", "text": "On 1999, he also worked in spectacular The Mummy, another classic Universal Monster brought to fame by Boris Karloff. This time, Coulier was experienced enough to be one of the key animatronic model designers, alongside with Chris Barton and Michelle Taylor."}, {"tag": "p", "text": "He would be an animatronic designer again in Star Wars: Episode I The Phantom Menace, which he would also act in as the Malastare senator Aks Moe, though professional voice actor Marc Silk would be dubbed over him."}, {"tag": "p", "text": "He was awarded with the Online Film and Television Association Awards and nominated for the Online Motion Picture Academy Awards."}, {"tag": "p", "text": "Coulier continued his career only as a makeup designer, apparently not interested in more acting jobs. On 2000, he created effects for two TV movies, including Arabian Nights (John Leguizamo, Jason Scott Lee...), for which he won an Emmy for Outstanding Makeup for a Miniseries, and Jason and the Argonauts (Dennis Hopper, Frank Langella...), nominated to that same Emmy. He also was in Leonardo DiCaprio's blockbuster The Beach."}, {"tag": "p", "text": "On 2001, he would work as prosthetic makeup artist in both the crime drama Another Life and in The Mummy Returns, where he was the only prosthetic makeup. He would also be the head of the make-up unit in during production of Harry Potter and the Sorcerer's Stone and one of the animatronic model designers for Harry Potter and the Chamber of Secrets."}, {"tag": "p", "text": "On this same 2002 year, Coulier also worked on TV, becoming the make-up designer for the star of the movie Stig of the Dump. He also worked as prosthetic make-up artist for Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "Coulier worked on science fiction again as make-up effects artist on the mini series Children of Dune (2003), as well as in the crime movie 3 Blind Mice."}, {"tag": "p", "text": "In 2004, Coulier returned to the Harry Potter saga for its third installment, Harry Potter and the Prisoner of Azkaban, being one of the key animatronic model designers alongside Val Jones-Mendosa, Tacy Kneale, Paul Spateri and Guy Stevens."}, {"tag": "p", "text": "Coulier is also a Visiting specialist lecturer on prosthetic make-up, and attends to conventions where he signs and speaks about his work."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}