{"url": "Mark_II_assault_droid_(Cold_War)", "categories": ["Category:Legends articles", "Category:Training droid models"], "nodes": [{"tag": "h1", "text": "Mark II assault droid  (Cold War)"}, {"tag": "p", "text": "The Mark II assault droids were training droids used by the Jedi Liam Dentiri to test the physical capabilities of Padawans during the Cold War between the Galactic Republic and Sith Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Mark II assault droids had brown-colored plating with yellow stripes, as well as yellow sensors. Each droid carried a single blaster pistol for use in combat. Used as training droids, the Mark II was an upgraded version of the Mark I training droids, while the Mark III and Mark IV training droids improved upon the Mark II design."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The assault droids were used for training by elements of the Jedi Order during the time of the Cold War, a proxy-conflict fought between the Galactic Republic and Sith Empire. Around 3643 BBY, the Jedi instructor Liam Dentiri used them to test the combat abilities of Padawans on the planet Tython. The test consisted of the Padawans activating a console within the Jedi Temple's courtyard, which summoned a single Mark II assault droid that would proceed to attack the Padawan. In order to pass the test, the Padawan had to defeat the droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mark II assault droid appears in the 2011 BioWare video game Star Wars: The Old Republic. The droid model is featured in the \"Combat Leadership: Mark II\" optional side quest, which is part of the \"Combat Leadership\" series available only to the Jedi Knight and Jedi Consular classes on Tython. Although its name makes the droid unique, the model used for the Mark II assault droid is the same one used for various other droid models in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}