{"url": "Mark_I_Power_Guard", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Power Guard models"], "nodes": [{"tag": "h1", "text": "Mark I Power Guard"}, {"tag": "p", "text": "Mark I Power Guards were the first model of soldiers augmented with the Power Guard Enhancement System, a supersoldier program developed by the Galactic Republic. When the Sith Lord Sadic acquired control of the Power Guard project in 3643 BBY, he manufactured Power Guards using refugees and wiped their minds, transforming them into mindless weapons for him to control. Mark I Power Guards were the weakest model of Power Guard but were equipped with advanced weapons and armor like later models. Several Mark I Power Guards were left to defend the Power Guard Cybernetics Lab after Sadic moved the program elsewhere, though they were no match for a young Jedi Knight who arrived not long afterward. After Sadic's defeat, the entire project was scuttled."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Power Guard Enhancement System was developed by the Galactic Republic as part of the Republic superweapon initiative during the Cold War between the Republic and the Sith Empire. The Power Guard system was applied to willing recruits on the moon Nar Shaddaa, but in 3643 BBY, the Sith Lord Sadic seized control of the project and set about using it for his own ends. Instead of using willing volunteers, his forces began abducting refugees and forcing them to undergo the Power Guard process—but their minds were also wiped and programmed, giving Sadic droid-like supersoldiers."}, {"tag": "p", "text": "When a young Jedi Knight began disrupting Sadic's operations, Sadic relocated the Power Guard program to another location, leaving only a handful of Mark I Power Guards along with his subordinate Commander Graul at the original Power Guard Cybernetics Lab. The Jedi Knight and a companion soon located the facility and stormed the building. When the Jedi breached the main chamber, the Knight briefly spoke with Sadic via holocomm, and then Sadic activated the remaining Mark I Power Guards stored in the lab to support Graul. However, the Knight and a companion killed Graul and the Power Guards."}, {"tag": "p", "text": "The Power Guard program came to an end not long afterward, with the Republic destroying all of the program's files."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A Mark I Power Guard was a supersoldier augmented with the Power Guard Enhancement System—an array of cybernetic enhancements and adrenal stimulants. Each Mark I Power Guard was a Human or humanoid individual who underwent the Power Guard modifications, and thus every individual Power Guard was unique in height, weight, and gender. The Power Guard system was originally intended to produce supersoldiers who retained their personalities and individualism, but when Sadic seized control of the project, he added mind-wiping and mental programming to the process, creating drone soldiers who followed his commands."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Each Power Guard was equipped with advanced armor based on the standard Republic trooper version and also carried an advanced blaster rifle and vibrostaff for combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mark I Power Guards first appeared in the Jedi Knight-class mission \"Red Light, Black Heart\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. The Power Guard project can either be salvaged for dark-side alignment points or destroyed for light-side alignment points, but as the Jedi Knight is a Republic character and thus assumed to make only the choices that reward light-side alignment points, this article assumes that the project was destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}