{"url": "Mark_Newbold", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Cleanup", "Category:Reference work authors"], "nodes": [{"tag": "h1", "text": "Mark Newbold"}, {"tag": "p", "text": "Mark Newbold has been a writer for the Star Wars Insider since 2006, contributing to the My Star Wars, Red Five and Launchpad sections as well as feature articles and interviews. He is a regular contributor to StarWars.com and has also written for De Agostini's Build The Millennium Falcon partwork, the Spanish version of the Star Wars Fact Files, Starburst magazine, Geeky Monkey magazine, Model and Collectors Mart, Film and TV Memorabilia magazine, Star Trek The Official Magazine, StarTrek.com and The Metro blog."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mark Newbold first printed appearance was in the letters page of Return of the Jedi Weekly 11 on August 31, 1983, where his fan-fiction character \"Jan Lomona\" appeared."}, {"tag": "p", "text": "His role as a freelance contributor to the Star Wars Insider began with Star Wars Insider 90 in September 2006, where he contributed an article on The 2006 Artoos Awards Ceremony. From Star Wars Insider 130 to Star Wars Insider 167 he wrote most of the My Star Wars entries and was the primary contributor to the Red Five section. As of Star Wars Insider 138 he began contributing to the Launchpad section of the magazine."}, {"tag": "p", "text": "In April 2009, Newbold contributed to the official Star Wars site with a piece on the opening night of Star Wars: In Concert. He then went on to be a Featured Blogger on the site, and one of the very first non-Lucasfilm employees to contribute to the official websites blogs."}, {"tag": "p", "text": "In December 2012, he was also the third guest blogger on the Dark Horse Blog leading up to the release of first issue of the new Star Wars title by Brian Wood."}, {"tag": "h3", "text": "Fansites"}, {"tag": "p", "text": "Newbold was editor on the fansite lightsabre.co.uk between 2000 and 2009, which hosted his first podcast —Setnin Radio. He then was the daily content manager of Star Wars website Jedi News from 2010 to 2017, and was the host of RADIO 1138 (formerly on the Rebel Force Radio feed), which launched its debut episode in October 2013. He also co-hosted the Take Cover podcast with Brian Cameron and Matt Booker. In totality, he has appeared on over 80 different podcasts since 2005. Now the Editor-in-Chief of Fantha Tracks, a UK Star Wars fan site, he is also the network director of Fantha Tracks Radio and co-hosts the shows Making Tracks with Rebel Legion UK CO Mark Mulcaster and Canon Fodder with Mulcaster, Cameron and Booker."}, {"tag": "h2", "text": "Star Wars published works"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}