{"url": "Mark_VII_experimental_prototype_assassin_droid", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with gameplay alternatives", "Category:Assassin droids", "Category:Jedi hunters", "Category:Masculine programming", "Category:Sith military personnel"], "nodes": [{"tag": "h1", "text": "Mark VII experimental prototype assassin droid"}, {"tag": "p", "text": "The Mark VII experimental prototype assassin droid, also referred to as the rogue assassin droid, or simply nicknamed Mark VII, was a droid that had been created to be the prototype for a series of assassin droid to be manufactured by the Sith Empire based on the graveyard world of Korriban. Designed specifically to hunt and exterminate Jedi, the droid proved to be more than its designers could handle, escaping from their custody in a murderous rampage. Hiding itself within the burial chamber of the Tomb of Marka Ragnos, the droid built for itself a guard force of lesser battle droids, who attacked any would-be assailants that made too much noise. Eventually, the former Sith Lord Revan found the droid and, using a sound-dampening device, managed to re-tune the droid's audio sensors and deleting its assassination programming. Grateful for the help it had received, the droid quickly fled the planet for parts unknown."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Construction and escape"}, {"tag": "p", "text": "The Mark VII droid was originally constructed to be the baseline for a series of assassin droid whose primary function was to seek out and exterminate any Jedi that it could hunt down. However, due to its programming being of a more independent nature than was the norm, even for assassin droids of the day, this prototype somehow developed an appreciation for all life, which was perhaps the antithesis of its creators' intentions. Unfortunately, the droid's auditory sensors had been incorrectly tuned to be far too sensitive, so that when it was first activated, the ensuing noise overload tripped its combat circuits. In hopes of quieting the excessive torrent of audio input, it began slaughtering every sentient being it encountered before fleeing the facility in which it had been built. Eventually making its way to the Valley of the Dark Lords, where a number of Sith tombs had been built over the centuries, the fugitive droid carved out a sanctuary within the inner burial chamber of the Tomb of Marka Ragnos. Once hidden, it proceeded to build and recruit a legion of battle droids into protective service."}, {"tag": "p", "text": "Its creators, however, were not about to give up on their project. Led by the droid's original creator, they soon mounted an expedition into the tomb in order to recover the droid. Unfortunately, one of the retrieval team's members, Ben Hu'al, had failed to bring his own sound suppressor; as a result, the team was detected and quickly dispatched by the droid's forces. Later, as the Sith presence on Korriban grew with the oncoming Jedi Civil War led by the former Jedi Knights Darth Revan and Darth Malak, culminating in the establishment of the Korriban Academy, a number of students attempted to recover or destroy the droid. None of these efforts succeeded, however, and fewer and fewer attempts were made."}, {"tag": "h3", "text": "Assistance from Revan"}, {"tag": "p", "text": "A number of years later, the mind-wiped former Sith Lord Revan encountered the droid when he and the crew of the Ebon Hawk traveled to Korriban in search of that world's ancient Star Map, some time in 3956 BBY. It was this quest to locate the mysterious Star Forge, which seemed to be at the heart of the Sith war effort, that prompted such a journey so deep into Sith-occupied space. While attempting to gain access to the Tomb of Naga Sadow that held the map he had seen through a vision, Revan, after successfully infiltrating the Sith academy that was the only means of accessing what he needed, entered the burial site of Marka Ragnos in order to eliminate the rogue droid. This was supposed to be just one such act in a series of deeds that were meant to gain prestige in the eyes of the Academy's headmaster, Uthar Wynn, who would decide who among that year's class was worthy to take a final test within Sadow's tomb. After carving his way through the phalanx of war droids that the prototype had built to guard the long hallway that led to its place of refuge, Revan, on the advice of another Sith student and that of a datapad that had been salvaged from the corpse of the original creator, equipped a sound-dampening device before entering the final chamber to confront the droid."}, {"tag": "h3", "text": "Final escape"}, {"tag": "p", "text": "Grateful that Revan had sufficiently dampened his ambient sound output so as not to overwhelm its auditory circuits, the rogue droid appealed to him to fix it and rid itself of its assassination protocols, which ran at odds with its desire to protect and appreciate life. After receiving as much in the way of instructions that the droid was able to furnish, Revan did so, working his way through and shutting down the droid's various levels of programming, starting with the Combat Matrix. Revan then worked further, and disabled the Motor Function Matrix, Sensory Systems Matrix, Memory Matrix, Cognitive Systems, Emotional Construct Matrix, Creative Simulation Matrix, finally ending with the droid's Core. These individual shutdowns initiated a complete systems shutdown; this allowed for the removal of all assassination programming. Once the droid's brain had been reinitialized, the operation was proved to be a success; as a reward, the droid offered up its now unneeded armaments and upgrades and left the planet via an internally-mounted rocket pack for parts unknown, confident that the Sith would never be able to find it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Though the Mark VII prototype had been designed to be an efficient hunter of Jedi, due to its complex programming and nature, it became self-aware and somehow developed an appreciation for all life and recognition of the value thereof. The rogue droid possessed sufficient awareness to realize that it was this highly-independent and unusual programming that prompted its ability to see the infinite complexities of all organic lifeforms. Unfortunately, due to its integrated assassination protocols, the Mark VII prototype was unable to reconcile the two disparate aspects of its personality matrix; on top of this, its overly-sensitive audio receptors usually precluded seeking outside assistance from organics who would have been able to assist it to achieving its desired goals. Despite its almost desperate need to escape from its original purpose, it was forced to terminate nearly everyone who came across it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While the droid bears an outer resemblance to war droids seen throughout Star Wars: Knights of the Old Republic and its sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, it is likely that the similarity is cosmetic only, and that the upgrades were entirely internal. This is plausible due to the fact that the Sith Empire of this era was largely made up of former Republic soldiers who had fought under Revan during the Mandalorian Wars and had regularly used combat droids of this form during their campaigns. Additionally, many droids bearing a resemblance to the Mark VII were utilized by criminal organizations, such as the Black Vulkars swoop gang that was based on Taris; these could have been sold off as military surplus or acquired through black market organizations like the Exchange."}, {"tag": "p", "text": "If the player does not equip a sound-dampening stealth unit, or lacks sufficient skill points in repair in order to successfully reset the puzzle inherent in fixing the droid if a mistake is made, it will become hostile and attack. Alternatively, if the player decides to take the darker path, they can set the droid to self-destruct, thus destroying it without a fight. It is also possible to choose not to use a sound-suppressor and simply fight and destroy the droid and its guards. It is only possible for the player to gain prestige with Master Uthar if the droid is destroyed or if the player has a high enough Persuade modifier to convince Uthar that he activated its self-destruct; in addition, this side-quest can be completely ignored, as entering the tomb of Marka Ragnos is entirely optional. The designation of \"rogue assassin droid\" is an in-game mechanic, as it is the name given within the dialogue history."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}