{"url": "Marka", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Sith acolytes and apprentices", "Category:Sith of the New Sith Wars", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Marka"}, {"tag": "p", "text": "Marka was a Force-sensitive Human female who was enslaved to the Toydarian Lod. During the final years of the New Sith Wars, she encountered the Sith Master Finn and his apprentice. After Lod struck Marka for disobeying her, the apprentice killed the Toydarian, freeing her. She used a mind trick on the young man in an attempt to convince him to take her with the Sith, and she then followed the two Sith to their starship and begged Finn to allow her to accompany them. When the Sith Master refused, citing the fact that he already had an apprentice, Marka seized the apprentice's lightsaber and pushed him off the building's docking pad, murdering him. With his death, she assumed the role of Finn's new Sith apprentice."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Marka, a Human female, was enslaved by the Toydarian Lod during the final years of the New Sith Wars. She and Lod encountered the Sith Master Finn and his apprentice on a planet shortly after they destroyed a building. Lod ordered Marka to impress the men by showing them her teeth; however, she refused. Lod struck her, and Finn's apprentice helped Marka to her feet, swearing that Lod would not hit her again. As Lod conversed with Finn, the young man killed the Toydarian, freeing Marka."}, {"tag": "p", "text": "After Finn rebuked him for helping Marka, she thanked the man and used a mind trick on the apprentice in an attempt to convince him to take her with the Sith. She followed the apprentice as he went to tell Finn that she was Force-sensitive, and the Sith Master ordered his pupil to deal with Marka. However, she and the apprentice pursued Finn up the turbolift which led to the docking pad where the Sith's starship was. Marka begged Finn to allow her to accompany them, saying that she could learn the Sith ways, but Finn refused, citing that he already had an apprentice and had no use for a slave. In order to overcome this obstacle, Marka seized the apprentice's lightsaber and threw him off the docking pad, sending him plummeting to his death. Marka then assumed the role of Finn's new Sith apprentice."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When Finn's apprentice killed Lod and freed Marka, she was grateful for his actions, but she also attempted to convince him to take her with the Sith. After Finn initially refused to allow her to accompany them due to the fact that he had a pupil, she murdered the man who freed her from slavery in order to become Finn's apprentice. After becoming Finn's apprentice, he demanded absolute loyalty from Marka."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Marka was noted by Finn as powerful with the Force; the Sith Master was able to sense her ability when she and Lod approached him and his apprentice. Marka was able to use the mind trick ability, and utilized it on Finn's Sith apprentice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Marka first appeared in the short comic \"The Apprentice\", which was featured in Star Wars Tales 17 and written by Mike Denning. In the comic, she was drawn by David Nakayama. The story was later compiled into a trade paperback version and republished in Star Wars Tales Volume 5. Plausible stories in Star Wars Tales 1–20 were initially viewed as S-canon until referenced in a non-Tales source, at which point the subject matter was elevated to C-canon status. Marka received an entry in The Complete Star Wars Encyclopedia, elevating the character's appearance in The Apprentice to C-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}