{"url": "Mark_of_the_Hero", "categories": ["Category:Legends articles", "Category:Artifacts"], "nodes": [{"tag": "h1", "text": "Mark of the Hero"}, {"tag": "p", "text": "The Mark of the Hero was a ring of great power gifted to a spacer who had gone above and beyond in his protection of the inhabitants of Tatooine."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The ring was in the possession of an unnamed hermit in a squill cave on Tatooine. In 1 ABY a spacer who was exploring the cave met the hermit at his home at the bottom of the cave. After a brief discussion between the two, the spacer made it clear they did not support the Galactic Empire. The hermit asked the spacer if they would retrieve a missing item of his from mouth of the cave, which the spacer agreed to do. The item turned out to be a squill skull. After returning it to the mysterious hermit, he tasked the spacer with four more heroic acts on Tatooine, which the spacer readily accepted. The spacer soundly completed the four tasks, including using their intelligence to deduce who was a troubled bounty hunter's target, and a display of their altruism by assisting a moisture farmer in distress by rescuing his family from the Sennex. After all task were completed, the spacer returned to the hermit and told him of their success. The hermit applauded the spacer for their bravery and heroism and declared them the Hero of Tatooine. He awarded them with a unique spherical sculpture, and the Mark of the Hero, which was believed to be able to bring its bearer back from the brink of death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mark of the Hero is a unique ring in Star Wars Galaxies: An Empire Divided. It is awarded to a player who completes the Hero of Tatooine quest line. Its function in-game is that of resuscitation. If used within a certain time after dying, it will bring the user back to life. Its uses are limited to 50 however, after which is becomes mere jewelry. It can only be used once every twenty-three hours."}, {"tag": "h2", "text": "Appearances"}]}