{"url": "Market_Row", "categories": ["Category:Legends articles", "Category:Cloud City locations", "Category:Markets"], "nodes": [{"tag": "h1", "text": "Market Row"}, {"tag": "p", "text": "Market Row was a corridor located on the 121st level of Cloud City on the planet of Bespin. Part of the Port Town district, the corridor was originally used as a flight corridor, but it had became a bustling market by the time of the Galactic Civil War. The Row became considered the best place to buy or sell anything in Port Town, legally or illegally. During the war the Pantoran Aris Shen arranged to meet a group of spacers hired by her father for a heist in Market Row. She was tailed there by a group of thugs working for her husband, Vorse Tabarith, but lost them with the spacers' help."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Market Row was a corridor built within Cloud City on the planet Bespin. Located on the city's 121st level, a part of the Port Town district, the corridor was almost seven kilometers long and about one hundred meters wide, with a ceiling high enough for small starships to fly under. It connected the outermost edge of city to the central shaft, with both ends sealed by massive hatches. Several chambers were also connected to the corridor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The corridor was originally used by remote-control operated droids and maintenance starships to reach the internal spaces of Cloud City. This useage eventually came to an end however, and by the time of the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire, the corridor had been converted into a busy market place. The row was considered the best place to buy and sell in all of Port Town, in both legal or illegal goods. A constantly shifting arrangement of stalls, vendors, food carts and illegally parked starships filled the space and its surrounding chambers, selling a large variety of goods to those that passed through. During the civil war, these included everything from weaponry, as sold by the Wookiee gunsmith Rowralorr, to exotic pets and food animals, which were available at the Hatchery run by Tezli Odo. Bothawui Jewellers was a jeweling business which was run by the Bothan couple Henna and Cidri out of the back of a JumpMaster 5000 starship during this time, and Hobi Rann's Fine Imported Goods provided cheap and colorful imports from all across the galaxy."}, {"tag": "p", "text": "While the corridor functioned as a market, the internal hatch leading to the central shaft was kept closed at all times, but the external hatch was kept open. This was to allow an Ugnaught work crew responsible for the corridor in and out, although they shut the hatch in times of dangerous weather. This hatch allowed starships to still enter the market, although they were advised to fly slowly once inside. While the corridor functioned as a market during the civil war, the Pantoran Arend Shen hired a group of spacers to pull off a heist for him within Cloud City, and arranged for his daughter Aris Shen to rendezvous with them in Market Row. Aris made her way to the market, but was followed by a group of thugs working for her husband, the local crime lord Vorse Tabarith. Once she found the spacers at rendezvous point they had agreed on, she asked them to help her lose the thugs without drawing her pursuers' attention."}, {"tag": "p", "text": "The spacers successfully aided Aris in escaping the thugs, who were lead by the Lutrillian Bhurra."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Market Row first appeared in The Jewel of Yavin, an adventure module released by Fantasy Flight Games in 2014 for Star Wars: Edge of the Empire. The book gives a number of options as to how players can help Aris escape, and this article makes no assumption as to which was chosen. The article does assume however, that the players were successful in helping her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}