{"url": "Marketta-class_shuttle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Marketta-class shuttles", "Category:New Republic starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Marketta-class shuttle"}, {"tag": "p", "text": "The Marketta-class shuttle was a transport shuttle featuring retractable wings and a passenger cabin that could hold at least four individuals. Created during the reign of the New Republic, the shuttle was used by the New Republic's military, and one such Marketta-class shuttle, the Chandrila Moon, carried Leia Organa Solo of the New Republic in 25 ABY to meet with representatives of the Imperial Remnant on the planet Bastion during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Marketta-class shuttle was a life support–equipped transport shuttle that had a narrow passenger cabin with rows of seating and room to accommodate at least four individuals. A screen situated at the front of the cabin allowed the passengers to see where the shuttle was headed. The Marketta-class shuttle also featured retractable wings and engines, and had an egress hatch and a landing ramp near the passenger cabin. The shuttle required at least one pilot to operate."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Marketta-class shuttle was mainly used by the New Republic's military."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The shuttle was created during the early decades of the New Republic. In 25 ABY, during the Yuuzhan Vong War, in which the extra-galactic Yuuzhan Vong species invaded the galaxy—one Marketta-class shuttle, the Chandrila Moon, was based on the New Republic Victory-class Star Destroyer Protector. That year, in an effort to improve relations between the New Republic and the Imperial Remnant in the face of the threat posed by the Yuuzhan Vong, the Protector ferried Ambassador Leia Organa Solo to the edge of the Sartinaynian system, the location of the Remnant's capital planet, Bastion. There, the Remnant permitted the New Republic to dispatch a single shuttle, and the Chandrila Moon carried Organa Solo, her two Noghri bodyguards, and the scientist Danni Quee to the primary docking bay of the Bastion customs station before they went on to meet Imperial Grand Admiral Gilad Pellaeon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Marketta-class shuttle appeared in Michael A. Stackpole's Dark Tide II: Ruin, which was published in 2000 as part of The New Jedi Order series. The shuttle later received an entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}