{"url": "Market_Street_Outdoor_Exchange", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "Market Street Outdoor Exchange"}, {"tag": "p", "text": "The Market Street Outdoor Exchange was an outdoor market in the Upper City of the Outer Rim planet Taris, extant during the era of the Mandalorian Wars. Located on Market Street, the Exchange was a location where entrepreneurs and industrialists were known to offer investment opportunities to locals—one such endeavor was a fleek eel importing proposition promoted by a Snivvian known as Baron Hieromarn."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Market Street Outdoor Exchange was a well-known outdoor market on Market Street, located in the Upper City of the Outer Rim world Taris during the time of the Mandalorian Wars. The Outdoor Exchange was an area where businessmen and entrepreneurs could gather to offer investment opportunities."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3964 BBY, a Snivvian self-proclaimed industrialist going by the name \"Baron Hieromarn\" made the Market Street Outdoor Exchange the site for a sales pitch to prospective investors. Promising a three-for-one return on investment, Hieromarn attempted to convince locals to fund the purchase and crewing of a tanker, which would bring fleek eels from the planet Falleen's Hocekureem Sea to Taris for the local restaurant trade. During the Mandalorian siege of Taris the following year, the entire Market Street area was heavily looted. A short while after the departure of the looters, Market Street was seized by the Mandalorian invaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Market Street Outdoor Exchange, although never actually making a direct appearance, was first mentioned in The Taris Holofeed: Prime Edition, an in-universe news report appearing on the last page of the comic Knights of the Old Republic 0. So far, it is the location's only mention in the Star Wars canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}