{"url": "Marko_Tyne", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Slavers", "Category:Zygerrians"], "nodes": [{"tag": "h1", "text": "Marko Tyne"}, {"tag": "p", "text": "Marko Tyne was a male Zygerrian slaver who was wanted for unlicensed slaving by the authorities of the Thesme sector. In 0 ABY, Tyne was killed by the bounty hunter Beilert Valance on Feriae Junction, who claimed the bounty on him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Marko Tyne was a Zygerrian male active during the Galactic Civil War, who conducted unlicensed slavery in nine of Thesme sector's star systems at some point prior to 0 ABY. For these acts, he was wanted by Thesmian authorities. Not long after the Battle of Yavin, Tyne visited the Junction City cantina on the planet Feriae Junction. He was tracked there by the bounty hunter Beilert Valance, who killed him with a blaster shot to the chest, much to the shock of the cantina visitors. Claiming the bounty on Tyne's head, Valance forced two cantina patrons to carry the slaver's body out of the establishment."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A brown-haired Zygerrian, Tyne engaged in slavery, the traditional business of his species. He owned a blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Marko Tyne first appeared in the opening pages of Star Wars 27, a 1979 comic book written by Archie Goodwin and illustrated by Carmine Infantino. The character went unreferenced for many years, until The Hunt Within: Valance's Tale, Mission 5: Showdown on Junction, a 2005 scenario for Wizards of the Coast's Star Wars Miniatures game, mentioned Tyne, identifying him as a Zygerrian. Despite being established as such, Tyne bears no resemblance to the later official Legends appearance of the Zygerrians, lacking any bony spurs on his face."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}