{"url": "Marl", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Duelists", "Category:Humans", "Category:Males", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Marl"}, {"tag": "p", "text": "Marl was a Human male who made his living as a duelist on the planet Taris during the Jedi Civil War. Marl's career spanned nearly twenty years, and by 3956 BBY, he became the dueling champion after the retirement of Bendak Starkiller. However, he was eventually defeated by the Rodian Twitch for the title of champion. After Marl was beaten by the Republic soldier Revan, the veteran duelist retired from the sport."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Marl was a Human male who lived during the time period after the Great Sith War between Sith Lord Exar Kun's Sith Empire and the Galactic Republic. Around 3976 BBY, Marl began his career as a professional duelist in the dueling ring run by the Hutt crime lord Ajuur on the planet Taris. By 3956 BBY, the current dueling champion, Bendak Starkiller, retired after death matches were outlawed by the forces of Darth Malak's Sith Empire, which had quarantined the planet in order to search for Jedi Knight Bastila Shan. Marl became the dueling champion but was defeated by the Rodian Twitch for the title. He still competed with other duelists, such as Ice, Gerlon Two-Fingers, and Deadeye Duncan. During his career, Marl made the decision to use a double-bladed vibrosword during combat after Two-Fingers' blaster overheated and exploded, paralyzing three of his fingers."}, {"tag": "p", "text": "In 3956 BBY, the final year of the Jedi Civil War between the Republic and the Sith Empire, the Republic soldier Revan, known by the nickname \"Mysterious Stranger\" after defeating Duncan, Two-Fingers, and Ice to ascend the ranks of duelist, challenged Marl. After the match was set up, Marl fought Revan in the arena but was ultimately defeated by the soldier. Afterward, Marl congratulated Revan for his success and decided to retire, realizing that his career as a duelist was over due to his age."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Marl was eager to fight in the dueling arena on Taris, and, as an experienced veteran in the dueling sport on Taris, he remembered all the duelists who had come through the arena in the twenty years he was a professional. When the Sith forces of Darth Malak invaded and quarantined Taris, Marl did not care, so long as they did not ban the arena. He regarded Bendak Starkiller as a legend, albeit bloodthirsty, and respected all the other duelists excluding Deadeye Duncan, whom he believed was the worst duelist ever."}, {"tag": "p", "text": "The veteran duelist never fought with blasters, preferring the use of a double-bladed vibrosword, a decision he made after fellow duelist Gerlon Two-Fingers' blaster exploded—which, according to Marl, was a rare occurrence. When Revan defeated him in their duel, Marl made it a point to congratulate him and wished the soldier well in the sport as he decided to retire due to his age. Marl was light-skinned, with gray eyes and hair, and wore a combat suit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Marl appeared in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare. He was mentioned in the game's official strategy guide and the Knights of the Old Republic Campaign Guide. This article was written under the assumption that Revan defeated Marl. However, in Knights of the Old Republic, the player can elect to not participate in the dueling arena, which led to Revan never dueling Marl."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}