{"url": "Marn_Hierogryph%27s_brother", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Performing artists", "Category:Snivvians", "Category:Unidentified brothers"], "nodes": [{"tag": "h1", "text": "Marn Hierogryph's brother"}, {"tag": "p", "text": "The brother of Marn Hierogryph was a Snivvian male and a citizen of the Galactic Republic who recorded pro-Republic propaganda broadcasts during the Mandalorian Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He was using alias \"Captain Benegryph Goodvalor\", which was a name provided by his brother, Marn Hierogryph, to Ministry of Defense following the battle of Serroco. During the battle Marn and his Trandoshan companion Slyssk accidentally saved half a battalion of troops, and Defense Ministry saw the chance to use it as a propaganda story."}, {"tag": "p", "text": "Hierogryph's brother was called in to perform the propaganda broadcast. Using a directional transmitter, those broadcasts flooded the Z-band of subspace radio, which the Mandalorians were using to conduct communication among their ground forces."}, {"tag": "p", "text": "In his broadcasts, \"Benegryph Goodvalor\" claimed to be the captain of a massive new Republic warship called the Serroco and urged the Mandalorians to surrender. He described massive Republic fleets building up for an inevitable counteroffensive that would turn the tide back in the Republic's favor. He also went on at length about the luxurious accommodations of his ship and the high standard of living for Republic citizens."}, {"tag": "p", "text": "His broadcasts typically began with the greeting \"Attention Mandalorians!\" and ended with a brief motto extolling the virtues of the Republic. Typical mottos were \"The Republic. Here today, here tomorrow\" and \"The Republic. Real beds. Running water.\""}, {"tag": "p", "text": "After the capture of Taris, the Mandalorian strategists turned their attention to the nearby world of Zongorlu. Goodvalor had anticipated this move and urged the Mandalorians against an attack. He claimed on various occasions that Zongorlu was a searing volcano world bathed in acid rain; that the native Zongorlu were enraged at the Mandalorians for their destruction of youngling camps; that the Zongorlu system was so filled with Republic warships that traffic was becoming congested; and that the Serroco was in orbit over a massive citadel on the planet's surface."}, {"tag": "p", "text": "Mandalorians were on guard for anything during the assault on Zongorlu, but they encountered no resistance at all. They discovered that Captain Goodvalor had operated out of a cramped transmission station on the surface, but had fled long before the Mandalorians arrived. There were some derelicts in orbit around Zongorlu, but no Republic fleet. And the Zongorlu species were not the warrior race Goodvalor had described, but a slow, peaceful plant race scarcely able to move a meter in a day."}, {"tag": "p", "text": "For several days the Z-band was free of interference, but then Goodvalor returned to the airwaves once again with his traditional greeting, claiming that he had been unexpectedly called away from Zongorlu before the attack. Goodvalor's message had changed from urging unconditional surrender to offering a peace agreement, including a share of taxation for all Republic worlds under Mandalorian occupation."}, {"tag": "p", "text": "During one broadcast, someone claiming to be \"Commander True,\" Goodvalor's first officer, passed on the captain's apologies for his absence. In either case, the Mandalorians were unimpressed by him. They continued operating on the Z-band despite his broadcasts. Many Mandalorians reacted by switching off their transceivers, causing minor communication problems. Mandalorian signals expert Koblus Sornell admitted the broadcasts were having an effect on some of the newer, less committed recruits, but insisted any true warrior would simply ignore them."}, {"tag": "h2", "text": "Appearances"}]}