{"url": "Marriage", "categories": ["Category:Canon articles", "Category:Stub", "Category:Incomplete lists", "Category:Weddings"], "nodes": [{"tag": "h1", "text": "Marriage"}, {"tag": "p", "text": "Marriage was the formally recognized union of two beings as partners in a relationship. A marriage ceremony, which could be presided over by a clergy member, was referred to as a wedding. In the Jedi Order, during the Rise of the Empire Era attachment and possession were forbidden, because they could lead to jealousy and fear of loss, and ultimately the dark side of the Force. For that reason, Jedi were not allowed to marry. Despite that, the Jedi apprentice Anakin Skywalker still married Senator Padmé Amidala shortly after the First Battle of Geonosis, during a secret ceremony held on Naboo. In some cultures, males had more than one spouse at a time, such as the alpha-bulls of the Crolute species who had senior spouses, junior spouses, and concubines. Marriage between two beings of the same sex also occurred."}, {"tag": "p", "text": "Marriages could be dissolved through divorce."}, {"tag": "h2", "text": "Betrothal"}, {"tag": "p", "text": "Betrothal, also known as engagement, was a marital custom of certain cultures, where two beings would be \"betrothed\" or \"engaged\" before officially marrying. Some cultures' rules required that betrothed individuals must not engage in reproductive activities prior to their marriage, although the Agbui Haplif had found this rule to usually be ignored during his travels through the Unknown Regions. Haplif was thus surprised when the Chiss mid-ager Yoponek insisted on having a separate sleeping room from his betrothed, Yomie."}, {"tag": "p", "text": "Former Separatist Senator Lux Bonteri infiltrated the Death Watch accompanied by Padawan Ahsoka Tano in 20 BBY.  Bonteri had discovered that Count Dooku ordered the assassination of his mother Mina Bonteri, and sought revenge by allying with the Mandalorian terrorist group. Ahsoka snuck aboard Bonteri's ship and the Death Watch did not expect her to accompany Bonteri, so he claimed she was his betrothed. Later, when Tano denounced the Death Watch to Bonteri, the young man kissed her to silence her criticism as Bo-Katan Kryze approached."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}