{"url": "Martial_traditionalists", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Martial traditionalists"}, {"tag": "p", "text": "The martial traditionalists were a Mandalorian group of Mandalorian warrior clans who had a degree of power on the planet Mandalore by 42 BBY. After the peaceful New Mandalorians rose to prominence, a small number of martial traditionalists used violence to stay in control, which resulted in the start of the Mandalorian Civil War. The traditionalists were defeated and exiled, with Mandalorian warriors being exiled to the moon Concordia. There, after infighting, Pre Vizsla grouped the traditionalists and formed the Death Watch, which created an underground movement of supporters at all levels of New Mandalorian government."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mandalorian Civil War"}, {"tag": "p", "text": "The martial traditionalists were a group of Mandalorians that maintained power on the planet Mandalore by 42 BBY. By this time, a peace movement began that slowly grew in strength to challenge Mandalore's martial traditionalists, which was composed of Mandalorian warrior clans, as the majority of Mandalorians did not receive any lasting benefits from mercenary expertise in war."}, {"tag": "p", "text": "The peaceful movement used the city of Sundari as an example of an alternative way of life, but by the time Duchess Satine Kryze of Clan Kryze led the New Mandalorian faction in 42 BBY, a minority of martial traditionalists used violence to retain their power. The Mandalorian Civil War between the traditionalists and the New Mandalorians broke out, forcing Duchess Satine to be protected by the Jedi Order from the Mandalorian insurgents and bounty hunters throughout the year-long civil war."}, {"tag": "p", "text": "By the end of the war, the New Mandalorians emerged victorious and the surviving traditionalists were exiled to Mandalore's moon, Concordia. At that time, the traditionalists fought each other for dominance and eventually regrouped under Pre Vizsla while Mandalore was rebuilt and prospered. Vizsla formed the Death Watch from the surviving traditionalists, and maintained an underground group of sympathizers at all levels of Mandalorian society. As a result of the civil war, Mandalorians were largely split into three groups. The New Mandalorians, the Death Watch, and the Old Mandalorians."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After an attack on a cruiser of the Galactic Republic was perpetrated by a Death Watch saboteur, Jedi Master Obi-Wan Kenobi traveled to Mandalore to investigate. There, New Mandalorian Prime Minister Almec briefed Kenobi that no true Mandalorian could have been the suspect, as all of the warriors from the civil war were exiled to Concordia, and died out years prior. Vizsla briefly became Mand'alor after Death Watch conducted a takeover of Mandalore with the help of the Sith Lord Maul's Shadow Collective. After Vizsla betrayed Maul, the Sith Lord killed Vizsla and claimed Death Watch, splitting the group into loyalists that formed the Mandalore resistance, and traditionalists serving as Mandalorian super commandos."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}