{"url": "Maru", "categories": ["Category:Legends articles", "Category:Creatures of Alaris Prime", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Reptiles", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Maru"}, {"tag": "p", "text": "Maru were agile reptiles native to the forest moon Alaris Prime in the Kashyyyk system. They had muscular hind legs and a long tail, though their forearms were vestigial. The Wookiee inhabitants of Alaris Prime used the beasts as war mounts, equipping the maru with special saddles, dual bowcasters, and a seismic pulse emitter."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Maru were agile, bipedal, reptilian beasts native to the moon of Alaris Prime in the Kashyyyk system. Although their forearms were vestigial, they had muscular hind legs and could use their long tails for defense. The creatures were able to run long distances and could maintain their speed while carrying a Wookiee on their back. Maru had brown skin with pale underbellies."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Maru were omnivorous creatures that mainly inhabited forests. They mostly fed on smaller animals from the forest floor and held their prey with their small arms to devour it. Many wild maru roamed the woods in packs of six or more, though others were domesticated by the local Wookiee population."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One month after the start of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems on the planet Geonosis in 22 BBY, the Separatist Droid Army invaded Alaris Prime. Count Dooku, leader of the Separatists, had recently acquired the Force Harvester and planned to use it to power the Dark Reaper superweapon. Having captured the Jedi Padawan Anakin Skywalker on Raxus Prime, Dooku intended to use the Jedi to test the Force Harvester, which drained the living Force from beings and converted it to energy. However, Skywalker escaped on Single Trooper Aerial Platforms with the help of mercenary Bera Kazan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maru were first mentioned in the 2002 Star Wars: The Clone Wars: Prima's Official Strategy Guide, the Prima Games guide to the Star Wars: The Clone Wars video game, which released that same year and was the ship's first appearance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}