{"url": "Martyrs", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Bothan culture"], "nodes": [{"tag": "h1", "text": "Martyrs"}, {"tag": "p", "text": "The Martyrs referred to the Bothans who gave their lives in order to acquire and forward the plans for the second Death Star to the Rebel Alliance. Because of their sacrifice, the Alliance ultimately defeated the Galactic Empire at the Battle of Endor, thus shifting the momentum of the entire Galactic Civil War. The Martyrs themselves were greatly revered within Bothan society, and to marry into a family of one of them was a great honor."}, {"tag": "p", "text": "Unfortunately, the cause of the Martyrs and their sacrifice were also used for political motives. Borsk Fey'lya, the Bothan representative to the New Republic Senate, brought forth their memory on many occasions when he felt that the Bothans were being discriminated against. Five years after the Battle of Endor, when Fey'lya had risen to the New Republic High Council, Leia Organa Solo privately reflected that he probably would not have risen nearly so high but for his connection with the Martyrs."}, {"tag": "p", "text": "Many other Bothans also saw them as a tool to gain power. During a briefing for the planned assault on Borleias, Wedge Antilles sourly reflected that the Bothans never missed an opportunity to remind others of the Martyrs' heroic sacrifice, and to claim to possess the same measure of courage. True to form, the task force's commander, General Laryn Kre'fey, was quick to dismiss Antilles' misgivings about the operation, using his own personal willingness to put himself in harm's way as a substitute for his poor tactical planning."}, {"tag": "p", "text": "After the briefing, Antilles angrily confronted Admiral Gial Ackbar, asking why nobody ever bothered to point out that, according to Luke Skywalker, the Emperor had deliberately allowed the Death Star's location to fall into the Bothans' hands, in order to lure the Rebel Alliance into a trap at Endor. Ackbar wearily replied that the Bothans had a ready answer for that, too: that the Emperor must have lied to Skywalker, and had only conceived the trap after the data had been stolen, so the Martyrs' sacrifice was no less worthy."}, {"tag": "p", "text": "When Rogue Squadron pilot Asyr Sei'lar was presumed killed in the Battle of Distna, Fey'lya attempted to have the remains of another Bothan take her place at a planned state funeral, as the bodies of the Martyrs had been destroyed by the Empire. This did not sit well with Booster Terrik who, after drubbing the Senator, unceremoniously dismissed him from his office aboard the Errant Venture."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}