{"url": "Mas_Amedda/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Chagrians", "Category:Galactic Republic bureaucrats", "Category:Galactic Republic senators", "Category:Imperial Inner Circle members", "Category:Males", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Mas Amedda"}, {"tag": "p", "text": "Mas Amedda was a male Chagrian who served as the Vice Chancellor of the Galactic Republic during the administrations of Chancellors Finis Valorum and Palpatine. Amedda served during the Clone Wars and continued to serve under the self-proclaimed Emperor Palpatine as one of the first members of the Imperial Ruling Council."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "A Chagrian male hailing from Champala, Mas Amedda was appointed by the Champalan government to represent the watery world in the Galactic Republic Senate on Coruscant. As a senator, Amedda considered himself an honest politician and strove to voice the wants and needs of his people in the Senate. Addicted to procedure and a stickler for rules, Amedda's fellow members of the Rim faction, specifically Senator Orn Free Taa, were anxious to put him in the position of Vice Chancellor. Despite Amedda's allegiance to the Trade Federation, Taa and his followers successfully appointed Amedda to the seat made available by the departing Bothan Vice Chair; the conspiring Senators hoped to bog down Supreme Chancellor Finis Valorum in meaningless procedural squabbles and eventually end his career. Amedda was also working closely with Senator Palpatine of Naboo to ensure Valorum became powerless, and is one of the few who knew that the Senator of the Chommell sector was more than he appeared to be."}, {"tag": "p", "text": "Placed into office on the heels of the failed trade summit on Eriadu, Amedda was awarded unprecedented power over the Supreme Chancellor, capable of blocking his ability to call sessions of Congress as well as work with the Jedi Order. As the Chancellor was further weakened by a scandal involving money laundering, support of Valorum's policies in the Senate degenerated, which effectively paralyzed the Chancellor's government. Unknown to the masses of the Republic, Senator Palpatine and the infamous Muun leader of Damask Holdings, Hego Damask, were behind the problems bogging down the Chancellor. Indeed even Amedda was a puppet to Palpatine, who was in fact a Dark Lord of the Sith. While Palpatine almost had Amedda eliminated for his accelerated climb to power, the Sith Lord decided the Chagrian would better suit the Sith Grand Plan as Vice Chancellor."}, {"tag": "h3", "text": "Brewing conflict"}, {"tag": "p", "text": "Per the Sith Grand Plan that clandestinely controlled every function of galactic politics, Amedda presided over the motion of a Vote of No Confidence in Valorum's leadership, as requested by Queen Amidala of Naboo following Senate inaction in response to the invasion of Naboo by the Neimoidian arm of the Trade Federation. While driven by ambition, Amedda was not foolhardy enough to believe that he could attain the Chancellorship; instead the Chagrian was prepared to manipulate the future Chancellor in order to aid the galactic populace."}, {"tag": "p", "text": "Following Senator Palpatine's election to the Chancellorship Amedda continued to serve as Vice Chair, planning on manipulating the Naboo man for the betterment of the galaxy. Feeding his ideas to the Chancellor, Amedda believed that he was the true power in the Senate as the Chancellor seemed to play off of his suggestions. In an attempt to keep Palpatine content, Amedda, a connoisseur of rare art, would travel to ancient worlds and obtain precious relics for the Chancellor's collection."}, {"tag": "p", "text": "Despite Amedda's attempts to keep procedure his office was constantly bombarded by accusations of scandal. Believed to continuously accept bribes from organizations such as the Trade Federation, Amedda disputed the claims and retained his position without cries for a recall. When the Separatist Crisis threatened to tear the Republic asunder, Amedda continued to attempt to manipulate events in the Office of the Supreme Chancellor. As the threat of the Confederacy of Independent Systems continued to grow, the Military Creation Act was hotly debated in the Senate Chamber; should the Senate vote to overturn the Ruusan Reformation and establish an army or should they continue attempts to negotiate? Upon the discovery of a droid army on the dusty world of Geonosis, Amedda conspired to persuade the unwitting Representative of Naboo, Jar Jar Binks, to propose to give emergency powers to the Chancellor. Unknown to the Vice Chair, the idea was in fact the Chancellor's own, and Palpatine had merely planted the idea in the Chagrian's mind."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Per Amedda's unsubtle suggestion, Representative Binks convinced the Senate to grant Palpatine emergency powers, and the Supreme Chancellor's first act was to create a Grand Army of the Republic. An army of clone troopers discovered by Jedi Knight Obi-Wan Kenobi on the planet Kamino served the role, and the galaxy-spanning Clone Wars began. Retaining his post throughout the conflict, Amedda eventually came to know the truth of Chancellor Palpatine and his alter-ego, Darth Sidious. Believing that the Sith could bring order back to the galaxy, Amedda agreed to keep the secret and planned to do nothing as Palpatine drove the galaxy into turmoil and the Jedi Order in disarray. As Palpatine gauged Amedda's trustworthiness, the Sith Lord ordered his Vice Chair to plan the assassination of former Chancellor Valorum."}, {"tag": "p", "text": "During a session of the wartime Senate, Amedda presided over the chamber as the Senators debated the potential threat that the Death Watch terrorist organization posed to the people of Mandalore. Despite the protests of Mandalore's Duchess Satine Kryze, the Senate was prepared to vote to allow the Republic to occupy the planet in order to resist the Death Watch. Amedda placed a datacard into a holoprojector that displayed a hologram of Mandalore's Deputy Minister Jerec calling for Republic assistance, though the message had in fact been doctored. Kryze was later attacked, and after being granted an audience with Palpatine, was told by Amedda and the Supreme Chancellor that the assassination attempt proved that Mandalore needed the Republic's aid. Amedda expressed his belief that Kryze was unable to keep the Death Watch reigned in by herself. When Senator Padmé Amidala of Naboo uncovered Minister Jerec's actual holorecording, requesting that the Republic leave Mandalore alone, Amedda and Palpatine presided over a Senate session that rescinded the Senate's earlier vote to occupy the planet. Kryze, Kenobi, the Jedi Knight Anakin Skywalker, and Amidala later discussed the outcome of the vote with Amedda and Palpatine in the Supreme Chancellor's office, and the latter three discussed the logistics of ratifying the Senate's vote."}, {"tag": "p", "text": "The Vice Chancellor attended Palpatine when the Supreme Chancellor welcomed Skywalker, Jedi Master Mace Windu, the astromech droid R2-D2, and the giant Zillo Beast of Malastare to Coruscant; Palpatine was eager to study the beast's fearsome armor despite the Jedi's discomfort with keeping the beast on the capital. Palpatine assigned Doctor Sionver Boll to the task of study, and brought Amedda with him to check on her progress. Back in the Supreme Chancellor's office, Skywalker and Amidala appealed Palpatine's decision to kill the creature, but Amedda expressed his opinion that uncovering the secrets to its armor was for the greater good. Some time later, Amedda and Palpatine presided over a session that saw Amidala present a bill proposing the cutting of military spending, and soon after attended the funeral of Amidala's ally in the Senate, Onaconda Farr of Rodia, who had been poisoned by his aide Lolo Purs. Amidala's bill was voted down, and Amedda was present outside of the Senate Chamber when Palpatine and Amidala discussed the outcome."}, {"tag": "p", "text": "Later in the Clone Wars, Amedda accompanied the Supreme Chancellor to Naboo to celebrate the Festival of Light. During the festival, Palpatine was the victim of a kidnapping attempt by Count Dooku and a group of bounty hunters."}, {"tag": "p", "text": "At one point in 20 BBY, Amedda was summoned to Palpatine's office and was asked to prepare him his shuttle. Around that time, Amedda was present at a funeral for Jedi who were killed in the Jedi Temple bombing. Soon after, he served a role in the trial of the Jedi Padawan Ahsoka Tano. Amedda handed the jury's verdict to Palpatine, but before it could be read, Anakin Skywalker arrived with the true culprit, Barriss Offee."}, {"tag": "p", "text": "As the Clone Wars grew to a new height, Amedda came under scrutiny by the Jedi High Council. Having obtained knowledge that the mysterious Darth Sidious was tied in with the Chancellor's Office and in control of the entire Senate, Councilor Mace Windu came to suspect Amedda of being the \"Second Sith\". Before further investigation could commence, Palpatine himself revealed his true persona to Windu and killed him, along with several other members of the High Council."}, {"tag": "p", "text": "Seeing the Grand Plan to fruition, Chancellor Palpatine destroyed the Jedi Order and recreated the Republic as the first Galactic Empire. Attending the declaration of a New Order, Amedda was attending to his new Emperor when Jedi Grand Master Yoda attempted to assassinate Palpatine in the Senate Chamber. Fleeing as the two Force-wielders dueled, Amedda returned to the Grand Convocation Chamber following the conclusion of the vicious battle. Assisting Palpatine, Amedda oversaw the Emperor's shock troopers' search for Yoda. Communicating with Captain Kagi and ordering him to prepare the Emperor's shuttle for departure to Mustafar, Amedda prepared himself for the transition from his former duties to the new ones laid out by the Emperor."}, {"tag": "h3", "text": "Imperial agent"}, {"tag": "p", "text": "Following the Empire's formation, Amedda became one of the first members of the Imperial Ruling Council. Despite losing his title of Vice Chair, Amedda retained a position of power, acting as Palpatine's representative in the Senate. As his position soon became largely irrelevant, Amedda was relegated to reclaiming lost Sith artifacts from worlds previously quarantined by the Jedi Order. Despite this apparent demotion, Amedda enjoyed his ability to pursue his thirst for knowledge of Sith history, exploring many Sith worlds. During this time, Amedda ventured to Yavin 4; discovering rare piranha beetles which delighted the Emperor. He later retreated to a secret Imperial citadel on Byss, Palpatine's secret throne world, where he proceeded to outline plans necessary for the New Order for the next 10,000 years and beyond."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mas Amedda was played by Jerome Blake in The Phantom Menace, David Bowers in Attack of the Clones, and by both Blake and Bowers in Revenge of the Sith."}, {"tag": "p", "text": "He appeared in the episodes \"Duchess of Mandalore,\" \"Senate Murders,\" \"Heroes on Both Sides\", \"Pursuit of Peace\" and \"The Zillo Beast Strikes Back\" of Star Wars: The Clone Wars. He was voiced by Stephen Stanton."}, {"tag": "p", "text": "Amedda appeared in Star Wars Episode I: The Phantom Menace video game, released in 1999, during the game's sixth mission, Danger in Coruscant. The mission contradicted the movie and this article assumes it is non-canon. Amedda met with Captain Panaka on a landing platform on Coruscant. He was escorting Queen Amidala to safety, following attacks by mercenaries paid by the Trade Federation. Amedda offered to sell his two Coruscant City Tour tickets to him for 50 Republic credits each (half of what he originally paid) because he had business to attend to on Alderaan. Panaka tried to barter for them with a pair of electrobinoculars, however Amedda declined, on account of having no use for them. He suggested Panaka sell the electrobinoculars to someone else to get the money. When Panaka returned with the 100 credits, Amedda asked for 200 credits to be paid. Panaka then brought this mistake to Amedda's attention, and Amedda apologetically gave him the tickets. In strategy guide, he was identified only as a citizen."}, {"tag": "p", "text": "Amedda's name is misspelled in Jedi Quest: The School of Fear as \"Ameeda.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}