{"url": "Masanya", "categories": ["Category:Legends articles", "Category:CR90 corvettes", "Category:Defiance Task Force ships"], "nodes": [{"tag": "h1", "text": "Masanya"}, {"tag": "p", "text": "The Masanya was a CR90 corvette manufactured by the Corellian Engineering Corporation that was used by the fleet of the Rebel Alliance as a light escort vessel. It was modified with a hangar for small vessels and equipped with missile-jamming target-disruption scanners. It fought in the Battle of Endor, a decisive engagement between the Rebel Alliance and the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Masanya was a light escort CR90 corvette manufactured by the Corellian Engineering Corporation. It was colored white with red markings at the time of the Battle of Endor during the Galactic Civil War—a conflict between the Rebel Alliance and the Galactic Empire—and was outfitted by Rebel fleet technicians with advanced scanners designed to continuously disrupt target-acquisition signals, making it impossible for missile guidance systems to lock onto the ship. The corvette was valuable as an escort for larger capital ships, as it was equipped with a hangar for small craft such as starfighters, and turbolasers for defensive cover fire. Its modifications were made at the expense of hull strength, however, making it slightly more vulnerable to damage than other contemporary CR90 corvettes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Masanya was acquired by the Rebel Alliance and incorporated into its fleet early in the Galactic Civil War. It was frequently used to provide escort support for Mon Calamari Star Cruisers and was part of the Defiance Task Force. It was personally assigned by Rebel Admiral Ackbar to the main Rebel fleet at the Battle of Endor, in which it participated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An unidentified, red-trimmed CR90 corvette that would later be identified as the Masanya first appeared during the Battle of Endor in Star Wars: Episode VI Return of the Jedi. The name \"Masanya\" was later applied to a corvette in Star Wars: X-Wing Alliance, a computer game published by LucasArts on February 28, 1999. The following year, in July of 2000, Decipher, Inc. published the Death Star II Limited expansion of the Star Wars Customizable Card Game, which tied the Masanya identified in the computer game to the red-trimmed CR90 corvette seen in Return of the Jedi."}, {"tag": "p", "text": "On February 16, 2006, LucasArts released Star Wars: Empire at War, in which the Masanya appeared as one of several Corellian corvettes randomly labeled in the game's space battles. In the Star Wars PocketModel TCG, a trading card strategy game published by WizKids Games in 2007, the Masanya is represented by a miniature marked with blue trim instead of the red trim previously associated with the ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}