{"url": "Maser", "categories": ["Category:Legends articles", "Category:Weapon stubs", "Category:Maser weaponry"], "nodes": [{"tag": "h1", "text": "Maser"}, {"tag": "p", "text": "A maser was a type of energy weapon, similar to but distinct from a laser. Masers used kinetic energy as well as laser energy to damage a target."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although maser weapons were rare compared with lasers in mainstream Galactic civilization, the Chiss made extensive use of a blue-beamed maser, known in Cheunh as a charric. These weapons are recorded as early as the Jedi Civil War, and continued in use until at least the time of the Swarm War. Chiss Star Destroyers made extensive use of maser cannons in the conflict, being armed with megamasers (most likely an analog of the turbolaser used by much of the outside galaxy)."}, {"tag": "p", "text": "Maser bolts carried much more momentum behind them than lasers, to the point that deflecting such a bolt might cause a lightsaber user to lose their grip on their weapon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maser is a real-world acronym for Microwave Amplification by Stimulated Emission of Radiation, a type of energy beam similar to a laser, but based on the use of microwave radiation rather than visible light. It is not clear, however, what the exact difference is between a Chiss maser and a standard Star Wars laser, especially as maser beams in the \"Galaxy far, far away\" are described as having a distinct particle component."}, {"tag": "p", "text": "In Star Wars canon, however, \"laser\" is often used as a generic term for weapons such as turbolasers and blasters, where a laser is simply used to trigger a projectile charge of the fictional substance known as blaster gas. It is thus possible that a Star Wars \"maser\" is a similar system that uses a microwave-based beam rather than a laser."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}