{"url": "Mask_(Sith_Alchemy)", "categories": ["Category:Legends articles", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Mask  (Sith Alchemy)"}, {"tag": "p", "text": "The Mask technique was a little-known special application of Sith alchemy. Using the technique, a Sith alchemist could literally reshape an individual's appearance, altering the subject at the molecular level."}, {"tag": "p", "text": "Very little was beyond this technique, limited only by the craftsmanship of the user. Features, age, disfigurations, even species could be concealed with the Mask (though the latter would require an incredible amount of skill to accomplish convincingly). Owing to its molecular nature, the technique lasted until altered, and even a thorough medical examination would not reveal anything out of place, unlike the tell-tale scars of surgical alterations. As it was a product of the dark side of the Force, it was susceptible to powerful blasts of dark side energy. If the subject was not careful, the Mask would literally melt away, making further attempts at concealment (even with the Mask) difficult."}, {"tag": "p", "text": "It is said that the Sith Lord Darth Sidious, a master at Sith alchemy, may have used this technique in order to conceal his appearance from the people of the Republic and hide his true nature under the façade of the mild-mannered Naboo politician Palpatine. When Jedi Master Mace Windu reflected Sidious's lightning blast back at him, the Mask would have melted away, disfiguring him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The \"Mask\" ability was created by Star Wars Roleplaying Game author Gary M. Sarli as a method of resolving the debate behind Palpatine's transfiguration during his duel with Mace Windu. In Jedi Counseling 71, published in 2005 on the website for the Wizards of the Coast Star Wars Roleplaying Game, Sarli was asked what exactly happened to Palpatine's face, and posted stats for the Mask power in response."}, {"tag": "p", "text": "The short, dialogue-less story Sithisis had Palpatine, in his Darth Sidious persona, allowing himself to be devoured by a gargantuan Sith wyrm before killing it from within and readopting his amiable appearance, although it wasn't made clear as to whether this was the method he used to maintain his Mask power."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}