{"url": "Mass-driver_cannon/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Projectile weaponry"], "nodes": [{"tag": "h1", "text": "Mass-driver cannon"}, {"tag": "p", "text": "A mass driver was a type of projectile cannon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "They inflicted damage by hurling projectiles at high velocities, which imparted kinetic energy and force to the target upon impact. Damage was thus a result of the mass of the projectile and its velocity."}, {"tag": "p", "text": "The velocity the projectile could achieve was limited by the method by which it was initially propelled. For a chemical explosion (how a conventional slugthrower worked), the peak velocity was about 1.8 km/s. For a plasma-driven round from an electrothermal cannon (an electrical arc vaporized the propellant into a plasma to create the requisite pressure to propel the slug), the peak was around 2.5 km/s. For a gauss/coil gun (where the mass was accelerated by passing through sequenced electromagnetic fields) the limit was about 2 km/s due to the rate at which the fields could be created and collapse. These speeds were a tiny fraction of light speed."}, {"tag": "p", "text": "For a rail gun (where the slug was accelerated by Lorentz forces and electromagnetism between two parallel rails) there was no real limit (except the speed of light), only a practical one based on rail erosion and, when in atmosphere, ablation of the projectile. Typically this speed was 6 km/s."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mass drivers were used to launch missiles, shot, and explosive shells. They could be found on a variety of craft, such as the missile launchers on the LAAT/i, the siege weapons on the Dreadnought battle tank, the flak guns on most capital ships, or artillery on the AT-AP or the SPHA-M."}, {"tag": "p", "text": "The Kumauri Battleship line, of which the Cal-class battleship was the last model, utilized massive mass-driver cannons that were slung on top of the dorsal hull.\nThe Vengeance-class frigate, Kedalbe-class battleship, turrets, Canderous-class assault tanks and space stations of Tyber Zann's Consortium were armed with mass-driver batteries."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}