{"url": "Massacre_at_Terrina_Square", "categories": ["Category:Legends articles", "Category:Battles of Quellor", "Category:Battles of the Galactic Civil War", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Massacre at Terrina Square"}, {"tag": "p", "text": "On the planet Quellor, the Galactic Empire conducted a massacre at Terrina Square of peaceful demonstrators around 3 ABY. The demonstrators had been protesting against Imperial atrocities in the Outer Rim Territories in the ongoing Galactic Civil War, as well as calling for an end to Death Star–like superweapons."}, {"tag": "h2", "text": "Rally against tyrrany"}, {"tag": "p", "text": "In the aftermath of the Battle of Yavin, the planet Quellor became the site of peaceful, anti-Imperial rallies. The Empire's Death Star superweapons, having destroyed the planet Alderaan beforehand, was in turn destroyed by the Rebel Alliance during that battle. The Empire thus let go of all its pretense of being benign, and responded to any manner of resistance or protest with fearsome might."}, {"tag": "p", "text": "Almost three years after the battle, as the Galactic Civil War intensified, hundreds of citizens of many species gathered at Terrina Square to protest reported Imperial atrocities in the Outer Rim Territories, as well as to rally for the banning of superweapons similar to the Death Star."}, {"tag": "h2", "text": "Burning Emperor; blaster fire"}, {"tag": "p", "text": "While the protest was peaceful, the governor of Quellor, Moff Toggan, commanded stormtroopers to oversee the demonstration and maintain order; Toggan specifically told troops not to employ deadly force unless he said otherwise. However, when the crowd at Terrina Square burned a facsimile of Emperor Palpatine to demonstrate their disapproval of Imperial policies, the troopers pushed through the demonstrator lines and opened fire. Whether the stormtroopers acted on their own or on orders from someone with more clout than the Moff, blasters fire cleared a path toward the burning Emperor, resulting in extensive civilian casualties."}, {"tag": "p", "text": "For thirty minutes, the massacre at Terrina Square was major news, yet at the end of the day, the Empire's Commission for the Preservation of the New Order censored further news of the subject under all the regulated media outlets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The massacre at Terrina Square was first mentioned in Rebellion Era Sourcebook, a 2001 supplement to the Star Wars Roleplaying Game which was published by Wizards of the Coast."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}