{"url": "Massacre_of_Aquilaris", "categories": ["Category:Legends articles", "Category:Battles of Aquilaris", "Category:Battles of the New Sith Wars", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Massacre of Aquilaris"}, {"tag": "p", "text": "The Massacre of Aquilaris was an attack by the Chagras Hegemony on the Galactic Republic planet of Aquilaris Minor in 1042 BBY during the Republic Dark Age. The Chagras Hegemony was a splinter state of the New Sith Empire which had fought a protracted war with the Republic and the Jedi Order for nearly a millennia since 2000 BBY. Chagras forces under the Sith Lord Odion wiped out much of the defenses, killed many civilians and destroyed much of the cityscape. Two survivors of the battle were the Jedi Knight Vannar Treece and the Human girl Kerra Holt. Due to her experiences, Kerra Holt joined the Jedi Order in an effort to avenge the destruction of her homeworld at the hands of Odion."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Aquilaris Minor had formerly been a resort world in the Grumani sector. During the Republic Dark Age, it accepted refugees from Sith-occupied Space until it drew the attention of the Chagras Hegemony, a Sith empire that was ruled by Sith Lord Chagras. Chagras was the sole survivor of the Charge Matrica, a succession conflict that had been instigated by his mother Vilia Calimondra, the matriarch of the Calimondra family, a powerful Sith clan operating in the region. Throughout the New Sith Wars, Vilia had married several different husbands and acquired a sizeable interstellar empire within the Grumani sector. Through these marriages, she produced seven children including Chagras and a daughter named Xelian."}, {"tag": "p", "text": "Each of her children vied for the right to inherit her empire. To resolve this dispute, Vilia proposed a contest known as the Charge Matrica where the successor who conquered the most territory would win the right to be her sole heir. This conflict began in 1066 BBY and devastated much of the Grumani sector and the surrounding space. Eventually, this contest degenerated into a family feud among Vilia's children after Xelian declared war on Chagras when her bid began to fail. Vilia did nothing to stop this family feud since she wanted to eliminate any potential threats to her rule. By circa 1050 BBY, Chagras won the Charge Matrica and became Vilia's designated heir. His victory brought a period of stability to the Grumani sector and guaranteed Chagras the assistance of his nieces and nephews, so he tasked them with repairing the damage that the war had caused his holdings."}, {"tag": "p", "text": "One of these nephews was the Sith Lord Odion, the eldest son of Xelian, who became one of his military commanders. By 1042 BBY, the Chagras Hegemony had recovered from the war and was ready to challenge the Galactic Republic. Aquilaris was one of those worlds targeted during this brief exapnsionist campaign. During a raid on the University of Sanbra, the Sith Lord Odion learnt that a team of academic researchers were cooperating with the Jedi Order on a research project to locate the Helm of Ieldis, an ancient Sith artifact created by Lord Ieldis prior to the Great Hyperspace War. Following the invasion, the university researchers had scattered with both the Jedi and Sith looking for them. Odion regarded the Helm as a potential game changer in the internecine Sith family feud which had destabilized much of the Grumani sector. Odion also obtained intelligence that some Jedi were planning to meet twelve of these researchers on Aquilaris Minor."}, {"tag": "p", "text": "Since Odion was still a junior Sith Lord within the Chagras Hegemony, he needed to get authorization from his superiors to launch the attack on Aquilaris. Odion was able to gain authorization from his grandmother Vilia Calimondra, by claiming that the purpose of the raid was to capture the Jedi Knight Vannar Treece, whose hit-and-run raids on Sith Space was undermining Sith rule. However, Odion's true purpose was to acquire the Helm for himself. He did not inform his fellow Sith family about the Helm since he wanted to gain an advantage over them in any future conflict. Due to his troubled childhood, Odion had developed a deeply nihilistic worldview which advocated destroying all life in the galaxy in order to find peace."}, {"tag": "h3", "text": "Details"}, {"tag": "p", "text": "A Chagras military fleet led by Odion invaded Aquilaris. The Galactic Republic defense of the planet was led by Vannar Treece himself and included a fleet of Hammerhead-class cruisers. While little details are known about the battle, what is known is that the Republic forces were overwhelmed by the invading Chagras forces led by Lord Odion. Sith forces led by a lightsaber-wielding Odion landed at the port city of Capital Cay and proceeded to slaughter the civilians including throwing them into the water. However, he ordered his troops to avoid the block where the researchers were located since he intended to capture them alive."}, {"tag": "p", "text": "Future Jedi Knight Kerra Holt's parents Aron and Mercia Holt told her to flee for he life from the marauding Sith. She fled to the docks where she met met up with her friend Joad Kreel, a young teenaged boy whose father was a member of the Seacroppers' Guild and operated a submersible. Joad told Kerra that he would wait for her while she brought her family back so that they could escape underwater into the oceans of Aquilaris. However, he got frightened and he left without her and his father who disappeared during the fighting. He managed to escape the harbor prior to a bombarded by Odion's forces. Joad subsequently returned to Capital Cay due to a lack of supplies and endured the Sith occupation. He remained with the Seacroppers' Guild but experience poverty and starvation due to economic hardship and the Sith occupiers seizing the supplies of the local people."}, {"tag": "p", "text": "Meanwhile, the Holts and the other researchers were captured by Odion's troops and forcibly enlisted in Project Pandemonium, to locate the Sith artifact the Helm of Ieldis. To cover up his secret mission, Odion ordered his forces to obliterate the residential block, destroying much evidence. Kerra made her way back to her home where she encountered Vannar whom she initially mistook for an intruder. However, she quickly recognized him as a Jedi and related to him how her family had to flee, but she did not know where else to go. Taking pity on here, Vannar informed Kerra that he had a starfighter hidden nearby and offered to help escape offworld. He promised Kerra that they would return to Aquilaris when it was safe and that they would make it safe as Jedi."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "h4", "text": "The Sith occupation"}, {"tag": "p", "text": "During the subsequent Sith occupation of Aquilaris, the Sith enslaved the surviving population including Joad Kreel, who was forced to return back to port since he had nowhere else to go. Odion massacred most of the world's inhabitants, and Chagras eventually intervened and prevented his nephew from killing all of the planet's population, so that some of the people could be used as slaves, to operate Aquilaris's fleek eel traps. Suspecting that Odion had an ulterior motive for invading Aquilaris, Chagras had Odion sent away from Aquilaris Minor. The Sith occupiers also requisitioned the populace's homes and food, reducing the Aquilarians to a state of poverty and misery. Kreel would spent much of his adolescence growing up in the Seacroppers' barracks, enduring squalid and unhealthy conditions."}, {"tag": "p", "text": "To cope with the harsh Sith occupation, Kreel and many other Aquilarians became addicted to the spice Deluge, a narcotic that had been deliberately distributed by the pro-Republic Grace Command on Alderaan under Operation Deluge. Operation Deluge was a secret black operation initiated by the Alderaanian Baron Lemayne, an influential Republic intelligence official, to weaken the Sith war effort without diverting substantial Republic military resources from defending the Colonies and Core Worlds from further Sith incursions. Despite its successes, many of the civilian populations in Sith-occupied Space became addicted to the drug but Grace Command merely regarded them as necessary collateral damage in the Republic's war effort against the Sith."}, {"tag": "p", "text": "Following the events on Aquilaris, Holt subsequently became a Padawan under Treece's tutelage. By 1032 BBY, she had passed her Jedi Trials and become a novice Jedi Knight. She subsequently served with distinction during the Chelloan affair where she helped fellow Jedi Gorlan Palladane evacuated around sixty thousand civilians from Chelloa prior to the destruction of its surface. Due to his experiences on Aquilaris and other worlds, Vannar also authored the holotract Those Who Drown which highlighted the plight of civilians in Sith-occupied Space. He also decried the general tendency within the Republic to blame the victims of Sith domination for not rising up to challenge their oppressors, citing they lacked the will and the strength to defend and free themselves from the Sith warlords. However, he still argued that they could be led to overcome their condition if the \"way was lit by those who fight for good.\""}, {"tag": "h4", "text": "The Deluge campaign"}, {"tag": "p", "text": "In late 1032 BBY, Kerra would subsequently return to Aquilaris Minor during the Aquilaris campaign following a distress call from the Seacroppers' Guild. In reality, this was a coded signal requesting more Deluge spice which had inundated the Grumani sector due to Operation Deluge. Following the death of Lord Chagras and the collapse of his empire, the planet had come under the Sith Lord Daiman, Odion's estranged younger brother and had declined economically due to the collapse of trade and the dictatorial tendencies of Daiman. Aquilaris attracted the attention of three rival parties with vested interests during a three campaign involving Daiman's princedom, Hutt crimelord Zodoh's empire, and the Galactic Republic and Jedi Order represented by Grace Command's Captain Jenn Devaad and Kerra Holt respectively."}, {"tag": "p", "text": "The Sith Lord Daiman had recently acquired the planet in the ensuing power vacuum following the collapse of the Chagras Hegemony. Zodoh had wanted to expand into traditional Sith Space by using his new Stormdriver superweapons to intimidate his Sith rivals. First, he intended to test them on Aquilaris Minor by using their weaponized vaporators to submerge the planet in water. Meanwhile, Grace Command had intended to drive out the Sith while secretly inundating the population with Deluge as part of Operation Deluge. In contrast, the Kerra Holt had planned to liberate the planet from Sith occupation and rescue the Aquilarians from the machinations of both Zodoh and the Sith."}, {"tag": "p", "text": "Zodoh and Grace Command wiped out Daiman's meager garrison, with the latter taking control of the planet. Zodoh's forces retreated into the far reaches of the Aquilaris system but lured Devil Squadron into a trap. The entire squadron with the exception of Captain Jenn were killed. Zodoh then proceeded to test his fleet of Stormdrivers on Aquilaris, creating a global flood which inundated much of the surface in water. Subsequently, Jenn managed to escape and disrupted the coordination of the Stromdrivers in the process. Despite this minor setback and the destruction of stocks of Deluge spice during the escape, Zodoh regarded this as a victory since it had proven the effectiveness of his superweapons. He then dispatched his fleet to Darkknell, capital of Daiman's princedom. He was ultimately defeated and slain during the battle."}, {"tag": "p", "text": "Meanwhile, thousands of lives on Aquilaris were saved through the efforts of Kerra with the assistance of local Seacroppers Joad and Padgett, who managed to evacuate many civilians in submersibles to underwater harvester stations. After the events of the Aquilaris campaign, Devaad and Holt came up with a strategy to sabotage Operation Deluge. Devaad would return to Grace Command and claim that she had gotten a contract for distributing the Deluge on Aquilaris. This ensured that Grace Command would continue to send transport ships which Devaad would personally fly to and from Sith occupied words. En route, she would dump the Deluge into hyperspace while returning to the Republic with civilian refugees. With the hidden undersea facilities on Aquilaris, the world could even become a important hub for ferrying refugees from Sith occupied space to safety in the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Massacre of Aquilaris first appeared as a plot device in Knight Errant: Aflame 2 which debuted on November 10, 2010. Its main function was to explain the motives and sentiments influencing the main protagonist Kerra Holt. It also introduced the planet Aquilaris Minor whose backstory was expanded in the second comic arc Star Wars: Knight Errant: Deluge which ran from August 17 through to December 21, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}