{"url": "Massacre_near_Teralov", "categories": ["Category:Canon articles", "Category:Battles of the Galactic Civil War", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Massacre near Teralov"}, {"tag": "p", "text": "The massacre near Teralov was the destruction of a rebel GR-75 medium transport and flight of A-wings from Green Squadron by the Galactic Empire who were en route to provide supplies to the people of Teralov. An Arquitens-class command cruiser had dispatched three TIE interceptors led by Captain Vult Skerris which quickly wiped out the rebel fighters. Despite the crew of the transport surrendering, Skerris destroyed the ship."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 2 BBY, the planet Teralov experienced a famine. The rebellion decided to send a relief transport to aid the people of Teralov. This transport was escorted by six A-wing starfighters from Green Squadron. The transport's pilot was contacted via hologram by a woman who thanked the rebels for their aid."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "Before the rebel convoy could proceed further, an Arquitens-class command cruiser emerged from hyperspace and dispatched three TIE interceptors which engaged in a dogfight with the rebel A-wings. After wiping out the A-wings, the fighters proceeded to strafe the rebel transport; damaging the transport. The pilot pleaded over the com for the Imperials to spare them because they were an unarmed transport. However, the Imperial Captain Vult Skerris disregarded his pleas and fired a final burst into the transport's bridge; destroying the ship and killing all aboard."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The destruction of the rebel convoy near Teralov was a major blow to the rebellion. Some rebels like Ezra Bridger lamented that the rebels were losing pilots at a faster rate than they could replace them. However, the Imperial action disconcerted several Imperial cadets at the elite Skystrike Academy; namely Wedge Antilles, Derek \"Hobbie\" Klivian, and Rake Gahree. They contacted a rebel agent named Fulcrum who relayed their plight to the Phoenix Cell. In response, Hera Syndulla dispatched Sabine Wren on an undercover mission to extract these cadets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The massacre near Teralov first appeared in the third season of the Disney XD TV-series, Star Wars Rebels, in the episode \"The Antilles Extraction,\" which was released in 2016. The event was identified in Dawn of Rebellion, a canon roleplaying 2018 sourcebook that is based on Star Wars Rebels and Rogue One: A Star Wars Story. The book was published by Fantasy Flight Games and was authored by John Dunn, Tom Sorenson, Sterling Hershey, Jonathan Julius, Keith Ryan Kappel, Tim Huckelberry, Jason Marker, and James M. Spahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}