{"url": "Massacre_of_New_Coral_City", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dac", "Category:Battles of the Second Imperial Civil War", "Category:Genocides and massacres", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Massacre of New Coral City"}, {"tag": "p", "text": "A massacre in the planet Dac's New Coral City occurred in 137 ABY in the aftermath of the battle between the Imperial Outer Rim Third Fleet and the Galactic Alliance Remnant. It was the first event of the Genocide on Dac."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "At Dac, Darth Krayt's Galactic Empire was constructing an Advanced Star Destroyer known as the Imperious. Admiral Dru Valan used the newly constructed ship as bait to lure the Galactic Alliance Remnant, led by Gar Stazi into a trap. But the battle that followed saw the theft of the Imperious and the escape of the Remnant."}, {"tag": "p", "text": "Following the Imperial defeat, Emperor Darth Krayt was furious that the Alliance had escaped with the pride of his Empire's fleet. He traveled to Dac with a number of Sith Lords. When he met with the Mon Calamari Council, he presented the recently captured Gial Gahan. He explained that he had long known the Mon Calamari had secretly supported Stazi for the last seven years, and that he had had enough."}, {"tag": "p", "text": "Instead of punishing Gahan for betraying the Empire, Krayt ordered the execution of ten percent of the Mon Calamari population of Dac starting with the members of the Mon Calamari Council, and the internment of the rest in work camps."}, {"tag": "h2", "text": "The massacre"}, {"tag": "p", "text": "Immediately after Krayt issued his command, his Sith Lords, among them Darth Azard, as well as his stormtroopers began to execute each Mon Calamarian present. Even though the Quarren had been placed in a position of power by the Sith Empire, those who opposed or questioned the Emperor's will were executed as well. With the massacre on its way, Emperor Krayt personally executed Gial Gahan."}, {"tag": "p", "text": "Treis Sinde and Sigel Dare, two Imperial Knights of the Empire-in-exile, were in New Coral City at the time to warn Stazi of explosives they had planted aboard the Imperious prior to its capture. In the midst of the chaos, they used their lightsabers to cut their way through stormtroopers and rescue Monia Gahan, niece of Gial Gahan and a member of the Remnant's Rogue Squadron. Gahan agreed to take them to Stazi on the condition that they rescue other Remnant pilots, who had been imprisoned on-world following the battle."}, {"tag": "p", "text": "The two Knights and the young Mon Calamari attacked the prison in which the Rogues were held and quickly managed to rescue the prisoners, among them the Klatooinian Ronto. When the Sith Lord Darth Azard confronted them, Sinde confronted him and managed to draw the Quarren's attention away from his escaping comrades. An explosion courtesy of Ronto stopped the duel and allowed Master Sinde to escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Dare, Gahan, Ronto, and the rest of the pilots reached Admiral Stazi. Meanwhile, Master Sinde went underground, joining a resistance cell of Mon Calamari freedom fighters formed against the Sith Empire's genocidal oppression."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The order by Krayt to destroy 10% of the Mon Calamari may be a reference to the Roman Empire's practice of punishing mutiny or cowardice by decimation, which translates literally as removal of one-tenth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}