{"url": "Massacre_on_Lenico_IV", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles in the Cademimu sector", "Category:Events of the Great Galactic War", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Massacre on Lenico IV"}, {"tag": "p", "text": "During the Great Galactic War, the Sith apprentice Exal Kressh committed a massacre on the planet of Lenico IV. Kressh, in her role as the apprentice of the Sith Emperor, served her Master as a loyal servant for many years, but was largely unaware of the true purpose behind the missions the Emperor assigned to her. That changed early in the Great War, when around 3678 BBY her Master gave her orders to locate and investigate a mysterious tribe of shamanistic Ortolans on the nearly-lifeless Outer Rim Territories world of Lenico IV."}, {"tag": "p", "text": "Upon finding the primitive tribe, Kressh learned of their history and the Force rituals which they practiced to preserve the lives of tribal patriarchs and shamans. Through their teachings, the young Sith realized that the Emperor planned to replicate their rituals to preserve his own life by transplanting his consciousness into multiple new bodies. Up until then, Kressh herself was unaware that she was already being partially controlled by the Emperor in such a manner, and when the Dark Lord learned all he needed from the Ortolans to complete his own plans, he guided his apprentice to massacre the tribe. Kressh complied with the Emperor's will, but after her time on Lenico IV, she decided to rebel against her Master to end his control over her and prevent him from creating a new batch of host bodies."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The massacre on the Outer Rim Territories world of Lenico IV came as a result of the ambitions of the Dark Lord of the Sith commonly known as the Sith Emperor. Formerly known as the Sith Lord Vitiate, the Emperor had led his people in a great exodus at the end of the Great Hyperspace War of 5000 BBY to preserve the remnants of the ancient Sith Empire and to rebuild the Sith Order at the heart of a new Imperial society. The Emperor, well-practiced in the art of Sith magic, successfully commanded the rebuilding of the Sith Empire, but quickly abandoned direct oversight of the civilization and turned his attention towards a search for immortality and power. Although he had already artificially extended his lifespan by sapping the Force from the planet Nathema, the Emperor intended to live indefinitely and operate on a level of omnipotency, and so sought out lore and magic from across the galaxy that would help him to fulfill that goal."}, {"tag": "p", "text": "After reigning over his Empire for over one thousand years, the Sith Emperor was attacked by the Jedi Masters Revan and Meetra Surik in his Citadel on Dromund Kaas. Although he survived the assassination attempt, the Jedi's near-victory shook the Emperor and led him to begin work on a number of clandestine operations meant to project his presence throughout the galaxy and protect against similar attacks in the future. As such, he began to utilize individuals known as his Wrath, Voice, and Hands to expand his potency, but also sought to create a new group of servants who would embody the entirety of his will when he so chose. To that end, he began collecting children from within the territory of the Empire and infusing them with his power. The first of his subjects was his own young Sith apprentice Exal Kressh, whom he worked to hollow out and fill with his own strength. Unbeknown to Kressh, the Emperor was using her as an extension of his will, and was therefore able to enter her mind, sense her thoughts, and contribute his own. His command over his young apprentice increased as she completed missions on his behalf to search out ritualistic lore and ancient holocrons that could help him to complete his plans."}, {"tag": "p", "text": "In 3681 BBY, the Sith Empire, as directed by the Emperor, emerged from its hidden realm in the Unknown Regions and launched the Great Galactic War to exact revenge against the Galactic Republic and Jedi Order that had defeated it in the Great Hyperspace War many years prior. Kressh, still serving as the Emperor's apprentice, now traversed even greater stretches of space to fulfill her Master's bidding. Approximately three years into the galactic conflict, around 3678 BBY, the Emperor commanded that Kressh travel to Lenico IV in the Cademimu sector to search out a tribe of Ortolan shamans on the planet's desolate Ash Plains. Despite being unaware of the reason behind her mandate, the young Sith complied and journeyed to the world."}, {"tag": "h2", "text": "The massacre"}, {"tag": "p", "text": "On Lenico IV, Kressh discovered the primitive Ortolan tribe living in a humble village and listened to their lore and histories. She learned of their tribal legends which told stories of patriarchs and shamans who were able to harness arcane rituals to live on through their descendants. The lessons helped Kressh to understand what the Emperor had planned for her and others: exploitation as little more than vessels so that he could achieve immortality and unlimited power. The Emperor, who was still able to invade his apprentice's mind, saw the events on Lenico IV through her eyes and learned the Ortolans' secrets. He then directed Kressh to kill the diminutive aliens. The Sith apprentice complied, easily massacring the Ortolans with her lightsaber and her use of Force lightning. The small village was reduced to ruins in the massacre and was later swallowed by the shifting sands of the Ash Plains."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Now aware of the Ortolan legends, the Emperor continued his work to create legions of his \"Children\" on the Sith holy planet of Korriban. Deep within the Sith academy there, the Dark Lord collected infants and prepared to turn them into extensions of himself through Sith Magic and the Ortolans' rituals. Meanwhile, Kressh returned to her duties as the Emperor's apprentice, but was shaken by what she had experienced on Lenico IV. She grew to hate her Master for using her as a puppet, and so resolved to abandon the Emperor and fight against his schemes. To that end, around fifty-two days prior to the Empire's victory in the Invasion of Begeren, the young Sith disappeared in the Kathol Rift and began a trek towards Galactic Republic territory. Once there, she began to covertly leak confidential Imperial strategy and information to Republic agents in the Strategic Information Service in the hope of undermining the Sith war effort and confounding the Emperor's plans to complete the creation of his Children."}, {"tag": "p", "text": "Although the Republic and Jedi Order benefitted from Kressh's betrayal, the Jedi High Council commanded that the mysterious Sith woman be found and taken into custody so the validity of her claims could be discerned. Simultaneously, the Sith Emperor and his Dark Council decreed that Kressh was to be located and executed for her crimes against the Empire. During the hunt for the young Sith, she attempted to throw off the Emperor's search teams by returning to Lenico IV; she was found there but managed to escape, and her pursuer, the Sith apprentice Teneb Kel, was temporarily stranded on the planet. There, he found rudimentary cave paintings depicting the massacre and even received a vision through the Force in which Kressh herself admitted to the slaughter. Although Kressh continued to give all of her pursuers a difficult chase across the Outer Rim Territories, she was ultimately defeated and her hopes of destroying the Emperor's Children were dashed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The massacre on Lenico IV was first mentioned in The Old Republic, Blood of the Empire Act 2: The Broken World, the second issue of the Blood of the Empire comic story arc. The event was pictured in a single-panel image of a cave painting on Lenico IV, and was later explained by an apparition of Exal Kressh. Although The Broken World was originally released in 2010 as a web-exclusive comic, it was later re-released in the same year as The Old Republic 5: Blood of the Empire, Part 2."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}