{"url": "Massacre_on_Yellowblade%27s_Landing", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Articles needing illustration", "Category:Battles in the Mid Rim", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Massacre on Yellowblade's Landing"}, {"tag": "p", "text": "A massacre took place on Yellowblade's Landing during the Clone Wars."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the escape of Obi-Wan Kenobi and Asajj Ventress during the Skirmish above Raydonia, Darth Maul and Savage Opress landed on Yellowblade's Landing to begin building their army. Upon entering a cantina, they began to look for the rally outpost's owner. The Bartender directed Maul to Nukss, who led the local gang known as The Scourge. After threatening Savage and Maul to either join the gang or pay them money, Maul returned with another threat; that they either join them, or die."}, {"tag": "h2", "text": "The Massacre"}, {"tag": "p", "text": "Once the fight began, Maul and Savage disposed of the six gang members, which left Nukss at Maul's mercy. Nukss claimed that he should be allowed serve the Zabraks, but Maul decided to kill Nukss now that he was useless to him. However, Savage chose to leave one of them alive, so that he would warn others and bring the Jedi to them. Maul spoke out against this and told Savage that they were not yet ready to face the Jedi, and that they should hide. In order to do this, Maul said that they should leave no witnesses, and to do that, they must slay all who were inside the cantina at the time of the skirmish."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Word that the two Sith had made their way to Yellowblade's Landing soon reached the Coruscant underworld, where Plo Koon learned from his informants that Maul and Savage were located there. Plo Koon, along with Obi-Wan Kenobi, Bruu Jun-Fan and his Padawan Tatsu, and Master Grohto would come to the icy world two rotations later, and found a Turtle Tanker, as well as the massacred bodies in the cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}