{"url": "Massad_Thrumble", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Character stubs", "Category:Galactic Empire science and engineering personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Massad Thrumble"}, {"tag": "p", "text": "Admiral Massad Thrumble was an Imperial droid researcher, working under Simonelle, who succeeded in creating fully operational Human replica droids for numerous clients including Black Sun and the Empire. Some of the HRDs he created included Guri, as well as replicas of Frija Torlock and her father Lexhannen."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In his youth, Massad Thrumble worked for the Empire as a captain in a droid production plant. Eventually, he rose to the rank of Admiral and was in charge of an Imperial droid research facility. There he was involved in the creation of Human replica droids such as Guri."}, {"tag": "p", "text": "Thrumble later retired, and as of 4 ABY he owned and operated a small cantina on Hurd's Moon. He had a modified medical droid, A-OIC, also known as Doc. Doc was stolen by the Pikkel Sisters on behalf of Spinda Caveel. Shortly after this, he was approached by Guri, who wanted him to remove her memories of working for Black Sun. He told Guri that he needed Doc to perform the operation, so she went to Murninkam to rescue the droid."}, {"tag": "p", "text": "Guri was successful and returned to Thrumble with the droid. However, she was pursued by several groups. The first was the bounty hunter Kar Yang, who was hired by Savan, niece of Prince Xizor, to capture Guri. Yang interrupted Thrumble before he could begin the operation on Guri, but Guri fought and killed him."}, {"tag": "p", "text": "Three more groups traveled to Hurd's Moon. The first was Caveel and the Pikkel Sisters, who wanted to take back Doc. The second was Savan, and the third was the Heroes of Yavin, who were following Savan. Despite this, Thrumble's defenses held off all of them while he and Doc performed the operation to remove Guri's memories."}, {"tag": "p", "text": "With Guri free from her past, Thrumble tried to flee with her on the Stinger. They encountered a gang of thugs working for Savan, but Guri remembered her fighting abilities and defeated them. They then encountered Savan herself, who tried to take control of Guri using a code phrase she learned from Xizor. Savan ordered Guri to kill Thrumble, but the code phrase did not work, and Savan was arrested by the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}