{"url": "Massiff", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Creatures of Geonosis", "Category:Creatures of Tatooine", "Category:Domesticated creatures", "Category:Non-sentient species", "Category:Predatory creatures"], "nodes": [{"tag": "h1", "text": "Massiff"}, {"tag": "p", "text": "The massiff was a reptilian species of dangerous hunters found on desert planets including Tatooine and Geonosis. Massiffs were domesticated for sentry and guard tasks, and were used by the Tusken Raiders of Tatooine."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A massiff was a squat quadruped with a row of spines along their humped backs. The size of the spines, which the reptiles used for defense, indicated a massiff's age. As well as the spines giving them an extra level of defense, the creatures also had armored hides. Native to desert environments, massiffs were snarling hunters with powerful and dangerous bites. Their mouths could open very wide and were filled with long dagger-like teeth. The creature's large eyes allowed it to see well at night and in the dark in general. An average massiff stood at roughly one meter high, and the species was found on a variety of worlds, typically in desert habitats such as Tatooine, Geonosis, and Florrum."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Many massiffs were domesticated and trained for sentry and guard duty. Tusken Raiders, Weequay pirates, and even clone troopers of the Grand Army of the Republic utilized massiffs as guard beasts. During the Clone Wars, ARF troopers trained massiffs as trackers. At least one, named Grizzer, was used by the clone trooper sergeant accordingly nicknamed \"Hound.\" Grizzer was used to track Jedi Ahsoka Tano on Coruscant after she escaped from the Republic military base."}, {"tag": "p", "text": "In 9 ABY,[source?] the Mandalorian bounty hunter Din Djarin ran into a pack of massiffs on Tatooine. As his companion Cobb Vanth grew nervous, Djarin began to communicate with the massiffs and calmly let one approach him before petting it and meeting with the accompanying tribe of Tusken Raiders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The massiff originated from a concept design of the orray. In particular, the massiff adapted the aggressive and menacing appearance of early orray concepts. The massiff was deemed too vicious-looking for a simple pack animal, so it became a dog-sized lizard that was to attack Obi-Wan Kenobi on Geonosis in a scene cut from Star Wars: Episode II Attack of the Clones. After this scene was cut, the massiffs were transported to Tatooine to serve as guard dogs for Tusken Raiders, replacing a creature design originally known as a faybo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}