{"url": "Armitage_Hux", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:First Order admirals and generals", "Category:Humans", "Category:Males", "Category:Spies", "Category:Supreme Council members"], "nodes": [{"tag": "h1", "text": "Armitage Hux"}, {"tag": "p", "text": "Armitage Hux was a human male who served as a general in the military forces of the First Order during the New Republic Era. With the support of Supreme Leader Snoke, Hux took command of Starkiller Base and promoted the development of new technology that allowed the First Order fleet to track targets through hyperspace. However, Snoke's death ruined the young general's career trajectory, as did the years that Hux spent jockeying for power against his rival Kylo Ren, who seized control of the First Order as the new Supreme Leader."}, {"tag": "p", "text": "Born on the planet Arkanis around the time of the Battle of Yavin, Hux was the illegitimate son of Commandant Brendol Hux, who fathered Armitage by a kitchen woman. In the aftermath of the Galactic Civil War, Hux was sent into the Unknown Regions where the First Order rose seeking to reclaim the glory of the Galactic Empire. A ruthless officer by the time of the Cold War, Hux engineered the death of his father, oversaw the training and indoctrination of a new generation of stormtroopers, and ordered the firing of the Starkiller superweapon to destroy the New Republic capital of Hosnian Prime. During the First Order/Resistance War, Hux served as commanding officer of the Mega-class Star Dreadnought Supremacy until its destruction shortly before the Battle of Crait."}, {"tag": "p", "text": "Hux's influence was diminished by Ren's accession to the rank of Supreme Leader. Though he served on the Supreme Council alongside other members of the First Order High Command, Hux had little independent authority without supervision, and was made to serve below Allegiant General Enric Pryde. Disillusioned with his place in Ren's regime, he supplied the Resistance with information about the Sith fleet on Exegol, determined to see his rival lose the war. Ultimately, however, Hux's role as a double agent was discovered by Pryde, and the young general was consequently executed for treason."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Armitage Hux was born on the planet Arkanis around the time of the Battle of Yavin, approximately 0 ABY, during the reign of the Galactic Empire. Hux was fathered by Commandant Brendol Hux, though not with his father's wife Maratelle, but rather a kitchen woman, making Hux the commandant's bastard son. Hux never knew his mother and as a boy remained utterly friendless. As a youngling, Hux was the subject of gossip among the Imperial officers' ranks, as they whispered among themselves about the existence of Brendol's bastard and the mother who bore him."}, {"tag": "p", "text": "Brendol made no secret of the low opinion he had about his son, whom he regarded as a frail, weak-willed boy, though not entirely bereft of potential. Grand Admiral Rae Sloane suspected that Hux was regularly abused by his father, both psychologically and physically, suspicions which proved to be true. Hux would find comfort and strength in his father's stories of how the Empire brought peace to a galaxy that had weathered the chaos of the Clone Wars, comforting him even as Hux weathered his own abuse under his father. Because of his Imperial heritage, Hux developed notions of grandeur and believed that he had a right to sit on the throne that ruled the galaxy. At an early age, Hux promised to himself that he would prove his father's preconceptions of him wrong. Taking inspiration from the legacy of Sheev Palpatine, the Naboo senator who became the Galactic Emperor, Hux believed that he was also capable of gaining absolute power. As such, Hux envisioned himself as the galaxy's future ruler, a savior bringing peace to the chaos for which he held the New Republic responsible."}, {"tag": "p", "text": "The young Hux became acquainted with his father's fellow officers, such as Enric Pryde, who was a friend of both Brendol and Maratelle, and Admiral Brooks, who openly ridiculed Hux's illegitimacy. Brooks once mocked Hux after he accidentally dropped their refreshments, suggesting that the illegitimate son of a kitchen woman should at least be capable of serving drinks. As Brendol expressed his contempt for his son, calling him pathetic and utterly useless, Hux promised to clean the mess, to which Brooks suggested that he lick the floor. Hux looked to his father for help before acquiescing to the admiral's request. Brendol, however, watched Armitage with disgust and began to physically accost his son."}, {"tag": "h3", "text": "Fall of the Galactic Empire"}, {"tag": "p", "text": "The Empire was in its death throes as a result of the Rebel victory at Endor. As the New Republic laid siege to Arkanis, the Hux family was forced to evacuate their homeworld in 5 ABY. Fleet Admiral Gallius Rax, a political protégé of the late Emperor Palpatine, became invested in the future of Brendol Hux because of the commandant's visionary ideas on stormtrooper training. At Rax's request, Sloane enlisted the services of the bounty hunter Mercurial Swift to rescue the Huxes, ensuring that neither Brendol nor his son became prisoners of the New Republic."}, {"tag": "p", "text": "Unbeknownst to Sloane, Rax was fulfilling the Emperor's Contingency—a clandestine operation designed to destroy the Empire from within and ensure its rebirth in the Unknown Regions of galactic space. Following the Attack on Chandrila, Armitage and Brendol traveled to the planet Jakku, where the Imperial Military gathered to make a last stand. In the months prior to the Battle of Jakku, the Huxes remained close at Rax's side, who effectively led the Imperial show government as the self-styled Counselor to the Empire. Hux tried to keep his distance from his father, who continued mistreating him, while Brendol trained twenty-four local orphans. By the end of their training, these child soldiers became Counselor Rax's personal bodyguards."}, {"tag": "p", "text": "When the New Republic Defense Force invaded Jakku, a transport ferried Hux, his father, Counselor Rax, the Emperor's adviser Yupe Tashu, and the child soldiers to the Jakku Observatory—a secret facility in the Plaintive Hand plateau, which was instrumental to the late Emperor's contingency plans. Rax intended to detonate Jakku's planetary core, wiping out both the New Republic and the Empire in a single stroke, before taking Hux and Brendol to the Unknown Regions where they could create a new Empire. As they traveled to the observatory, Hux found himself alone in the transport hold with the child soldiers. The older children intimidated him, as they had been trained by his father to become ruthless killers. Until then, Rax was focused on what Brendol offered to the new Empire that he intended to build in the old regime's place. However, in pitying the boy, who was well aware of what his father thought about him, the Counselor began considering Hux's role as well."}, {"tag": "p", "text": "The child soldiers were ultimately gifted to Hux by Counselor Rax, realizing that Hux would carry on his father's work by training a new generation of soldiers bred for warfare. With that, Rax addressed his troops personally, informing them that they would follow Hux's orders to the death and without question. Putting his new authority to the test, Hux ordered one of the boys to strike his comrade. After reaching the observatory, the Huxes were bidden by the Counselor to board his luxury yacht—a replica of the Emperor's Imperialis. Rax, however, was killed by Sloane before he could complete his plan to explode Jakku. Seizing the opportunity to mold the next Empire according to her ideals, Sloane accompanied Hux and Brendol on their sojourn to uncharted space."}, {"tag": "p", "text": "During the journey, Sloane befriended Hux, who came to see the Grand Admiral as his protector from Brendol. Hux likewise protected Sloane from the child soldiers, who remained loyal only to himself in accordance with Rax's last wishes. Sloane berated Brendol, warning the commandant to cease hurting his son. However, she also wanted Hux to benefit from his father's experience and as such Brendol was ordered to educate his illegitimate son as he would a proper heir. For several months, the Imperialis traveled through the Unknown Regions, and in that time, Hux and his soldiers grew even more vicious under Brendol's tutelage. Even Sloane was taken aback by Hux's cruelty, which she considered to be an unusual trait for such a small boy. Their travails eventually culminated in their discovery of the Emperor's Super Star Destroyer, the Eclipse."}, {"tag": "h3", "text": "Rise of the First Order"}, {"tag": "h4", "text": "A general in the making"}, {"tag": "p", "text": "Although the Empire surrendered to the New Republic, signing the Galactic Concordance that ended the Galactic Civil War, the principles of the New Order survived through a new generation of adherents. Armitage Hux was part of that generation, having grown up listening to stories about legendary Imperial leaders. As part of his education, Hux was raised to believe that the Empire delivered the galaxy from the chaos of the Clone Wars, whereas the New Republic lacked the strength to impose such order."}, {"tag": "p", "text": "At the same time, several individual elements of the Old Empire were combined to form a new regime, melding the Empire's political, military and spiritual survivors under a movement that became known as the First Order. As the son of an Imperial Academy commandant, Hux belonged to the military branch that was the template of the First Order military. He eventually gained the status of general, becoming the youngest First Order officer to hold that military rank while also serving as a member of First Order High Command. However, Hux aspired to control both branches of the military—the First Order Navy and the First Order army—as Grand Marshal, although Supreme Leader Snoke denied him this title."}, {"tag": "p", "text": "Having spent his life in thrall to the idea of Imperial power, General Hux continued his father's legacy which included Brendol's radical ideas on training soldiers from birth. This approach produced a new generation of stormtroopers that began with Brendol and continued through Hux, who also revived another Imperial ideal—achieving military superiority through technological terror."}, {"tag": "h4", "text": "Mission to Parnassos"}, {"tag": "p", "text": "At some point Hux ventured to Parnassos to respond to the distress signal sent by Brendol from the crash site of his ship. Hux arrived at the crash site personally, greeting his father, Phasma, Siv, and Frey impersonally and accepting Phasma and Frey into the First Order. Hux told his father that his disappearance had caused concern in the higher ranks of the First Order and that he needed to return immediately, as the Supreme Leader had many things to discuss with him."}, {"tag": "p", "text": "As he rode with Brendol, Phasma, and Frey to the Resurgent-class Star Destroyer Absolution, Hux bore witness to Brendol's orbital bombardment of Parnassos. Footage recovered from the shuttle that transported them to the Absolution was later recovered by Resistance intelligence agents. One of these agents, Vi Moradi, viewed the recording and said that the look she saw Armitage giving Brendol was one of pure loathing."}, {"tag": "h4", "text": "An act of patricide"}, {"tag": "p", "text": "Over the course of his rise to power, the young general ruthlessly dispatched many enemies and potential foes before they became too dangerous a threat. This included the quiet elimination of Hux's father, Brendol, the elder General Hux. Knowing how his father truly felt about him, Hux resolved to kill his father, although this was not the only reason behind his patricidal actions. Driven by ambition and a sense of destiny, he saw Brendol as an obstacle in his path to gaining greater power. To that end, he enlisted the help of Captain Phasma, and the two conspirators agreed that the old Imperial veteran had to be permanently removed so as to promote their own interests."}, {"tag": "p", "text": "Although Hux had no reservations about committing patricide, he left the actual killing to his co-conspirator, whom he instructed to use an untraceable method, not wanting the murder to be traced back to himself. Phasma therefore utilized a toxin, taken from the bite of a Parnassos beetle, to assassinate Brendol. Once the deed was done, Hux proceeded with formalities by addressing the members of the First Order Stormtrooper Corps, informing them that their founder had died. After concluding his speech, Hux wasted no time in positioning himself as his father's successor, and even took possession of Brendol's suite on the Absolution."}, {"tag": "p", "text": "In the years following Brendol's demise, Hux remodeled the First Order army according to his design, promoting Phasma to complete the older stormtrooper cadets' training. Her methods emphasized loyalty, obedience and ruthlessness, qualities that met with Armitage's approval. Keeping with his habit of eliminating potential threats, Hux sidelined Captain Cardinal, knowing that the latter was a loyal supporter of the general's late father. Cardinal eventually concluded that Phasma was the culprit behind his mentor's death, though he was unaware of Hux's role in it. He reported his findings to Hux, who revealed his own involvement in the conspiracy that assassinated his father. Though Cardinal was ultimately deferential to Hux due to the latter's authority, Hux remained skeptical about Cardinal's loyalty and expected Phasma to elminate him as well."}, {"tag": "p", "text": "As a precaution, Hux excluded Cardinal from a meeting of senior First Order officials. When Cardinal arrived with evidence of Phasma's crimes, Hux curtly dismissed the captain, telling him that his services were no longer required. Having spent a lifetime following protocol, Cardinal complied but later attempted to avenge Brendol by killing Phasma. However, he was bested by his fellow captain in single combat and grievously wounded. Cardinal only escaped with the help of Moradi. In the end, his idealized view of the First Order was shattered by the actions of Hux and Phasma."}, {"tag": "h4", "text": "The hunt for Poe Dameron"}, {"tag": "p", "text": "At some point prior to the cold war, Hux allegedly harbored a distaste for First Order Security Bureau agent Terex, a belief largely founded on Terex's past as a criminal. Terex had begun a manhunt against Resistance agent Poe Dameron, an action harshly opposed by Hux and other First Order leaders."}, {"tag": "h3", "text": "Cold War"}, {"tag": "h4", "text": "GUHL-JO387O"}, {"tag": "p", "text": "Hux, Kylo Ren and two First Order admirals gathered in a conference room aboard the Finalizer over the planet GUHL-JO387O. They were discussing travel to a planet in the Western Reaches. While in the conference, the creature that FN-2187 was chasing turned off the lights, interrupting the conference."}, {"tag": "h4", "text": "Marooned with Kylo Ren"}, {"tag": "p", "text": "While traveling through hyperspace, a shuttle carrying Hux and Ren crashed on a terrestrial forested planet. They survived, however, due to Ren's command of the Force, although the dark warrior admitted that Hux's survival was entirely accidental on his part. After coming to the conclusion that the ship had been sabotaged, Hux got into an argument with Ren, taunting him by telling him that Ren's grandfather, Darth Vader, needed his mask to survive, whereas Ren used his mask to play dress up and hide the faces of his parents. This angered Ren, who activated his lightsaber and threatened to kill Hux; after all, no one would find out. Hux pointed out that Supreme Leader Snoke would find out and would punish Ren. Ren deactivated his lightsaber but commented that he didn't know why Snoke kept Hux alive."}, {"tag": "p", "text": "Suddenly, the two men spotted a leg of an animal. Hux told Ren it was bait right as a massive beast known as a norwood came out of the shrubbery and surprised the two. Ren activated his lightsaber and told Hux to stand behind him, but Hux had already fled. Kylo then used the Force to hurt the norwood. Thinking the beast was dead, Ren got closer to it. Suddenly, the infuriated beast rose and struck Ren, knocking his helmet off his head and knocking Ren unconscious."}, {"tag": "p", "text": "Hux, who'd been watching the event unfold while he was hiding in the trees, saw a man with a blaster in his hand draw near to the beasts. The man saw Hux hiding, pointed the blaster at him, and ordered him to come out. Hux did as he was ordered and stepped out. He marveled at how the man had tamed the norwoods. Hux, looking at the man's uniform, concluded that the man was a Palace Guard. The man told Hux that he had been off-world when the Death Star destroyed Alderaan. The man then ran off, far away as possible from the Empire, and came to the planet. Hux, after finding out the man's name, which was Bylsma, told him that the Empire had fallen years before. Bylsma was skeptical and asked Hux how could he know that Hux spoke the truth. Hux told him that the truth was Kylo Ren. He then informed Bylsma that Kylo Ren was Ben Solo, son of Leia Organa, Princess of Alderaan and that Ben's parents had won the war. Bylsma then asked about the Death Star. Hux told him that the Death Star and its successor had both been destroyed. Bylsma was surprised when he heard that the Empire had built a second Death Star. Hux answered by saying the Galactic Empire was never renowned for its creativity. Bylsma then stated that he had known Ben's grandfather and mother."}, {"tag": "p", "text": "As the men headed back to where Bylsma lived, Hux asked Bylsma why he was still on the planet. Bylsma replied by saying that he didn't know who'd receive his transmission. He didn't want to risk being found since he had already lost one world. After laying Ben on a bed, Hux, who was pretending to be caring, convinced Bylsma to let him use the communication array so that they could enjoy the peacetime that was won. Finally, Kylo woke up, with Hux telling him that the shuttle would arrive soon, thanks to Bylsma."}, {"tag": "p", "text": "Eventually, a First Order shuttle with Phasma and a small team of stormtroopers on board arrived on the planet. As the ship opened, Phasma and her stormtroopers shot Bylsma's norwoods dead. Hux, now revealing his true nature, ordered Phasma to leave Bylsma alive, stating that he wanted to use the planet for target practice when Starkiller Base became operational. The shuttle left, leaving behind a shocked and saddened Bylsma."}, {"tag": "h4", "text": "Armitage Hux's revenge"}, {"tag": "p", "text": "After speaking with Snoke via hologram on Starkiller Base, Hux was allowed to deal with with the radar technician. Hux dealt with the radar technician. But he wasn't finished. He met with Admiral Brooks, a friend of his father and enemy of his. After asking Phasma to confiscate Brook's weapon, Hux took Phasma's blaster and asked Phasma to leave the two of them."}, {"tag": "p", "text": "Once Phasma had left, Hux ordered Brooks to take a seat. Brooks told Hux that he had never sabotaged the shuttle. Hux replied by saying that he knew and that he'd already dealt with the saboteur. However, Hux told Brooks that Brooks was the radar technician's superior, and ultimately the responsibility lay with Brooks. Brooks told Hux that he had known Hux since he was a child. There had been an incident with the two when Hux was a child. Hux told Brooks that he remembered the incident. Brooks told Hux he was as spineless as he was when he was a child and that Brendol thought little about him. Hux replied that was one of the reasons why he had his father killed as he shot Brooks dead."}, {"tag": "h4", "text": "Commander of Starkiller Base"}, {"tag": "p", "text": "Thirty years after the Battle of Endor, Hux was the general who commanded Starkiller Base, the primary base of operations of the First Order, as well as the Resurgent-class Star Destroyer Finalizer and answered to Supreme Leader Snoke. Deeming Luke Skywalker, the last Jedi, to be a threat to the First Order, Hux, along with Ren, were given the directive. Though the First Order possessed maps from the Empire that would lead them to the planet where Skywalker was hiding, they lacked a final piece. To that end, the Finalizer traveled to Jakku and dispatched a group of stormtroopers to attack the settlement of Tuanul, where Ren captured a Resistance pilot named Poe Dameron, who already acquired and hid the final piece of the map. After Ren interrogated Dameron, he informed Hux that the prisoner had entrusted the map to the BB-series astromech droid BB-8. Hux dispatched stormtroopers back to Jakku to search for it and posted a bounty on the droid."}, {"tag": "p", "text": "Subsequently, Dameron was freed by a stormtrooper and the pair attempted to escape on a TIE/sf space superiority fighter, disabling the Finalizer's turbolasers. Hux ordered the ventral cannons to shoot down the fighter, causing it to crash-land on Jakku. Upon informing Ren of the incident, the dark knight deduced that the traitorous stormtrooper was FN-2187. Hux checked with Phasma, who noted that this was FN-2187's first offense."}, {"tag": "p", "text": "Subsequently, Supreme Leader Snoke ordered BB-8 captured or destroyed if necessary. When Hux informed Ren, the latter questioned the competency of their stormtroopers, given that one of them committed high treason, and suggested that the First Order instead appropriate a clone army like the Galactic Republic and early Empire before them. Hux assured him that his stormtroopers were trained from birth to succeed and reminded Ren not to let his obsession with Skywalker interfere with their mission."}, {"tag": "h4", "text": "End of the New Republic"}, {"tag": "p", "text": "After BB-8 fled Jakku aboard the Millennium Falcon, Hux and Ren returned to Starkiller Base, where they spoke to a hologram of Supreme Leader Snoke. Snoke was not surprised that they let the droid slip through their fingers and stated that the Jedi would rise again if the map got to the Resistance. Hux humbly took full responsibility for his failure, but the Supreme Leader interrupted him, declaring that their strategy had to change. Hux suggested testing the superweapon and destroy the New Republic for supporting the Resistance, leaving their enemies vulnerable. After receiving authorization for the undertaking, Hux then assembled the First Order army at Starkiller Base and gave a grand speech, proclaiming that the destruction of the Republic would be the beginning of the First Order's rise to power in the galaxy. Hux sent his speech via hologram to the First Order's garrison at the Colossus station on Castilon. At his signal, the Starkiller weapon fired and destroyed the Hosnian system, which at the time hosted the Republic's capital and Senate, wiping away its leadership and fleet."}, {"tag": "p", "text": "Subsequently, the First Order received a tip from an informant on Takodana that BB-8 was there, so Ren led an attack squadron. However, Ren instead captured BB-8's accomplice, the Jakku scavenger Rey, because she had seen the map, and ordered the division to retreat as the Resistance engaged them. Ren brought Rey back to Starkiller Base and attempted to extract the map from her mind, only to learn that the girl was strong in the Force and turned his own mind probe against him. Hux later walked in a conversation between Ren and Snoke, the latter asking what happened to BB-8. The general humiliated his colleague by telling the Supreme Leader that Ren decided the droid was no longer valuable to the First Order's mission, and that the girl was all they needed. He then informed Snoke that they tracked the Resistance scout ship performing recon on Starkiller Base back to the Ileenium system. Snoke ordered Hux to use the superweapon to destroy the Resistance before they could find Skywalker."}, {"tag": "p", "text": "However, while its weapon was charging up, the Resistance led a starfighter assault against Starkiller Base, which resulted in the planet's oncoming collapse before it could fire on D'Qar. Hux was then ordered by Snoke to evacuate the base and to take the defeated Kylo Ren with him, something that Hux, having a very low opinion of Ren, was all too eager to accomplish knowing that Ren suffered a humiliating defeat."}, {"tag": "p", "text": "As he was making his way out of the base, Hux's path took him into proximity with the quarters of the Jerjerrod couple, which had been hit by falling debris from a crashed TIE fighter. There, he briefly witnessed the ongoing fight between First Order forces and members of the Resistance's J-Squadron. Officer Jul Jerjerrod requested aid from him, which Hux affirmed, assigning several of his accompanying stormtrooper detachment to aid in the capture of the squadron."}, {"tag": "h3", "text": "First Order/Resistance War"}, {"tag": "h4", "text": "Return of Captain Phasma"}, {"tag": "p", "text": "A few days after the assault on Starkiller Base, Hux greeted Phasma personally on his ship, the Finalizer. He questioned Phasma's late return, to which she replied that she had been preoccupied with chasing down and dispatching the true culprit behind the one who had turned off the shields at Starkiller Base. She named Lieutenant Sol Rivas as the perpetrator. Hux complimented her and promptly left, leaving Phasma to stare off at the sight of the First Order fleet gathering in large numbers."}, {"tag": "h4", "text": "Battle of D'Qar"}, {"tag": "p", "text": "After the assault on Starkiller Base, Hux led a First Order fleet, including a Mandator IV-class Siege Dreadnought, to the evacuated main Resistance base on D'Qar. Placing more emphasis on spectacle than tactical sense, Hux ordered no fighter deployments in favor of annihilating the base and fleet from orbit with the dreadnought. He was, however, briefly distracted by an insulting transmission from Poe Dameron, who repeatedly referred to Hux by the mocking term \"General Hugs\" and implied that Leia wanted to send a message about Hux's mother. Hux responded that he would not negotiate with the Resistance, but Poe responded as if he couldn't hear him. After a few more attempts which made Hux increasingly angry, he ultimately ordered the dreadnought to destroy the Resistance base, and afterwards, the main fleet. When Poe attacked the dreadnought head-on, Hux dismissed it as an insane maneuver only to watch in shock and disbelief as the Resistance ace proceeded to destroy the dreadnought's surface cannons one by one, prompting him to hail the dreadnought's commanding officer and angrily demand why he was not blasting \"that puny ship\". The dreadnought's captain, a veteran of the Old Empire with little patience for Hux, retorted that the ship was too small and too close and ordered the ship's fighters deployed in a manner which contradicted Hux's prior orders.Though the base was ultimately destroyed, the victory wound up being largely pyrrhic because it had been completely evacuated and the Resistance deployed bombers which annihilated the dreadnought, allowing the Resistance fleet to escape. Hux was then contacted and subjected to painful humiliation by Snoke, who slammed the general into the floor of the bridge with the Force for his failure to destroy the Resistance. Hux, though smarting and with a bleeding lip, replied that he had a plan to track the Resistance through hyperspace, a plan which he relayed in full to the Supreme Leader aboard his flagship, the Mega-class Star Dreadnought Supremacy."}, {"tag": "h4", "text": "Commander of the Supremacy"}, {"tag": "p", "text": "During the assault on the Resistance fleet, Hux was frustrated that the Resistance fleet, consisting of only three cruisers, was able to stay far enough ahead of them to render the First Order cannons ineffective against their shields but nevertheless ordered the barrage to continue, specifically targeting the MC85 Star Cruiser Raddus. After the Resistance's medical frigate ran out of fuel, Hux ordered it destroyed the second it was in range, though the ship was successfully evacuated prior to its destruction."}, {"tag": "p", "text": "When Finn and Rose Tico were captured while trying to disable the tracker on the Supremacy, they were led to an assembly area of stormtroopers in the hangar, led by General Hux. Hux then struck Finn on the cheek, showing his disdain for him. After insulting the people of the Otomok system, Tico's home system, she bit Hux on the hand, infuriating him. Shortly after, Hux left the pair to be executed by Captain Phasma, having figured out the Resistance's plan to escape via thirty U-55 orbital loadlifters, thanks to DJ divulging this information to the First Order. He also proceeded to have the fleet pick off any and all escape ships one by one. Focused on the annihilation of the transports, Hux brushed off the news that the Raddus was preparing a hyperspace jump as a failed ploy to distract them, unaware that Vice Admiral Amilyn Holdo was intending to jump the Raddus to lightspeed directly at the Supremacy. Upon seeing she had turned about face, Hux realized her intentions and frantically ordered all firepower concentrated on the Raddus, but it was too late. The faster-than-lightspeed collision sliced the Supremacy in two, also annihilating twenty other nearby Resurgent-class Star Destroyers as well."}, {"tag": "p", "text": "After Holdo's suicide attack, General Hux went to the throne room to report to and check on Snoke. Upon reaching it, however, he found the place in shambles, littered with the bodies of Snoke's Elite Praetorian Guard, who were killed by Kylo Ren and Rey, Snoke's dismembered corpse lying near the throne and Kylo Ren lying unconscious in the wreckage. Hux tried to take advantage of the situation to kill his rival, but Kylo woke up before he could act. After he expressed disbelief at seeing Snoke's dead body, Kylo told him that Rey killed Snoke and ordered him to move the men to Crait, to crush the Resistance once and for all. Hux protested, stating than Kylo had no rights to command him or his men but Kylo merely seized Hux in a crushing Force choke until he acknowledged him as the new Supreme Leader."}, {"tag": "h4", "text": "Battle of Crait"}, {"tag": "p", "text": "Hux was in Kylo Ren's command shuttle during the Battle of Crait. Once Kylo Ren gave the order to advance, Hux also attempted to issue the command, resulting in a sidelong stare by Kylo. After Kylo Ren fired on Luke Skywalker's force projection with All Terrain MegaCaliber Six and First Order All Terrain Armored Transport walkers, Hux shouted at the pilots to stop firing, thinking that Skywalker had been completely destroyed by the barrage. Hux asked if Ren thought he got him, but was startled when the smoke cleared to reveal Skywalker completely unharmed. Ren ordered the command shuttle to land only for Hux to protest that Ren was getting distracted. In response, Kylo Ren hurled Hux against a wall with the Force, temporarily knocking him out. By the time Hux regained consciousness, the Resistance had already fled and reorganized itself into the Rebellion. He and Kylo Ren accompanied the First Order Snowtroopers as they searched through the now-abandoned base."}, {"tag": "h4", "text": "Hunting the Resistance"}, {"tag": "p", "text": "A period of confusion and uncertainty ensued as word of Supreme Leader Snoke's death spread through the ranks of the First Order. A group of First Order officers discussed among themselves the ramifications of their ruler's demise, and wondered if General Hux had taken the reins of power as the First Order's new Supreme Leader."}, {"tag": "p", "text": "Under the new Supreme Leader's reign, Hux traveled to the First Order supertanker, the Titan, to meet with Commander Pyre and Agent Tierny. While on the station, he and his stormtrooper attache ordered Kazuda Xiono, who was disguised as a First Order technician, to lead him to the briefing room of the station. Xiono, a native of Hosnian Prime and aware of Hux's role in the destruction of the planet, almost attacked Hux as the general spoke in a disdainful manner to his subordinate. Upon arriving to the briefing area, Hux delivered more orders to Pyre regarding the attainment of valuable supertanker assets, notably to quell the resistance on the Colossus. During the later meeting, Hux became frustrated with the interruption to the meeting caused by Xiono's theft of the Titan's radiation deflector."}, {"tag": "p", "text": "Hux then led a fleet that destroyed the planet of Tah'Nuhna because of its assistance to the Resistance, despite pleading from its leaders about their long-standing neutrality in galactic affairs. At the order of Kylo Ren, Hux also ordered the Kendoh Gang to get Resistance operative Finn when they alerted him that they'd spotted him, though Hux had initially refuted the validity of the gang's claims."}, {"tag": "p", "text": "Hux was eventually contacted by Chadkol Gee regarding the Resistance presence on Mon Cala. Upon arriving to Mon Cala, Hux ordered the destruction of rebellious Quarren and Mon Calamari fighters. Following the skirmish, Hux deduced that Mon Cala had finally sided with the Resistance."}, {"tag": "p", "text": "In the aftermath of the devastation of Aeos Prime, Hux was informed via holoprojector by Commander Pyre and Agent Tierny that the suppression of the Aeos system was complete and that there was no longer any Resistance presence in the sector. Hux then walked away so Supreme Leader Kylo Ren could talk with Pyre and Tierny about the matter of the Colossus."}, {"tag": "p", "text": "Hux, alongside Supreme Leader Ren, was in command of a Resurgent-class Star Destroyer that captured a Resistance Intersystem Transport Ship. However, Poe Dameron managed to escape before returning with a sizeable fleet that caught the First Order off-guard."}, {"tag": "h4", "text": "At war's end"}, {"tag": "p", "text": "In the year after the Battle of Crait, a mysterious message swept out across the galaxy in the voice of Darth Sidious, previously presumed dead at Endor decades prior. To Hux's dismay, Ren diverted his attention away from the Resistance to focus on the potential threat to his rule the phantom Emperor posed, which Hux didn't take seriously, dismissing Ren's actions as chasing a ghost. To track down Sidious, Ren required a Sith wayfinder, which he eventually located, despite Hux's smug disapproval, on the volcanic planet of Mustafar, once ruled by Ren's grandfather Darth Vader from his personal stronghold, Fortress Vader."}, {"tag": "p", "text": "Hux accompanied Ren along with Allegiant General Enric Pryde, who had become a rival of his since the Crait, to Mustafar, which Hux described as a \"desolate hellscape.\" Once there, Ren and a squad of stormtroopers fought against the Alazmec of Winsit, a tenacious sect of Sith cultists devoted to protecting Corvax Fen and who venerated Vader as a deity of the dark side. Hux and Pryde watched the fight from a safe distance. While watching, Pryde asked Hux if he didn't like seeing Ren fighting, Hux expressed his opinion that Ren had gone mad due prioritizing the Emperor's supposed return over the burning flames of rebellion across the galaxy, leading Pryde to remind Hux that there was someone behind the broadcast and that Ren would answer to no one."}, {"tag": "p", "text": "Ren eventually made his way to Fortress Vader and recovered Vader's wayfinder, which led him to the ancient Sith world of Exegol. Once there, Ren discovered that Sidious' spirit had in some manner endured, and through the power and influence of his station as Emperor and as a Sith Lord, he had assembled a shadow empire on the fringes of the galaxy. With the aid of the Sith Eternal from Exegol, Sidious had forged the Final Order—one of the largest fleets in history. Following an initial meeting with a hostile Ren, Sidious persuaded him to augment his forces with the Final Order and usher in ultimate galactic dominance as the new Emperor. In parallel to these events, Hux's triumphant First Order military had been tasked by Ren with destroying the remaining Resistance forces, which had continued fighting after Crait but had largely been forced underground by the repressive and expanding regime. In the course of these operations, a number of TIE fighters became involved in a pursuit of the Millennium Falcon as it collected intelligence from Boolio on a spy embedded deep within the First Order that could lead the Resistance to the resurgent Sidious."}, {"tag": "p", "text": "Shortly after the TIEs had chased the Falcon from the Sinta Glacier Colony, the Supreme Leader and his Knights of Ren arrived,  interrogated and ultimately killed Boolio before delivering his decapitated head to a conference of the Supreme Council, including Pryde and Hux. Ren informed his subordinates that there was a traitor in their midst. Sensing apprehension among them, the Supreme Leader inquired if his freshly reassembled helmet made Hux uncomfortable; the general quietly replied that it did not. A comment from General Bellava Parnadee that she liked the mask brought a short pause to the proceedings."}, {"tag": "p", "text": "General Domaric Quinn spoke up, positing that the returned Sidious and his followers seemed more like a cult than anything else. Pryde dismissed this concern, but Quinn continued, wondering aloud if the Sith fleet promised by the Dark Lord was a gift and what he might demand in return. Enraged, Ren used the Force to choke General Quinn and throw his body to the ceiling. As Quinn died, Ren announced to the remaining assembly that his mission, and that of the First Order, were to eliminate Rey, as the Emperor had commanded."}, {"tag": "p", "text": "Following a brief skirmish between First Order troops and Rey's Resistance party on Pasaana, Hux presented to Pryde a \"valuable prisoner\" taken during the fighting: Chewbacca, who is believed dead by his allies. The elder commander, unfazed by the roaring of the Wookiee, ordered immediate interrogation. Shortly after, Ren would return to the Steadfast, having failed to accomplish the task set by Sidious."}, {"tag": "p", "text": "The Steadfast eventually arrived at Kijimi shortly after the arrival of Rey's party, with Ren swiftly disembarking to aid his knights in hunting the scavenger and her allies. Through an old accomplice of Dameron, the fugitives were able to sneak aboard the vessel in order to liberate Chewbacca from First Order custody, Rey having discovered his survival through the Force. Although they managed to kill a number of stormtroopers, all members of the strike team save for Rey were eventually swarmed by overwhelming numbers and captured. Hux soon arrived to confront the prisoners and ordered their immediate execution. He chose to accompany the squad of troopers selected for the duty as they escorted Finn, Dameron and Chewbacca to a sequestered section of the ship."}, {"tag": "p", "text": "Moments before the sentence was to be carried out, Hux spoke up and claimed that he would like to join the firing squad. Accepting the blaster of one of the troopers present, the general swiftly spun around and killed the troopers before outing himself as the spy that Ren and Pryde had been hunting within their ranks. Offering his assistance to the bewildered Resistance agents, he quickly escorted them to the incarcerated Falcon, lingering behind them as they blasted their way through his own troops."}, {"tag": "p", "text": "Stopping Finn before he could board the Falcon, Hux demanded that the former stormtrooper shoot him in the arm in order to verify his cover story that he had been forced to aid in their escape. Out of spite, Finn shot the general in the thigh. He then inquired as to why Hux would betray the First Order he had helped build; disdainfully, the general said that he didn't care if the Resistance won so much as that Ren needed to lose. The Resistance agents then completed their escape, rejoining Rey as she ended her latest duel with Ren, who had returned to the Steadfast after discovering she was aboard."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "Hux had his injured leg treated with bacta gel, causing the wound to itch, and bandaged before reporting to Pryde on the bridge of the Steadfast. He provided Pryde with a false account of how the Resistance escaped in order to conceal his actions of treason and murder. He then planned on framing Ren as the spy who supplied the Resistance with information concerning the fleet on Exegol, believing that this was his opportunity to wrest power from his rival."}, {"tag": "p", "text": "Hux's attempt at deception did not succeed on Pryde. Instead, Hux inadvertently revealed his treachery to the Allegiant General and was summarily executed by Pryde for betraying the First Order. The general's last thought was about Rey, whom he held responsible for the failure of his plans. Although Hux hated the scavenger, her defiance allowed him to die with a sense of hope that Ren would still lose the war."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The last days in the life of General Armitage Hux were spent under the authority of Supreme Leader Kylo Ren and Allegiant General Enric Pryde, both of whom outranked the ambitious officer who sought to rule the galaxy through the First Order. Pryde held Hux personally responsible for the loss of Starkiller Base; as such, he welcomed the First Order's alliance with the Sith Eternal, convinced that they needed their allies' warships to replace the resources that were lost in the wake of Starkiller's destruction."}, {"tag": "p", "text": "General Hux's jealousy and insecurities caused him to take desperate actions with far-reaching consequences, resulting not only in his demise but also the downfall of the First Order. In the aftermath of Hux's death and Ren's subsequent renunciation of the dark side, Pryde traveled to Exegol to oversee the deployment of the Sith fleet, having sworn fealty to the resurrected Emperor. However, the fleet was destroyed by the Resistance and their allies during the Battle of Exegol. The First Order consequently lost its dominance over the galaxy as multiple worlds, including Bespin, Jakku, and Endor, rebelled against military rule."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "General Armitage Hux was a human male who stood at 1.85 meters and weighed 75 kilograms. He had red hair, green eyes and pale skin due to lack of exposure to sunlight. His favorite beverage was bitter tarine tea. He was a ruthless officer in the First Order as well as an adherent to the ideals of the Galactic Empire. Like other members of his generation, who served as the vanguard of First Order leadership, Hux was strikingly young, but what he lacked in experience and wisdom, he made up for in his zeal. Due to his youth, Hux's experiences in warfare were entirely theoretical. Though acknowledged for the thoroughness and complexity of his simulations, Hux earned little respect for his abilities as a warrior."}, {"tag": "p", "text": "As the son of a highly placed official in the old Imperial Academy, Hux was raised to celebrate his Imperial heritage. He grew up idolizing historical Imperials who became legends in the First Order. Hux was convinced that the Empire delivered the galaxy from the violence of the Clone Wars, and that the galaxy once again needed to be saved from itself. This responsibility fell to the First Order, as the New Republic, in Hux's view, was too weak to prevent the inevitable chaos. Hux felt nothing except contempt for the New Republic, a regime that he regarded as corrupt and illegitimate, and treacherous for secretly supporting the Resistance, another organization that the general loathed."}, {"tag": "p", "text": "In addition to his views on the New Republic, Hux did not view the First Order as a continuation of the Old Empire, but rather its successor. Despite his admiration for the Empire's accomplishments and his desire to relive the glories of its past, Hux believed the Empire fell due to internal flaws, whereas he saw the First Order as a more refined and pure version of what the Empire sought to become, but never achieved. This viewpoint led Hux to look down on the older generation of Imperial veterans who founded the First Order. In Hux's mind, officers such as Captain Edrison Peavey belonged to a different time, and had outlived their glory days."}, {"tag": "p", "text": "Due to his imperious nature, Hux sought far greater authority than that of his official rank as general. Though his ultimate ambition was to become Supreme Leader,  Hux was content to wield authority over both the armies and fleets of the First Order as Grand Marshal while Snoke reigned. Undaunted by Snoke's refusal to grant this title, the young general continued to court the Supreme Leader's favor in order to promote his military career, resulting in his elevation as commander of Starkiller Base. With his ruler's support, Hux proudly took the reigns of the Starkiller project, determined to become the face of the First Order regime. Hux took great care to conceal his ambitions as best he could, having to occasionally stop himself from referring to himself as \"Supreme Leader Hux,\" as he was well aware of the First Order's extensive surveillance system. In addition to the Supreme Leader's title, Hux coveted Snoke's flagship, the Supremacy, and would often transfer his command ship from the Finalizer to the gargantuan Mega-class Star Dreadnought. Hux respected Snoke for building the First Order out of a group of Imperial refugees exiled to the Unknown Regions, but in private he did not consider anyone other than himself as being capable of directing the galaxy's industries and nurturing their innovations, while commanding the citizens' respect."}, {"tag": "p", "text": "Hux was obsessed with his appearance; believing it was a vital part for maintaining discipline, he would always wear a parade uniform designed to broadcast his authority as general. Even his posture was affected by this belief, as Hux would often pose in a formal parade stance. In addition to his uniform and bearing, Hux's hair was coiffed to his exacting standards. Hux carried an officers version of the SE-44C with dark plaster as opposed to the regular white sidearm."}, {"tag": "p", "text": "Hux had little understanding or patience for the mystical ways of the Force. While he did not doubt the Force's existence, having witnessed its power in action and even experienced it in the form of a punishment, Hux nonetheless regarded it as the center of an obsolete religion belonging to a bygone era. The future, Hux believed, would be ruled through industry and innovation, and as such he regarded himself as a man of science and technology. Notwithstanding his lack of faith in the Force, Hux believed in himself and considered it his destiny to sit on the throne that would rule the galaxy. When accompanying Kylo Ren to Mustafar, Hux became desperate to leave the volcanic planet and even considered to join the Supreme Leader's fight with the Alazmec of Winsit to hurry things up, but knowing that his fighting skills weren't as good to those of Ren and considering himself to be too valuable to risk, Hux preferred allowing Ren to do all the dirty work."}, {"tag": "p", "text": "A rival of Kylo Ren, Hux hated the Supreme Leader's apprentice, whom he disdainfully referred to as \"Snoke's loathsome creature.\" As they vied for the approval of the Supreme Leader, a tense competition was formed between Hux and Ren, with the latter representing the mystical side of the First Order that Hux cared little for. Despite their mutual contempt for each other, a part of Hux respected Ren and his Force abilities, although Ren had little if anything to say about Hux's fighting skills. Ren regarded Hux as a craven coward, a view reinforced when Hux, on one occasion, turned and fled from a hostile animal, leaving his rival to defend himself while he hid under the cover of tall grass. In loathing Ren, Hux took pleasure in his adversary's failures and Snoke's anger with his apprentice. The fact that Ren required rescuing from Starkiller Base after losing to a lightsaber novice particularly delighted the young general. His hatred for Ren extended to his followers, the Knights of Ren, despising them for their unkempt appearance as well as their tendency to tread dirt into the polished halls of First Order capital ships. By the end of the war, Hux considered Ren to be a mindless dog and blunt instrument in combat. Another one of Ren's traits Hux greatly disliked was the Supreme Leader's disordered hair, to the point Hux was glad that Ren repaired his mask so he would be able to no longer see what he deemed an indignant detail a good leader shouldn't have. Hux swore himself that the first thing he would do if once he could take the role of Supreme Leader would be ordering Ren to cut off his hair."}, {"tag": "p", "text": "Several separate elements comprised the First Order, and General Hux was firmly part of the military branch. As such, he continued to use the stormtrooper training regimen pioneered by his father, based on ideas that the elder Hux developed as an Academy commandant. Hux had complete confidence in his father's idea that stormtroopers trained through vivid simulations made the most loyal soldiers. Openly proud to be the inheritor of his father's legacy, Hux refused to stand by while Ren criticized an entire generation of soldiers who had been trained under two generations of the Hux family. Having invested a lifetime in their training, Hux considered his stormtroopers as examples of the perfect warrior—a soldier trained from birth and programmed for absolute loyalty. Though baffled by the treasonous actions of FN-2187, Hux believed that the renegade trooper was an abnormality whose isolated case had no bearing on the reliability of the other stormtroopers that obeyed their orders without question."}, {"tag": "p", "text": "Ultimately, Hux was a man of no scruples who craved power above all. He was utterly remorseless, possessing a predisposition to the act of killing that existed within him since early childhood. As he rose to power, Hux dispatched many enemies and would-be foes, including his own father, the elder General Brendol Hux. As the commanding officer of Starkiller Base, the younger Hux was responsible for the deaths of billions. He took pride in the weapon that the First Order had built into a planet, marveling at its destructive power and was certain that the new galactic war would be won with the firing of a single shot. Throughout his career, Hux utilized assassination and sabotage as methods for eliminating his enemies, both within the First Order and without, although he rarely carried out such tactics on his own, preferring to have his allies or subordinates do the work for him. However, Hux made an exception for Admiral Brooks. Having never forgotten the way Brooks treated him as a child, Hux shot the elder officer in the shoulder and proceeded to torture him, ignoring the Brooks' pleas for mercy before finally executing the injured, unarmed man."}, {"tag": "p", "text": "Beneath the surface of Hux's pride and ambition existed a burning shame that started with the abuse he endured under his father's care. Though he also enjoyed a life of privilege due to Brendol's elevated position in the early First Order, young Armitage was the object of Brendol's scorn and therefore lived in fear of his father. Brendol considered his son pathetic, weak, sniveling and utterly useless. Hux likewise loathed his father and regarded Brendol as an \"old bastard\" whose death gave him a sense of relief. Nevertheless, Hux was proud of his ties to the Empire, being the son of an Imperial Academy commandant. However, he was forced to live with the shame of being his father's bastard son by a kitchen woman, rather than a legitimate heir by Brendol's lawful wife, Maratelle. For all of his imperiousness and sense of manifest destiny, Hux never forgot his origins—he was the unloved, illegitimate son of a man who hated him—and he never forgave his abusers. As an adult, Hux possessed a delicate ego that was easily wounded by mockery, such as Poe Dameron's deliberate mispronunciation of his name as \"General Hugs.\""}, {"tag": "p", "text": "Vaunting the technological might of Starkiller Base was the last time when Hux felt certain about anything. He watched helplessly as his fortunes changed for the worse, with Ren ascending to the rank of Supreme Leader in the wake of Snoke's unforeseen demise, and Allegiant General Enric Pryde gaining greater favor in the new regime at Hux's expense. His deviousness and years of jockeying for power worked against the general, as the new Supreme Leader considered Hux untrustworthy and entrusted him with nothing of importance. After Ren seized power, Hux lost much of the zeal he possessed under Snoke's reign, despite managing to survive under his rival's rule. By then, Hux no longer aspired to the title of Grand Marshal, as that role had been essentially taken by the Allegiant General."}, {"tag": "p", "text": "He continued to observe military protocol, but no longer did so in spirit—and although he was given a seat on the Supreme Council, Hux maintained an uncharacteristically silent presence, being careful not to provoke Ren's temper as he had done in the past. Without Snoke's protection, Hux began addressing Ren with the deference due to the latter's power and rank. In private, however, he strongly disapproved of Ren's leadership of the First Order as well as his handling of the war, and was convinced that Ren had gone mad for diverting his attention from the Resistance to investigate Darth Sidious' return."}, {"tag": "p", "text": "Even as he watched his career trajectory veer wildly off course, Hux did not completely abandon his scheming nature. In the end, the general who led the vanguard of the First Order's invasion of the galaxy committed treason by spying for the Resistance. However, he was not motivated by regret for his actions or a newfound belief in the Resistance's cause. Hux was remorseless to the end; all he had left was his rivalry with Ren, whose reign he sought to undermine until it ended in defeat."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As a child, Armitage Hux was considered weak and useless by his father, Brendol Hux, who found his son to be unreliable at virtually everything. Unlike Hux's father, however, Gallius Rax saw Hux's usefulness to his plans for the future, in particular the next generation of soldiers, the leadership of which he entrusted to Hux. Supreme Leader Snoke also saw Hux as someone who was useful to his plans. Therefore, he supported the general's career despite Kylo Ren's opposition to a \"rabid cur\" occupying a position of significance in the First Order."}, {"tag": "p", "text": "Hux was precise and methodical in his rise to power as well as his approach to warfare. He possessed a combination of patience and inner shame, both of which motivated his desire to gain greater power at the expense of his rivals, including his own father whom he had assassinated. Possessing an appreciation for superior technology, Hux pioneeered the invention of cutting-edge technologies such as the Starkiller superweapon and active hyperspace tracking. He was also familiar with the operating systems of a Resurgent-class Star Destroyer and Starkiller Base."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "General Hux wore a charcoal grey general's uniform, black gloves, a polished officer's buckle, traditional flared-hip breeches, and insulated boots. He also wore a crested command cap emblazoned with the insignia of the First Order and a gaberwool officer's greatcoat. Hux believed that a tidy appearance was essential to maintaining discipline. When addressing his men, he wore a parade uniform designed to broadcast his authority as a First Order General."}, {"tag": "p", "text": "After the Battle of Starkiller Base, Hux carried a cross draw holstered SE-44C blaster pistol and a monomolecular dagger hidden in his sleeve."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "The character of General Hux was created for the 2015 film Star Wars: Episode VII The Force Awakens, in which he is portrayed by Domhnall Gleeson. Gleeson was cast in the movie in April 2014, just one day before appearing in a publicity photo of the cast doing a table read of the script. He afterward rented a screening room in his hometown of Dublin, Ireland, and watched all three installments of the original Star Wars trilogy to prepare for shooting the new film—he has described arriving on the set of a Star Wars movie on his first day of shooting as a breathtaking, \"pinch me\" moment. Details of Gleeson's character, including the name General Hux, were first revealed to the public at the San Diego Comic-Con in July 2015."}, {"tag": "p", "text": "While developing Hux's character, Gleeson and the film's production team posited that he was an obsessive character who does not get a lot of sleep. They created his look with that in mind: pale with dark eyes, and dead-set on his goals. The Force Awakens director J.J. Abrams has called Hux a merciless character, and Gleeson has described him as someone who enjoys having authority and holding onto it at all costs. He has also stated that Hux \"would just like a little bit more order in the universe\" and would do whatever it takes to achieve that order. In the leadup to the film's release, he joked that Hux was obviously an evil character due to his British accent, a trait shared by numerous Star Wars villains. Gleeson was excited to play such a character, as it was unlike any acting role he had previously done and allowed him to explore the notion of authority. StarWars.com then confirmed that Gleeson was to return in Star Wars: Episode VIII The Last Jedi."}, {"tag": "p", "text": "During filming of The Force Awakens, several different versions were shot of a scene where Hux addresses the troops of the First Order, as J.J. Abrams hoped to try it at various levels of intensity. He ultimately \"wanted it big,\" and he and screenplay writer Lawrence Kasdan believed that it was Hux's major moment in the movie. Although the amount of stormtrooper extras present for the scene made Gleeson nervous, he also felt like it gave him a sense of the number of people his speech was intended to affect. The speech has been compared to Adolf Hitler speaking at a Nuremberg Rally and has been described by reviewers as being an over-the-top and random moment in the film."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "Prior to The Force Awakens's release, a character named Brendol Hux was introduced in Servants of the Empire: The Secret Academy, a young readers' book by Jason Fry that serves as a tie-in to the television program Star Wars Rebels. In the book, Brendol Hux reveals his ambition to create an army of soldiers loyal to the Galactic Empire from birth. A StarWars.com Databank entry later revealed that Brendol Hux is General Hux's father, and Star Wars: The Force Awakens: The Visual Dictionary went on to confirm that Hux's army of stormtroopers in the film—trained from infancy to be loyal to the First Order—are an extension of his father's group, the Commandant's Cadets."}, {"tag": "p", "text": "Fry originally conceived of the cadets to advance a plotline in his story, but he was struggling to find them a goal or a purpose that would eventually come into fruition. The idea to connect them with General Hux came in November 2014 when he met with Lucasfilm Ltd. about another project, Star Wars: The Force Awakens: Incredible Cross-Sections, and was privy to concept art, stills, and a synopsis of the upcoming movie. He then proposed to Pablo Hidalgo of the Lucasfilm Story Group that the idea of training children to be stormtroopers began with Hux's father in the era of Star Wars Rebels, and when Hidalgo ran it up the chain of command, the answer came back in the positive. Fry considered inserting a \"red-haired baby\" Hux into his book, being cared for by a sinister nanny droid, but he ultimately felt that it was a reference for the sake of a reference and cut it from the final draft."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}