{"url": "Master_Replicas", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Real-world companies"], "nodes": [{"tag": "h1", "text": "Master Replicas"}, {"tag": "p", "text": "The Master Replicas brand (also known as MR) produce movie prop replicas and high end collectibles. Based in Walnut Creek, the company was founded in 2003 by Michael Cookson. Cookson has served as Chairman of Master Replicas since it was founded and chief executive officer since August 2004. Historically, Master Replicas has sold its products principally to customers in the United States."}, {"tag": "p", "text": "Master Replicas manufacture licensed product for brands and companies such Lord of the Rings, Star Trek, Disney, Pirates of the Caribbean, The Chronicles of Narnia, Marvel Comics, Muppets, and Stargate. Previous to January 2008, the company manufactured and sold product under the Star Wars brand before the license had expired. While many of their items are props at full-scale (particularly weapons like lightsabers, phasers, and swords), they also make many scale model items, like spaceships, and characters."}, {"tag": "p", "text": "Master Replicas has also been commissioned to make items for corporations to resell on their own. For example, MR made a 1/6 scale Master Sword and Hylian Shield for Nintendo and Target Stores to coincide with the release of The Legend of Zelda: Twilight Princess."}, {"tag": "h2", "text": "Force Fx Lightsabers"}, {"tag": "p", "text": "Master Replicas is known for their Force FX product line which recreates various lightsabers used in the Star Wars movies. Examples include:"}, {"tag": "h2", "text": "Helmets"}, {"tag": "p", "text": "Besides the Force FX lightsabers, Master Replicas also, starting in 2003-2004, created mini-helmets based on headgear (or in one case, a head part) from the Star Wars franchise. They created the helmets after buying the license from Riddell's mini-helmet line."}, {"tag": "h2", "text": "Notes and references"}]}