{"url": "Master_Vodo%27s_quarterstaff", "categories": ["Category:Legends articles", "Category:Jedi artifacts", "Category:Personal weapons", "Category:Staffs"], "nodes": [{"tag": "h1", "text": "Master Vodo's quarterstaff"}, {"tag": "p", "text": "Jedi Master Vodo-Siosk Baas carried a wooden quarterstaff that offered support to his aged physical being. When the need for combat arose, Master Baas imbued his staff with the power of the Force, whereupon the cane served him in place of a lightsaber."}, {"tag": "p", "text": "In 3997 BBY, Master Baas' staff was broken while sparring with one of his students, the Human Exar Kun. Baas repaired his walking stick, but forewent using it in combat for a time. Exar Kun would later go on to become a Dark Lord of the Sith and instigate the Great Sith War where he committed countless atrocities against the citizens of the Galactic Republic. It was then that Vodo-Siosk Baas chose to take up his staff again in preparation for an encounter with the former student whose fall to the dark side of the Force Baas felt responsible for."}, {"tag": "p", "text": "The Krevaaki Jedi confronted Kun on Coruscant and engaged him in a duel. However, when the Dark Lord ignited the second blade of his recently redesigned lightsaber, Master Baas' staff was unable to withstand repeated blows from Kun's double-bladed weapon. The wooden staff was shattered yet again, and the cleaving strike followed through to slay its owner as well."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The walking staff that was utilized by Krevaaki Jedi Master Vodo-Siosk Baas' was simply a wooden stick approximately one and a half meters long. One end of the staff was wrapped with fabric strips and served as the head. Baas wielded the weapon in lieu of a lightsaber despite his skills in their construction, augmented the staff through the Force to allow it to withstand lightsabers, as well as transfer tremendous amounts of kinetic energy into targets, allowing him to shatter rocks with the weapon, or off-balance and disarm opponents with ease."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of the most notable uses of the weapon was during a sparring match with Baas' student, Exar Kun. Kun, after a match with his fellow student, Sylvar, suddenly fell into a vicious rage after the Cathar clawed him across the face in response to a speciesist slur he made against her. Were it not for Baas' intervention, Kun almost certainly would have killed her."}, {"tag": "p", "text": "In his arrogance, Kun challenged Baas to a sparring match, his lightsaber against his master's staff. Initially, Baas held the advantage in their contest, throwing Kun off balance with a well placed strike. However, Kun was hardly finished, summoning the lightsaber of Baas' third student, Crado. Now armed with two lightsabers, Kun began raining vicious attacks upon his master, driving him back. Their contest finally ended when Kun shattered Baas' staff with a powerful dual-overhand strike. Baas casually inspected the two halves of his broken staff, lamenting Kun's usage of dual-blades against his \"poor stick\". He acknowledged Kun as his most formidable student, but warned of an emptiness in Kun's heart that could allow him to fall to the dark side of the Force."}, {"tag": "p", "text": "Kun left Baas' apprenticeship to seek out forbidden dark side knowledge, taking the rank of Jedi Knight without any formal basis or approval."}, {"tag": "p", "text": "Baas eventually took up a second staff to replace the broken one, but kept the pieces of his shattered weapon. As the Great Sith War was started by Exar Kun, who resurfaced as the new Dark Lord of the Sith, Baas considered this conflict his fault, a result of his failure to stop Kun when it mattered most. After aiding the Jedi on Coruscant in capturing Kun's apprentice, the fallen Jedi Ulic Qel-Droma, Baas returned to Dantooine and resolved to find a way to stop Kun. Gathering the broken pieces of his staff, he mended the weapon and returned to Coruscant to attend Qel-Droma's trial."}, {"tag": "p", "text": "During the trial, Qel-Droma was sentenced to death by the Galactic Senate. However, before the sentence could be carried out, Exar Kun burst in on the proceedings, paralyzing the Senate with a Sith spell and killing Supreme Chancellor Sidrona. As Kun prepared to leave, Baas confronted him, wielding his mended staff. Both attempted to convince the other to join their respective causes, but were unsuccessful, and Kun drew his lightsaber."}, {"tag": "p", "text": "As they battled, Baas held off his former student, constantly pleading for Kun to see reason. Tired of his masters begging, Kun decided to take their contest up a notch, igniting the second blade of his weapon, revealing it to be a double-bladed lightsaber. Unable to stand against this unfamiliar weapon, Baas was slain, his staff again shattered by a vicious overhand strike."}, {"tag": "p", "text": "Vodo-Siosk Baas became one with the Force, while his newly-broken staff was abandoned along with his garments."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}