{"url": "Master_of_Ceremonies", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Entertainers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Master of Ceremonies"}, {"tag": "p", "text": "The Master of Ceremonies was the nickname of a male Human who organized Life Day activities towards the middle of the inter-Sith Wars period. In 3638 BBY, he and his Life Day Revelers stayed on Vaiken Spacedock, which was property of the Sith Empire. However, the Imperials had only allowed him on their spacedock by accident, and his presence was explicitely condemned in the Imperial Edict GR-1NC4. During his two-week stay on the spacedock, the Master of Ceremonies sold festive goods and promoted cheerful activities that were looked at with jaundiced eyes by the Imperial authorities. That same year, he also appeared on Carrick Station, with the Galactic Republic's blessing."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Human known as the \"Master of Ceremonies\" lived during the inter-Sith Wars period. With the help of his Life Day Revelers, he promoted the celebration of Life Day, an end-of-the-year holiday originally invented by the Wookiees of Kashyyyk, in the wider galactic community. By 3638 BBY, in the midst of the Galactic War between the Sith Empire and the Galactic Republic, he acted as the ringmaster of a series of seasonal activities revolving around the celebration of Life Day. Along with his entourage of Human and Wookiee Revelers, the Master of Ceremonies showed up at both the Republic's Carrick Station and the Empire's Vaiken Spacedock to bring holiday cheer and sell Life Day-themed novelty items."}, {"tag": "p", "text": "While the Galactic Republic welcomed the Revelers on Carrick Station, the authorities of the Sith Empire considered their holiday activities to be \"unbecoming of an Imperial citizen.\" Despite that, the Master of Ceremonies did obtain an official license to peddle his goods in the Galactic Trade Market sector of Vaiken Spacedock because of an administrative oversight. The Master of Ceremonies and his Revelers remained on Vaiken Spacedock for two weeks, encouraging the Imperials stationed there to sing, dance and throw harmless Life Day snowball bombs at each other. Despite having accidentally authorized him on the station, the Imperial government issued the Imperial Edict GR-1NC4, branding the Master of Ceremonies and his cohorts as dissident elements. The edict also warned the citizens not to buy their goods—which were under review under Section 53-T of Imperial law, meaning their purchase and possession was be considered an official contraband violation."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By 3638 BBY, the Master of Ceremonies was a tall, husky man with broad shoulders, brown eyes and a pinkish complexion. Most of his once brown hair had gone white with the exception of the eyebrows, and he sported a short boxed beard. When selling his holiday items on Vaiken Spacedock, he wore the same red robes and white gloves of the Life Day Revelers, while also donning a distinctive crescent-shaped headgear with a crest mounted transversely."}, {"tag": "p", "text": "Contrary to the dominant position in the Sith Empire, the Master of Ceremonies had no biases against non-Humans such as the Wookiees, the original celebrants of Life Day on their homeworld of Kashyyyk, as he openly encouraged nonviolent physical contact with them. As a whole, his cheerful disposition put him at odds with the Imperial culture, which was dominated by Sith Lord and soldiers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}