{"url": "Master_of_the_Order/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Jedi ranks"], "nodes": [{"tag": "h1", "text": "Master of the Order"}, {"tag": "p", "text": "Master of the Order was a title used to denote the elected leader of the Jedi High Council during the last decades of the Old Republic, and was also used by the New Jedi Order. Even though the title was separate from the title of Grand Master, the positions were oftentimes granted to the same individual."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Master of the Order was a title which had existed within the Jedi Order for much of its history, representing the elected leader of the Jedi High Council. Appointment of this position was reserved to the High Council's sitting members, with a unanimous vote needed to name a new leader. While not always the case, the Jedi Grand Master was frequently named leader of the High Council."}, {"tag": "p", "text": "While many Masters have held the title over the history of the Jedi, only a few names are remembered by historians. The earliest named Master of the Order was the Jenet Grand Master Fae Coven, who was appointed head of the Council and held the position for several centuries, meeting her future successor, Yoda, before her death."}, {"tag": "p", "text": "Master Mace Windu held the title during the last years of the Republic's Golden Age, stepping down after the Battle of Geonosis so as to take a more active role in the Clone Wars. Grand Master Yoda took up the title in Windu's absence, as he remained on Coruscant to serve as Supreme Chancellor Palpatine's chief military adviser. At the end of the war, Chancellor Palpatine revealed himself as a Dark Lord of the Sith and ordered the disbanding of the Order. With the High Council dissolved and Master Yoda in exile, the term fell out of use for several decades."}, {"tag": "p", "text": "Before his death, the exiled Master Yoda helped Luke Skywalker complete his training as a Jedi; Skywalker would eventually rebuild the Order, yet he did not form a Council until several years later. Leading the Order he built for many years, Skywalker was held responsible for the actions of the Jedi-turned-Sith Jacen Solo by the Galactic Alliance government. After trying the Grand Master, Chief of State Natasi Daala exiled Skywalker from Coruscant and the Jedi Order in 43.5 ABY until he could prove what had caused Solo's turn to the dark side of the Force. In the mean time, Skywalker and Daala agreed to the appointment of Master Kenth Hamner as acting Grand Master and leader of the Council, until Skywalker's return or the High Council elected another Master."}, {"tag": "p", "text": "When tensions between Daala's Galactic Alliance and the Jedi Order grew, the Jedi refused to continue appeasing her demands of the Order. The Masters wanted to launch a wing of StealthXs to help Skywalker fight a new Sith threat, but Hamner feared that the Galactic Alliance would think the launch was against them and would open fire on the StealthXs. However, when the Council discovered that Hamner had taken unilateral actions in making an agreement with Alliance Admiral Nek Bwua'tu to stall the launch until Bwua'tu gave him permission, they removed him from his position as acting Grand Master and decided to launch the StealthXs. Hamner attempted to stop the StealthX launch, and in the ensuing skirmish with Master Sebatyne, he fell to his death. The Masters then unanimously voted for Sebatyne, who had led the vote of no confidence against Hamner, as the new acting leader of the Jedi. She felt that the appointment was wrong, as she was deeply upset over her failure to prevent Hamner's death, but eventually accepted her position. Luke eventually returned to Coruscant and resumed his duty as leader of the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The title \"Master of the Order\" first appeared in Yoda: Dark Rendezvous, but it is unclear if this was meant to be a separate title or another term for Grand Master."}, {"tag": "p", "text": "Jedi Master Kol Skywalker was also described as being the leader of the Jedi Council in Star Wars: Legacy 0½; this would seem to imply that he also held the title of Master of the Order. Also his brother, Bantha Rawk, referred to the Jedi High Council as \"Kol's Council\", which would also support this."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}