{"url": "Armor/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles needing additional sources", "Category:Armor"], "nodes": [{"tag": "h1", "text": "Armor"}, {"tag": "p", "text": "Armor was a protective covering worn mainly by militants. Some examples of armor are Mandalorian armor, Sith battle suits, and light battle suits. Most armor would stop a standard blaster bolt, although only advanced, heavy battle armor could withstand a heavy cannon bolt. Specialized weapons (called disruptors) could punch through armor. The term \"armor\" could also refer to the armored plating of a vehicle or starship."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Armor was generally divided into three classes: light armor, medium armor, and heavy armor. Light armor usually came in the form of woven cloth or thin plastics. Medium armor, by far the most common, was made up of small ceramic or metal plates. Heavy armor was designed for front-line combat, and is usually fully enclosed."}, {"tag": "p", "text": "Most cultures and races used armor for forms of armed conflict. Some armor was implanted with cortosis and made especially for battle with lightsabers. Mandalorian armor was some of the best armor in the galaxy, notably the Neo-Crusader armor used during the Mandalorian Wars."}, {"tag": "p", "text": "Usually, armor was much more restrictive than regular clothing. Most Jedi did not use armor for this reason. Even though they did not wear armor, their robes had underlays for better protection. Armor was also used to show either rank or what type of soldier the wearer was, such as in the Grand Army of the Republic."}, {"tag": "p", "text": "The Golan Arms DF.9 anti-infantry battery was enclosed by proton-shielded armor."}, {"tag": "p", "text": "During the Yuuzhan Vong War, Yuuzhan Vong warriors wore Vonduun crab armor, which had been created from bioengineering Vonduun crabs and was still alive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}