{"url": "Masticator", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Starship types"], "nodes": [{"tag": "h1", "text": "Masticator"}, {"tag": "p", "text": "The term masticator was given to any space vessel produced to breakdown asteroids or other small, rocky bodies. Masticators utilized spinning drums studded with durasteel teeth to grind the large rock into pieces small enough to be mixed into a slurry."}, {"tag": "p", "text": "The Geonosians during the Clone Wars made use of spherical masticators for the construction of the various Lucrehulk-class battleships for the Trade Federation."}, {"tag": "p", "text": "The Galactic Empire utilized several fusion-powered masticators that were ultimately derived from the Geonosian model. Each one was equipped with various tractor beam generators and projectors in order to ensure the various asteroids were drawn into the maws of the masticators. Their maws included whirling durasteel teeth that chewed the asteroids into tiny bits, and then mixed the bits with alloy ores, which included quadanium which had been mined and imported from the planet Despayre. They also added water to the resulting highly-pressurized ravel to form a semiliquid mixture which was then fed into pipelines leading to the smelters. These smelting pots, being essentially huge melting pots to refine the mixture, burned off impurities before proceeding to convey the resulting scarified ore into extruders that pressed out the hull plates. They then gathered up any leftover slag, and ejected it towards the central star of the solar system the masticators were stationed at. Aside from processing materials, the Imperial masticators were also able to directly work on the superstructures of large-scale vessels, including the Death Star superweapons, being equipped with large utility and docking arms for this purpose. They also prepared the materials for use in Imperial hull-plate extruders."}, {"tag": "p", "text": "Several Imperial masticators were utilized for the construction of the Death Star II at Endor. The main engineer for the construction of the superweapon, Bevel Lemelisk, also engineered the masticators involved in the battle station's creation to be dismantled relatively easily and then separated into components, which would then be reformed and incorporated into the Death Star itself upon the final stages of construction, as Lemelisk fully intended for them to be fully utilized."}, {"tag": "h2", "text": "Sources"}]}