{"url": "Matalok", "categories": ["Category:Legends articles", "Category:Cruiser classes", "Category:Matalok", "Category:Yuuzhan Vong starship classes"], "nodes": [{"tag": "h1", "text": "Matalok"}, {"tag": "p", "text": "Mataloks were large Yuuzhan Vong bioships commonly found in the Yuuzhan Vong warfleet. The New Republic referred to them as 'cruiser analogs' with certain classes. Mataloks were a specific class of cruiser analogs."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "They were approximately 1,200 meters long and had an armament of 40 yaret-kor. They possessed a Yuuzhan Vong wing of 36 Coralskippers. They were used to command the Yuuzhan Vong attack forces."}, {"tag": "p", "text": "Several different varieties of vessels were grouped together in the \"cruiser analog\" from \"light cruiser analogs\", \"assault cruiser analogs\" and \"heavy cruiser analogs\"."}, {"tag": "p", "text": "Specific Yuuzhan Vong types included the 740m Suuv Ban D'Krid. The much larger Kor Chokk \"grand cruiser\", comparable in size and firepower to a Super Star Destroyer, may also have been grouped into the cruiser analog category."}, {"tag": "p", "text": "The Vua'spar and probably the Miid ro'ik, however, were designated as destroyer analogs. Together, cruiser and destroyer analogs comprised the main fighting force of the largest Yuuzhan Vong fleets."}, {"tag": "p", "text": "In spite of their relatively large size, many cruiser analogs were also capable of operating deep inside a planetary atmosphere, in direct support of ground troops."}, {"tag": "p", "text": "It is likely that the \"cruiser analog\" designation correspond broadly to the standard cruiser designation used by the Galactic Empire and New Republic: combat warships more than 400 meters long that were not Star Destroyers."}, {"tag": "p", "text": "This excluded most ships above ~850-900 meters, but some larger ships, like 1.2km Mon Calamari Star Cruisers and the 2km Invincible-class Dreadnaught Heavy Cruiser, were typically still referred to as cruisers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They resembled the Mon Calamari Star Cruisers from a distance and were heavily armed and shielded, but there were instances of mataloks being destroyed by proton torpedo shots that would have only dented the armor on a Mon Calamari cruiser."}, {"tag": "p", "text": "For instance, one Jedi shadow bomb launched from Jaina Solo's X-wing destroyed a matalok in the Second Battle of Borleias (by blowing a large crater, ensuring that the matalok was dying). Rogue Squadron X-wings launched a proton torpedo barrage at another matalok to cover a refugee ship later in the same battle. Three of the torpedoes hit, cracking the matalok in half."}, {"tag": "p", "text": "At least four mataloks fought at the Battle of Duro, and at the Battle of Yag'Dhul, two mataloks pursued Corran Horn, Anakin Solo and Tahiri Veila as they escaped the system. It is not clear, however, what part of the overall fleet strength in these battles they represented."}, {"tag": "p", "text": "Later, mataloks together formed the backbone of the fleet in the Battle of the Black Bantha. The combined total of ships of these types was around one hundred, probably 10% of the complete fleet strength, and they formed a central core of heavily-armed warships, guarding the fleet's supply ships, and supported by outer screens of lighter frigate analogs and corvette analogs. It is likely that mataloks from this fleet also played an important role in the Battle of Coruscant."}, {"tag": "p", "text": "Mataloks could also play a central role in high-level formations, as Wyrpuuk Cha used a Matalok as the command ship of his fleet in the Second Battle of Borleias. However, this is the only certain example of a matalok being used in a command ship role, unless we count this designation as including the \"grand cruiser\" type to which Legacy of Torment and possibly Yammka's Mount belonged: all other evidence indicates the use of destroyer analogs and worldships."}, {"tag": "p", "text": "As the Yuuzhan Vong moved to consolidate their conquests after Coruscant's capture, mataloks were more often found deployed in pairs for probing missions, often as strike elements of larger fleets, though sometimes as detached taskforces."}, {"tag": "p", "text": "Later in the Battle of Borleias, two mataloks made a strike against the New Republic positions on the surface, provoking a counterattack by Twin Suns Squadron and Rogue Squadron, in which one was driven off, and one destroyed. in the closing stages of the battle, two mataloks were destroyed by the Errant Venture."}, {"tag": "p", "text": "Elsewhere, a pair of mataloks dropped low into the skies of Coruscant to investigate the disturbance caused by Lord Nyax, and a pair of cruisers were also the core capital ship force of Commander Ekh'm Val's squadron, which located and attacked Zonama Sekot."}, {"tag": "p", "text": "A number of mataloks also fought in the Battle of Borosk, and at least one was present at the Battle of Esfandia."}, {"tag": "p", "text": "In the closing stages of the war, mataloks played a role in the major fleet actions comparable to that which they had performed at the Black Bantha and Coruscant. In the Defense of Mon Calamari they were again grouped with destroyer analogs, plus yammosk carriers and fleet tenders, in the center of the fleet formation, with picket ships and coralskippers deployed in screening formations that resembled the arms of a yammosk or indeed a spiral galaxy."}, {"tag": "p", "text": "This large formation was capable of segmenting into smaller battlegroups, and this tactic was repeated during the Battle of Yuuzhan'tar, where mataloks played a prominent role in the groups sent against the Fourth Fleet and Zonama Sekot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}]}