{"url": "Materrus", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Males", "Category:Sith of the resurgent Sith Empire", "Category:Sith species"], "nodes": [{"tag": "h1", "text": "Materrus"}, {"tag": "p", "text": "Materrus was a male Sith who served the Sith Lord Darth Angral of the resurgent Sith Empire during the Cold War with the Galactic Republic. In 3643 BBY, Angral sent Materrus to the planet Taris to purchase a shipment of Jedi relics from the Death's Claw pirate organization."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the year 3643 BBY, the Sith pureblood Materrus had become a Sith within the reconstituted Sith Empire, and he served the elder Sith Lord Darth Angral as a retainer during the Cold War between the Empire and the Galactic Republic. That year, the Death's Claw pirates offered to Angral a shipment of artifacts belonging to the long-dead Jedi Covenant sect, which they had uncovered on the planet Taris. Angral dispatched Materrus to meet with Captain Dugge of the Death's Claw and acquire the artifacts."}, {"tag": "p", "text": "Materrus and Dugge met in the Rasaaran storage facility on Taris and completed their deal without incident."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Force-sensitive male with orange skin and red eyes, Materrus wore his red hair in a spiked style down the middle of his head with two strands of hair near his ears. While confident of his power, Materrus was weak-willed and easily influenced with the Force."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Materrus carried a single red-bladed lightsaber and wore black hooded robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Materrus first appeared in the BioWare-LucasArts video game Star Wars: The Old Republic, in which he is part of the Jedi Knight-class mission \"An Opportunity Too Good To Pass Up.\" At the end of the preceding mission, the player is offered a choice of missions depending on the player's alignment. Light-side players learn from the Imperial spymaster Watcher One of the assassin Rora Seake and her mission to eradicate a Republic colony, while dark-side players are alerted to the sale of Jedi artifacts. The player can choose to accept the offered mission or ignore it, a choice that results in dark-side points. During the mission itself, the player can Force-persuade Materrus to surrender and allow himself to be killed for dark-side alignment points, or the player can either talk to the Sith or attack for no alignment points."}, {"tag": "p", "text": "However, this article assumes that the player chooses only the moral light-side options as a Republic character and therefore assumes that the player was not told about the relics and that Materrus's deal was allowed to proceed without interruption."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}