{"url": "Mathieson%27s_protocol_droid", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:New Republic droids", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "Mathieson's protocol droid"}, {"tag": "p", "text": "A protocol droid served Admiral Mathieson of the New Republic, recording every conversation the admiral had for five years. The protocol droid's head was stolen from the Brooksdion space station by a small team of Resistance operatives led by Vice Admiral Amilyn Holdo. The New Republic's Rapier Squadron, led by Commander Poe Dameron, attempted to pursue the thieves, but the Resistance vessel managed to escape with the protocol droid's head."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The protocol droid served the New Republic's Admiral Mathieson during the government's reign. By 31 ABY, the droid had worked alongside Mathieson for five years, recording every conversation the admiral had. While Admiral Mathieson was stationed on the Brooksdion space station between 30 ABY and 31 ABY, Vice Admiral Amilyn Holdo of the Resistance detached and stole the droid's head, believing that the droid held information of New Republic High Command's inaction against the growing threat of the First Order."}, {"tag": "p", "text": "Holdo and her team managed to escape the station in a passenger craft flown by pilot Nien Nunb, but were pursued by the New Republic's Rapier Squadron after Brooksdion's personnel were alerted to the theft. Commander Poe Dameron disabled the starship's hyperdrive, but the vessel activated its engines. Dameron, having been given orders from Mathieson to destroy the ship with the droid head aboard, pursued the Resistance craft into the Lost Souls asteroid field. After navigating the treacherous field, Holdo disabled Dameron's X-wing starfighter to prevent him from chasing further. The Resistance vessel, its hyperdrive repaired, escaped into hyperspace with the head of Mathieson's protocol droid."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Admiral Mathieson's protocol droid possessed gold plating. The droid held five years' worth of recordings of Mathieson's conversations with other individuals."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The protocol droid's head appeared in the comic Age of Resistance - Poe Dameron 1, written by Tom Taylor, illustrated by Ramon Rosanas, and published by Marvel Comics on August 28, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}