{"url": "Matrik", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Exchange members", "Category:Males", "Category:Tarisians", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Matrik"}, {"tag": "p", "text": "Matrik was a male Twi'lek who served as a former member of the Exchange on Taris during the Jedi Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Matrik was once a low level employee of the Exchange. The violence and killing he experienced working for the Exchange led him to realize what he was doing was wrong, so he testified to Taris Officials, which resulted in several members of the Exchange being put in prison and some operations being shut down. It took Davik Kang thousands of credits to get back on his feet, and in response to the treachery Davik placed a bounty on his head. Matrik used to be in witness protection until the Sith under Darth Malak's command took over, prompting him to hide himself in an abandoned apartment. He was prepared to make a stand at the apartment rather than continue to run away from Davik's bounty hunters. While he was holed up he came up with a plan to fake his own death but he knew he couldn't do it alone. The plan involved him supposedly killed in a large explosion, since that was the only way for his bounty to be fulfilled without Davik becoming suspicious due to the lack of remains."}, {"tag": "h3", "text": "Help from Revan"}, {"tag": "p", "text": "However, Revan, an amnesiac former Sith Lord, stumbled into his apartment. Matrik was, at first, cautious with Revan, but eventually shared his troubles and explained his plan. Revan gave him a permacrete detonator, and Matrik was able to fake his own death by setting off the detonator in his apartment. He then thanked Revan and went off to hide in another place until the things would quiet down. The plan worked because there was no evidence left behind to suggest that Matrik had not been killed. Revan was able to lie to Zax and collect the bounty on Matrik. Zax congratulated Revan for his \"success\" but at the same time, explained that he went too far with a bomb."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Matrik was very suspicious of Revan at first, but he eventually did confide in Revan, possibly out of desperation or hope. He also had some demolition experience from his days in the Exchange, enough to be able to proficiently use a permacrete detonator to completely obliterate his apartment. He was also very grateful for Revan for helping his plan come to fruition and help him escape pursuit of the Exchange."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the player brings Matrik the explosive tools needed to help him fake his death but does not give them to him, citing cost or some other reason, Matrik will attack the player. This results in neither Light or Dark Side points as killing him in this case is self-defense."}, {"tag": "p", "text": "If the player's attempt to persuade Matrik to explain his situation goes poorly, he will also attack the player, in which case neither Light nor Dark side points are awarded."}, {"tag": "p", "text": "Alternatively, the player can simply kill Matrik and collect the bounty from Zax. The act does grant the player dark side points in the Xbox version but strangely does not happen in the PC version."}, {"tag": "p", "text": "In the Strategy Guide Matrik has been identified as a Human. But the Xbox version identifies him as a Twi'lek."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}