{"url": "Matt_Turhaya", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Alliance Army personnel", "Category:Humans", "Category:Males", "Category:New Republic Army officers", "Category:New Republic Special Forces personnel"], "nodes": [{"tag": "h1", "text": "Matt Turhaya"}, {"tag": "p", "text": "Matt Turhaya was a Human male and the husband of Anii Degarienne as well as the father of their child, Alexandra Winger."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Corellia in 31 BBY, Turhaya married Anii Degarienne, also of that world, in 13 BBY. Shortly after their marriage he joined the Imperial Navy and attended Academy of Carida where his daughter Alexandra Winger was born. A few weeks before Turhaya graduated from the Academy, Degarienne was killed in an accident at the weapons factory where she worked. Unknown to Turhaya, her death was not an accident but a deliberate act of sabotage."}, {"tag": "p", "text": "Turhaya took his daughter to his in-law's home on Janara III while he served in the Imperial Navy. Within two or three years he realized that he no longer aspired to serve an Empire that denied freedom and destroyed lives; as a result, Turhaya deserted. He returned to Janara III to discover it had been devastated by the Empire. Thinking that his daughter was dead, Turhaya sought comfort with the bottle and gambling after he moved in with his older brother Jamie in Mos Eisley on Tatooine. Jamie owned a speeder repair shop there. In 3 BBY, Turhaya met Captain Tere Metallo, a member of the Rebel Alliance. Turhaya signed on as her co-pilot on the Star Quest to pay off his debt from a sabacc game."}, {"tag": "p", "text": "By 9 ABY, Matt Turhaya had become commander in the New Republic Special Forces. Shortly after the end of the Thrawn campaign, he fought for the liberation of Garos IV, but he was killed before having ever met his daughter. Alexandra later identified Turhaya as her father and learnt his tragic fate on her world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}