{"url": "Matthew_Wood", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:LEGO Star Wars: The Freemaker Adventures voice actors", "Category:Rogue One: A Star Wars Story voice actors", "Category:Star Wars Battlefront II voice actors", "Category:Star Wars Episode III: Revenge of the Sith video game voice actors", "Category:Star Wars prequel trilogy voice actors", "Category:Star Wars production staff", "Category:Star Wars Rebels voice actors", "Category:Star Wars Resistance voice actors", "Category:Star Wars: Battlefront II voice actors", "Category:Star Wars: Episode VII The Force Awakens voice actors", "Category:Star Wars: Forces of Destiny voice actors", "Category:Star Wars: The Clone Wars voice actors", "Category:Star Wars: The Clone Wars: Lightsaber Duels voice actors", "Category:Star Wars: The Clone Wars: Republic Heroes voice actors", "Category:Star Wars: Episode IX The Rise of Skywalker voice actors", "Category:The LEGO Star Wars Holiday Special voice actors", "Category:The Mandalorian actors", "Category:Star Wars: The Bad Batch voice actors"], "nodes": [{"tag": "h1", "text": "Matthew Wood"}, {"tag": "p", "text": "Matthew Russell Wood (born August 15, 1972) is currently the Supervising Sound Editor (2008) employed at Skywalker Sound in Marin County, California."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Matthew Wood worked on all three films of the prequel trilogy as supervising sound editor and also did an uncredited acting portion in The Phantom Menace as Bib Fortuna and the voice of Ody Mandrell. In Attack of the Clones he played Seboca and Magaloof."}, {"tag": "p", "text": "As a voice actor, he is best known for his role as General Grievous in the film Star Wars: Episode III Revenge of the Sith, the film's video game, the General Grievous Halloween audiocast, the video game Star Wars: Battlefront II and the Star Wars: The Clone Wars televison series. He also plays Battle droids, Wat Tambor, HELIOS-3D, Senate Guards, Commando droid, and Poggle the Lesser in the series."}, {"tag": "p", "text": "Lucasfilm announced on October 24, 2013 that Wood would serve as supervising sound editor on the 2015 film Star Wars: The Force Awakens. Wood received an Oscar nomination for his work. Matthew Wood served as the voice of the B1 battle droid Roger, one of the protagonists of the 2016 Disney XD television series LEGO Star Wars: The Freemaker Adventures. Wood also provided additional voices of death troopers and voice of Pao in Rogue One: A Star Wars Story. Wood, along with Ren Klyce, served as a sound editor for Star Wars: Episode VIII The Last Jedi, receiving another Oscar nomination."}, {"tag": "h2", "text": "Star Wars filmography"}, {"tag": "h3", "text": "Sound Editing"}, {"tag": "h3", "text": "Acting"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}