{"url": "Matton_Dasol", "categories": ["Category:Legends articles", "Category:Humans", "Category:Kashyyyk residents", "Category:Males", "Category:Mechanics", "Category:Merchants", "Category:Spacers"], "nodes": [{"tag": "h1", "text": "Matton Dasol"}, {"tag": "p", "text": "Matton Dasol was a male Human starship mechanic living on Kashyyyk in 3956 BBY as an indentured servant of Eli Gand."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Matton was working for Eli Gand in order to pay off a debt that his crew had incurred while stopping on the Wookiee homeworld. Telling Dasol that the crew had left Kashyyyk without paying the debt and thus marooning him, Gand forced him to pay it off by citing \"standard trading rules.\" In reality, the merchant had tricked Dasol's crew, letting them believe that there was salvage to be had in the arboreal world's Shadowlands; this proved to be a trap, as Eli ambushed and murdered them."}, {"tag": "p", "text": "When Revan and his party arrived on Kashyyyk in their quest to find the Star Maps that would reveal the location of the Star Forge, they encountered Gand and Dasol's small stand, where the two related the circumstances of Dasol's \"employment\" in a roundabout way that caused Mission Vao to remark that the situation \"smelled worse than an overcrowded Ronto stable.\" As the party made their way through the planet in their search, they eventually came across the remains of Dasol's repair droid, D-A02, whose barely-functional memory banks contained evidence of Gand's treachery. Returning the droid's head to Dasol, the true extent of the crime was revealed and Gand fled to the Shadowlands. Dasol took over the business to earn enough credits for transportation off Kashyyyk. Soon afterward, the Wookiees rebelled and forced all outsiders off the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After revealing Gand's treachery, the player can either convince Dasol to kill Gand for lying to him, or to simply let the ex-merchant flee to the Shadowlands. Either way, Dasol will take over the operation and reward Revan with credits and a small discount. If the player convinces Dasol to let Gand's stand rot, Dasol says he will take what he needs from the store, and let the rest rot like a corpse. Dasol then gives the player a Mandalorian assault rifle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}