{"url": "Maul%27s_descendant", "categories": ["Category:Legends articles", "Category:Cut content from Battle of the Sith Lords", "Category:Articles with conjectural titles", "Category:Dathomirians", "Category:Maul's kin", "Category:Sith Lords", "Category:Sith Masters", "Category:Unidentified family members", "Category:Unidentified males", "Category:Unidentified Sith"], "nodes": [{"tag": "h1", "text": "Maul's descendant"}, {"tag": "p", "text": "This individual was a descendant or clone of the Sith Lord Darth Maul. He lived during the reign of Darth Krayt's Galactic Empire over a century after Maul’s time. After recruiting Darth Talon as his apprentice, this individual sought to reinstate the Rule of Two and eradicate Darth Krayt and his One Sith, who violated the ancient Sith practice with their Rule of One. Darth Maul's descendant and Talon went on to battle several Sith Lords including Darth Inexor and Jedi such as Gareth Lorca. Talon and her master established a base of operations inside an asteroid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maul's descendant was a proposed character for the canceled video game Battle of the Sith Lords, which was being developed by Red Fly Studio in 2010 and 2011."}, {"tag": "p", "text": "Battle of the Sith Lords began development as an origin story for Darth Maul before his death in Star Wars: Episode I The Phantom Menace. Development shifted after a meeting with George Lucas where Darth Talon was suggested as a central character alongside Maul. When Lucas was told that this wouldn't work since Talon lived more than 170 years after Maul, he said the main character could instead be a descendant or clone of Maul."}, {"tag": "p", "text": "Red Fly Studio developed Maul's descendant based on this idea, and created several character concepts that displayed him as a new and unique character distinct from Darth Maul. LucasArts was not in favor of the concept and insisted that the main character look identical to Darth Maul."}, {"tag": "p", "text": "Development of Battle of the Sith Lords ceased on June 24, 2011 and the character of Maul's descendant was scrapped along with the title."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}