{"url": "Maulers", "categories": ["Category:Legends articles", "Category:Assassins", "Category:Criminal organizations", "Category:Naboo organizations"], "nodes": [{"tag": "h1", "text": "Maulers"}, {"tag": "p", "text": "The Maulers were a group of criminals active on Naboo during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Maulers were a group of assassins and thugs who followed the teachings of the presumed late Sith Lord Darth Maul. Most Maulers were not Force-sensitive, but extremely brutal and violent. They inhabited an area of Naboo once populated with peaceful philosophers. They were typically seen in red and black clothing, in honor of Maul's tattoos."}, {"tag": "p", "text": "Mauler beast masters trained veermoks for fighting."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Battle of Yavin, the Royal Naboo Security Forces increased their activities in response to the trouble caused by the Maulers. This interfered with the spice smuggling operations of the Rodian smuggler Radeld Siwar, who sent a young smuggler to deal with this problem. The smuggler ambushed and killed several Maulers near their stronghold to quiet them down."}, {"tag": "p", "text": "Around the same time, a patron in Theed hired the Maulers for an assassination but the criminals took the money and did not executed the contract. The patron later tried to take his revenge by revealing the location of their stronghold. Roric V`lia, a Naboo noble and employer of Vaik'anna Silverlight, sometimes used the services of the Maulers."}, {"tag": "p", "text": "Circa 1 ABY, the Maulers planned planet-wide criminal activities on Naboo, but their operation were thwarted by agents of the Royal Naboo Security Forces. The Royal Security Police Force raided the Mauler Apprentice Camp and the Mauler Stronghold near the city of Keren. They eliminated a Mauler warlord known as the Mauler Usurper, but failed to capture the Mauler Leader Doogal Belstar, killing him during the operation. Around the same time, the Mauler Stronghold was also targeted by the Royal Marine Regiment. Weapons caches were confiscated and four Mauler leaders were eliminated: the chief tactician Zolo Sartain, the chief of security Yarick Tempol, the assassin Xylan Kee'choap and the mystic Walus Mutin."}, {"tag": "p", "text": "Later, Vance Groten recruited RSF agents to eliminate a group of Maulers near the city of Dee'ja Peak."}, {"tag": "p", "text": "Boss Rugor Nass later sent a spacer to recover a Gungan artifact that the Maulers had stolen. The spacer killed the Mauler Master Driton Fitch in the Mauler Bunker and recovered the artifact."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}