{"url": "Armored_Personnel_Carrier/Legends", "categories": ["Category:Legends articles", "Category:Vehicle stubs", "Category:Galactic Empire vehicles", "Category:Repulsorcraft"], "nodes": [{"tag": "h1", "text": "Armored Personnel Carrier"}, {"tag": "p", "text": "The Armored Personnel Carrier (APC) was an armored, land-based repulsorlift troop transport vehicle used by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Armored Personnel Carrier was a repulsorcraft troop transport was armed with two double blaster cannons, and one mounted E-Web heavy repeating blaster. The two blaster cannons were positioned in turrets equipped with spotlights flanking the main door, while the E-Web was mounted on top. The APC also included holding cells for prisoners."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Rebel Alliance pilot Luke Skywalker encountered several Armored Personnel Carriers on Dantooine and Ralltiir during the Galactic Civil War, where they were used to deploy troops, serve as medium attack vehicles, and transport the Imperial defector Tycho Celchu."}, {"tag": "p", "text": "During his encounters, he discovered that they had weak hulls around the double blaster cannons and was, for the most part, able to disable them with fire from E-Web blasters."}, {"tag": "p", "text": "APCs were later dispatched to the Empire's invasion and subsequent blockade of Ralltiir. Rebel pilot Sarkli, when defecting to the Empire during the Alliance's attempt at evacuating the scientists, boarded an APC."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "These APCs appear in the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike."}, {"tag": "p", "text": "In real life, \"Armored Personnel Carrier\", or \"APC\", is a military term used to describe armored troop transports, i.e vehicles used to ferry troops to the battlefield and built with either a fully or a partially armored chassis. They are usually armed with defensive weaponry to protect their occupants, but not always. Different vehicles in the Star Wars universe fit into this category, like the Republic Troop Transport, the All Terrain Open Transport, the Multi-Troop Transport, and the A-A5 speeder truck."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}