{"url": "Max_Rebo", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Males", "Category:Max Rebo Band members", "Category:Ortolans"], "nodes": [{"tag": "h1", "text": "Max Rebo"}, {"tag": "p", "text": "Max Rebo was a male Ortolan from Orto and a popular musician who led the Max Rebo Band. He mainly played the red ball jett organ, which he played with his feet; he and his band often performed for criminals and gangsters."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Max Rebo was born on the cold planet of Orto. At some point Rebo formed a band, called the Max Rebo Band, which would go on to perform for Jabba the Hutt. Rebo also had a brother named Azool Phantelle."}, {"tag": "h3", "text": "Mistaken identity"}, {"tag": "p", "text": "At some point, Azool swindled several of the inhabitants of the spaceport Mos Eisley on the planet Tatooine. The victims mistook Rebo for Azool and began chasing the musician. Rebo then collided with two Imperial stormtroopers while fleeing toward Chalmun's Spaceport Cantina. Before the troopers could punish him for the collision, Azool spotted Rebo while passing on a speeder bike and pulled his brother out of harm's way and onto the bike."}, {"tag": "p", "text": "As the pair sped away from the angry stormtroopers and locals, Rebo admonished Azool for his life of crime. He fretted that the Hutt crime lord Jabba Desilijic Tiure, who employed Rebo, would punish both brothers for Azool's crimes, as they had taken place within the crime lord's territory. Unconcerned, Azool avoided a missile fired by Boushh, but then Rebo stopped the chase by grabbing Azool's bag of stolen funds and throwing the contents out to those chasing them. Rebo and Azool then got out of the speeder, with Azool saddened when he watched his funds being taken away by the pursuers. Jabba the Hutt then came to both of them, asking Rebo what had occurred; when Rebo gave the excuse that Azool had been causing trouble on Jabba's territory, and Azool claimed he had not known that it was Jabba's territory. As a result, Jabba punished Azool by forcing him to be a waiter on the Khetanna."}, {"tag": "h3", "text": "Performing for Jabba"}, {"tag": "p", "text": "In 4 ABY, Rebo and his band performed for Jabba. While performing, they were interrupted by the scream of Jabba's slave dancer Oola as she was dropped into the Hutt's rancor pit below his throne room. Later, the band was present when Leia Organa entered the palace disguised as the bounty hunter Boushh. At night, several members of the band accompanied Jabba into hiding as Organa freed the smuggler Han Solo from carbonite. Max Rebo then traveled aboard Jabba's sail barge to the Great Pit of Carkoon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}