{"url": "Max_Rebo_Band/Legends", "categories": ["Category:Legends articles", "Category:Jizz bands", "Category:Max Rebo Band members"], "nodes": [{"tag": "h1", "text": "Max Rebo Band"}, {"tag": "p", "text": "The Max Rebo Band, also known as The Max Rebo Twelve and (originally) Evar Orbus and His Galactic Jizz-Wailers, was among the most well known bands of the galaxy, thanks in part to their status as the regular band at Jabba's Palace."}, {"tag": "h2", "text": "Early history"}, {"tag": "p", "text": "Formed on the initiative of the Letaki would-be impresario Evar Orbus, the band originally consisted of the Ortolan Siiruulian Phantele (stage name Max Rebo), the Pa'lowick Sy Snootles and the Kitonak Droopy McCool. Performing as Evar Orbus and His Galactic Jizz-Wailers, Snootles and Orbus would dazzle audiences with their impressive vocal talents as Rebo and McCool accompanied them on their instruments: the Red ball organ and a chidinkalu flute."}, {"tag": "p", "text": "Touring small venues and cantinas in the Outer Rim, the Orbus-led group soon built up a following. The band was responsible for many hits, including \"Jedi Rocks\", \"Lapti Nek\" and \"(That Joyous Night) I Ate My Mate\". Thanks to his shady contacts, however, Orbus was the only one to earn a profit."}, {"tag": "p", "text": "In 15 BBY, the band played at Doodnik's Café on the planet Tyne's Horky."}, {"tag": "p", "text": "Around 1 BBY, the band was playing at the Blue Moon, a cantina and strip club in the rundown city of Trid. Located on the backwater world of Danuta, the Blue Moon would frequently see Imperial officers from the Imperial research facility as denizens in their off hours."}, {"tag": "p", "text": "When invited to play at the Mos Eisley Cantina by the Wookiee Chalmun, the band leaped at the opportunity to gain greater fame. Unfortunately, Figrin D'an, leader of the Modal Nodes, took offense to the fact that Chalmun would hire a second band, and attempted to kill them. Orbus was the only one to perish in the ensuing melee, and the surviving members allowed the Bith to keep the job."}, {"tag": "h2", "text": "Changing their tune"}, {"tag": "p", "text": "Desperate for a new gig, the band needed to take a new direction. Snootles, knowing that Rebo could be easily manipulated, allowed him to become the new leader of the band. She did this in order to ensure that Rebo would provide a public target for any further assassination attempts while she managed the band from behind the scenes. Sy Snootles' first act was to bring in backup dancers Greeata Jendowanian, Rystáll Sant and Lyn Me, in addition to fellow musicians Rapotwanalantonee Tivtotolon (stage name Rappertunie) and Barquin D'an, whose relationship to Figrin was irrelevant to the band."}, {"tag": "p", "text": "Rebo, McCool and Snootles met with Naroon Cuthus, who allowed the band to audition for Jabba Desilijic Tiure. Jabba was so impressed by their performance that he offered them a lifetime contract, with payment in the form of all the food the band could eat. Rebo immediately accepted the offer before the others could stop him. Snootles would later comment on how foolish she had been in letting Rebo act as the public face of the band, as it had led them to virtual eternal servitude."}, {"tag": "p", "text": "Still, their lives were not as bad as they had once been. They were allowed to travel outside the palace and accept tips from the palace denizens. They were sent to Hoth to perform for Bingo Mehndra on the crime lord's Spawning Day. Unknown to the band, they were being sent to kill him. When McCool discovered thermite explosives hidden in the speakers, the band set up a holovid that played a previous performance for Mehndra while they made their escape. In gratitude, Jabba bought them new instruments and gave them three new band members: the Klatooinian Umpass-stay, the Weequay Ak-rev and the Rodian bard Doda Bodonawieedo."}, {"tag": "p", "text": "The band played at Jabba's Palace during Luke Skywalker's attempt to free Han Solo and later played at their execution over the Great Pit of Carkoon. The band barely escaped the catastrophe that followed, jumping to safety as the Sail Barge blew apart. Greeata and Lyn Me then drove away a band of Tusken Raiders, stealing their banthas to ride to civilization."}, {"tag": "h2", "text": "Fallout"}, {"tag": "p", "text": "With their release from Jabba's contract, the band split apart. Rebo would eventually join the Rebel Alliance, playing for the troops and enjoying their food (which he claimed was his reason for joining in the first place). He would later relocate to Coruscant when the New Republic recaptured it. Rebo also started a resturant chain called Max's Flanth House. Yowza joined The Palpatones, exchanging his singing talent for transportation across the galaxy. Greeata and Rystáll would also join the band, Greeata gaining fame with the hit \"Kick the Ranat\" and Rystáll leaving the band after meeting fellow Theelin Shug Ninx. D'an built up a thriving import business on Stenos, while Rappertunie joined Rebaxan Columni, designing upgrades for the MSE-6 droid. Bodonawieedo would steal several sculptures from Jabba's Mos Eisley townhouse, selling them off and earning himself a fortune in credits, and Umpass-stay would become employed by Jocoro Desilijic Tiure. Lyn Me searched for her idol Boba Fett after it was uncovered that Fett survived the Sarlacc."}, {"tag": "p", "text": "The others were not as successful. Snootles would become a spice addict, never able to reclaim her past fame. McCool wandered off into the desert wastes of Tatooine and was never heard from again. Ak-Rev was killed by a pack of Tusken Raiders who had taken offense at his fellow Weequay's habit of killing their banthas as sacrifices to the Weequay god Quay."}, {"tag": "h2", "text": "Songs"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 1984 Kenner action figure set listed this band's name as Sy Snootles and the Rebo Band."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}