{"url": "Maxo_Vista", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Athletes", "Category:Criminals", "Category:Euceron", "Category:Males"], "nodes": [{"tag": "h1", "text": "Maxo Vista"}, {"tag": "p", "text": "Maxo Vista was a celebrated, award-winning athlete from the planet Euceron."}, {"tag": "p", "text": "Vista stunned the galaxy by winning an astonishing five events at the 33 BBY Galactic Games on Berrun. Seven years later, in 26 BBY, his home planet hosted the next Galactic Games, for which Vista, also a member of the Commerce Guild, was appointed a member of the Council of the Games."}, {"tag": "p", "text": "In one of the Games' exhibitions in Stadium Nine, Vista forced Obi-Wan Kenobi to compete with him in an intense, fast-moving holographic obstacle course that the former Galactic champion had rigged with a real Gladiator droid among a platoon of holographic droid renditions; but the Jedi still won the competition, shaming the former champion."}, {"tag": "p", "text": "Vista also made a deal with Doby Tyerell and Deland Tyerell to supply them illegally with advance track information for an illegal Caves podrace, which he transmitted to their pod that Anakin Skywalker was flying on their behalf. What they did not know was that Vista had also wired the pod's steering mechanism to blow through the nav computer so that it would crash into a stadium full of spectators, once the pod reached the grandstands near the finish line. Skywalker, however, was able to regain control of the podracer and go on to win not only the race, but also the freedom of the Tyerell brothers' sister-slave Djulla (Sebulba's 'property')."}, {"tag": "p", "text": "Later, even though Vista's villainy was exposed by the Jedi and he was summoned to a hearing on the charges of murder and of disruption of the Games' events by way of a Games Council conspiracy against several Galactic Senators, he was ultimately set free after the Ruling Power's hearing, when Obi-Wan Kenobi's key witness, Bog Divinian, refused to testify against the famous Games athlete (while other witnesses, Fligh and Didi Oddo, had conveniently fled the planet). Vista and Council head Liviani Sarno denied all charges brought against them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}