{"url": "May_the_Force_be_with_you", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Phrases"], "nodes": [{"tag": "h1", "text": "May the Force be with you"}, {"tag": "p", "text": "\"May the Force be with you\" was a phrase used to wish an individual or group good luck or good will, one that expressed the speaker's wish that the Force work in the favor of the addressee. The phrase was often used as individuals parted ways or in the face of an impending challenge."}, {"tag": "h2", "text": "Jedi"}, {"tag": "p", "text": "Qui-Gon Jinn wished Anakin Skywalker \"May the Force be with you\" shortly before the start of the Boonta Eve Classic."}, {"tag": "p", "text": "Jedi Master Obi-Wan Kenobi used the phrase throughout his life, including at the end of his message sent through the Jedi beacon, warning any possible survivors of Order 66 that the Galactic Republic had turned against the Jedi and that those who remained should not return to the Jedi Temple. He later told Luke Skywalker, \"The Force will be with you. Always\" during the Battle of Yavin."}, {"tag": "p", "text": "Skywalker would later wish Lando Calrissian and Chewbacca \"May the Force be with You\" before they started their search to locate Boba Fett and to rescue their comrade Han Solo from being frozen in carbonite."}, {"tag": "h2", "text": "Non-Jedi"}, {"tag": "p", "text": "The Guardian of the Whills Chirrut Îmwe used a variation of this phrase, \"May the Force of Others be with you,\" during his time proselytizing on the streets of Jedha City. During the theft of the Death Star plans, Sergeant Jyn Erso of Rogue One said to her team \"May the Force be with us.\" Admiral Raddus said \"Rogue One, may the Force be with you,\" as a tribute to the squad when the surviving members were wiped out on Scarif by the Death Star. Shortly before the Battle of Yavin, while overviewing the plan to destroy the Death Star, General Jan Dodonna used the phrase toward the Rebel pilots. Similarly, Han Solo said it to Luke Skywalker while preparing to leave Yavin 4, despite his agnostic stance towards the Force. The phrase was later used by Admiral Gial Ackbar before the Battle of Endor, saying \"May the Force be with us.\" After being questioned by New Republic X-Wing pilots, Din Djarin said \"May the Force be with you,\" to which one of the pilots, Carson Teva replied, \"And also with you.\" Prior to her departure in the Millennium Falcon to seek out Luke Skywalker, General Leia Organa said it to Rey. The phrase was later used toward the Resistance pilots by Vice Admiral Amilyn Holdo after the attack on the Resistance fleet. While trying to leave the Resistance Finn said it to Rose Tico."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The phrase \"May the Force be with you\" originated in Star Wars: Episode IV A New Hope and has continued to be part of Star Wars stories ever since."}, {"tag": "p", "text": "Based on an old interview with actor Christopher Lee (Count Dooku) some have begun to speculate that the phrase “May the Force be with you.” originally came from actor Peter Cushing (Grand Moff Tarkin), who would often end personally written letters with the phrase \"May God's blessing be with you.\"[source?]"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "On June 21, 2005, \"May the Force be with you\" was listed as #8 of the AFI's 100 Years...100 Movie Quotes."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Many fans celebrate May 4th as \"Star Wars Day\" by paraphrasing the phrase as \"May the fourth be with you.\""}, {"tag": "p", "text": "In his introduction for Star Wars Rebels: The Visual Guide, Dave Filoni told readers that \"The Force will be with you, always.\" In his introduction for A New Dawn, he stated that \"Because of fans like you around the world, the Force will be with us, always.\" The final page of The Adventures of Luke Skywalker, Jedi Knight features the phrase \"May the force be with you!\" against a backdrop of stars, echoing the final lines of the story: \"Luke Skywalker fulfilled his destiny. He became a Jedi Knight and saved the galaxy. More important, he saved his father and found his family. The Force was with him.\" The final line of The Rebellion Begins reads \"May the Force be with them all.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}