{"url": "Mayth_Duvel", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Black Sun members", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Mayth Duvel"}, {"tag": "p", "text": "Mayth Duvel was a Black Sun sublieutenant during the Galactic Civil War. He was among the few loyal underlings of Dark Prince Xizor, Underlord of Black Sun, who could claim the privilege to visit Xizor within his personal sanctum on the planet Coruscant. Duvel met with Xizor in 3.5 ABY while bearing a petition on behalf of the criminal Nezriti Organization, which requested an alliance with Black Sun."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mayth Duvel was a male sublieutenant in the Black Sun crime syndicate during the Galactic Civil War. A loyal underling of Black Sun's leader, Dark Prince Xizor—or as loyal as fear could make him—Duvel numbered among the select few of Xizor's minions who had the right to visit the Dark Prince within his personal sanctum on the planet Coruscant."}, {"tag": "p", "text": "In 3.5 ABY, some months after the Battle of Hoth, Duvel entered Xizor's sanctum with a petition from the Nezriti Organization. Bowing low before his master, Duvel explained that the rival criminal group sought an alliance with Black Sun and presented Xizor with a small package, which contained a bloodred Tumanian pressure-ruby. By gifting the rare gemstone, which easily cost several million credits, the Nezriti hoped to curry Xizor's favor, but the Dark Prince merely tossed the token onto his desk, unconcerned if it were to later fall in with the garbage. Xizor then dismissed Duvel, instructing him to inform the Nezriti that Black Sun would consider their offer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mayth Duvel appeared in the May 1996 novel Shadows of the Empire, written by Steve Perry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}