{"url": "Meck_Odom", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic members", "Category:Humans", "Category:Imperial defectors", "Category:Males", "Category:Stormtrooper officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Meck Odom"}, {"tag": "p", "text": "Meck Odom was a Human male Imperial officer who served the Galactic Empire and later joined the Alliance to Restore the Republic during the Galactic Civil War. He was assigned to the research facility on Danuta."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Odom was a more spiritual person than the average citizen of the Empire, and had studied the teachings of the B'omarr Order. As the Empire didn't tolerate religion he kept it a secret."}, {"tag": "p", "text": "Odom was once the best friend of Kyle Katarn when they were roommates during their tenure at the Academy of Carida. After his Omega Exercise, where he fought against Rebel base, Katarn called Meck for a secret meeting at the Academy's library -specifically the cooking section- where he confided to him the unexplained premonitions that guided him through his mission, and called upon his religious background. Meck wasn't happy that Kyle brought up this personal matter in a discussion, and all he could say was that his studies didn't mention much about the Force."}, {"tag": "p", "text": "Odom's parents and sister came to his class' graduation and invited Katarn (who was alone) to stay with them that night. Katarn had a crush on Odom's sister."}, {"tag": "p", "text": "Later, while Katarn was on a mission to steal the partial set of Death Star plans from the city of Trid, he encountered Odom before infiltrating the research facility. Odom was persuaded to shut down the base's outer perimeter, allowing Katarn an easier entry. During the skirmish, the two staged a blaster shot that wounded and rendered Odom unconscious, hoping that this would remove Odom from suspicion."}, {"tag": "p", "text": "It is unknown whether Odom was implicated in the Danuta incident, whether he was able to defect to the Rebellion, or whether he continued to serve the Empire during the Galactic Civil War. At the time, Odom was not entirely certain he had done the right thing—his true loyalty was to saving lives, not to the Empire or Rebellion—but he comforted himself with the knowledge that only time would tell."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Meck Odom was portrayed in Dark Forces: Soldier for the Empire audio drama by Kale Browne, the same voice actor who portrayed Biggs Darklighter in the Star Wars radio drama.[source?] He is mistakenly called \"Odom Meck\" throughout the audio dramatization and is listed by the mistaken name on the Dark Forces: The Collector's Trilogy audio drama box."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}