{"url": "MedStar_II:_Jedi_Healer", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:MedStar duology"], "nodes": [{"tag": "h1", "text": "MedStar II: Jedi Healer"}, {"tag": "p", "text": "MedStar II: Jedi Healer is the second book of the MedStar Duology written by Michael Reaves and Steve Perry that takes place during the middle of the Clone Wars, approximately two years after the First Battle of Geonosis. It follows the story of a Medical Doctor named Jos Vondar, and his Rimsoo 7 (Republic Mobile Surgical Unit) on the planet Drongar. The book is part of the Clone Wars multimedia project."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "While the Clone Wars wreak havoc throughout the galaxy, the situation on the far world of Drongar is desperate, as Republic forces engage in a fierce fight with the Separatists…."}, {"tag": "p", "text": "The threatened enemy offensive begins as the Separatists employ legions of droids in their attack. Even with reinforcements, the flesh and blood of the Republic forces are just no match for battle droids' durasteel. Nowhere is this point more painfully clear than in the steaming Jasserak jungle, where the doctors and nurses of a small med unit face an impossible situation. As the dead and wounded start to pile up, surgeons Jos Vondar and Kornell \"Uli\" Divini know that time is running out."}, {"tag": "p", "text": "Even the Jedi abilities of Padawan Barriss Offee have been stretched to the limit. Ahead lies a test for Barriss that could very well lead to her death—and that of countless others. The conflict is growing—and for this obscure mobile med unit, there's only one resolution. Shocking, bold, unprecedented, it's the only option Jos and his colleagues really have. The unthinkable has become the inevitable. Whether it kills them or not remains to be seen."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Starting approximately one week after MedStar I: Battle Surgeons, this novel continues the story of Barriss Offee, Jos Vondar, Tolk le Trene, Klo Merit, I-5YQ, Den Dhur and Kaird the Nediji during their stay on the planet Drongar over the Republic and Separatists' war for bota over the planet. Dr. Vondar is still wallowing in grief over the loss of his late friend Zan Yant, even as Zan is replaced by the adolescent surgeon, Kornell \"Uli\" Divini, who takes a liking toward Barriss, who does not reciprocate his interests because of the Jedi Order's ban of attachments. Kaird succeeds in his operations on Drongar for the Separatists and Black Sun's interests and leaves. Meanwhile, the spy, who is also working for the Separatists and Black Sun, continues his duties of sabotaging the Republic Rimsoos. Barriss nearly falls to the dark side when she takes bota to heal herself, but rejects it at the last second. She then uses her Force powers to locate who the spy is, and finds the culprit in Klo Merit. Dr. Vondar confronts him with a blaster and kills Merit, avenging Zan's death."}, {"tag": "p", "text": "The Republic and the Separatists leave Drongar when they figure out that the drug has mutated into a useless weed, but its effects in enhancing one's Force abilities to the point of the dark side, such as from Barriss's case, still lives on unbeknownst to the Republic or Separatists. I-5YQ and Den Dhur depart for Coruscant to fulfill the late Lorn Pavan's wishes to look after his son, Jax, just as I-Five believes he has gained sentience. Barriss returns to the planet as a Jedi Knight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the cover variations of Medstar II: Jedi Healer."}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}