{"url": "Medal_of_Bravery", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Alliance to Restore the Republic awards"], "nodes": [{"tag": "h1", "text": "Medal of Bravery"}, {"tag": "p", "text": "The Medal of Bravery, also known as the Medal of Alderaan, was a medal given for heroic efforts by the Rebel Alliance."}, {"tag": "p", "text": "After Luke Skywalker destroyed the Galactic Empire's feared battle station, the Death Star, with the assistance of Han Solo, Princess Leia Organa presented them both with medals of honor. She placed the medals around their necks in a special ceremony held at the Rebel base on Yavin 4 following the Battle of Yavin. Chewbacca was also presented with such a medal, though not during the public ceremony."}, {"tag": "p", "text": "The medal was engraved in a stylized flower that resembled an emblem used by the Galactic Republic of old. At its heart was a stylized rising sun that symbolized the dawn of a new hope in the wake of the Alliance's victory over the Galactic Empire."}, {"tag": "p", "text": "To settle his tab with Maz Kanata, Solo gave the pirate queen his medal, which she kept in her castle on Takodana. During the New Republic Era, the Force-sensitive Karr Nuq Sin traveled to Takodana to deliver a package to Kanata for Dok-Ondar. Whilst at the castle, Sin touched the medal as part of a test by Kanata, and revealed to the pirate that Solo had actually given her Skywalker's medal."}, {"tag": "p", "text": "After Solo's death at the hands of his son Kylo Ren, Organa took the medal she gave Solo on Yavin 4 and kept it with her. Following the Battle of Exegol in 35 ABY, the Resistance celebrated the death of Darth Sidious at their base on Ajan Kloss. During the celebrations, Kanata gifted Solo's Medal of Bravery to his former copilot, Chewbacca, telling the Wookiee that his partner would have wanted him to have it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Medal of Bravery was first seen being presented to Luke Skywalker and Han Solo by Leia Organa in the 1977 film Star Wars: Episode IV A New Hope. The medal was to appear again in the 2015 film Star Wars: Episode VII The Force Awakens, but the footage was dropped from the finished film. However, the footage was repurposed and was featured in the 2019 film Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "h3", "text": "Controversy"}, {"tag": "p", "text": "Chewbacca's not being awarded a medal in the film was a source of discontent for many Star Wars fans. In an interview recorded shortly after the release of Episode IV, George Lucas explained that Wookiee species don't care for medals but that a large contingent of Alliance officers were sent to Kashyyyk for a memorable celebration due to Chewie's efforts."}, {"tag": "p", "text": "While a number of Star Wars Legends stories, such as The Day after the Death Star!, confirmed that Chewbacca did receive a medal, Smuggler's Run: A Han Solo & Chewbacca Adventure was the first new canon tale to confirm this. In A New Hope: The Princess, the Scoundrel, and the Farm Boy, Chewbacca is presented with a medal at the same time as Skywalker and Solo."}, {"tag": "p", "text": "As a reference to the controversy, Maz Kanata gave Chewie Han Solo's Medal of Bravery left to him by Leia at the end of The Rise of Skywalker."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "LEGO Star Wars: Droid Tales - \"Mission to Mos Eisley\" depicts a humorous take on the controversy by showing C-3PO being so distracted by the safe return of R2-D2 that he drops and breaks a medal labeled \"Chewie\" in two. Later, in \"Gambit on Geonosis,\" C-3PO presents Chewbacca with a medal that R2 had initially attempted to give to him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}