{"url": "Medal_of_Bothawui", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic awards", "Category:Bothan culture"], "nodes": [{"tag": "h1", "text": "Medal of Bothawui"}, {"tag": "p", "text": "The Medal of Bothawui was a medal awarded by the Rebel Alliance during the Galactic Civil War. It was \"Named in honor of the Bothan people, many of whom sacrificed themselves in the war against tyranny. Awarded for distinguished service in intelligence gathering and fighting the rising tide of oppression and injustice.\" This award for intelligence gathering symbolized that while weapons, food and other supplies are vital to the resistance movement, information is the most vital resource of all."}, {"tag": "p", "text": "A spacer was awarded this medal for retrieving droid modules and delivering them to Wilson Tchorshel. Its Imperial equivalent was presumably the Medal of the Emperor's Fist."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "At least two variants of the medal existed."}, {"tag": "p", "text": "One variant simply had a red ribbon with gold attachments and a massive gold medallion with the Rebel Alliance logo emblazoned on the front."}, {"tag": "p", "text": "The other variant had a red ribbon lined with various rubies, sapphires, emeralds, and diamonds, with the medal itself being gray and spade-shaped, with the Rebel Alliance logo being prominently displayed as well as featuring the silhouette of an X-wing at the top."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This medal is a player reward in the online game Star Wars Galaxies for completing the Rebel arc of the Legacy Quest. The medal had two different designs between the in-game version of the medal and the one in the eponymous card for the Champions of the Force deck for the Star Wars Galaxies Trading Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}