{"url": "Medical_droid/Legends", "categories": ["Category:Legends articles", "Category:Droid stubs", "Category:Incomplete lists", "Category:Medical droid models", "Category:Medical droids", "Category:Medical occupations"], "nodes": [{"tag": "h1", "text": "Medical droid"}, {"tag": "p", "text": "Medical droids, medi-droids, meddroids, Emdee droids, or surgeon droids were specialized in medical and surgical operations. A classification of first-degree droid, medical droids were actually considered to be members of the larger biological science droid classification, but were typically listed separately due to their prominence."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The galaxy was full of sentient species and it could be very hard for a flesh-and-blood doctor to know how to effectively treat more than a few of them. Medical droids had no such shortcomings, some even had a passable bedside manner. The most popular meddroids included the 2-1B surgical droid and FX-series medics. GH-7 medical analysis units were common throughout the Galactic Republic, while the Sith employed DD-13 medical assistant droids for their dark reconstruction surgery. There were even models that specialized in non-sentient creatures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Geeaych-Seven was also known as the GH-7 meddroid. Its data banks were filled with information about almost all medical problems, physical or mental. In 19 BBY, a GH-7 was deployed at the Polis Massa Research Base to oversee the medical treatment of Padmé Amidala with the assistance of a Midwife droid as she gave birth to Luke and Leia."}, {"tag": "p", "text": "A team of DD-13 cybernetic surgical droids were used to reconstruct Darth Vader in the Emperor Palpatine Surgical Reconstruction Center after he was severely injured in a duel with his former master, Obi-Wan Kenobi on Mustafar."}, {"tag": "p", "text": "Luke Skywalker was treated in a Bacta tank operated by two medical droids, a 2-1B and an FX-7, in the Echo Base medical lab shortly before the Battle of Hoth in 3 ABY. The same droids would replace Skywalker's hand with a cyborg replacement after losing it to Darth Vader on Bespin."}, {"tag": "p", "text": "Another medical droid pulled shrapnel out of Luke after his escape from the Cavrilhu Pirate Base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}