{"url": "Meditation/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Jedi culture", "Category:Meditation"], "nodes": [{"tag": "h1", "text": "Meditation"}, {"tag": "p", "text": "Meditation was a mental technique practiced by Force-sensitives and non-Force-sensitives alike, by which one attempted to get beyond the reflexive, \"thinking\" mind into a deeper state of relaxation or awareness. Many Force-based organizations, such as the Jedi Order and the Order of the Sith Lords, used meditation for enhancing emotional control over self and for better connection to the Force. Members of these and other groups often built meditation chambers in which outside disturbances could be muted and shut out to provide a more conducive atmosphere for deep meditation. While meditation could be attained without any outside means, some individuals chose to meditate with the assistance of a rare, naturally occurring meditation crystal."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Jedi Order"}, {"tag": "p", "text": "Meditation within the Jedi Order was considered paramount to mastering oneself and the Third Pillar of the Jedi Path: Self-Discipline. Without self-mastery, Jedi scholars would argue that achieving mastery over the Force would be impossible. To the Jedi, meditation allows a practitioner to achieve inner peace, harmony, and serenity; three of the core principles of the Jedi Code. Due to the importance on meditation, the Council of First Knowledge created a five sessions-a-day meditation regimen for Initiates within the academies of the Order to ensure that the necessity was driven home. Initiates and Padawans were then encouraged by their instructors to meditate whenever they had a spare moment, seeking deeper meditation during private time."}, {"tag": "h3", "text": "Sith Order"}, {"tag": "p", "text": "Similar to the Jedi Order, the members of the Sith Order as it existed across the millennium employed meditation to focus and sharpen their mind, regain their strength, and heal their wounds. Forsaking all attempts to eliminate passions and gain serenity, Sith often times used their dark and raw emotions to reinvigorate themselves and stoke the flames of passion which burned within their souls. Over their history, many notable Dark Lords of the Sith have meditated privately within a specially-made meditation chamber within their palaces or aboard their starships. Most notably, the ancient Sith Lords of Korriban had learned to create meditation sphere; mobile war craft used by Sith employing the complicated art of battle meditation."}, {"tag": "p", "text": "Darth Bane grew in the power of the dark side of the Force to the point where he almost never slept, relying instead on an hour or two of daily meditation to keep his body energized and his mind invigorated."}, {"tag": "h3", "text": "Gand Findsmen"}, {"tag": "p", "text": "An organization of Gand operating on their homeworld, the Findsmen worshiped the mists of their home, attributing the mysteries of the Force to this shroud of fog. Among the Findsmen individual meditations were kept private and secret, with rituals lasting for an uninterrupted three hours. Through such rituals the Gand opened themselves up to the Force, drawing on energies which could be focused into other abilities, such as battlemind or farsight. Knowledge gained through Findsmen meditations was said to have a statistically high accuracy rate; the notorious Findsmen Zuckuss was calculated to have a high accuracy rate of 91.33725."}, {"tag": "p", "text": "A Findsman's meditation session typically began with the regulation of the respiration rate, allowing the practitioner to slowly enter a calm state where the mists of Gand could easily swirl about their mind. As the vision presented itself, the mists would recede and information could be read. A unique quality of the Findsmen meditations was dependent on where the ritual took place. Those who meditated within a crowded city were said to become mindful of the actions of those around them. In contrast, meditation in planetary orbit granted the practitioner the ability to have foreknowledge of planetary cultures and customs. Some rituals took place during trips through hyperspace; Findsmen claimed that these rituals allowed them to sense the underlying feelings motivating the galaxy's countless sentients."}, {"tag": "h3", "text": "Nightsisters"}, {"tag": "p", "text": "The Nightsisters of Dathomir, a secluded group of Force witches focused their studies on the Force through their meditations on the green spirits. This thin veil of green mist which permeated Nightsister temples and convents aided them when preforming such feats as the surge of the brier."}, {"tag": "h2", "text": "Variants"}, {"tag": "h3", "text": "Meditation of Emptiness"}, {"tag": "p", "text": "A technique employed by the Jedi Order, Empty Meditation was recommended to students as a means to center oneself and find deep inner peace and purge negative emotions. Establishing an emotional anchor, Jedi used the technique for centuries despite purges and war. The famed Jedi Master Obi-Wan Kenobi highly recommended the technique, while members of the Order continued the practice well past the Yuuzhan Vong War."}, {"tag": "p", "text": "A similar technique developed by Grand Master Luke Skywalker after the reformation of the Order was called heji tal. Drawing on all three fundamental skills of the Jedi teachings: control, sense, and alter, heji tal saw these skills focused upon in ever-changing patterns. Like Empty Meditation, heji tal brought inner peace, knowledge, and serenity."}, {"tag": "h3", "text": "Moving Meditation"}, {"tag": "p", "text": "The art of Moving Meditation was a technique practiced in a state of wakefulness at which time a practitioner quieted all external distractions consciously by performing an activity involving movement coupled with concentration. Moving Meditation could manifest itself in many different ways, awakening a feeling in the user that they could complete any task they were faced with. Moving Meditation practices ranged from repairing starfighters or droids, such as Jedi Knights Anakin Skywalker and Meetra Surik were fond of doing. Surik, a Jedi during the Jedi Civil War, would often enter into the trance while tinkering with her personal utility droid T3-M4, while her companion Bao-Dur could only find a serene calm while working on machinery."}, {"tag": "p", "text": "A more refined and personal form of Moving Meditation originated at Stav Kesh on Tython during the time before the founding of the Galactic Republic or the Jedi Order. Known as Alchaka, this deeply complex exercise involved seemingly endless repetitions of intense stances which left the practitioner exhausted. Used by non-Jedi groups, a similar form of Moving Meditation was developed by the Matukai. A type of meditative martial arts, this technique was often employed while wearing a meditation band around the head."}, {"tag": "h3", "text": "Floating Meditation"}, {"tag": "p", "text": "The art of floating or rising meditation was a rare technique for students of the Force to achieve. Attainable only once deeply submerged in the Force, this form of meditation allowed practitioners to rise several meters off the ground. also known as \"Rising Meditation\" - a technique where Jedi meditated while using the Force to float several inches off the ground."}, {"tag": "p", "text": "While teaching her young Padawan Barriss Offee, Jedi Master Luminara Unduli instructed her apprentice to meditate behind a low wall until she could see the shop on the other side. Struggling for hours to achieve Rising meditation, Offee was shocked to discover her master's task was far simpler. Unduli explained that it is unnecessary to float over the low wall to see the shop when she could simply stand."}, {"tag": "h3", "text": "Healing meditation"}, {"tag": "p", "text": "Healing meditation or a healing trance was a method of healing ones injuries with the Force. Some species, such as Whiphids, had a natural affinity for healing themselves through trances, while other organizations taught the skill to their acolytes."}, {"tag": "h3", "text": "Arch Pose"}, {"tag": "p", "text": "The Arch Pose was another mediative stretching exercise practiced by the Jedi Knights. With the hands and feet placed firmly on the ground, a Jedi then arched their body into a rounded shape, with the buttocks as high as they could go."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}