{"url": "Mee/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Creatures of Naboo", "Category:Herbivorous creatures", "Category:Non-sentient species", "Category:Scalefish", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Mee"}, {"tag": "p", "text": "The mee, also known as a daggert, was a poisonous scalefish native to the waters of the Mid Rim planet of Naboo. The mee was rotund yet flat, with black-and-yellow scales and a set of poisonous spines that protruded from its centerline. With its diagonal striping pattern, it could camouflage itself and blend into its surroundings, such as sea grasses and reeds. Mee largely resided within Lake Paonga, around the underwater Gungan city of Otoh Gunga, and were later transported to Naboo's moon Ohma-D'un in a Gungan recolonization effort, as well as the Outer Rim planet Aquilaris."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Mee, sometimes referred to as daggerts, were poisonous and herbivorous scalefish native to the oceans of the Mid Rim planet Naboo but were also found on one of Naboo's moons, Ohma-D'un, and the Outer Rim planet Aquilaris. The typical mee possessed a rotund though vertically flat body, with black-and-yellow scales and poisonous spines that protruded from its centerline. Its diagonal striping served as camouflage, allowing it to blend into sea grasses and reeds. Larger varieties of mee known as jumbo daggerts existed in the core of Naboo and were considered much rarer than their surface counterparts."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Mee reproduced frequently, though they possessed a short lifespan. They survived by nibbling at the roots of plants growing in the water. Mee were plentiful, traveling in schools of thousands, and were a staple food source of many other species, such as the opee sea killer, faa, yobcrab, tee, see, pikobi, and otta. Their diet included bubble spore and their seeds, cambylictus trees, chak-root, green glie, nave, pom, red glie, rutiger trees, and tassler trees and their knees."}, {"tag": "p", "text": "On Naboo, the mee were commonly found in both shallow and deep swamps, and in the area around the underwater city Otoh Gunga, one of the homes of the amphibious sentient Gungan species. They were attracted by the underwater city's lights; however, they knew by experience not to go through the portal zones of the hydrostatic bubbles that led to the air-filled chambers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mee evolved in the waters of Naboo and were transported in Gungan colonization efforts to its moon Ohma-D'un. Some mee were present in the waters of Lake Paonga as of the Trade Federation's Invasion of Naboo in 32 BBY as Jedi Knight Qui-Gon Jinn; his Padawan, Obi-Wan Kenobi; and their Gungan scout, Jar Jar Binks, swam to Otoh Gunga to speak with local representatives."}, {"tag": "h2", "text": "Mee in the galaxy"}, {"tag": "p", "text": "Circa 20 BBY, mee, along with ray, faa, and laa, were present in a holding tank aboard the Titavian IV, an exploration vessel formerly operated by the Intergalactic Zoological Society on Mycroft whose mission was to gather and catalog specimens from across the galaxy. The scalefish were also present on the water planet of Aquilaris."}, {"tag": "p", "text": "Mee were such a notable fish on Naboo that they were included in children's holographic nursery mobiles around the time of the Clone Wars, lasting from 22 BBY to 19 BBY. Despite their poisonous nature, mee could be consumed by non-aquatic species and were presented as fillets in Dex's Diner located in the CoCo Town district of the Core World ecumenopolis planet Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mee first appeared in the 1999 prequel trilogy film Star Wars: Episode I The Phantom Menace, along with other scalefish named doo, ray, faa, see, laa, and tee, which refer to the real-world musical scale: \"Do, Re, Mi, Fa, Sol, La, Ti.\" All of these fish were first named according to the musical scale in 1999's Star Wars: Episode I The Visual Dictionary. The mee also appeared in subsequent associated material, including Star Wars Episode I: Racer, Star Wars Episode I: The Gungan Frontier, and the 2000 Daniel Wallace short story \"The Monster\" in Star Wars Gamer 2."}, {"tag": "p", "text": "The Gungan Frontier, released two days before Episode I: The Visual Dictionary, gave the mee an alternative name: the daggert, a reference to game developer Todd Daggert, courtesy of The Wildlife of Star Wars: A Field Guide author Terryl Whitlatch. Jumbo daggerts were mentioned in the 2000 young readers novel Episode I Adventures 9: Rescue in the Core. Later references to the mee were made in a 2004 issue of the Star Wars: Republic comic series and the 2007 Star Wars: Legacy of the Force novel Sacrifice. Most recently, two representations of mee made an appearance alongside a see in a 2009 episode of Star Wars: The Clone Wars, and mee were also mentioned as \"daggerts\" in 2009's \"Dining at Dex's,\" a Hyperspace article."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}