{"url": "Meebur_Gascon/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic military officers", "Category:Males", "Category:Zilkins"], "nodes": [{"tag": "h1", "text": "Meebur Gascon"}, {"tag": "p", "text": "Meebur Gascon was a male Zilkin who served as a colonel in the Grand Army of the Republic during the Clone Wars. A diminutive alien, he led the Republic droid-only D-Squad on a mission to steal an encryption module from a Separatist dreadnaught."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Service in the Republic"}, {"tag": "p", "text": "In 22 BBY, Meebur Gascon had been a member of the Grand Army of the Republic since the First Battle of Geonosis, where he served as a tactical adviser during the battle."}, {"tag": "h3", "text": "Stealing an Encryption Module"}, {"tag": "p", "text": "Two years later, Meebur was assigned by Jedi Master Mace Windu to lead D-Squad, a group of droids to steal an Encryption Module. Gascon was quite tough and was really looking forward to his promotion as Brigadier-General to obtain for the Grand Army. Gascon was not very-well prepared, especially when it came to the pit droid WAC-47 The Colonel considered the Pit Droid to be an adjunct to the mission without much utility. WAC worked on the system and continued to address Colonel Gascon as Corporal, which insulted him greatly. To lead the droids, Gascon took place in the head of M5-BZ, whose memory modules were removed by Doctor Gubacher."}, {"tag": "p", "text": "The Colonel wanted a strategy in order to board a Separatist dreadnaught where the Encryption Module was contained. Unfortunately, WAC recklessly set their shuttle on a collision course with the dreadnaught, only to be caught in a tractor beam, to Gascon's annoyance. Their shuttle was soon boarded and the droids (with Gascon hidden within BZ) were escorted for interrogation. The astromech quickly disabled their CIS escort. Gascon directed each of the droids throughout the operation. He even sanctioned WAC's offer to distract a pair of super battle droids when the little Pit Droid begged so eagerly."}, {"tag": "p", "text": "Unfortunately, Gascon's plan hit a snag, as M5-BZ accidentally fried himself while trying to hack the door to the Comm Vault. Gascon was forced out of the smoking droid. He then suggested that one of them perform the task. QT-KT suggested he do it himself. Gascon proudly boasted that he is an officer but confesses that he's had no field experience whatsoever. As R2-D2 opened the door, Gascon stated that he was not going to just relinquish his leadership, but he promised that the droids would be treated with more respect during the mission. At least, until one of them screws up."}, {"tag": "p", "text": "After getting past the swarm mines and reaching the Comm Vault, Artoo used his rocket boosters to ascend and grab the module. Unfortunately, their disturbances were soon noticed by the super tactical droid, Aut-O, who confronted them. Artoo quickly shut off the gravity in the room, causing temporary confusion. Gascon participated in the fighting, trying to distract Aut-O from dragging Artoo down as he reached for the module. As Artoo managed to acquire the encryption module, Aut-O grabbed onto him and tried reaching for Gascon as well. WAC quickly turned the gravity back on. Once back on solid ground, Aut-O grabbed Gascon and attempted to squeeze him to death. Luckily, Artoo dropped right on top of him and decapitated the droid."}, {"tag": "p", "text": "Unfortunately, Aut-O's destruction triggered a general wide alert, forcing D-Squad and the Colonel to leave. However, Artoo refuses to leave M5-BZ behind. Realizing he's right, Gascon agrees to take their inactive teammate with them. D-Squad then escaped the dreadnaught without alerting suspicion. Gascon was proud of D-Squad and was finally gratified when WAC-47 who finally called him Colonel."}, {"tag": "h3", "text": "Stranded"}, {"tag": "p", "text": "After escaping the Dreadnaught with the encryption module, the ship they were on crossed paths with a comet field. WAC alerted Gascon of this and the ship was forced into an ice comet and the ship was critically damaged, forcing them to crash land on the planet below. After climbing out of the crashed ship, R2 decided to go ahead and complete the mission at hand by finding a civilized location."}, {"tag": "p", "text": "Although, Gascon didn't like this idea and yelled at R2 to return to the crash site, the rest of D-Squad decided to follow R2, Gascon was forced to follow along. After a while of walking, Meebur drank the last of this water and remarked about the extremely hot weather. WAC mentioned it was a \"sunny day\" which reminded Gascon to check the sun so they would know in what direction they were going. Doing so, he noticed there was no sun."}, {"tag": "p", "text": "He later thought he saw the crash site of their ship and he went there alongside D-Squad only to find another crash site containing corpses. He climbed on top of the ship and eventually fell down. A few seconds later he thought he had seen a village. Once he arrived there with M5-BZ and the rest of D-Squad, they realized it had only been a hallucination, and Colonel Gascon began to go mad. The rest of D-Squad left him and WAC-47 to continue their task to find a civilized location."}, {"tag": "p", "text": "As Gascon regained his sanity, he spoke with WAC about how he was trained. WAC remarked that he was no different than Gascon, as he had been programmed and Gascon had been trained. Soon, a stampede approached. Gascon and WAC grabbed hold of the animals and they soon lead them to Pons Ora, where they would meet up with D-Squad again. As Gascon was dehydrated, he drank water from the nearby oasis. Before leaving to the oasis, Meebur promoted WAC to Corporal."}, {"tag": "h3", "text": "In Pons Ora"}, {"tag": "p", "text": "When Gascon and D-Squad entered the town of Pons Ora, they discovered that the place was a total dump. The Colonel did not care for the people around the streets, noting the fact that most of them are castaways as well. Gascon knew that he had a mission to finish, but he also knew that he was hungry and needed something to eat. The group stopped in front of a diner named “Power Sliders”. Gascon decided to check out the place and possibly have a meal, but before that he sent out the Astromechs to check the town for unfriendlies.\nWhen Gascon and WAC entered the diner, they were met with hostility from the diner's owner Borkus. Borkus told the Zilkin that the diner does not serve his kind or droids. Gascon was puzzled to what Borkus meant by his kind. Borkus said to Gascon that this was no place that gave food to conduit worms. Gascon just wanted to get the special of the day, but was chased out by Borkus swinging a kitchen knife."}, {"tag": "p", "text": "After escaping with their lives from the angry Sullustan, WAC suggested to Gascon to go in the back of the diner and offered the Colonel to eat some garbage. Gascon was annoyed by WAC's proposal for the Colonel to eat garbage, but WAC countered Gascon's annoyance with the statement that the garbage was still edible. Fed up with everything and very hungry, Gascon set aside his principles and prepared to eat from the garbage pile. At that very moment, the Zilkin was showered with fresh trash from the diner. When the Colonel turned his head up, he saw that the person throwing the garbage was actually a Clone. Gascon jumped on the garbage can that the clone was holding and started inquiring the Clone. It turned out that the Clone named Gregor did not know that he was a Clone. Gregor did not have time to talk to Gascon since he the Clone was being called in the diner by Borkus. Gregor left Gascon and WAC in the alley behind the diner with Gascon still hungry."}, {"tag": "h3", "text": "Recruiting Gregor"}, {"tag": "p", "text": "When Gascon regrouped with the droids, they informed him that there are Separatist droids in the town. The Colonel deduced that if there were enemy forces on the planet then there had to be a landing zone and a shuttle near by. It turned it out to be so. Gascon initially wanted to sneak aboard the ship like they did on Aut-O's cruiser. WAC disagreed since the Battle droids might have their signatures and would not be as easy. Then Gascon decided that the only way onto the shuttle would be by fighting their way through. The Colonel knew and explained that he can not take on so many Separatists droids with the forces he had available – D-Squad. Gascon was determined to get help from Gregor one way or another so he could finish his mission."}, {"tag": "p", "text": "Back at Gregor's home, Gascon and the droids awaited Gregor. Just as Gregor was drinking from a bottle, R2-D2 projected a hologram of Captain Rex that confused Gregor. Gascon walked in to explain to Gregor the whole situation about what he is and what are Clones. Gascon insisted that Gregor was a soldier and to prove to the soldier the truth, he asked R2 to scan his Identifying code on his wrist. The information explained that Gregor was a clone commando and he had gone missing during the Battle of Sarrish. Gascon explained that the battle was one of the Republic's most devastating losses, but he also told Gregor that there was nothing he could do about that battle. The Colonel said that the Commando can help them with their mission and that it depended on Gregor."}, {"tag": "p", "text": "After convincing Gregor, D-Squad had to wait for the Clone to shave himself and then they went to Borkus's diner to look for Gregor's equipment. While everyone was searching, Gascon was walking back and fourth spouting orders that they did not have all night. At that moment the door opened and Borkus walked in the diner. He was carrying Gregor's armor and equipment. Gregor and the droids confronted the Sullustan with Gregor being knocked out by Borkus. Then the droids stepped in and tied up Borkus with their cables. As Gascon and his group were leaving, they learned from Borkus that the Separatists were mining Rhydonium and planning to blow up a Republic cruiser that was orbiting the planet with explosive fuel. Borkus threatened the Zilkin and his friends that the Separatists were going to succeed and D-Squad was going to come back to beg for work in the Sullustan's diner. Gascon was not phased by what Borkus said."}, {"tag": "p", "text": "D-Squad and their new friend Gregor arrived at the landing zone. Gascon ordered Gregor to look around and see what they were up against. It turned out that Borkus was telling the truth and so Gascon said that they had a new mission – stop the Separatists from destroying the cruiser. Gregor told D-Squad that he was going to take care of the enemies while D-Squad makes it for the shuttle. The Colonel liked the plan and so it began."}, {"tag": "p", "text": "Gascon and the droids made their way down to the lower level and closer to the shuttle. At the same time, Gregor was destroying the enemy droids in the way of D-Squad and providing cover. One stray shot managed to hit some Rhydonium canisters that caused them to explode and knock over BZ with the Colonel inside. Gascon told WAC to keep going and leave him. The rest of D-Squad and Gregor made it to the shuttle, but WAC told the clone commando that the Gascon and BZ were still out there. Gregor went back and helped BZ up. Gregor was providing cover fire so Gascon and BZ could make it safely to the shuttle."}, {"tag": "p", "text": "Unfortunately, the Separatists droids were too many and Gregor told Gascon to take off without him. Gascon told Gregor over the intercom that the Clone's sacrifice will not be forgotten and that D-Squad will tell Gregor's story and await for his return. As the shuttle was taking off, Gregor managed to shoot up several canisters with Rhydonium and cause a giant explosion that destroyed the facility. As the facility was blowing up, the shuttle managed to get to the Venator-class Star Destroyer."}, {"tag": "h3", "text": "Stopping the cruiser-bomb"}, {"tag": "p", "text": "When D-Squad landed in the hangar of the Republic cruiser, they noticed that there was nobody on board to welcome them. There was no sight of anybody. WAC was confused by what was happening, but Gascon was reassuring himself and the droids that all will be explained when they find the captain of the vessel.\nOn the bridge, D-Squad found a full contingent of Clone officers. Just as Gascon was preparing to hand off the encryption module to one of them, the strangest thing happened – the officer turned out to be nothing more than a hologram."}, {"tag": "p", "text": "Then the cruiser jumped into hyperspace. That jump led Gascon to believe that somebody was the ship and was controlling it. After looking around the bridge, the Gascon and the droids discovered that the entire ship was hijacked by the Separatists. The Battle droids tried to stop D-Squad, but the Gascon and the Astromechs managed to escaped and hide in the room where the detonator for the bomb was. R2 informed Gascon that the entire ship had been turned into a bomb. A claim the Colonel could not believe, but proven true after all the blast doors opened and revealed hundreds of Rhydonium canisters. Gascon ordered everybody to evacuate, but only when the cruiser comes out of hyperspace."}, {"tag": "p", "text": "D-Squad managed to find a lonely LEP servant droid named “Bunny” who told Gascon that there were more crew members on board. Gascon was disappointed to find out that they were all droids and hiding the D-Squad's shuttle. On the shuttle, Gascon learned from the “Bunny' that the ship was heading for Carida system and was to designated to blow up the Valor space station. The Zilkin decided that D-Squad had to do something about the situation and just as he was wondering what to do, D-Squad noticed that they were being watched by a buzz droid. It tried to escape, but the entire group of Republic droids gave chase and tried to stop it."}, {"tag": "p", "text": "The chase led the Gascon and droids to one of the cruiser's gun batteries. Everybody started searching for the buzz droid, but at that moment Gascon noticed that the entire sealing of the room was covered with buzz droids. It turned out that D-Squad was surrounded by dozens upon dozens of buzz droids. The Republic droids tried to defend themselves against the attacking buzz droids. WAC asked Gascon if he had some strategy for this situation. The Colonel replied that he did not know what how to handle so many buzz droids. Then BZ told Gascon to get out of his head and BZ went to open the airlock. Everybody magnetized their feet as BZ just opened the airlock and with that sucked all the buzz droids into hyperspace. Gascon ordered BZ to also magnetize, but it was too late. BZ went out with the buzz droids. Barely holding on to the antenna of one of the droids, Gascon ordered R2-D2 to secure the room by closing the airlock. After that was done, R2 asked Gascon to say something to honor BZ's sacrifice. Gascon decided that the only way to honor BZ was to stop the ship from hitting the space station over Carida."}, {"tag": "p", "text": "On their way to the shuttle, Gascon briefed everybody on the plan – he was going to get the injured droids to the shuttle and distract the Battle droids while R2 went to the detonator and programmed it to explode early. Just as R2 left, Gascon and the rest of D-Squad stumbled upon Separatist droids that started shooting at them. Gascon managed to get the Republic droids to the shuttle and went off with C4 to distract the Battle droids. The hijacked cruiser arrived at Carida. During the chaos on the ship, Gascon and C4 flew up to check on R2's progress. The Colonel was worried that R2 would not be able to get to the shuttle in time so he wanted to delay the launch of the shuttle. On the shuttle, Gascon was ordering D-Squad that they had to go back and help R2 with the Super tactical droid, but all of a sudden WAC started the engines and took off without R2. The shuttle flew off the ship just in time when R2 detonated all the Rhydonium and saved the space station."}, {"tag": "p", "text": "In the middle of debris, Gascon contacted the space station. The person who answered was Anakin Skywalker. The Jedi wanted to know where was R2. Gascon regretfully told him that R2 was on the ship when it exploded, but assuring Skywalker that R2 did not go for nothing since he saved everybody on the space station. General Skywalker sent out search parties to find R2."}, {"tag": "p", "text": "Eventually, Gascon arrived on the station and found out that R2 had survived the massive explosion. The Colonel commended R2-D2 and told all the droids that he would be happy to serve with them again any day. WAC then informed Gascon that they all were assigned to the same platoon and that they will be together for the rest of the war. This news brought Gascon to tears."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gascon's design was based on previously unused pre-production concept art from The Phantom Menace, for the character who would eventually become Jar Jar Binks."}, {"tag": "p", "text": "His voice was provided by veteran Clone Wars actor Stephen Stanton. Stanton also provided the voice of season four's Moralo Eval—both the Gascon and Moralo story arcs were written by Brent Friedman."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}