{"url": "Meena_Tills/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Females", "Category:Galactic Republic senators", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Meena Tills"}, {"tag": "p", "text": "Meena Tills was a female Mon Calamari and the senator of Calamari sector together with the Quarren Tundra Dowmeia during the Clone Wars. Tills and Dowmeia replaced former Senator Tikkes, who defected to the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Early in the Clone Wars, in 22 BBY, Tills was kidnapped and held hostage at the Galactic City Spaceport on Coruscant by a group of Korunnai terrorists from the planet Haruun Kal. After a lengthy stand off with the Coruscant Security Force and the brutal murder of a Jedi negotiator, Tills and the other hostages at the spaceport were rescued by Null ARC trooper N-11 and the clone commandos of Omega Squad."}, {"tag": "p", "text": "Around 21 BBY, during the Clone Wars, Tills was present during a second battle of Dac, as the Mon Calamari people sided with the Republic, while the Quarren were backed by the Confederacy of Independent Systems. Tills was caught in the midst of this conflict, advising where she could while under the protection of the Jedi and clone troopers."}, {"tag": "p", "text": "She was later present in the Galactic Senate when it was announced that interest rates on the Republic would be raised by the Banking Clan because the Separatists were refusing to pay their loans. She expressed her concerns along with Senators Mot-Not Rab and Kin Robb. When Senator Robb called for a counter-invasion in order to seize the banks, Tills supported her."}, {"tag": "p", "text": "A staunch Loyalist, she was one of the leading political figures behind the Delegation of 2000, a movement in the Galactic Senate that opposed Supreme Chancellor Palpatine staying in power. She was part of the group that presented the Petition of 2000 to Palpatine following the Battle of Coruscant. The document would later be used to incriminate many Loyalists, including Tills, under the Galactic Empire."}, {"tag": "p", "text": "After the formation of the Empire, Senator Tills was arrested and her people and planet were enslaved. However, she eventually escaped captivity, and was eventually issued with a bounty on her head sometime prior to the Battle of Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2011, the Star Wars: The Clone Wars television series episode \"Water War,\" changed Tills' gender from male to female. This discrepancy establishes a continuity error, as Tills, who first appeared in George Lucas' 2005 film Star Wars: Episode III Revenge of the Sith, was introduced as a male and was such in various sources following the film. Supervising Director Dave Filoni later clarified that change to be based on the character's original namesake, Lucasfilm employee Tina Mills."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}