{"url": "Meerian", "categories": ["Category:Legends articles", "Category:Human and Near-Human species", "Category:Meerians", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Meerian"}, {"tag": "p", "text": "The Meerians were a race of short, silver-haired Near-Humans indigenous to the planet of Bandomeer."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Meerians were small and wiry, averaging only 1.1 to 1.6 meters tall. Despite their size, they were relatively strong. Their hair color ranged from pale silver to bright gold, and their skin was very pale, due to the lack of sunlight on their planet. Their eyes did not have pupils, and often matched the color of the individual's hair. Throughout the centuries of pollution on Bandomeer, the Meerians developed the ability to breathe in toxic air, with their noses and tongues working in tandem to filter the air."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "As a people, the Meerians were a slow, deliberate race. They were optimistic, agreeable, and sympathetic to others' needs, and had an innate ability to see both sides of an argument. This made it difficult for them to reach a consensus, however."}, {"tag": "p", "text": "Due to the takeover of their planet by cold-hearted mining companies, some Meerians developed a selfish mentality that contrasted with the older, more helpful philosophies. These Meerians would often take their credits and leave the planet."}, {"tag": "p", "text": "Meerians preferred to speak to others eye-to-eye, believing this was the only way all participants in a conversation would be seen as equals. While dealing with species of a taller stature, they would use seats with repulsorlifts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For much of their history, the Meerians had no contact with offworlders, until Galactic Republic survey teams landed on their planet. Soon, the mineral riches of Bandomeer were discovered, and several mining conglomerates essentially took over the planet. At this point, the Meerians were so primitive that they held no sway over the mining companies or the Republic. Although the Republic Senate later recognized the Meerians as the true owners of Bandomeer, and they began to profit from the mining, they exerted little control over the fate of the planet. By the waning years of the Republic, Bandomeer had been dominated by the mining companies for hundreds of generations."}, {"tag": "h2", "text": "Examples of Meerian names"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}