{"url": "Meetra_Surik%27s_armband", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Arm-guards"], "nodes": [{"tag": "h1", "text": "Meetra Surik's armband"}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Meetra Surik's armband appeared red, while providing more health and resiliency to the Jedi. It was similar to many other armbands of the era in its appearance, and it could be worn on either arm. Unique in construction, it was usable only by Surik."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3951 BBY, at the height of the Dark Wars, Human Jedi Knight Meetra Surik returned to Republic space after her exile to the Unknown Regions for defying the Jedi Council's wishes during the Mandalorian Wars. She was taken as a passenger on the Republic Hammerhead-class cruiser Harbinger, with her armband among the possessions she kept in her cabin aboard the ship. When Sith assassins led by Darth Sion infiltrated the starship, Meetra Surik was evacuated to a small freighter, the Ebon Hawk, and escaped without her belongings. During the escape, Ebon Hawk was damaged by Sith fire, and it barely managed to make an emergency jump to hyperspace before it ended up drifting and consequently harboring in a mining facility on one of the asteroids of the Peragus asteroid field."}, {"tag": "p", "text": "When the Harbinger docked to the mining facility in pursuit of the Jedi, Surik and her new companions used the ship as an escape route. While going through the now Sith-controlled cruiser, Surik recovered her armband from the cabin she occupied while being a passenger on the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Meetra Surik's armband was created for Obsidian Entertainment's 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords. In the game, the Jedi Exile is named according to the player's choosing, and the armband gains the name accordingly. In the Xbox version of the game, the armband is called \"Jedi Exile's armband\" while in the PC-version it's referred to as \"Jedi Exile's band\" or \"Jedi Exile's armband.\" This article uses the more comprehensive naming of the two. In the 2011 novel The Old Republic: Revan, the name of the Jedi Exile was confirmed to be Meetra Surik. The band provides +1 to the constitution attribute of the playable character, which affects maximum health and resiliency in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}