{"url": "Meetra_Surik%27s_first_lightsaber", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Meetra Surik's first lightsaber"}, {"tag": "p", "text": "Meetra Surik's lightsaber was the personal weapon of the Jedi Knight Meetra Surik, more commonly known as the Jedi Exile."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Meetra Surik constructed her Jedi lightsaber some time before the Mandalorian Wars. During the War, she would use it against the Mandalorian Neo-Crusaders conquering the galaxy in a number of battle such as Eres III, Onderon, Dxun, Duro and eventually the Battle of Malachor V."}, {"tag": "p", "text": "After the war's end, Surik was called to the Jedi Temple to answer for her actions during the conflict. Despite an impassioned plea, the Jedi High Council decreed that because she had followed Revan to war, she was to be cast out of the Jedi Order. In defiance when they asked for the surrender of her lightsaber, she stabbed it into the center stone of the High Council Chamber. During the following years, the weapon was kept in the Jedi Enclave on Dantooine."}, {"tag": "p", "text": "When the Jedi Civil War broke out, Jedi Master and historian Atris evacuated most of the Jedi historical materials, including holocrons and Surik's lightsaber, to the academy on Telos IV in case of an attack. Five years later, Meetra Surik found Atris on Telos during her search for the Lost Jedi. The Jedi Master refused to return her the lightsaber which had become for the historian a symbol of the violence of the Mandalorian Wars corrupted by the Dark side. But the Exile later discovered that Atris had in fact become a Dark Jedi. Meetra Surik returned to the Academy and clashed successfully with the historian in a lightsaber duel, allowing her to recover her first lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cut content: during Atris' battle with the Exile, it was planned she would use the Exile's first lightsaber against her, claiming it is not hers to wield anymore."}, {"tag": "p", "text": "The lightsaber is customizable through a discussion with Atton Rand; the player can choose to make it single or double-hilted and what color the crystal was. Whatever choices the player makes, Atris will reveal the lightsaber when conversing with the Exile. Choosing not to discuss with Atton about the lightsaber makes it a single-hilt with a cyan blade (coincidentally, the only color not available in the dialogue choices)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}