{"url": "Meetra_Surik", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:Exiled Jedi", "Category:Females", "Category:Force ghosts", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Masters of the Jedi Order", "Category:Khoonda Militiamen", "Category:Onderon Royalists", "Category:Revanchists", "Category:Swoop racers"], "nodes": [{"tag": "h1", "text": "Meetra Surik"}, {"tag": "p", "text": "Meetra Surik, also known as the Jedi Exile after the Mandalorian Wars, was a female Human Jedi Master. As a Padawan, she chose to disobey the orders of the Jedi High Council and aid the Galactic Republic in its war against the invading Mandalorian Neo-Crusaders. Rising to the rank of Jedi Knight during the conflict, she served with distinction under the command of her fellow Crusaders Revan and Malak and was eventually commissioned as a General in the Republic Military. Surik played a vital role in defeating the Mandalorians during the latter stages of the conflict, but as a direct result of her controversial actions during the cataclysmic final battle, she effectively cut her connection to the Force. Afterwards, out of all those who went to war, she was the only Jedi to avoid the call of the dark side and return to the Jedi Council to be judged for her crimes. After being exiled from the Jedi Order, she wandered the periphery of known space for nearly a decade before returning to the Republic during the Dark Wars, at the height of the First Jedi Purge."}, {"tag": "p", "text": "Caught up in the schemes of various mysterious factions, she was swiftly drawn into the ongoing conflict and became instrumental in engineering the defeat of the Sith Triumvirate, ruled by Darth Nihilus, Darth Sion and Darth Traya. With her connection to the Force restored, Surik emerged victorious from her campaign against the Sith Lords, and immediately began a search for the long absent Jedi Revan. She eventually found Revan imprisoned on Dromund Kaas, the capital world of a Sith Empire, believed to have been destroyed over a thousand years prior. Surik joined Revan in his mission to kill the Sith Emperor, who had been plotting an invasion of the Republic for centuries. She, Revan and Lord Scourge joined forces in their common cause and attacked the Emperor. However, Scourge seemingly betrayed his Jedi allies and stabbed Surik from behind, killing her instantly. Her death helped Revan in delaying the Emperor and his plans."}, {"tag": "p", "text": "Surik did not become one with the Force at the time of her death; instead, her spirit stayed with Revan and helped him to endure the horrors of his imprisonment in stasis. In the following years after her physical demise, the Jedi that she trained during her travels proved essential to the process of rebuilding the Jedi Order, in the wake of its near annihilation due to the machinations of the Sith. When the Sith Emperor finally unleashed his army against the Republic three centuries later, Surik's spirit instructed Jedi Master Oteg to dispatch a team to free Revan from his prison on Taral V. After urging Revan to fulfill his objective and destroy the Emperor, Surik disappeared. Years later, Surik later joined with the legendary Alliance Commander and many of history's greatest champions to battle the reassembling vestiges of Vitiate's essence, destroying the Emperor once and for all. Surik became one with the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Jedi training"}, {"tag": "p", "text": "As a child, Surik was initially found and separated from her parents by the Jedi Order. Like many pre-Jedi younglings of her day, Surik started her training as a Padawan at the Jedi Enclave on Dantooine. She was taken as an informal Padawan by the Jedi Knight Kavar. After Kavar left to fight the Mandalorians in the early skirmishes, she trained under many Masters, including Vima Sunrider, daughter of the famed Nomi Sunrider. Master Sunrider would often caution the young Surik to be mindful of her powers, especially her aptitude for severing one's connection to the Force."}, {"tag": "h3", "text": "The Mandalorian Wars"}, {"tag": "p", "text": "When the Mandalorian Neo-Crusaders launched an invasion of the Galactic Republic, Surik had overwhelming compassion for the lives lost in the Outer Rim. Inspired by her former Master Kavar, who had fought in the early skirmishes, she soon joined the ongoing battle, and became part of the Jedi Knight Revan's faction of Jedi after being personally recruited by Malak himself. She left a prospective Padawan, Mical, without a Master."}, {"tag": "p", "text": "Surik served as one of Revan's most trusted generals during the Mandalorian Wars. She would prove her skills in battle and her knowledge of warfare in many of the war's bloodiest battles and campaigns, including the second battle of Onderon's jungle moon Dxun. She also attained the rank of Jedi Knight during the war, but no knowledge is known as to how this happened."}, {"tag": "p", "text": "Overseeing the final battle at the Sith planet Malachor V, she gave the order to activate the Mass Shadow Generator when it was clear that the bulk of the Republic's forces, led by Revan, would not arrive in time to engage the Mandalorian armada. She watched silently from the bridge of her command ship as the generator crushed both the Republic and Mandalorian forces caught in its destructive wake. The ensuing death and destruction, particularly that of the comrades she had led and befriended during the war caused such a substantial wound in the Force that the shock would have killed Surik had she not unconsciously, and instinctively, severed her own connection. Thereafter she was deafened to the Force's call; incapable of sensing it through the interference caused by the Force echoes of the suffering that she had inflicted and been forced to witness. The only Jedi under Revan able to turn away from the dark side after Malachor V, she was also the only Jedi to willingly return to the Jedi Temple on the Galactic Capital Coruscant and face trial for her actions—and also to defend them. Malak originally wanted Revan to use his assassin droid HK-47 to eliminate Surik, but Revan, who referred to her as a Jedi \"who was already dead,\" wanted her to face the Council and show them the hypocrisy of their teachings, and so let her leave."}, {"tag": "p", "text": "Despite an impassioned plea, the Jedi High Council decreed that because she had followed Revan to war, she was to be cast out of the Jedi Order. In defiance when they asked for the surrender of her lightsaber, she stabbed it into the center stone. After she left, the Council discussed the true nature of her exile; they feared the \"wound\" in the Force that surrounded her. Some on the Council, most notably Jedi Master Zez-Kai Ell, felt that they were punishing her not because of what she did, but because she was symbolic of the many Jedi that had fallen to the dark side over the course of history. These Council members felt that she was the perfect opportunity to examine why and how so many Jedi fall to the dark side. But more conservative Council members, such as Master Atris, felt that the Council was too lenient on Surik, fearing that she may join Revan. The Council, however, felt that the wound in the Force already left Surik dead."}, {"tag": "h3", "text": "The Dark Wars"}, {"tag": "p", "text": "Full details of Meetra Surik's adventures in the Outer Rim are unknown, but it is known that Atris had orchestrated the Exile's return to known space. In order to trick the Sith into revealing themselves, Atris leaked her return to the galaxy and, predictably, attracted the attention of the Sith Triumvirate. Surik's return from exile into Republic space occurred in 3951 BBY, in a time where Revan had vanquished Darth Malak and the last of the Jedi were being hunted down and exterminated. The Harbinger, a Republic cruiser bound for Onderon, had been ordered by the Republic admiral Carth Onasi—a veteran of the Mandalorian Wars and the Jedi Civil War—to abort the planned trip and head to the Outer Rim in order to pick up Surik. It was requested she be given status as a diplomatic passenger and escorted to Telos IV, though it was made clear that she was to be given no special treatment nor to make any indications of her identity."}, {"tag": "p", "text": "During the trip to Telos, the ship received a distress call from a low-stock freighter, claiming to be engaged in a firefight with a Sith warship. When the Harbinger arrived, they found the ship derelict; after the crew boarded the vessel they found it to be empty, save for the battered body of Sith Lord Darth Sion. The Ebon Hawk, a small freighter that once had played a major role in the Jedi Civil War, also seemingly deserted, was picked up as well. In the next few days, crew aboard the ship began to disappear; when Darth Sion finally awoke, saying that he had come for the Jedi, cloaked Sith assassins revealed themselves and slaughtered the ship's crew \"en masse.\" In the ensuing chaos, it went unnoticed that an HK-50 series assassin droid unit had drugged Surik and sealed her away. As the ship died around them, a former Jedi Master named Kreia—who was the exiled Sith Lord Darth Traya—found Surik, brought her back to the Ebon Hawk and attempted to flee. Unfortunately, they attracted the attention of the now fully-operational warship, which fired on the freighter, damaging it severely and nearly killing both Surik and Kreia. With the help of the utility droid T3-M4, Surik was taken care of and the Ebon Hawk was guided to the nearby Peragus Mining Facility."}, {"tag": "p", "text": "When Surik awoke from her torpor in the mining facility's medlab, she found Kreia unconscious. After Kreia awoke and told Surik that they had to find a way off the station, she found the facility to be completely abandoned except for malfunctioning mining droids, which attacked Surik on sight. To add to the mystery, Surik's severed Force connection slowly began to return; while searching for a way off the station she found a male scoundrel named Atton Rand, who was imprisoned within a force cage in the station's brig. After Darth Sion and a group of Sith Assassins arrived on the Harbinger intending to kill Surik, believing she was the last of the Jedi, the three escaped with T3-M4 aboard the Ebon Hawk, but not before Sion sliced off Kreia's left hand. They then traveled to Telos, since it was the only available destination in the Peragus facility's navigational charts. While being pursued by the Sith in the asteroid field around Peragus, laser fire from the hijacked warship ignited the volatile fuel within the asteroids. The resulting explosion destroyed both the facility and the planet itself, though the Ebon Hawk and the Sith on board the Harbinger were able to escape."}, {"tag": "p", "text": "When Surik and her crew arrived at the massive Citadel Station in orbit around Telos IV, the Ebon Hawk and T3-M4 were stolen and brought to the Telosian surface where they were held for questioning about the Peragus explosion. After a Telosian investigation proved their innocence, they were asked by Lieutenant Dol Grenn to stay on-station until the Republic's inquiry was complete. Instead, Surik allied herself with the Ithorian Force Adept Chodo Habat, eventually gathering enough evidence to expose Jana Lorso, the executive of the Czerka outpost on the Citadel Station. After gathering the necessary evidence to bring Lorso down, and after Surik saved Habat from mercenaries hired by Czerka to kill him and his herd, he allowed Surik and her companions to use one of their shuttles to reach Telos' surface, where they were shot down by a Czerka air defense tower. An Iridonian Zabrak engineer named Bao-Dur, who had designed the Mass Shadow Generator and served under Surik at Malachor V, saw the crash and pulled the three unharmed from the wreckage."}, {"tag": "p", "text": "While on the surface, they learned that the Ebon Hawk had been taken to the old planetary aqueducts in the polar region of the planet. Commandeering a shuttle from an abandoned military compound, Surik and her companions traveled to the aqueducts and found Jedi Master Atris there, a former member of the Council that sentenced Surik into exile. Atris was attempting to recover lost Jedi teachings and had surrounded herself with several Echani sisters. These sisters, known as Handmaidens, had vowed not to learn the ways of the Jedi. After a heated debate over what the Jedi should have done during the Mandalorian Wars, Surik and her party left with the Ebon Hawk and T3-M4. When they left, T3-M4 revealed that he had managed to download Atris's database while being held, including a recording of Surik's trial and records of where the last five remaining Jedi Masters were hiding: Atris on Telos, Kavar on Onderon, Vrook Lamar on Dantooine, Zez-Kai Ell on Nar Shaddaa, and Lonna Vash on the Sith tombworld Korriban. Coincidentally, although Kreia believed otherwise, these were the same five Jedi on the Council that cast Surik out of the Order to become the Exile. However, Brianna was ordered by Atris to sneak aboard the Ebon Hawk and aid Surik in her mission in order to monitor her activities and in order to confirm that Surik still served the Light side of the Force. The crew, together with its newest member, went off to these worlds in search of the Jedi in an attempt to unite them against the Sith and to find the answers as to why Surik was sentenced to exile."}, {"tag": "p", "text": "During her adventures, Surik met many beings who became her companions. She found many of them to be Force-sensitive, and thus she trained them in the Jedi ways. During this time the Dark Lord of the Sith Darth Nihilus had sent his Shadow Hand, the Miraluka Visas Marr, to assassinate Surik. However, after a brief lightsaber duel she was able to redeem Marr, accepting her into the ship's crew and retraining her in the ways of a Jedi Sentinel. With Marr gained as an ally, Surik knew she could not hide her presence for long, however she also knew that she had an inroad into finding at least one of the Sith Lords who hunted her. Surik also helped Bao-Dur overcome his guilt over the lives lost at the Battle of Malachor V, and trained him in the ways of a Jedi Guardian. When two Twi'leks on Nar Shaddaa warned Surik about Atton Rand - saying he was a killer and not just a soldier - she approached Rand about this. Initially upset about being asked about his past, Rand however revealed his past as a soldier under the Republic during the Mandalorian Wars, and as a Sith trooper during the Jedi Civil War. He told her that he decided to leave the Sith after he killed a female Jedi, with whom he fell in love, after she showed him the Force. After Surik forgave him for killing that Jedi and welcomed his honesty, Rand asked her if she would train him to be a Jedi. Surik agreed, and began training him as a Jedi Sentinel."}, {"tag": "h4", "text": "In search of the Lost Jedi"}, {"tag": "p", "text": "Surik endeavored to stabilize the political conditions on several planets: on Nar Shaddaa she helped the refugees who were being exploited by the Exchange criminal organization, destabilizing its operations on the moon by killing the Quarren crime lords Saquesh and Visquis. She also destroyed the crime lord G0-T0's flagship, the Visionary. G0-T0 himself went along with Surik in hopes of stabilizing the galaxy. He later admitted to her that he was the droid intended for the Telos Citadel Station. She then met with Jedi Master Zez-Kai Ell and convinced him to go to the ruins of the Dantooine Jedi Enclave. After Surik's exploits on Nar Shaddaa, she discovered that the bounty hunter Mira, who joined her party on Nar Shaddaa, was Force-sensitive, and she showed Mira how to harness the Force."}, {"tag": "p", "text": "When Surik and her crew traveled to Onderon, the Ebon Hawk was attacked by one of General Vaklu's commanders, Colonel Tobin. After destroying the Onderonian starfighters sent to intercept the Ebon Hawk, they were forced to land on Dxun, the moon of Onderon where she fought during the Mandalorian Wars. After completing various tasks, the Mandalorian leader on Dxun, Mandalore the Preserver, allowed Surik to take one of their shuttles to Iziz, the capital of Onderon. After gaining contact with Jedi Master Kavar in the Iziz Cantina, Tobin interrupted the meeting, forcing Kavar to flee, but not without promising to contact her when he was able. Surik and Mandalore killed Tobin's forces that attacked them in the cantina and the western square, and proceeded to leave the city. After they returned to Dxun, Mandalore joined Surik not only because he felt she need an ally against the Sith, but because he intended to look for Mandalorian clans on other worlds so that he could reunite them under \"his\" leadership. She then helped Mandalore in finding scattered clans on Nar Shaddaa and Dantooine."}, {"tag": "p", "text": "When she traveled to Dantooine, she met with Terena Adare, who was the Khoonda outpost's administrator. Adare granted Surik permission to search for Vrook Lamar in the Jedi Enclave's ruins. Surik met a scientist and historian named Mical, who was Surik's prospective Padawan before she left to fight in the Mandalorian Wars; he joined her crew and she eventually re-trained him as a Jedi Consular. After rescuing Lamar from being shipped to Nar Shaddaa by a band of mercenaries in the Crystal Cave, she was confronted by the mercenary leader Azkul, a veteran of the Jedi Civil War who was trained at Darth Malak's academy. Azkul asked Surik to join him and take over Khoonda; however, she refused, and he left, ordering the mercenaries accompanying him to kill her. After defeating them, she returned to Khoonda, bolstered its defenses and finalized the battle plans with the local militia leader, Zherron. She and Lamar fought in the ensuing battle, killing Azkul and his mercenaries. Having successfully defending Khoonda, she spoke with Lamar, and convinced him to meet with the other Jedi Masters she would find at the Academy."}, {"tag": "p", "text": "Surik eventually received a message from the Mandalorian Kelborn, telling her that he had received a message from Kavar. She traveled to Dxun, where Kelborn told her that Vaklu met with the Council of Lords, and had them declare Queen Talia, who was his cousin, guilty of treason. Kreia sensed something stirring on Dxun, and asked Kelborn whether or not they picked up anything on their sensors. Kelborn confirmed that they had, and Surik sent three members of her crew to deal with the Sith forces at the tomb of the ancient Sith Lord Freedon Nadd. She then traveled with Kreia and one other crew member in a Basilisk war droid provided by Mandalore."}, {"tag": "p", "text": "After Surik and her companions landed in Iziz, they made their way to the Royal Palace, assisting Captain Bostuco in defeating Vaklu's exterior forces. When she made her way into the palace, Tobin locked the door that led to the Queen's throne room; after overriding the security codes, she killed the drexl larva that Tobin and the Sith forces used to breach the throne room. She then assisted Talia's forces in fighting Vaklu's soldiers, killing all but four. After Vaklu ordered the four remaining troops to kill Talia, Kavar and Surik intervened, killing them and defeating Vaklu. Kreia then tried to convince her to have Talia execute Vaklu, who was unarmed at the time, claiming he was too dangerous to be left alive. Surik, while respecting her counsel, said that the decision was the queen's to make, not hers. Talia then ordered her troops to execute Vaklu, ending the Onderon Civil War. After the battle, Surik spoke with Kavar, who said he would meet with her and the Council on Dantooine."}, {"tag": "p", "text": "Surik went in search of the Jedi Master Lonna Vash on the ancient Sith homeworld of Korriban. After Kreia telepathically guided her through the Valley of the Dark Lords, she entered the abandoned Sith Academy and found that Darth Sion had killed Vash no more than an hour after they landed. Before Surik and her companions escaped the Academy, they were confronted by Sion, who told her that he studied and \"immersed\" himself in her, and that he knew of the paths she walked in exile. He said that he knew her teacher, Kreia, and of the fires that raged on Dxun while the Republic died around her. Sion further stated that she knew of war and battle, and said that he knew of Malachor. Sion said that Surik knew what it meant to be broken, and warned her that Kreia would destroy her as she had destroyed him and said that he could end her suffering at Kreia's hands before it began. With these words, Surik and her companions fought the Lord of Pain, striking him down multiple times. However, the Dark Lord would recover from the fatal injuries and keep fighting. Through the Force, Kreia informed Surik that Sion was not a beast of flesh and blood, and that it was not a battle that could be won. She told her that while there would be another opportunity, now was not the right time—not while Korriban ran through Sion. Surik thanked Kreia for the information, and she and her companions fled the Sith Academy."}, {"tag": "p", "text": "While exploring the shyrack cave near the Sith Academy, she found the hidden tomb of the Sith Lord Ludo Kressh. When she went inside, Surik was forced to confront many of her own personality traits as well as many of her past choices and regrets. This took the form of a series of visions, during which she witnessed a twisted version of when she was recruited by Malak, a recollection of her actions during the second battle of Dxun, an illusionary confrontation between Kreia and various members of her party, and finally a silent apparition of Darth Revan, with whom she did battle. During these sequences, much of her character was revealed, determined by her choices."}, {"tag": "p", "text": "After locating and conversing with all of the remaining Jedi Masters, Surik returned to Dantooine to find the rebuilt Jedi Enclave. There, Masters Lamar, Kavar, and Ell had formed a Council in which they would decide her fate. The Masters concluded that, through her actions at Malachor V, she had become a wound in the Force. They stated that she carried the deaths of all who died in the battle within her, and that she regained her connection to the Force by feeding on death and leeching the life energy of her companions. According to the Masters, the Sith had learned their ability to feed on the Force from her, and thus she was a threat to all living beings, and possibly the Force itself, and in time she might possess the same magnitude of power like Darth Nihilus and ultimately consume the galaxy, which wasn't true. However, they deemed it necessary that she be stripped of the Force with or without her consent; she submitted to their sentence. Having re-established her previous sentence of exile, they attempted to strip her of the Force, but before they could finish, Kreia stormed into the meeting to save Surik at the last moment. Surik, still under her stasis established by the reconvened Jedi Council, was left helpless and watched as Kreia, who revealed her identity as the former Sith Lord Darth Traya, used the Force to drain the Jedi Masters of their powers, putting them through the same suffering Surik had felt on Malachor V. However, the Jedi did not let go of the Force; they died as a result of their dependency on the Force."}, {"tag": "h4", "text": "Against the Sith Triumvirate"}, {"tag": "p", "text": "After Kreia left, Meetra Surik finally regained her strength and departed for Telos IV to find and confront her. There, she found Brianna defeated at the hands of a corrupted Atris. In order to save Brianna, Surik was thus forced to confront Atris, who had fallen to the dark side and, in Kreia's words, become a Darth Traya. After Surik defeated Atris, the victor persuaded the fallen Jedi Master to forgive her and helped Atris see the folly of her beliefs. Atris then told Surik that Kreia had fled to Malachor V to wait for her there for a final confrontation, and confirmed her identity as one of the Lords of the Sith, one of those that had murdered the Jedi. After the duel, Brianna pledged her allegiance to Surik, renouncing her title of Last of the Handmaidens, and embracing her true name. Surik then left Atris in the Academy until her role in nearly destroying the Jedi could be judged by Surik's apprentice Mical and the new Jedi Council. Shortly thereafter, Surik participated in the Battle of Telos IV and faced off with Darth Nihilus on the bridge of his flagship Ravager to keep him from destroying Telos, which he was doing to fuel his hunger for the Force. With the assistance of Nihilus' former Sith apprentice, Visas Marr, and Mandalore the Preserver, Surik faced the Dark Lord. He proved a formidable opponent and managed to stun Surik, at which point Marr offered her life in exchange for sparing Surik's life. This distracted Nihilus long enough for Surik to recover. Marr used her bond with the Dark Lord to weaken the Dark Lord, the team vanquished him, and then they proceeded to Malacor V for a final confrontation with Kreia."}, {"tag": "p", "text": "After crashing on the surface of Malachor V, Surik proceeded to the Trayus Academy despite mentally sensing the anguish of all whom had perished there and physically feeling the effects of the intense gravity of the planet crushing down on her, something she would later recount as one of the worst moments of her life, she nevertheless continued and demonstrated her strength with the Force and her skill in lightsaber combat against hordes of Sith Assassins, Lords, and Marauders before confronting and defeating Darth Sion himself multiple times. Surik persuading Sion to let go of his hatred and his life; to finally succumb to his numerous injuries and die. Meetra Surik then confronted and tried to save Kreia. But Kreia would not have it; though she was warmed by the thought that her former pupil would still care enough to try and \"save\" her. She vowed that this confrontation could only end in death, and that if Surik would not fight her, she would break her as she did Sion. After a fierce but short battle, Surik severed Kreia's remaining hand, as well as their Force bond in a single stroke. Satisfied that their bond would soon be no more, Kreia requested at Surik to finish her. However, Meetra Surik chose not to violate the symbiosis of life and the Force; the Jedi Exile did not kill her mentor."}, {"tag": "p", "text": "Enraged that Surik was not letting go, Kreia continued to battle by animating three lightsabers to do battle for her through the Force, until Surik had no choice but to strike her down. Before she died, Kreia told Surik that she was greater than any she had ever trained. In her final moments, Kreia gave Surik information about Revan's location in the Unknown Regions, and about the future fates of Surik's allies; the planets they had visited, and the future of the Republic. Shortly after Kreia's death, Bao-Dur's remote reactivated the Mass Shadow Generator in order to completely destroy the planet. The crew of the badly damaged Ebon Hawk retrieved Meetra Surik and escaped the planet."}, {"tag": "h3", "text": "Troubled peace"}, {"tag": "p", "text": "After Kreia's final lesson and the fall of the dark Jedi, Surik returned to Dantooine to complete her retraining as a Jedi. But it was not long before Surik's droid, T3-M4, revealed that he had been carrying information about Revan's fate the entire time he had been in her possession. The droid stubbornly refused to show the information to anyone other than Bastila Shan, and so Surik took the droid to Shan's home on Coruscant. Together, the two watched as T3 revealed that the Ebon Hawk had crashed on the dead planet Nathema, once a member world of the Sith Empire. As they watched, the recording revealed that Revan had been captured by a Sith male—a race thought extinct since the end of the Great Hyperspace War. Unbeknownst to them, this Sith was Lord Scourge."}, {"tag": "p", "text": "Recognizing the threat that the individual posed, and spurred on by her continued unpopularity amongst the older and more conservative ranks of both the Republic and the surviving Jedi Order, Surik resolved to rescue Revan from whatever fate had befallen him. Before Surik's departure, Shan revealed that she possessed Revan's mask. She presented it to Surik to return to Revan, in the hope that it would restore his memories and aid in his escape. Leaving her apprentices behind to resurrect the fallen Jedi Order, Surik and T3 boarded the Ebon Hawk and set off for Nathema."}, {"tag": "h3", "text": "A new journey"}, {"tag": "p", "text": "Arriving on the planet, Surik immediately became disturbed by The Void to the point of feeling physically ill. In contrast to the feelings of horror in death that she could feel at Malachor V, Nathema was just dead. The once-populated, once-agricultural world had no living things of any kind anywhere on the planet, and the whole world was a dead spot in the Force. Surik and T3 located a government building and sliced into its network to retrieve files on the nature of the planet. After returning to the Ebon Hawk, Surik fled the system as fast as the Ebon Hawk would fly before pouring over the information that T3 had retrieved. She quickly learned that the world had survived the end of the Great Hyperspace War, and had been ruled by a being of immense power known as Lord Vitiate."}, {"tag": "p", "text": "After the war, she read, Vitiate had called many of the surviving Sith leaders to his world to discuss the future of their kind. The Sith Lords had arrived on Nathema, but shortly afterward all records of every kind ceased to be recorded. Surik surmised that Vitiate had invited the other Sith Lords to his planet as a trap, and once they arrived, had enacted the Sith sorcery that had destroyed the world. Through fortunate happenstance, Surik also learned that Vitiate had had his people searching for Dromund Kaas, a long-lost colony world of the Sith. With T3's expert slicing skills, they were able to determine both the location of the world as well as a safe hyperspace route. With this knowledge, the pair set course for the unknown world and left Nathema silent once more."}, {"tag": "p", "text": "The Ebon Hawk was able to land on Dromund Kaas without incident; the capital of the Sith Empire evidently believing itself invulnerable to attack or infiltration, since the Empire had been unknown to the Republic for over a millennium. Through several intermediaries she was able to buy off, Surik was finally able to arrange a meeting with the Sith from T3's recording. Though the meeting was initially marred by a skirmish in which Surik slayed the four soldiers he had brought along as escort, she found herself in the curious position of having a civil—if tense—conversation with Scourge. He informed her that Revan was a prisoner of his own master, Darth Nyriss, and that Revan had foretold of her coming to rescue him. The two eventually agreed to an alliance of convenience, because they shared the common goal of stopping the Sith Emperor's plan to invade the Republic."}, {"tag": "p", "text": "Surik agreed to wait while Scourge arranged circumstances where they would best be able to free Revan from captivity. With his own intelligence and resources, Scourge schemed to destroy Darth Nyriss by exposing her and the other Dark Council members' intrigues against the Emperor to him. The Emperor's retaliation was swift and brutal. Surik and Scourge were able to take advantage of the chaos as the elite Imperial Guard units assaulted Nyriss' personal compound, killing every soldier, charge, and slave loyal to the traitorous Sith lady. Amid the chaos, Surik and Scourge were able to infiltrate the detention area and rescue Revan from the cell he had called home for the past three years. In the moments before leaving the detention area, Surik remembered that she was still carrying Revan's mask and presented it to him. He had a brief moment of recognition before passing out from the flood of his life's memories returning to him. In those vulnerable minutes, Darth Nyriss entered the detention area with the intent of killing Revan. Surik and Scourge were forced to fight Darth Nyriss on their own."}, {"tag": "p", "text": "The ensuing battle was entirely one-sided—Surik and Scourge, despite their formidable skills, were no match for a member of the Dark Council. In what seemed sure to be their final moments, Surik witnessed a reborn Revan intervene and destroy Nyriss by turning her own powers against her. Together, the three escaped the dead Sith lady's compound and began to prepare for their mission to destroy the Emperor. After escaping the warzone of Darth Nyriss' compound, the trio of Jedi and Sith learned that the Emperor had done far more than move against her. He had seized upon the opportunity to exterminate every member of the Dark Council, as well as to declare martial law on the planet until the situation was resolved. The small conspiracy reasoned it likely that the Emperor was purging the Council as a pretext for replacing its members with lackeys who would not defy his plot to attack the Republic. Revan, Scourge, and Surik decided to spend the night in hiding and await daybreak, hoping that many of the soldiers would be resting or tired out after a long night of battles and massacres. Overnight, Scourge experienced his first-ever Force vision: seeing himself and his Jedi allies broken and defeated at the feet of the Emperor."}, {"tag": "h3", "text": "Final confrontation"}, {"tag": "p", "text": "With Scourge's aid, the three were able to infiltrate the Imperial Citadel in Kaas City. As Scourge had provided the information that allowed the Emperor to act against the Dark Council, they faced little challenge from the Imperial Guards protecting the palace. The ruse was ended when the Guard captain finally saw Revan's mask, recognizing him as the man who had tried to infiltrate the Citadel years earlier. A battle quickly broke out between the trio of unlikely allies and the formidable and fanatically devoted Imperial Guards. Surik and Scourge continued to battle the guards as Revan pressed on into the throne room to challenge the Sith Emperor himself. Even though they were outnumbered by skilled opponents, both Scourge and Surik prevailed over the guards and turned to join the fight against the Emperor himself."}, {"tag": "p", "text": "Surik saw that the Emperor had all but defeated Revan without even drawing a weapon. She charged to his aid even as Revan was still reeling from being electrocuted by the Emperor's dark powers. Seeing the Emperor take Revan's own lightsaber and prepare to kill him with it, Surik made a choice which would have galactic consequences for centuries to come; rather than throw her lightsaber to kill the distracted Emperor at the cost of Revan's life, she threw her blade only to deflect the killing blow. It was in this moment that the battle was lost, and Lord Scourge realized that the only way to challenge the Emperor's plot against the Republic was to make it appear as though he had brought the Jedi before the Emperor as a trap for the servants of the Light. Taking advantage of her trust, Scourge stabbed Meetra Surik in the back with his lightsaber, ending her life."}, {"tag": "h3", "text": "Post-mortem"}, {"tag": "p", "text": "Though her life was ended, Surik's existence continued in some ethereal form through the Force. With Revan captured by the Sith Emperor to be used as a source of life energy to draw upon, Surik's spirit remained near Revan's body to keep his spirit alive for the centuries he was to be held in captivity."}, {"tag": "h3", "text": "The Cold War"}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the Sith Empire, Meetra Surik's spirit contacted the Jedi Master Oteg and instructed him to liberate an important Jedi from Sith captivity. A combined team of Jedi and Republic commandos were dispatched to a Sith world called Taral V. They infiltrated the prison complex, defeated the Sith garrison and freed their target—the Jedi Revan. Although he was initially displeased with the fact that he could no longer influence the Emperor's mind, Revan was visited by Surik. She urged her former mentor to resume his efforts to kill the Emperor. With Revan's resolve restored, Meetra Surik disappeared once more."}, {"tag": "h3", "text": "The Third Galactic War"}, {"tag": "p", "text": "During the Third Galactic War, in the year 3626 BBY, the Alliance Commander, Kira Carsen, and Scourge boarded a ship which housed Satele Shan and her students, who had been rendered unconscious by Tenebrae's curse. The three were guided through the ship by Revan, who sought to see the Sith Emperor finally meet his end. Once they reached Satele Shan's body, Kira Carsen guided the group in meditation so that they may enter her mind and prevent the Sith Emperor's rebirth. Inside Satele's mind, the Alliance Commander encountered Meetra Surik, who was mocked by the Emperor for failing to kill him. Ultimately, the Sith Emperor was vanquished as all those who he had manipulated and killed over the centuries, Surik included, manifested behind the Alliance Commander to aid in their fight. With the Emperor defeated once and for all, Surik became one with the Force."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Throughout her life, Surik formed bonds with her comrades, even those who were supposedly her superiors or lesser in rank. It was said that during her training, many fellow Padawans were quick to do whatever she did, and that others disliked her intensely. She was regarded as a natural leader and a quick learner as well as generous and kind, though beyond this the personality of her early life is largely unknown. In the wake of the Mandalorian Wars, Surik returned to the Jedi Temple on Coruscant to answer for her actions. She was fully aware of what she had done, and tried one last time to convince the Jedi Council of the rightness of her—and by extension Revan and Malak's—actions. Despite her conviction and understanding of the consequences, she was exiled; in defiance, she stabbed her lightsaber into the center stone of the Council chambers when asked to surrender it. After her departure, her former Master Kavar mentioned that there was much defiance in her."}, {"tag": "p", "text": "Following the exile's path, she forsook the company of others, preferring to wander about the Outer Rim in solitude. The wars had left many scars on her, both physical and mental, and she was left with a feeling of regret for what she had done and what she had been asked to do. During her exile, when she heard of the war started by Revan, she wondered if she could have been so blind or if the galaxy was so truly incomprehensible. She then retreated further into herself, forsaking all Jedi principles excluding one: no attachments. She disliked having to speak about the war, even after returning to the Republic and traveling amongst friends. She was even uncomfortable discussing the war and its end with Bao-Dur, her old friend from the war. Her wanderings served to maintain the discipline she had built up during her years of training and suffering the hardships of war."}, {"tag": "p", "text": "Starting with her meeting of Kreia in the Peragus facility, Surik began once more to form bonds with people she met during her travels, people with whom she had an interest in helping to keep alive so that they, in turn, could protect her. Eventually she began to realize the leadership role she was destined for, embracing it in order to train the Force-sensitives in her company to become the foundation of the new Jedi Order. Also during this Surik saw it as her duty to help stabilize the Republic in any way possible, reflecting her old sense of compassion and generosity that had initially driven her to war. Because of her experiences in the Mandalorian Wars, she also understood the nature of war and battle and the hard choices that had to be made when conflict was inevitable."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Surik dressed in simple Jedi robes, and possessed a blaster pistol, an armband, and a self-built lightsaber containing a cyan crystal, like the one she used during the Mandalorian Wars. Since exiles were not allowed to keep their lightsabers, Surik's was taken by Atris after the trial, but even with all the Jedi enclaves destroyed, she was able to find the necessary parts to build a new one. Bao-Dur, the Zabrak tech specialist who served under Surik during the Mandalorian Wars, aided in its construction, having learned the subtleties in the time he spent around Jedi. The blade found an excellent focusing crystal when Surik visited the Crystal Cave on Dantooine, where she harvested a crystal with very rare properties. The crystal responded to her, drawing on Force energy which radiated from her body and strengthening her in turn, in the way of a Force bond. The bond was such that the crystal matured as Meetra's strength in the Force grew, and it would respond to her alone, making the blade unusable by anyone else. Kreia would help Surik tune the crystal periodically so that it would best reflect her current self."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Meetra Surik was described as \"undisciplined\" and \"mediocre\" by Vrook Lamar while Vandar Tokare described her as \"an average student of the Force,\" though Kavar stated she always possessed a \"deep\" and \"strong\" connection to the Force as a Padawan while Revan recalled her being \"a powerful Jedi\" with recognizable potential during the Mandalorian Wars. Both sets of statements imply she always had high potential and a naturally above-average facility for the Force—unnoticed in her youth due to a lack of proper focus. Most notable to everyone around her however, was her unusual ability to influence others, and the Jedi Masters believed that she could form bonds through the Force easily to those around her, an ability she was not consciously aware of. After reconnecting with the Force, this ability became stronger. Simply by observing another in action, Surik could instantly learn Force techniques and lightsaber forms that would take a Jedi Master years to perfect. It was believed by Masters Zez-Kai Ell, Kavar, and Vrook Lamar that this was because of the wound in the Force that surrounded her, which allowed her—like Darth Nihilus—to feed on the death of other life forms to sustain her Force powers. This wound was caused by the Battle of Malachor V, and was what originally blocked her connection to the Force. It was also because of the nature of such wounds to feed on death that Surik began to regain her Force connection on Peragus II, after all the personnel were killed by HK-50's machinations.[source?] When Surik traveled the galaxy, killing hundreds in her search for the Masters, she unconsciously fed on all that death, fuelling her powers. It was this that caused the Masters such fear—both at her trial and after she had united them on Dantooine—as they thought her condition to be not only a threat to the Jedi and the Force, but a threat to life itself."}, {"tag": "p", "text": "Through her informal apprenticeship to Kreia, Surik was able to learn a number of rare and advanced Jedi techniques, including Breath control and Beast trick. Kreia also taught Surik a powerful form of mind reading, where one could read the innermost thoughts of another. Kreia was very impressed with the speed in which she learned this power. She said that most Jedi Masters studied many years to learn the technique. Surik was also proficient in other Force powers, including Force valor, Force resistance, Force whirlwind, and Mind trick. She also learned many techniques from her companions: Atton Rand taught her to shield her thoughts, Brianna taught her Battle Precognition, Mical taught her an advanced form of meditation, and Visas Marr taught her how to see through the Force. She also learned Moving Meditation while trying to improve the functionality of her utility droid T3-M4. She learned the light-sided Force technique known as Force Enlightenment, after nearly being severed from the Force by the reconvened Jedi Council, and after Kreia, who had revealed herself as the former Darth Traya, stripped away the Masters' bond with the Force."}, {"tag": "p", "text": "Surik defeated a number of high-profile adversaries, including Azkul, Vaklu, Atris, and the Sith Lords Darth Sion and Darth Nihilus. She was highly skilled in the art of lightsaber combat, utilizing the lightsaber forms Shii-Cho, Makashi, and Soresu, and was known to have used at least one advanced Force technique, known as Force Channel. She was also proficient in many forms of hand-to-hand and melee combat. At the Telosian Jedi Academy, Surik defeated five of the six Handmaiden sisters in hand-to-hand combat. On Dxun, Surik defeated the two champions of the Mandalorians' battle circle, Kelborn and Bralor, becoming the champion of the battle circle and earning the champions' rights to criticize or praise any Mandalorian who sparred in the battle circle. Mandalore the Preserver told Surik, with respect, that even with all their martial training, battles and ethics, even the greatest of his Mandalorian warriors were no match for her. Even Bralor commented on her abilities stating that he now saw why the Jedi were able to beat them. She also became one of the few Jedi capable of using Dun Möch, especially in a duel against Darth Sion who could not be defeated by normal means. Surik eventually convinced Sion to let go of the Force and to finally allow himself to leave his life of pain and die. Surik remained the only known light-sided Jedi that used the technique to it's greatest extent (most Jedi that used the technique employed an inverse variant or in limited applications only)."}, {"tag": "p", "text": "Surik was also a very skilled tactician. She served during the Mandalorian Wars and had, by war's end, become Revan's most trusted general, and commanded over half of the Republic fleet during the Mandalorian Wars. She was known to have taken part in both the second battle of Dxun and of Malachor V, both of which were victorious. She also proved her tactical brilliance, as well as her natural talents of leadership, after her return from exile, during the battle of Khoonda. On Dantooine, a war had broken out between Khoonda and the forces of the mercenary Azkul. Both Khoonda and Azkul wanted Surik on their side, but she decided to help Khoonda. Before the arrival of Azkul's men to the battlefield, Surik bolstered Khoonda's defenses by persuading several civilians to join the Khoonda militia, healing those of the militia who were injured, planting more mines in the surrounding fields, and repairing damaged gun turrets and medical and combat droids. Within a matter of mere hours, she had turned a disorganized mess into a powerful army, able to defeat the larger forces of Azkul."}, {"tag": "p", "text": "Surik was fluent in droidspeak, having worked alongside many utility droids during the Mandalorian Wars. She could also speak and comprehend Basic, Huttese, Mando'a, and Tchuukthese without the aid of a translator. She was also an accomplished swoop racer, winning sector championships on the Telos Citadel Station, Nar Shaddaa, and Onderon, and was also proficient at playing pazaak, a popular card game in which the goal was to reach 20 without going over."}, {"tag": "p", "text": "The ramifications of Surik's actions were still being felt throughout the galaxy nearly 4,000 years after the defeat of the Sith Triumvirate. The Jedi she trained would go on to resurrect the all-but-decimated Jedi Order. Furthermore, the actions she took on Dantooine, Onderon, and Telos would ensure the solidification of a Republic that, because of the Great Sith War, the Mandalorian Wars and Jedi Civil War, had been teetering on the edge of collapse, prolonging its existence for several thousand more years."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h4", "text": "Revan"}, {"tag": "p", "text": "Meetra Surik joined Revan's faction of Jedi that defended the Galactic Republic in the Mandalorian Wars. During the conflict with the Mandalorians, Surik became Revan's most trusted general and ally. On her part, Surik came to see Revan as her mentor, and thus she was completely loyal to him. Her feelings for Revan even extended to love, though not in a romantic way. Rather, she loved him like a brother. Surik would later credit Revan's influence as a factor behind her development into a great Jedi."}, {"tag": "p", "text": "After the destruction of the Sith Triumvirate, Surik departed known space with T3-M4 in order to find Revan. She eventually found and freed her mentor from captivity with the help of Lord Scourge. Surik then joined him in an attempt to assassinate the Sith Emperor, who planned to consume all life in the galaxy in order to live indefinitely. Surik, instead of capitalizing on an opportunity to kill the Emperor, chose to save Revan's life during the fight. The assassination plot ultimately failed and Surik was killed by Scourge. While the duel took place, Scourge witnessed a vision of the future through the Force, in which he saw that the Emperor would die by the hand of a Jedi—but that Jedi was neither Revan or Surik. Hence, he killed Surik in order to feign loyalty to the Emperor."}, {"tag": "p", "text": "Although Surik was dead, she refused to become one with the Force immediately. Instead, she allowed her spirit to stay with Revan, who had been captured and imprisoned once again. For the next three centuries, Surik's spirit augmented Revan's own strength of will, and thus enabled him to resist the Emperor's powers."}, {"tag": "p", "text": "After three hundred years as the Emperor's prisoner, Revan was released by agents of the Republic and the Jedi Order. Soon after his liberation, Revan was visited by the spirit of Meetra Surik. He then realized that it was her presence that helped him to endure the centuries of captivity. After Surik disappeared, a determined Revan vowed to complete what was their ultimate objective—the destruction of the Sith."}, {"tag": "h4", "text": "Atton Rand"}, {"tag": "p", "text": "Atton Rand met Surik when she first walked into his holding cell area in nothing but her undergarments, he was instantly attracted to her. After she helped him escape and communicated with the utility droid, T3-M4, Rand commented that it must have been tough considering how she could not have a family or husband. After being blackmailed by Kreia at the Telosian Jedi Academy, Rand stuck around Surik during her mission to find the lost Jedi Masters. He even went so far as to ask one of Surik's other companions, Bao-Dur, if he had any chance with Surik. Bao-Dur didn't make a comment at the request and continued his mechanical work on the ship."}, {"tag": "p", "text": "Things got more complicated for Rand when the crew landed on Dantooine. Surik found her prospective Padawan from years before, Mical. Their relationship, though completely friendly, enraged Rand with jealousy, causing him to lash out at Mical whenever he simply offered to help. When the bounty hunter and scout Mira joined the crew of the Ebon Hawk, she first noticed Rand's close attention of Surik and Mical, and came close to figuring out his secret. After Surik met a pair of Twi'leks on Nar Shaddaa who claimed that Rand was not really who he said he was, he eventually confessed to Surik that he was shown the Force by a Jedi with whom he fell in love, but then he killed her for crawling inside his head. With that, Surik trained Rand as a Jedi."}, {"tag": "h4", "text": "Mical"}, {"tag": "p", "text": "Mical knew Surik when she was first part of the Jedi Order, before the Mandalorian Wars. As a student in the Jedi Order who needed a Master, Mical wanted Surik to be his Master above all else. However, when Surik left to aid the Republic by fighting the Mandalorians, Mical was left without a mentor and thus left the order to work with the Republic as historian and scientist. While investigating the ruins on Dantooine, ten years after the Mandalorian War, he met Surik again. Though at first he denied knowing her, he confessed that Surik did know him from long ago. Surik regretted causing such a rift in Mical's future and so trained him as Jedi."}, {"tag": "p", "text": "While traveling with Surik, Mical found himself at odds with the pilot Atton Rand. Both seemingly desired Surik, although Mical's love was more of admiration of her strength and leadership, which was heightened by her beauty. When Surik attempted to isolate herself after meeting with the three Masters on Dantooine and learning the truth about her powers, Mical sought her out and reassured her, saying that he did not agree with the Council, and that he and the others were there by their own choice."}, {"tag": "h4", "text": "Darth Sion"}, {"tag": "p", "text": "After stalking Surik for so long, the Lord of Pain grew attached to her, practically falling in love, although he knew that this just weakened him. When Surik came to Korriban in search of Master Lonna Vash, Sion had his deadly assassins stalk her through the Korriban Academy. However, after Sion confronted her himself, he called off his assassins and allowed her to escape."}, {"tag": "p", "text": "Later, while in the Trayus Academy on Malachor V, Sion confronted Surik again and told her of his love for her, though he could not describe it exactly, knowing that she must fall if he was to remain strong. Sion gave Surik two choices; to either return to the surface of Malachor and let the planet take her life, or he would kill her himself, as either death would be far more merciful than what Kreia had in store for her should she fail. However, neither Sion nor Surik were willing to back down, and they battled. After being struck down several times Surik finally convinced him that his struggle was futile, and he surrendered his life. His last words were to tell her that she was Kreia's ultimate weakness, just as she had been his."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Meetra Surik was created by Obsidian Entertainment as the primary protagonist in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords, the sequel to the 2003 Star Wars: Knights of the Old Republic. At the time of the game's release, the character was known only as the \"Jedi Exile,\" and because players in The Sith Lords could create male or female characters, the Exile had no definitive gender. The narration for an early promotional trailer referred to the character as a male, as well as early promotional artwork, leading some fans to believe that the character was canonically a male. However, the Exile's gender remained undetermined along with the canon ending for The Sith Lords in the Holocron continuity database."}, {"tag": "p", "text": "In 2006, The New Essential Guide to Droids established the Exile as a female, using the term \"heroine\" and female pronouns in a number of entries on droids that appeared in The Sith Lords. The New Essential Guide to Droids, along with the 2008 Knights of the Old Republic Campaign Guide, further confirmed that the light-side ending of The Sith Lords is the canonical ending. The 2011 novel The Old Republic: Revan, which bridges the gaps between Knights of the Old Republic, The Sith Lords, and Star Wars: The Old Republic, established the Exile's name to be Meetra Surik. The novel also reaffirmed Surik's gender and the canon ending of The Sith Lords, and explained what happened to the Exile after the events of the game."}, {"tag": "p", "text": "At the beginning of the game, the player may customize Surik's Jedi class, appearance, and name. The player may also choose to play a male or female character. The character's gender affects the makeup of his or her party, with the Echani Handmaiden Brianna joining the party rather than Mical the Disciple if the player chooses the male gender. It also affects the optional romantic subplots, with the male player character able to pursue a relationship with Brianna or Visas Marr. Hints of a prior relationship between a male Exile and Atris also appear in the dialogue. The rest of the storyline is unchanged."}, {"tag": "p", "text": "Surik's Jedi class is as of yet unknown. However, after she helped Queen Talia and the Onderon Royalists defeat General Vaklu and his traitorous forces, Kavar told Surik that he tried to convince her to become a Jedi Guardian like he was, saying that they could have used someone like her. Surik can learn both the Ataru and Shien lightsaber forms regardless of whether or not she was a Jedi Guardian or Jedi Sentinel, or their corresponding classes, the Jedi Weapon Master and Jedi Watchman, respectively. However, if she was a Jedi Sentinel or Watchman, she would learn the Niman discipline from one of the Masters. If she was a Jedi Guardian or Weapon Master, she would learn the Juyo discipline instead."}, {"tag": "p", "text": "According to the official strategy guide for The Sith Lords, should Surik have trained Bao-Dur in the ways of a Jedi Guardian, she would have been able to train him in the use of advanced lightsaber forms and techniques. This is cut content, and never made it in the final pressing of the game."}, {"tag": "h3", "text": "Alternative storylines"}, {"tag": "p", "text": "Following the tradition of the video game Star Wars: Knights of the Old Republic, the aforementioned light side story is canonical.[source?] According to Leland Chee as of February 21, 2006, an official decision on this had not yet been reached. However, The New Essential Guide to Droids clearly defines Surik as a \"heroine\" in the entries on HK-47, G0-T0, and T3-M4. The book also says that Malachor V was destroyed, which only happens in the light side story."}, {"tag": "p", "text": "The alternate dark-side storyline differs in the fates of the planets that Surik visits; Onderon is usurped by Vaklu, Dantooine is captured by Azkul and his mercenaries, Telos becomes a world of machines due to its Czerka takeover, and Malachor V remains intact. The dark-sided Wookiee scout Hanharr joins the player's party instead of Mira. Additionally, Surik kills the Jedi Masters herself upon visiting each planet, rather than having them converge on Dantooine. She instead speaks with Kreia alone at the rebuilt Dantooine Jedi Academy, and Kreia knocks her unconscious and goes to Malachor V. When Surik confronts Atris after Kreia left her, she kills the fallen Jedi Master upon defeating her. After defeating Kreia at the Trayus Core on Malachor V, Kreia's prediction of Surik's companions also change, due to Surik falling to the dark side."}, {"tag": "h4", "text": "Male relationships"}, {"tag": "h5", "text": "Visas Marr"}, {"tag": "p", "text": "While Visas Marr and Surik became close as friends and allies during their journey, Marr developed feelings for, and fell in love with Surik if the player was male. From the moment Marr sensed Surik across space, she recognized that there was someone in the universe who felt the same spiritual emptiness that she felt, someone who had suffered and lost everything they had ever loved, just as she had. But it wasn't until she had challenged Surik, and was spared, that she came into his service."}, {"tag": "p", "text": "After being shown mercy, she pledged her life to serve him without hesitation, so that she might come to understand how he could go on when he carried so much pain within him. She made it her personal mission to help him and protect him until he would be ready to fight her master, Darth Nihilus. This fervent loyalty came at much to the disapproval of Kreia, and Brianna the Handmaiden. A rivalry for Surik's affections boiled over at one point, when Brianna confronted Marr in her quarters on the Ebon Hawk. Brianna was suspicious of her Sith nature, and perhaps even a little jealous that Surik had welcomed her into their group without hesitation, and was spending time with her as well. Marr quelled her outrage by confessing that she wished only to serve and protect him, just as Brianna did, and that she could \"see\" from her movements that she was growing to care for him. Marr then hinted at her own feelings when, before Brianna left, she asked her to describe what Surik looked like. With her species lacking eyes and her Force vision somewhat damaged in unexplained ways, she wanted to know more about him."}, {"tag": "p", "text": "For the most part Marr kept these feelings to herself, but when Brianna left the group to take Kreia before Atris, she realized that soon they would be forced to confront her old Master, and she suddenly began to fear losing him. She came to Surik and opened her heart to him, begging him to stay with her and not fight. Surik told her that he couldn't turn away from this battle, but before they arrived at Telos they shared an intimate moment, using their shared Force Vision to \"see\" each other. Eventually Marr was left behind by Surik, as he traveled into the Unknown Regions he could not take anyone he cared for with him. However the love she had felt finally helped her to heal her spirit, and make peace with her past. She vowed that she would always wait for him to return, and that if he would not, she would continue loving him for the rest of her life."}, {"tag": "h5", "text": "Brianna"}, {"tag": "p", "text": "In the established Legends storyline for The Sith Lords, the only time Surik would meet Brianna was at the Telosian Jedi Academy after speaking to Atris. However, in the non-canon male storyline in which Surik is a male, Brianna the Handmaiden would join Surik's party after departing the Jedi Academy. Before the Ebon Hawk departed from the hidden Jedi enclave on Telos, Jedi Master Atris privately ordered Brianna to sneak aboard the ship, supposedly to assist Surik in finding and uniting the lost Jedi against the hidden Sith threat. When her sisters discover her missing, Atris lied and told them that Brianna had voluntarily left with Surik for reasons that weren't known to her, causing the Handmaidens to believe she had broken her oath. After revealing she had stowed away onboard the ship, Surik accepted her onboard for the journey, much to the annoyance of Kreia and Rand."}, {"tag": "p", "text": "Through talking, sparring, and witnessing many acts of his good nature, Brianna began to question if Atris had been wrong in her judgment of Surik. She sought to understand him, in hopes that she might understand the choices her mother and father had made, and why she had started having doubts about the path she had chosen. After three duels with Surik, Brianna declined to continue their training, explaining that repeated duels had a very significant meaning in Echani culture, and she did not want to break her vow to Atris by allowing their friendship from becoming anything more. This changed however, when Surik told her that because her mother had been the Jedi Master Arren Kae, that she too had the potential to become a Jedi. Faced with this new information, Brianna made the difficult choice of forsaking her oaths like her parents had done before her, and pledged herself to Surik's teachings, becoming a Jedi Guardian. There was no question that this bond made them grow closer, and at times Brianna found herself jealous of Visas Marr, who was also falling for him."}, {"tag": "p", "text": "Her feelings towards Surik and her strong passions worked against her in the end; when tricked into believing that Surik had been killed by Kreia, she was tricked into bringing her before Atris to be punished. However Atris had already been corrupted by the dark side, and now seething with jealousy she attacked Brianna, nearly killing her with several attacks of Force Lightning, until Surik arrived and saved her. With her oaths to Atris and her sisters no longer valid, she re-pledged herself to Surik instead, vowing to stay by his side for as long as he would need her. Their alliance would be short lived; when Surik left for the unknown regions he had to leave everyone he cared about behind him, as Revan had done before him. Though it would seem they were destined never to meet again, she would eventually take up the role of Jedi Chronicler and would teach many Padawans about the Jedi who had given up the Force, and became better for it."}, {"tag": "h5", "text": "Atris"}, {"tag": "p", "text": "If Surik was male, it was strongly implied that Atris held feelings for him prior to his departure for the Mandalorian Wars—and even after his exile. It seemed that having someone she cared about turn away from the path of the Jedi shook her deeply, and contributed to her fall to the dark side. After Brianna defeated her sisters, Atris confronted and tortured her with Force lightning, out of jealousy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}