{"url": "Melee_weapon/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Melee weaponry"], "nodes": [{"tag": "h1", "text": "Melee weapon"}, {"tag": "p", "text": "Melee weapons, also known as hand-weapons, were the first weapons developed for close combat and are among the simplest weapons of all."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Melee weapons generally dealt bludgeoning, slashing, or piercing damage, depending on the design of the weapon. Some special weapons such as the lightsaber dealt energy damage also. Although primarily used as close-combat weapons, some melee weapons such as knives, spears, and axes were also thrown."}, {"tag": "p", "text": "Melee weapons came in all shapes and sizes. Some, such as knives, were small enough to be handheld, while other much larger weapons such as the vibro-ax generally required two hands to use. Most melee weapons were simple enough to use without any special training, but some, such as the lightsaber, the ryyk blade, and the amphistaff, had unusual and exotic designs or functions which required training if the weapon was to be used proficiently."}, {"tag": "p", "text": "Also considered melee weapons were various gloves and gauntlets worn on the hand to increase unarmed combat damage, such as combat gloves and stun gauntlets."}, {"tag": "p", "text": "Melee weapons were used by military personnel and law enforcement agencies, but due to their widespread availability, civilians also used them. Some societies and cultures had duels or ceremonial combat that required the use of specific weapons. Not all melee weapons were used exclusively for combat. Some were used to hunt wild game, while others were used as cutting tools for slicing through underbrush or chopping down trees."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Early weapons such as clubs and spears were made of wood and stone. The development of metallurgy led to melee weapons being made of more durable metals such as durasteel and transparisteel. An important development was the inclusion of cortosis and phrik alloys, which gave weapons a resistance to lightsabers. This made dueling with these weapons possible with the lightsaber wielders prevalent in the Old Republic era."}, {"tag": "p", "text": "Other advancements in melee weapons produced vibroweapons, which used ultrasonic vibrations to increase cutting power with less effort by the wielder. There was also the advent of stunning weapons such as the shock stick and stun baton, which were primarily used to disable an opponent with non-lethal force. These weapons typically used an electric charge to incapacitate."}, {"tag": "h3", "text": "Cultural weapons"}, {"tag": "p", "text": "Some species developed their own favored melee weapons which became a part of their culture. For example, the Tusken Raiders used the gaderffii, a metal pole-like weapon. Wookiees used ryyk blades, which were curved hunting swords. Gamorreans used huge axes called arg'garoks. Cereans used shyarns—light, curved swords employed during their ancient honor duels. Gungans used atlatls and cestas, which could also be used to hurl energy balls. The Yuuzhan Vong used the amphistaff, a living weapon that could transform into a spear, a staff, or a whip, and was even able to shoot venom. The Nagai used the tiny but deadly Tehk'la blades."}, {"tag": "p", "text": "Various orders and organizations also had their signature weapon. The most familiar examples included the Jedi and the Sith, who extensively used the lightsaber, one of the most versatile and powerful melee weapons ever known. The ability to cut through virtually anything as well as the ability to deflect and redirect blaster bolts made this weapon extremely deadly in the hands of a trained Force user. Other organizations that made extensive use of the lightsaber were the Jensaarai and the Imperial Knights."}, {"tag": "p", "text": "Aside from the lightsaber, the Sith used a variety of other melee weapons. One of these was the Sith sword, a blade imbued with the dark side of the Force using Sith alchemy. The wielder of this weapon would be able to call upon the dark side and channel it into the blade, using it to strike powerful blows. Other weapons used by the Sith included the Sith Tremor Sword and the Sith war sword. Most of these weapons had lightsaber-resistant properties, enabling them to duel effectively with their lightsaber-wielding Jedi enemies."}, {"tag": "p", "text": "Other Force-using organizations had their own signature melee weapons. The Matukai Adepts used the wan-shen, a large, halberd-like weapon. Those belonging to the Order of Shasa used a curved sword known as a fira. The Felucian shamans on Felucia used sword-like skullblades."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}