{"url": "Melee/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Besadii servants", "Category:Females", "Category:Humans", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Melee"}, {"tag": "p", "text": "Melee was a Human female slave who found herself in the service of Gardulla the Elder and Bryyn Woolery on the remote desert planet of Tatooine. She was a particularly adept mechanic, and her skills were tapped by both her masters. Growing up on the harsh streets of Mos Espa, Melee aspired and clamored for a life of freedom, but she covered her feelings with a tough and cruel demeanor. Teaming up with Seek, another young slave, she became one of the resident bullies of Slave Quarters Row, crushing the hopes of other slaves with stinging remarks. At an early age, she found herself attracted to fellow slave Anakin Skywalker, but she kept her feelings hidden and was devastated when he was later freed."}, {"tag": "p", "text": "When Gardulla was fed to her own canyon krayt dragon, Melee fell into the hands of Woolery, a machinery merchant. Though Skywalker had left Tatooine, Melee still visited his mother, Shmi. She and her droid, C-3PO, taught Melee to read and write. Woolery eventually moved to the more lucrative city of Mos Eisley, where business was strong enough to allow her to free Melee. Melee remained in Woolery's employ, however, putting her mechanical skills to good use."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "In the service of Gardulla the Elder"}, {"tag": "p", "text": "As far as Melee could remember, she had been a slave. Early in her life, she was sold to the Hutt Gardulla the Elder, who initially assigned Melee various cleaning duties. The Hutt, however, soon realized that Melee's small hands would be better served in maintenance and put her to more suitable work. In time, Melee became an adept mechanic, viewing the tasks as nothing more than children's puzzles. She became familiar with the workings of podracers as well during her work."}, {"tag": "p", "text": "Living at Slave Quarters Row, Melee had bright hopes for the future, but she played her aspirations down in favor of a tough and gritty demeanor. She teamed up with the local bully and fellow slave, Seek, and began berating other slaves for their lofty hopes and dreams. The pair would mercilessly tease the other children, among them Anakin Skywalker. Skywalker was secretly building a podracer, which drew fire from Seek and, apparently, Melee. However, she secretly harbored an affection for Skywalker, which she chose to cover with disdainful comments."}, {"tag": "p", "text": "On the eve of the Boonta Eve Classic podrace in 32 BBY, in which Skywalker would be competing, Melee joined Seek and several friends to inspect his self-built racer. However, she eschewed helping him in favor of playing ball with Seek. When the day of the race came, she sneaked away from Seek's presence and entered the Mos Espa Grand Arena grandstand to watch the race. She was elated when Skywalker finished first, but she was soon met with the news that a tall outlander had spirited him away to a better life. Though she was bitterly disappointed, Melee found solace in the fact that he had been freed and was moving onto better things. Seek, however, thought that fortune would not smile on the Mos Espa slaves twice."}, {"tag": "h3", "text": "In the service of Bryyn Woolery"}, {"tag": "p", "text": "When Gardulla was later fed to her own canyon krayt dragon by the bounty hunter Jango Fett in 32 BBY, Melee fell into the service of merchant Bryyn Woolery. She also visited Anakin's mother, Shmi Skywalker, from time to time, who taught her to read and write with the help of the protocol droid C-3PO. Melee continued to reside in the Slave Quarters until Woolery moved to the larger spaceport city Mos Eisley in pursuit of more lucrative fare. As a result, Melee fell out of touch with the elder Skywalker. In Mos Eisley, Woolery turned enough of a profit to free Melee, but the young woman decided to stay in her former master's employ as an errand girl."}, {"tag": "h3", "text": "Freedom"}, {"tag": "p", "text": "Using a dilapidated old landspeeder, Melee would make deliveries to remote settlements around Mos Eisley. Many years passed, and in 0 BBY, upon delivering a shipment to Tosche Station outside the town of Anchorhead, she heard word of a Luke Skywalker and decided to inquire, thinking she may have found Anakin, the subject of her affections. Traveling to Skywalker's home, the Lars homestead, she was met with nothing but the smoldering remains of the Lars' moisture farm. She never discovered that this Skywalker was in fact the son of Anakin, her old friend. In the following years, Melee enlisted the services of a spacer, hoping to have a gang of scavengers outside Mos Eisley eliminated."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Born a slave, Melee was an ambitious person, with dreams and aspirations that looked far beyond her post. Since such thoughts were often frowned upon or scorned by other slaves, she kept her intentions and ideas private, veiling them with a harsh and mean-spirited demeanor. Her attraction to fellow slave Anakin Skywalker was also kept secret, as she felt it would test her friendship with Seek. In reality, she did in fact doubt his mechanical skills, as she was experienced in that particular field. In her later life, Melee stayed on Tatooine, despite being freed, and was relatively ignorant of developments in the galaxy as a whole."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Melee first appeared in George Lucas's Star Wars: Episode I The Phantom Menace, wherein she was portrayed by Megan Udall. The character's backstory was later developed by Alex Dishal, \"Ghent the Slicer,\" \"Cockroach King FS,\" and James Floyd through the StarWars.com Hyperspace feature What's The Story? The information from the resulting Databank entry was later used in 2008's The Complete Star Wars Encyclopedia. Although Melee's Databank entry states Gardulla the Elder was killed by Jango Fett during the events of 2002's Star Wars: Bounty Hunter video game, the 2010 Star Wars: The Clone Wars television series episode \"Hunt for Ziro\" revealed that the Hutt had in fact survived the incident."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}