{"url": "Arndall_Lott", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Army generals of the Galactic Empire", "Category:Imperial warlords", "Category:Males"], "nodes": [{"tag": "h1", "text": "Arndall Lott"}, {"tag": "p", "text": "Arndall Lott was a Human male, born in 48 BBY on the planet Kwenn. Lott joined the Imperial Army where he showed considerable aptitude for walker operations. After serving a two-year tour under General Maximilian Veers, Lott was promoted to the rank of General and placed in command of Walker Operations and Tactics at the training center on the planet Jardeen IV. Following the Battle of Endor, Lott joined Captain Iolan Gendarr in forming a warlord splinter faction."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Arndall Lott was a native of the planet Kwenn, born in 48 BBY. Lott attended the Imperial Academy, and joined the Imperial Army upon graduation. He was promoted to the rank of sergeant after showing considerable skill in walker operations, and also served a two-year tour of duty under General Maximilian Veers as part of the army detachment assigned to the Death Squadron. Eventually, Lott achieved the rank of general, and was given command of Walker Operations and Tactics at the Imperial Army training center on the planet Jardeen IV. Following the Battle of Endor and the death of Emperor Palpatine, Lott fled the planet along with Captain Iolan Gendarr and the Star Destroyer Reliance, who had been assigned to protect Jardeen IV. The pair formed their own Imperial warlord faction, where Lott designed a primitive slave-rigging system inspired by the famed Katana fleet to control multiple walkers such as All Terrain Armored Transport and All Terrain Scout Transports via the use of remote operators. Lott's invention was used to devastating effect in coordinated assaults on New Republic and civilian bases to obtain supplies and equipment. The New Republic charged Lott with treason, sedition, destruction of New Republic property, murder of New Republic personnel, destruction of private property, and murder. A reward of 75,000 credits was offered by the New Republic for Lott's capture. Lott's design was later used in the control systems of the TIE/D automated starfighter by the resurrected Emperor's Dark Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Arndall Lott was a Human male who was 1.95 meters tall. He had a moustache and smoked. Lott was a skilled commander and instructor, and an expert tactician in the field of ground assault operations and squad-based tactics."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Lott was trained and skilled in the use of blasters, blaster artillery, and vehicle-mounted blasters. He was knowledgeable about alien species and their languages. A soldier, Lott was trained in unarmed combat, survival, and stealth techniques, and was able to operate ground vehicles, repulsorlift vehicles, and walkers. He could also repair walkers, and program and repair computers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "General Lott wore black-colored Imperial Army field armor, was armed with a blaster pistol, and carried a comlink and a datapad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arndall Lott was profiled in Wanted by Cracken, a sourcebook published in 1993 for West End Games' Star Wars: The Roleplaying Game. Lott's illustration was provided by Rob Caswell."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}