{"url": "Mellcrawler", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starships", "Category:Inyusu-class Star Yachts", "Category:Smuggler starships"], "nodes": [{"tag": "h1", "text": "Mellcrawler"}, {"tag": "p", "text": "The Mellcrawler was the personal starship of the Sullustan smuggler Nien Nunb that he used throughout the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Owned and operated by the Sullustan smuggler Nien Nunb, the Mellcrawler was a cobbled-together Inyusu-class Star Yacht. The yahct's interior featured a chaotic clutter of items, which, when compared by Leia Organa to the Millennium Falcon, made the latter seem like a starship that had just came off the assembly line. Between the entry ramp and the cockpit, the Mellcrawler had an engineering station that housed its droid brain. The station could be plugged into by a protocol droid such as C-3PO, who could then communicate with the ship's droid brain. In addition, the station displayed readouts and could be locked down from the outside."}, {"tag": "p", "text": "The ship's cockpit had four chairs, with one seat for the pilot as well as a navigator's chair. A maze of circuitry hung overhead. The Mellcrawler also featured a lounge area and cabins."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early years of the Galactic Civil War, the Mellcrawler was ran by the smuggler Nien Nunb, which he used as his personal smuggling vessel. During that time, Princess Leia Organa's homeworld of Alderaan was destroyed by the Galactic Empire. As a result of the atrocity, Organa took it upon herself to rescue the Alderaanians who had survived the Disaster and reunify them. She stopped first on Naboo, where she rescued the Melodic Order, a group of Alderaanian musicians, and acquired a yacht, the Lord Junn. She traveled next to Sullust, Nunb's homeworld, and rescued the population of an enclave of Alderaanians who lived underground there. However, she had gained the attention of the Empire, and had little means of transporting the Alderaanians of Sullust to safety. So Evaan Verlaine, Organa's friend and pilot, contacted Nunb and he came to their rescue in the Mellcrawler. Over the next several days, Nunb used his ship to ferry the Alderaanians from the enclave to safety on the Lord Junn. Nunb also supplied Organa with several blaster cannons that had been in the Mellcrawler's hold while it was docked with the Lord Junn in orbit over Espirion. Later, Organa left for the desert planet Skaradosh to enact a prisoner transfer, while a fleet of Alderaanian ships appeared over Espirion."}, {"tag": "p", "text": "Verlaine, however, enlisted the Mellcrawler and Nunb to help to rescue Organa from Imperial commander Dreed on Skaradosh. Nunb skillfully piloted the Mellcrawler past Dreed's Star Destroyer, which had blockaded the planet, and interrupted the prisoner exchange: Verlaine fired on the Imperials with the blaster cannons Nunb had supplied them. Verlaine killed Dreed, and the Mellcrawler set down to allow Organa and the other Alderaanians to board. Nunb then quickly piloted the freighter through the planet's atmosphere and launched a decoy, to confuse the Star Destroyer's sensors long enough for the Mellcrawler to escape into hyperspace, and the Imperials to think they had destroyed the Mellcrawler, though, it was the decoy."}, {"tag": "p", "text": "Soon thereafter, the Alderaanian fleet moved to Skaradosh in order to fight the Empire. Organa was apprehensive, but told them to prepare for battle nonetheless. She, Verlaine, R2-D2 and the Alderaanians disembarked the Mellcrawler when it docked with the Lord Junn, and Nunb became a part of the fleet. Soon, Organa broadcast a speech to the fleet as the Star Destroyer arrived, asking them to fight even though they had little chance of winning against the warship. Nunb engaged the enemy and their TIE fighters in the mayhem, until the Espirion Multi arrived, also a warship, and blew the Star Destroyer to pieces. Later, a celebration of the reunification of Alderaanian's survivors was held that Nunb attended. Organa then returned to the Rebel Alliance, and the Alderaanians, led by Verlaine, began searching for a new planet to colonize."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mellcrawler first appeared in the fourth issue of the 2015 comic-book series Princess Leia. Written by Mark Waid and illustrated by Terry Dodson, the comic was published by Marvel Comics on June 3, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}