{"url": "Melter", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Races and species stubs", "Category:Enslaved species", "Category:Inner Rim species"], "nodes": [{"tag": "h1", "text": "Melter"}, {"tag": "p", "text": "Melters was the name given to the energy based beings that lived in the meltmassif of the Taspan system. They were given this name because they \"melted\" out of the meltmassif at will, they used the meltmassif for their physical form. The melters could produce an energy discharge that had an effect much like a stun blast."}, {"tag": "p", "text": "Originally they lived in the crust of Taspan II. The Big Crush was initially of great benefit to them, as they fed on stellar radiation and stayed in communion despite being physically scattered. However, many pieces of meltmassif fell to the world of Mindor. Some died as their meltmassif burned up in the atmosphere. Those which survived suffered in slow asphyxiation, as the vaporized meltmassif screened Taspan's rays."}, {"tag": "p", "text": "Cronal used captive melters to reprogram and enslave his Pawns, making them form crystalline \"shadow webs\" that ran alongside each Pawn's nervous system. With the Shadow Crown, a meltmassif construction, he was able to control them and, through them, control meltmassif. Melters on Mindor also acted as a kind of unwitting security force. When they encountered organic beings such as Aeona Cantor's group, they caused vaguely Humanoid legless shapes to rise out of the meltmassif, stun the organics, and half-encase them in meltmassif in locations Cantor referred to as \"Melter crypts\"."}, {"tag": "p", "text": "Melters had minds and sensory experiences totally unlike those of most other sentient beings, although they did have analogues to curiosity and puzzlement. Their minds were so alien that Cronal felt that they supported his theory of the Way of the Dark. Luke Skywalker, known for a Force-given ability to communicate with nearly anything, even mineral-based sentients like the Tsils, had great difficulty trying to connect with them. He was unable to determine if they were one being made out of many pieces, or a number of individuals, referring to them once as a culture/mind. Human nervous systems produced energy in the general wavelength of melters, drawing them, and they had no conception of the fact that by entombing captives they were killing them."}, {"tag": "p", "text": "At the end of the Battle of Mindor, Luke Skywalker acted through the Shadow Crown and liberated the Melters by \"feeding\" them with the light of the Force. \"Never again would they feed upon light; there would never be the need. They would forever shine with light of their own.\" This had the additional effects of causing the meltmassif they were in to become liquid and pour out of the bodies they had been inserted into, and killing all of the stormtroopers controlled by meltmassif."}, {"tag": "h2", "text": "Appearances"}]}