{"url": "Memah_Roothes", "categories": ["Category:Legends articles", "Category:Bartenders", "Category:Business owners and executives", "Category:Coruscanti", "Category:Death Star residents", "Category:Females", "Category:Rutian Twi'leks"], "nodes": [{"tag": "h1", "text": "Memah Roothes"}, {"tag": "p", "text": "Memah Roothes was a female Rutian Twi'lek who owned and operated the Soft Heart Cantina on Coruscant, at some point prior to 6 BBY. When her establishment was burned to the ground under suspicious circumstances, she accepted an offer from the Galactic Empire to open and manage a similar operation on board the first Death Star, then under construction in the space around Despayre. She named this new location the Hard Heart in honor of her old diner. During the Battle of Yavin, Memah and several other acquaintances, including Celot Ratua Dil, with whom she had fallen in love, would escape the station just prior to its destruction."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Ryloth, Memah Roothes emigrated to Coruscant at some point before the fall of the Old Republic. Shortly thereafter she established a cantina, which she dubbed the Soft Heart, within the planet's underlevels, employing the Ragithian Human Rodo as a bouncer and security guard. Over the years, the two would become very good friends, though their relationship would never develop into an intimate one due to Rodo's beliefs."}, {"tag": "p", "text": "During the middle stages of the first Death Star's construction, she was approached by an agent of the Galactic Empire, who offered her a two-year contract to manage a cantina on the massive battle station. The pay and benefits seemed to be an excellent deal, and Memah was tempted to accept, however it was not until the Soft Heart and the entire neighborhood around it was destroyed in a fire under suspicious circumstances, that she took up the offer, as she and Rodo were now without employment options. Memah's only condition was that Rodo would be able to join her there and continue his employment, which the agent readily agreed to."}, {"tag": "p", "text": "The new cantina, which she named the \"Hard Heart\" in memory of her previous establishment, soon became a prominent after-duty stop among the many personnel, entertaining such patrons as stormtrooper Sergeant Nova Stihl; TIE/LN starfighter pilot Villian Dance; and the Zelosian con artist and smuggler, Celot Ratua Dil. Dil, as it turned out, was quite the charmer; drawing her in with his startlingly green eyes, it wasn't long before the two began dating, despite the fact that Dil did not attempt to hide that he was actually a prisoner that had recently escaped from the prison planet of Despayre."}, {"tag": "p", "text": "As work on the Death Star progressed, Memah and others of her more frequent patrons became disillusioned with the Empire and its practices. When the world that supported the Death Star's construction, Despayre, was destroyed in a test of the station's superlaser, she began to realize just what kind of place she was inhabiting—and indeed helping to prosper. With the destruction of Alderaan, this grew into open hostility to Imperial practices. She, along with several of the cantina's patrons, decided to leave the Death Star and the Empire. Eventually, she ended up escaping the Death Star, along with Dance, Dil, Teela Kaarz and Dr. Kornell Divini, although Rodo was forced to stay behind to hold off a large group of stormtroopers and was killed in the fight. Upon leaving the station with the help of Atour Riten, the defectors were briefly engaged by Darth Vader in his TIE Advanced x1 before he was forced to abandon his pursuit of the runaways to engage Luke Skywalker and his X-wing wingmen."}, {"tag": "p", "text": "Following the Death Star's destruction, Roothes and the other defectors considered their options. Ratua asked her to settle down with him managing his family's lucrative real estate business and informed her that he was in fact very wealthy due to his share in it. While angry at him for not mentioning this to her earlier, Memah agreed to go with him to meet his family."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}