{"url": "Memory_Walk", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Dark side powers", "Category:Mind-affecting powers"], "nodes": [{"tag": "h1", "text": "Memory Walk"}, {"tag": "p", "text": "Memory Walk, also known as torture by chagrin, was a Force ability first developed by the Jedi Vindicators and their guild of vigilantes which haunted the dark areas of galaxy since the Pius Dea Crusades. Through the millennia, various dark side groups utilized the ability, including the Sorcerers of Tund and the Order of the Sith Lords."}, {"tag": "p", "text": "The ability consisted of mentally reaching into the victim's mind, forcing them to relive all the worst memories of their life, both painful ones and ones that were merely embarrassing, over and over and over again to the point where it almost seemed to cause physical pain."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "First developed by the Jedi during the Pius Dea Crusades, the memory walk was a talent of the Jedi Vindicators, a sect of Jedi eventually banished for their extremist views on justice and punishment. When the Guild of Vindicators began to appear as a vigilante group across the galaxy, their capacity to violate the minds of others drew the attention of various dark side groups."}, {"tag": "p", "text": "Discovered by the Sorcerer Rokur Gepta, he found that after a brief session of torture by chagrin, the subjects demonstrated a slight increase in intelligence and efficiency after they recovered. For this reason he used it regularly on the crew of his personal command ship, the Wennis."}, {"tag": "p", "text": "When Gepta captured Lando Calrissian, he planned to use torture by chagrin to kill him. Half an hour of it and Lando was in pain like he'd never known before; Gepta believed he could make Lando last for several weeks before the gambler's mind finally snapped and he died. To make the process more personal, the Sorcerer of Tund had created a machine which would amplify his power and allow him to pick and choose which memories Lando would relive. The machine would also let Gepta alter the memories to be even worse than they were already. Fortunately for Calrissian, a squadron of Renatasians attacked, distracting Gepta long enough for the gambler to execute a plan to escape."}, {"tag": "p", "text": "Nearly a century late of years later this ability was used by Darth Maladi and Cade Skywalker against each other on the world of Wayland. Darth Wyyrlok III wielded this technique in his duel against Darth Krayt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}