{"url": "Menace_of_the_Sith", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:LEGO Star Wars: The Yoda Chronicles"], "nodes": [{"tag": "h1", "text": "Menace of the Sith"}, {"tag": "p", "text": "\"Menace of the Sith\" is the second episode of LEGO Star Wars: The Yoda Chronicles. It aired on September 4, 2013 on Cartoon Network."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Following the creation of the \"Sith clone\" Jek-14, Darth Sidious summons all of the Separatist leadership to Geonosis, where he plans to unveil his new weapon. As the Separatist leaders fly to Geonosis, there is a delay as several of them have to wait for Nute Gunray to finish drinking his coffee. When all the leaders are gathered in the Petranaki arena, Sidious tells the other Separatists that the Clone Wars are not going well for them. He reassures them that things are going to change due to Jek-14, his new Sith weapon."}, {"tag": "p", "text": "Unbeknownst to the Sith, Jedi Obi-Wan Kenobi and Yoda have infiltrated the Arena disguised as Sith. At first the Separatist leaders are impressed with Jek, especially Gunray who openly disparages the clone; earning a bolt of Force lightning from Sidious. Jek manages to impress the Separatist leaders with his display of Force powers. He destroys several columns in the arena and Nute Gunray's hat, and even creating a sign saying 'GO SITH' from the debris. When Darth Maul complains that Jek stole his theme song, Asajj Ventress replies that he is being a diva."}, {"tag": "p", "text": "Back in the Jedi Temple on Coruscant, C-3PO begs the Jedi Council to remove him as a substitute teacher for the young Padawans because they put him in grave peril. The protocol droid adds that he will suffer from an internal meltdown soon as the stress is getting to him. The Jedi agree and transfer him to Jedi Temple Food Services, for which C-3PO is grateful. The Padawans get a new teacher, Anakin Skywalker, who hates the thought of baby-sitting Padawans. When the Padawans ask him where he is taking them, Anakin replies that they are going on a journey of discovery to the frozen planet Hoth, which the Padawans are not fond of. Anakin tries to persuade the students to no avail. The Togruta Padawan, Vaasa Ti remarks that he is a great Jedi but a horrible actor."}, {"tag": "p", "text": "Meanwhile on Geonosis, Jek continues to impress the crowd with his skills. Palpatine plans to create thousands of Jek clones and has Dooku display his new cloning machine. However, this test is a failure because the resulting clone of Jek is a Dark Side midget that only has a fraction of his powers. Obi-Wan and Yoda show themselves and fighting erupts in the Arena. During the skirmish, the Jedi managed to defeat most of the Sith and their minions but Sidious managed to escape. Obi-Wan adds that the Sith is truly an evil man as he stole Palpatine's space gunship, to which Darth Maul adds that they just don't get it, but keeps quiet in order to protect Sidious' identity. Back on Hoth, Anakin takes the Padawans on a tour but gets trampled by Tauntauns to their amusement."}, {"tag": "p", "text": "Back on Geonosis, Obi-Wan and Yoda are forced to fight Jek who easily defeats them. However to Dooku's dismay, Jek refuses to execute the Jedi because they are unarmed. Regarding himself as neither Sith nor Jedi, Jek decides to run away and be himself. Both the Jedi and Sith chase after him but their ships are left wrecked in the asteroid belt around Geonosis. Jek then jumps into Hyperspace and bids farewell."}, {"tag": "p", "text": "Back on Hoth, Anakin finds himself entertaining the Padawans by giving them his prosthetic arm to play with on the advice from C-3PO, who says that he is always happy to assist and adds that Anakin shouldn't feel embarrassed. Meanwhile, C-3PO is serving burgers at the Jedi Temple Restaurant but is attacked by Cad Bane for not giving him light mayonnaise in his sandwich. C-3PO accidentally pulls one of his breathing tubes out of his head, and puts them back the wrong way. An infuriated Bane starts shooting at C-3PO and the droid runs away. As Cad Bane accidentally shoots at a fellow bounty hunter, a fight begins in the restaurant."}, {"tag": "p", "text": "Meanwhile Dooku and Grievous are traveling aboard the Separatist Subjugator-class heavy cruiser Malevolence. Both Separatists are furious that none of the bounty hunters are refusing to work for them in the wake of Jango Fett's death. Dooku orders Grievous to deploy several probe droids to find Jek. Some of the droids reach Hoth, where Anakin complains about not being able to join the hunt for Jek and the other Jedi thinking that he is not ready."}, {"tag": "p", "text": "The Padawans leave Echo Base and find Jek creating beautiful ice sculptures in the snow. Jek confesses that he doesn't want to fight but only wants to create things and to be left alone. Anakin tries to attack Jek but is not able to pass through the energy shield. Jek says goodbye to the Padawans and adds the he has to find a new home. Shortly later, Jek is attacked by probe probe droids and captured by General Grievous. R2-D2 wakes Anakin, to which the latter responds that he thinks he can be too impulsive sometimes."}, {"tag": "p", "text": "Meanwhile Dooku and Grievous start cloning Jek and depart for Coruscant. On Coruscant the Jedi Order is debating what course of action should they partake while Palpatine eavesdrops on them. Obi-Wan orders Anakin to stay put, but it is too late as he is already battling the Separatists over Coruscant. Yoda argues that it was too risky to train Anakin, but Obi-Wan answers that it was Qui-Gon Jinn's final wish. Qui-Gon appears as a force ghost and tells Obi-Wan not to blame that on him. As the battle over Coruscant rages on, Dooku produces several new Sith clones using Jek's genetic material. Unlike Jek-14, these Sith clones are loyal to the dark side and Count Dooku."}, {"tag": "p", "text": "During the battle, Anakin's ship is blown up by the Malevolence. While R2-D2 flies to Coruscant, Anakin and the Padawans create new LEGO ships with the help of the Force. R2-D2 lands at the Jedi Temple kitchen where C-3PO is working and destroys it in the process. After some difficulty, Anakin manages to find the ship's \"weak spot\" and destroys the Malevolence, sending its debris scattering over Coruscant. At the Jedi Temple, the Padawans, the Jedi, and Palpatine are cheering at the falling wreckage. Alternating between being Supreme Chancellor and Darth Sidious, Palpatine uses the Force to halt the descent of a large piece of wreckage carrying Dooku, Grievous, Jek-14, and the Sith clones."}, {"tag": "p", "text": "Dooku presents an unconscious Jek before ordering his Sith clones to attack the Jedi. As the clones attack, Jek awakes and uses his Force powers to save the Jedi by destroying the Sith clones. He then uses the Force to hurl Dooku and Grievous into the air. While Jek wins the affection of the Jedi, he tells them that he wants to be left alone and begs his new allies not to call him. Jek departs on his modified starfighter for parts unknown."}, {"tag": "p", "text": "The episode ends with Yoda putting the memories of the mission into the Jedi Chronicles. He expresses pride in his Padawans' accomplishments and compliments the valor of Anakin, who will no longer be teaching the Padawans as C-3PO has asked for the job once more. After a brief exchange, Obi-Wan chases his master Qui-Gon Jinn's force ghost over the matter of training Anakin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}