{"url": "Menstruation", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles with conjectural titles", "Category:Biology"], "nodes": [{"tag": "h1", "text": "Menstruation"}, {"tag": "p", "text": "Menstruation, or a period, was a biological occurrence involving blood that was experienced in cycles by some beings, including young female humans such as the Naboo Royal Handmaidens. They could be unpredictable, inconvenient, or painful."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The biological occurrence of menstruation, also known as a period, was experienced by some beings on a cyclical basis, including some female humans. Menstruation could be detected by blood-sensitive sensors. Some beings, such as the Naboo Royal Handmaidens serving Queen Amidala, kept absorption pads in their bathroom as an option to use during their periods. Others took suppressant shots to avoid having cycles due to their busy lives. Periods could cause beings to experience pain or cramps of varying severity that could be relieved by painkillers."}, {"tag": "p", "text": "Menstruation could be an unexpected occurrence. During fourteen-year-old Padmé Amidala's first public tour as queen in 32 BBY, Amidala was caught off guard when she failed to anticipate the start of an unusually painful period. Her handmaiden Rabé expressed surprise that Amidala was not using suppressant shots. Yané attributed Amidala's experience to increased stress, and made a note on the queen's medical profile for the droids to address this when they returned to Theed. The queen's decoy, Sabé, appeared publicly as the queen while Amidala waited in bed for her painkillers to take effect. On another occasion, Mariek Panaka and her husband, Quarsh Panaka, both of the Royal Naboo Security Forces, were alerted by a security sensor in Amidala's suite that someone was bleeding. They discovered twelve-year-old handmaiden Saché was unaware she had started her period. Mariek told her husband that it was likely the older handmaidens utilized suppressant shots as she and other guards who cycled did, and that he was an idiot for using a blood-sensitive sensor in a teenage girl's bedroom."}, {"tag": "p", "text": "During the Age of the Empire, after Jyn Erso joined Saw Gerrera's Partisans but before she turned fourteen, Gerrera recruited fellow Partisan Idryssa Barruck to have a private conversation with Erso about her health and hygiene."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Menstruation was first depicted in the 2020 young adult novel Queen's Peril by E. K. Johnston, though its origins in Star Wars go back to Beth Revis' 2017 novel Rebel Rising. According to Johnston, Revis was asked by fellow Star Wars author Jason C. Fry to include a plot device within the book to demonstrate that Saw Gerrera was ill-equipped to parent a young Jyn Erso. This occurred as an indirect mention of a discussion \"about hygiene and health.\""}, {"tag": "p", "text": "In the acknowledgments of Queen's Peril, Johnston gave praise to editor Jennifer Heddle for her work on the book, going on to thank her for helping to ensure that a page on menstruation would be created for Wookieepedia. Johnston later expressed her happiness on her Tumblr blog upon learning that an article had indeed been created. Though the word \"menstruation\" is used in the book's acknowledgment, the novel itself uses \"period,\" \"cycles,\" and indirect mentions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}