{"url": "Mephitisian", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Colonies species", "Category:Mephitisians"], "nodes": [{"tag": "h1", "text": "Mephitisian"}, {"tag": "p", "text": "The Mephitisians were a four-armed sentient species from the planet Mephitis. Their homeworld had a noxious atmosphere, and as a consequence, the species had evolved adaptations to limit exposure to these gases, such as lids over their eyes and the lack of a nose. The Mephitisian Mosh Pelkan gained prominence on the planet Questal as a Turf Boss—a criminal leader with quasi-official authority. He hosted a celebration for the birthday of local Imperial Moff Bandor, which was infiltrated by Rebel Alliance agents."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Mephitisians were a sentient species with purple-tinged skin and four arms, each of which they could use independently of the others. Having evolved on a world with a noxious smell, they had adapted to their environment: the Mephitisians had no noses, so they lacked the ability to smell, and their black eyes were small and covered with clear lids. They had large upper lips that they flapped over their mouths to limit their exposure to the air. The Mephitisians were dexterous beings. Their heads had two horn-like projections, which were sensitive to vibrations and air movements."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mephitisians evolved on the planet Mephitis, located in the south-western portion of the Colonies. The atmosphere on their homeworld was noxious and offensive to all species that visited the planet. The Mephitisians were part of the galactic community from the time of the Galactic Civil War. The Mephitisian Mosh Pelkan was a Turf Boss on the planet Questal. Turf Bosses were criminal leaders who had agreements with the official District Commanders to keep down insurgency in exchange for the Commanders turning a blind eye to their activities. Originally traveling to the planet with the intention of becoming an ardanium prospector, Pelkan soon realized that importing illegal goods earned a greater profit. He established a significant power base and was a popular figure in Gralleenya, Questal's capital city. When Imperial Moff Bandor was given jurisdiction over Questal, he gave Pelkan control over a district of Gralleenya."}, {"tag": "p", "text": "Pelkan hosted a costume gala at his mansion to celebrate Bandor's birthday. The party was infiltrated by agents of the Alliance to Restore the Republic, who were searching for the missing agent Tiree. The Rebels believed Pelkan could provide them information on Tiree on the advice of local bar owner Tan Shilley, who had earlier suggested to Tiree that he contact Pelkan. At Pelkan's party, entertainment was offered in the form of gladiatorial combat."}, {"tag": "p", "text": "Despite their best efforts, the Rebel agents gained no useful information from Pelkan, but were instead forced to fight in the arena against his champion, Cromag. They defeated Cromag and escaped the party, eventually rescuing Tiree from where he was being held in Bandor's Palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mephitisians were created by Robert Kern for the roleplaying adventure The Game Chambers of Questal, published by West End Games as a standalone paperback in 1990, and as part of the collection Classic Adventures: Volume Five in 1995. In the scene involving the Mephitisian Mosh Pelkin, there are five examples of why the players might end up fighting Cromag; whether one of these or an original reason, the fight is a set part of the adventure."}, {"tag": "p", "text": "In Roman mythology, Mefitas was a goddess synonymous with poisonous vapors emitted from the ground in swamps. The Mephitisians and their homeworld possess names similar to this goddess and share traits of hers on account of the planet's obnoxious atmosphere."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}