{"url": "Mercenary/Legends", "categories": ["Category:Legends articles", "Category:Mercenaries", "Category:Service occupations"], "nodes": [{"tag": "h1", "text": "Mercenary"}, {"tag": "p", "text": "A mercenary (merc for short), sometimes also called soldier of fortune, hired gun, or free lance, was a soldier who fought or worked in other ways (mostly in those involving violence) for any faction in exchange for a desirable amount of money."}, {"tag": "p", "text": "Sometimes, the word mercenary was used as a derogatory term for someone who valued credits over other things, such as ideals or kinship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Mercenaries served mostly as troopers or pilots for hire, but also as bodyguards and enforcers. They worked in other military assignments as well, for example in those involving testing the equipment, liberating abducted people or retrieving, transporting and protecting valuable goods or items. Some even outfitted other beings with devices and equipment they may need. They appeared in all known eras, being especially active when conflicts erupted. Mercenaries were often said to be opportunistic and concerned only on profits and \"survival to fight another day\". Mostly they had \"neutral\" affiliation and were hired by many fighting forces without actually joining them. In some cases though, they grew sympathetic to their clients, such as Kyle Katarn or Han Solo, who eventually joined the Rebel Alliance. Many mercenaries were also defectors from armies or ex-soldiers, often from special forces, thus having versatility and abilities very useful in their occupation."}, {"tag": "p", "text": "Mercenaries always were equipped with weapons, often they also carried personal armor and multiple devices allowing them to fulfill their employer's demands."}, {"tag": "p", "text": "Many civilizations were specialized in mercenary business. The Mandalorians have served the galaxy as mercenaries for thousands of years. Having complicated history behind them, Mistryl Shadow Guard dedicated themselves to serve as mercenaries to save their people. Due to their incredible brute strength and low intelligence, Gamorreans were often employed as mercenaries for less demanding. Many Rodians, Trandoshans, Ubese and Weequay were working throughout the galaxy as mercs. Due to their strong military traditions, gungans were also highly regarded as mercenaries."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mercenaries from several factions (like Echani, Iridonians and Mandalorians) were employed in the Jedi Civil War by both Sith and Galactic Republic forces. Prior to the splitting of the Mandalorians into two factions, they were among the most famous and skilled mercenaries in the galaxy. During the Clone Wars, the Separatists often hired mercenaries to perform special operations and other services that required more finesse or creativity than could be found in their droid army. The Republic was not above hiring mercenaries for many of the same reasons. Under the rule of the Galactic Empire, powerful mercenary organizations were either employed by the Empire or hunted down and wiped out, although many mercs were defectors from the Imperial service.\nThe Rebel Alliance hired several privateers in the Galactic Civil War."}, {"tag": "h2", "text": "Mercenary organizations"}, {"tag": "p", "text": "Only few large mercenary organizations existed in the galaxy. The forces of the galaxy tended to pull such organizations into conflict too regularly for mercenaries to exist in organized companies. Instead, individual mercenaries formed brotherhoods, that often existed as loose networks of contacts and contract makers. These brotherhoods provided some measure of camaraderie amongst the members of this otherwise very lonely business. Occasionally, members of the brotherhoods found themselves employed by opposite sides of armed conflicts, forcing them to fight against each other. But when the contract was over, the brotherhood took precedence. The largest of these brotherhoods was the Brotherhood Mortalis, founded during the final years of the Old Republic."}, {"tag": "h3", "text": "Mandalorian mercenaries"}, {"tag": "p", "text": "Mandalorian mercenaries, known informally as Mandalorian Mercs, were regarded as some of the finest soldiers-for-hire in the galaxy, greatly due to their warrior-based culture, providing the combat training to its members even when they are very young."}, {"tag": "p", "text": "After the Mandalorians were defeated by the Galactic Republic during the Mandalorian Wars in the year 3960 BBY, the Jedi Knight Revan disarmed and disbanded the Mandalorian Clans, and allowed them to scatter in disheartened groups across the Outer Rim Territories. There, devoid of leadership and honor, they degenerated. A few Mandalorian Neo-Crusaders survivors returned to the Mandalore system, but many veterans, including Canderous Ordo, humbled their pride and became mercenaries for hire."}, {"tag": "p", "text": "The skilled Mandalorian Mercs became highly sought after in the aftermath of the Mandalorian Wars. During the Jedi Civil War and the Dark Wars, they gathered on Kashyyyk, Dantooine, Nar Shaddaa, Manaan, and many other worlds where they hired themselves out to the Sith, the Republic, and various criminal organizations such as the Exchange."}, {"tag": "p", "text": "Canderous Ordo returned to the former Mandalorian headquarters of Dxun and began to rebuild Clan Ordo. Through skill in arms and sheer cunning, he rose to the rank of Mandalore and began to gather the remaining Mandalorian Clans. While journeying with the Jedi Exile during the First Jedi Purge, he was able to convince several groups of Mandalorian mercenaries to give up their independence and join themselves to his cause."}, {"tag": "p", "text": "It is unknown how many Mandalorians Canderous eventually managed to recruit, but in any case, Mandalorian mercenaries became a traditional part of Mandalorian society and they continued to operate for millennia."}, {"tag": "p", "text": "Jaster Mereel, a later Mandalore, would later try to purge the dishonorable brigandage adopted into their society by superseding their old code with the Supercommando Codex, bringing honor back to their society. The Death Watch, a splinter group, opposed such change and fought the True Mandalorians in a civil war to determine their future."}, {"tag": "p", "text": "A later group called the Mandalorian Protectors, formed by Mandalore the Resurrector, would revive mercenary traditions and prior to the Yuuzhan Vong War, Mandalorians were once again in high demand."}, {"tag": "h3", "text": "List of mercenary units"}, {"tag": "p", "text": "Mercenaries worked either as freelancers or as members of some larger military unit or mercenary guild. Some of them included:"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Most Star Wars mercenary units are interstellar versions of real-world private military companies, a mercenary-type, privately owned paramilitary organization that provides security detail and military support. As with Aurodium Sword, PMCs often employ retired ex-Special Forces veterans."}, {"tag": "p", "text": "The mercenary is an advanced class for the bounty hunter class in the Star Wars: The Old Republic MMO video game. This advanced class specializes in dual-wielded blasters, missile launchers, and dealing damage in battle as well as healing. The Republic counterpart for this archetype is the Commando."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}