{"url": "Mercia_Holt", "categories": ["Category:Legends articles", "Category:Archaeologists", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Mercia Holt"}, {"tag": "p", "text": "Mercia Holt was a female Human archaeologist who was born during the time of the New Sith Wars. Holt lived on the planet Aquilaris Minor with her husband, Aron Holt, and her daughter, Kerra Holt."}, {"tag": "p", "text": "In 1042 BBY, while expecting their second child, Mercia and Aron were captured during an attack on their homeworld by the forces of the Sith Lord Odion. The pair were subsequently transferred to Odion's Project Pandemonium, an effort to locate the Helm of Ieldis. Their last known location was Sarrassia where they cooperated with the Grumani Hierophants to conceal the fact that the Helm was located on Skarpos, a bleak desert world in the Menagerie. There, she and her husband sacrificed themselves in an attempt to deny the Sith with access to the Helm, by using explosives to destroy the chamber within the Morbollon Mesa storing it."}, {"tag": "p", "text": "Despite their deaths, their sacrifice motivated Kerra to stop Odion's bid to dominate the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Wartime Separation"}, {"tag": "p", "text": "Mercia Holt was an archaeologist and a field researcher associated with the University of Sanbra, who lived on Aquilaris Minor during the Republic Dark Age. She married Aron Holt and became the mother of Jedi Knight Kerra Holt, residing at a house in the city of Capital Cay. Prior to the Sith invasion of Aquilaris, she and her husband Aron was involved in an archaeological research project sponsored by Sanbra University which was searching for the Helm of Ieldis, a Sith artifact developed by Lord Ieldis. The Helm was capable of turning sentient beings into mindless killers by harnessing dark side energies. During a research expedition to Sarrassia, she was accompanied by her husband and her young daughter Kerra. They established contact with the Grumani Hierophants, one of the many religious sects on the planet. They befriended the Grumani priestess Aunt Zoojoo who became a close family friend. When Kerra climbed onto the roof of the Great Hall, she caused the abbot to suffer a stroke. Kerra was later reprimanded by both her parents for her mischievous actions."}, {"tag": "p", "text": "In 1042 BBY, Sanbra itself was invaded by the Sith Chagras Hegemony and the researchers were forced to scatter. The Holts along with ten other researchers fled to Aquilaris Minor where they had planned to meet some Jedi to discuss their findings. However, Sith Lord Odion obtained intelligence about the meeting and launched an attack on Aquilaris Minor to capture the researchers, under the pretext of capturing the Jedi Knight Vannar Treece, a perennial foe of the Sith. At that time, Mercia was pregnant with her second child."}, {"tag": "p", "text": "Later that year, Aquilaris was invaded by Odion's forces who wiped out the weak Republic defenses and slaughtered and enslaved much of the population. During the invasion of Capital Cay, she attempted to conceal her research while her husband was seen sporting a blaster pistol in the event that Sith troops stormed their house. They planned to flee to the harbor and escape on a submersible manned by the Seacroppers' Guild."}, {"tag": "p", "text": "While their house was being besieged by Sith troopers, Mercia instructed her daughter Kerra to flee to the harbor first. Her parents would then meet up with her and they would flee with Joad Kreel and his father into the open seas. Finally, Mercia told her daughter not to come back looking for them and promised they would join her. After Kerra fled, the house was invaded by a group of Sith troopers who overpowered and took the couple captive. Odion had ordered his troops to capture the researchers alive so that he could obtain the Helm of Ieldis before his Sith compatriots could."}, {"tag": "p", "text": "Her daughter Kerra would flee to the harbor but would return when her parents did not join her and Joad. Kerra subsequently was found by the Jedi Knight Vannar Treece who managed to evacuate her offworld in a starfighter. She subsequently became a Jedi Knight herself and would return to help her homeworld during the Aquilaris campaign."}, {"tag": "h3", "text": "Captivity and Death"}, {"tag": "p", "text": "Due to their occupations, Mercia and her husband were forcibly inducted into Odion's Project Pandemonium which aimed to locate the Helm of Ieldis. These researchers became part of Odion's core research team tasked with capturing the Helm. During their incarceration, Mercia at some point gave birth to a second child but mother and child were forcibly separated. The child was sent to an Odionate cloister, a network of orphanages within the Odionate where children were indoctrinated into slaves and warriors for Odion's death cult."}, {"tag": "p", "text": "In 1039 BBY, Mercia and Aron returned to Sarrassia as part of their research project. This visit occurred a few days prior to the conquest of Sarrassia by Lord Ayanos Bactra. While they revealed to Aunt Zoojoo that they had been sent by Odion to find the artifact, she sensed that they had not yet succumbed to his nihilistic 'sickness.' Together, the pair conspired with the Grumani Hierophants to locate and hide the Helm of Ieldis from Odion. By translating ancient Hierophant markings, Mercia found out that the Helm was located at the Grumani temple chamber at the Morbollon Mesa on Skarpos, a barren desert world in the Menagerie, a realm ruled by the Sith Lord Malakite."}, {"tag": "p", "text": "Mercia and Aron agreed to deny Odion access to the Helm at all costs. In exchange, the Hierophants agreed to guard the temple beneath Mount Diligence at all costs. On Skarpos, the Holts found the Helm. Lacking the means to destroy the Helm themselves or escape since they were besieged by a Sith army, the Holts detonated explosives within the chamber, causing it to collapse. The Holts were buried beneath rubble but they succeeded in denying Odion further information about the Helm. Prior to their deaths, they left their daughter with a holorecording, outlining the rationale for their sacrifice."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Since they never returned from that trip, Zoojoo could only assumed they had succeeded. Following that trip to Sarrassia, there were no further written records of what they did after that. Prior to their Sarrassian trip, Kerra deduced that Mercia had given birth to another child under Sith captivity but little else was known.In 1032 BBY, Kerra Holt infiltrated the Odionate disguised as a Novitiate recruit following the Battle of Darkknell with the connivance of rival Sith Lord Daiman, the estranged younger brother of Odion. At Jubalene, she learned that her parents had been captured by Odion and had been conscripted into Project Pandemonium."}, {"tag": "p", "text": "Kerra subsequently traveled to Sarrassia during the Sith invasion and quickly learned about details of their Sarrassian trip from Aunt Zoojoo prior to her demise. After learning that the Helm was located on Skarpos, Kerra would follow her Sith companions in her quest to ascertain the fate of her parents and her younger sibling.During the Second Battle of Skarpos, Kerra managed to enter the Grumani temple chamber only to discover a mound of earth and that Odion had already claimed the Helm for himself."}, {"tag": "p", "text": "Kerra was subsequently taken captive by Odion and brought to the top of the mesa. General Beld Yulan's troops did an excavation of the collapsed temple chamber and discovered the skeletal remains of Aron Holt and his wife. The realization that her parents had died drove Kerra into a deep grief, which activated the Helm of Ieldis. The Helm was capable of amplifying negative emotions like grief and despair to increase its user's dark side powers. Odion subsequently use the Helm to destroy three entire armies on Skarpos, forcing his two rivals Lords Daiman and Malakite to flee."}, {"tag": "p", "text": "Following the battle, Beld Yulan showed Kerra the holorecording left by her parents where they explained their decision to bury themselves with the Helm in order to deny it to the Sith. During the recording, Mercia lamented the loss of their second child to Sith captivity and also reached out to Kerra, expressing her hopes that she had somehow survived the events on Aquilaris and found someone to take care of her. She also reiterated that they never gave up on her and that their sacrifice would save future future generations from the ravages of the Sith. While Yulan was unable to understand why they chose to die for everyone else, Kerra perfectly understood that if death could have a meaning then life must have a meaning. This made Kerra better appreciate the sacrifices of her parents and galvanized her determination to stop Odion from testing the Helm on more subjects: the children incarcerated with the Odionate cloister at Vanahame."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}