{"url": "Mercy_Mission", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Mercy Mission"}, {"tag": "p", "text": "\"Mercy Mission\" is the fifth episode of the Star Wars: The Clone Wars television series' fourth season. It is the first in a two-part story storyline about R2-D2's and C-3PO's adventures. It aired on October 7, 2011."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"After groundquakes have devastated the planet Aleen, a Republic relief effort arrives, including the droids R2-D2 and C-3PO. When the native Aleena's pleas go unheard, it becomes the duty of the droids to embark on a surreal journey through Aleen's subterranean world to save the planet.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Senator Amidala and Master Yoda contact Commander Wolffe, the leader of the humanitarian relief expedition, for a status report on the situation on Aleen, which is fairly joyful considering the circumstances. A fully loaded relief force—including C-3PO and R2-D2 sent along as translators and to interface with the equipment—descends to the surface, which is planned to be only a brief stay because the troops would have to return to the war as soon as possible. The king of the Aleena, Manchucho, welcomes Wolffe and his troopers enthusiastically, though an aftershock disrupts the greeting somewhat. When C-3PO tries to calm the startled villagers just as the quake stops, the Aleena view the golden droid as some sort of divine messenger and ask the Republic troops to put the earth to rest, a request Wolffe understandably has to pass."}, {"tag": "p", "text": "While Wolffe and C-3PO explain the function of the delivered supplies to Manchucho, Boost, Sinker, and R2-D2 enter the local Republican communication station to survey and repair the damage the quake has inflicted, accompanied by a few Aleena, who become increasingly impressed with the \"magics\" their helpers make work. When C-3PO joins R2 in the station, the villagers are eager to show him something and lead the two droids to a collapsed structure, which contains a huge golden seal embedded in the ground. The seal is revealed to be the entrance of a tunnel leading into the subterranean regions of the planet; when another quake hits the area, C-3PO accidentally slips through the partly uncovered opening and plunges into the dark depths, followed by R2. A tangle of branches cushions 3PO's fall, but then the rubble shaken loose from another shock clogs the entrance tunnel, trapping the droids underground. One of the Aleena tries to fetch help, but with no knowledge of their language Wolffe misunderstands their intentions, so Manchucho and a few of his people race to the structure and initiate a chanting ritual."}, {"tag": "p", "text": "While exploring the tunnels they have landed in, C-3PO and R2-D2 encounter speedy, sparkling lights chasing them and subsequently stumble into a strange subterranean ecosphere which is inhabited by sentient, tree-like beings called Kindalo, who demand they leave since they claim that the surface dwellers \"destroy the peace.\" After C-3PO convinces them they bear the Kindalo no ill will and mentions that they are here to help with the earthquakes, the Kindalo send the droids to Orphne, an amphibian-like humanoid with mystical powers. Orphne explains that a mutual balance has existed between the Aleena and the subterranean world, which was supposedly unsettled by surface dwellers who have breached the Underground's most vital sanctum. The Underground dwellers depend on the soil of the planet filtering the surface air and rendering it fit for them to breathe, and without this process the air proves toxic to them; the Underdwellers have therefore set off the earthquakes in an attempt to seal the opening. C-3PO offers to fix the damage, and before she dissolves into a swarm of flying fairy sparks, Orphne mysteriously asks the droids to find their true purpose and gives them a parting riddle:"}, {"tag": "p", "text": "You can run but can not walk\nYou have a mouth but cannot talk\nYou have a head but never weep\nYou have a bed but never sleep\nAsk yourself, who are you?"}, {"tag": "p", "text": "With no other option left, C-3PO attempts to solve the riddle. By viewing the seals in Orphne's chamber (which are in fact elemental signs), however, R2 finds the answer first: a river. By wetting the water seal, R2 activates a waterspout which carries the chamber's central floor plate—with him and C-3PO aboard—through the ceiling back to the surface, right into the middle of Manchucho's chanting congregation. Poisonous air from the Underground then leaks to the surface through the seal tunnel, and C-3PO finally understands that, because they are droids and thus not dependent on air, he and R2 are the only ones who can close the breach, which is in fact the unsettled seal. Together, the droids put the seal back into place, ending the earthquakes. Though their efforts go unappreciated with the skeptical clone troopers, the Aleena give them their heartfelt gratitude and a very cordial farewell."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In this episode's online episode guide, the title has the tagline, \"The Droids Are In Trouble Again!\" \"In Trouble Again\" was the theme song to the Star Wars: Droids animated television series."}, {"tag": "p", "text": "While airing the episode, Cartoon Network erroneously called it \"Mercy Mansion.\""}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "\"Mercy Mission\" was the least watched episode of the series to date with only 1.35 million views."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}