{"url": "Mercy_Mission_(short_story)", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:The Rise of the Empire"], "nodes": [{"tag": "h1", "text": "Mercy Mission  (short story)"}, {"tag": "p", "text": "\"Mercy Mission\" is a canon short story by Melissa Scott that was published on October 6, 2015 as part of The Rise of the Empire paperback compilation. The story is set between Lords of the Sith and Tarkin, and features Twi'lek pilot Hera Syndulla as its protagonist, serving as a prequel to her canonical debuts in the novel A New Dawn and the animated TV series Star Wars Rebels."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Years before she led the crew of the Ghost, Hera Syndulla was a young pilot looking to make a difference in the galaxy. Hera sets out with Goll — a close ally of her father, Cham Syndulla — on a dangerous mission to help the citizens of her homeworld, Ryloth, now languishing under the might of the Empire."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the defeat suffered by the Free Ryloth Movement, Hera Syndulla and the Karthakk Group travel aboard the YT-209 freighter Eclipse to smuggle a shipment of gattis-root extract to Ryloth. For the mission, Hera is accompanied by former Free Ryloth leader Goll, the ship's human captain Krysiant Rheden, \"Clinician\" Trae Baratha, the Nikto gunner Ul'ligan,and the Sephi gunner Eira Tay. Due to the mission's sensitivity, Hera has to leave her C1-series astromech droid Chopper behind aboard the Ghost. The Empire has rationed the supply of gattis-root extract in order to ferret out fugitive Free Ryloth insurgents. Due to the dangerous nature of the mission, the Karthakk Group members man the ship's weapons. Upon entering the Ryloth system, their ship, which is posing as the freighter Tirion, is scanned by an Imperial cruiser and cleared for entry. Despite her strained relationship with her father Cham Syndulla, Hera had volunteered for the mission."}, {"tag": "p", "text": "To mislead the Imperial space flight control, Hera and the rebels decide to cut the Imperial auto-control system once they have reached the right altitude. This would trick the Imperials into thinking that their ship has crashed and enable them to smuggle their stash to the city of Lessu. After reaching Marker 210, Hera and Krysiant Rheden disengage the auto-control system. Their actions create a power glitch in the Imperial space flight control system. Moff Delian Mors, the Commander of the Imperial Forces on Ryloth, learns about the disappearance of the Tirion and dispatches a flight of V-wing starfighters under Lieutenant Niol to investigate."}, {"tag": "p", "text": "Three Imperial V-wings intercept the Eclipse but the rebels shoot down the enemy starfighters following a brief dogfight. However, the Eclipse's engines, long-range sensors, and the main transmitter are damaged. Captain Rheden is also injured. After some deliberation, the rebels decide to continue their supply mission and to stop the ship somewhere for repairs. Approaching Lessu, Hera lands the Eclipse in an abandoned commercial landing zone to the city situated beyond the viewing range of the Imperial monitoring stations. There, the rebels deliver their supplies and complete their repairs."}, {"tag": "p", "text": "After learning that the unidentified freighter has landed on the outer surface of the city, Moff Mors orders Imperial starfighters to intercept the ship. However, the Eclipse succeeds in delivering its supplies and manages to flee into hyperspace. In response, Moff Mors orders a full lockdown of the city and places a bounty on the freighter, the cargo, and its eventual recipients. Having completed their mission, Hera sets the Eclipse on course for Manda. Hera and the mixed Twi'lek and Nikto crew reflect on the solidarity between the two subject peoples. Goll also compliments Hera for her leadership skills."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Del Rey press release announcing the story stated that \"Mercy Mission\" bridges the gap between Lords of the Sith and Tarkin. Both novels take place five years after the founding of the Empire, in 14 BBY. However, in the story itself, Moff Delian Mors reminisces about the Emperor's visit the year before, which was shown in Lords of the Sith. This comment suggests that contrary to the press release, the short story actually takes place in 13 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}