{"url": "Aro_N%27cookaala", "categories": ["Category:Canon articles", "Category:Guards", "Category:Gungans of unspecified race", "Category:Males", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Aro N'cookaala"}, {"tag": "p", "text": "Aro N'cookaala was a male Gungan security guard at the prison moon Substation Grimdock. He was stationed in Administrative Sector 44-B when Han Solo visited the prison to gather information about Fyzen Gor and the Phylanx Redux Transmitter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A security guard in Administrative Sector 44-B of the prison moon Substation Grimdock, N'cookaala despised his job, but was forced to work there due to his inability to find affordable housing on Naboo."}, {"tag": "p", "text": "In 7 ABY, after Han Solo and Lando Calrissian were threatened by the Pau'an gangster Fyzen Gor, they undertook a mission to Substation Grimdock to retrieve information on him. Solo, along with the Wookiee Chewbacca and the Ewok slicer Peekpa, encountered N'cookaala while trying to reach the Grimdock Archive. Solo attempted to greet the Gungan with stereotypical Gunganese speech patterns, but N'cookaala stopped him, ranting about his assumption. When Solo was unable to provide their cover story for accessing the substation's archives, Peekpa gave N'cookaala an explanation, which he believed."}, {"tag": "p", "text": "N'cookaala led the trio to the Grimdock Archive, where Peekpa searched for information on Gor and the Phylanx Redux Transmitter. However, Peekpa triggered an alarm, and the Sef Con troopers that worked at the prison were alerted. N'cookaala entered the archive, informing Solo's team of the situation, before exiting to confront the Sef Con troopers. When the troopers demanded that he step aside, N'cookaala refused, shooting them down. With more Sef Con troopers on their way, N'cookaala led Solo, Chewbacca and Peekpa toward a side exit, but their path was blocked by Sef Con's Forosnag Attack Battalion."}, {"tag": "p", "text": "Peekpa sliced into Substation Grimdock itself, opening the floor beneath the troopers and their forosnags. However, she was unable to stop the rest of the floor from disappearing, and Chewbacca used a suction spike on his bowcaster to save them from falling the entire way down. They landed safely on the ground, but discovered that the lower levels of the prison were inhabited by carnivorous bastaks. Aro and Peekpa ran away from the crustaceans, but Solo was mesmerized by their hypnotic call. Chewbacca broke Solo's eye contact with the bastak, and they continued to run from the creatures."}, {"tag": "p", "text": "Aboard the Vermillion, the starship Solo and his team had arrived on, Calrissian was able to use a comlink and the droid DRX-7 to find their location. As Solo attempted to kill the bastaks with thermal detonators, they were saved by Taka Jamoreesa, who distracted the bastaks while they climbed into the Vermillion. The ship flew through the middle of the standoff occurring near Substation Grimdock, and were eventually boarded by the New Republic's Captain Krull, who requested information about their mission. With the help of Senator Leia Organa, Krull was informed of the mission's secrecy, and was dropped off, along with N'cookaala, on the Tribulan Vort."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Gungan, N'cookaala took offense when people stereotyped his species, believing that the stereotypes were false and that those who used them were uninformed. He enjoyed providing reasons against using stereotypes, ranting triumphantly to prove his point. N'cookaala was also irritated about the divide between the Naboo and the Gungans, which he felt had barely changed since the Battle of Naboo. He also hated working at Substation Grimdock, and its Imperial-supporting management, satisfied upon being able to shoot down troopers of Sef Con."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As he worked as a security guard, he had some ability to use a blaster, even against the highly elite Sef Con troopers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aro N'cookaala first appeared in Last Shot, a 2018 canon novel written by Daniel José Older."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}