{"url": "Merei_Spanjaf", "categories": ["Category:Canon articles", "Category:Corulag residents", "Category:Females", "Category:Grav-ball players", "Category:Gray Syndicate members", "Category:Humans", "Category:Resistance fighters", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Merei Spanjaf"}, {"tag": "p", "text": "Merei Spanjaf was a human female and the girlfriend of Zare Leonis. She was tech-savvy, and she used her abilities to help Leonis uncover the truth about his missing sister Dhara Leonis. Hailing from the planet Corulag, Spanjaf spoke with a Core Worlds accent and played kicker for the AppSci SaberCats grav-ball team when she moved to Lothal. She was close to her parents, Gandr and Jessa Spanjaf, who affectionately called her \"Mer Bear.\" While searching the Imperial databases for information about Dhara, Merei came into contact with a sympathetic classmate named Jix Hekyl, who put her in touch with a criminal organization called the Gray Syndicate."}, {"tag": "p", "text": "Through the Gray Syndicate, Merei managed to acquire snoopers that allowed her to hack into the Imperial data network on Lothal. In an effort to access declassified documents on Dhara, she obtained a stolen Imperial decoder with the connivance of the Spectres, a rebel cell that operated on Lothal. Merei's data breach of the Imperial data network eventually drew the attention of the Imperial authorities who assigned her own mother Jessa, a renown data-security specialist, to investigate the breach. Merei's problems were further complicated when the Gray Syndicate's boss Yahenna Laxo utilized her services as a courier in return for supplying the snoopers. In an attempt to elude the Imperial investigators and to break free of her debt to the Gray Syndicate, Merei staged her own kidnapping and framed Laxo; leading to a deadly raid on syndicate's headquarters in Ake's Tavern which killed numerous individuals."}, {"tag": "p", "text": "Guilt-ridden by her role in the deaths of many people, Merei endeavored to help an elderly fugitive named Holshef escape off-world. This plan, combined with the continuing Imperial investigation into the Transportation Ministry data breach, set into a motion a chain of events that led Merei to flee Lothal with her parents and the Leonis family with the assistance of Old Jho and the Spectres rebel cell. After learning that Zare had been exposed and put on trial before a military tribunal, Merei and her new-found rebel allies took part in a successful mission to rescue Zare and his sister Dhara Leonis from Area Null on the planet Arkanis."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Moving to Lothal"}, {"tag": "p", "text": "A native of the Core Worlds planet of Corulag, Merei Spanjaf and her parents migrated to the backwater Outer Rim world of Lothal. Her parents, Jessa and Gandr Spanjaf, were data-security specialists and sought to take advantage of the new Imperial developmental program on Lothal. She enrolled at the Junior Academy of Applied Sciences where she joined the school's grav-ball team, the AppSci SaberCats, and befriended two Human boys Zare Leonis and Beck Ollet; the former another recent migrant and the latter a third-generation Lothalian resident. Both boys were fellow SaberCat players with Zare being the center-striker of the team. The SaberCats were coached by an elderly Duros coached named Ramset."}, {"tag": "p", "text": "While discussing strategies prior to an upcoming game against the rival West Cap City Carvers team, Merei and Zare talked about their homeworlds and the different grav-ball rules on Lothal. While Spanjaf was familiar with the Corellian rules, she and Zare were unfamiliar with the Lothalian variant of the game. After further discussions, Zare agreed to assign Merei to be the SaberCats' kicker. During a match against the Carvers, Spanjaf's kick along with the fullback player Ollet's \"big carry\" helped the SaberCats score a victory by a narrow two points. As a result, Merei came to develop a warm and close friendship with Zare and Beck."}, {"tag": "h3", "text": "Three is Company"}, {"tag": "p", "text": "After learning of Merei's computer hacking skills, Zare and Beck asked Spanjaf to locate the latter's old family homestead and orchard in the Westhills. To Beck's dismay, Merei discovered that his family's former orchard had been reclassified for mining extraction. Beck Ollet had recently moved to Capital City after the Empire bought his family's lands. While the Imperials had compensated his family, Beck was upset that the Empire was disrupting Lothal's traditional way of life particularly the jogan fruit harvesting tradition."}, {"tag": "p", "text": "The day after a successful match against the Green Dragons, Beck took Merei and Zare on a trip to see the \"real Lothal.\" This proved to be Merei and Zare's first trip to the Lothalian countryside. While traveling to Beck's former orchard in the Westhills on jumpspeeders, Merei and Zare learned more about Beck's grievances against the Empire which were mainly linked to his unhappiness with the rapid industrialization that was transforming Lothal's countryside. Upon arriving at Beck's old orchard, they discovered that the Empire was using harvester droids to harvest the jogan fruits. These droids proved incompetent and ended up bruising the fruits. These only hardened Beck's feeling against the Empire, which would later have implications for Merei and Zare."}, {"tag": "p", "text": "Following a match against the Thrashers, Beck took Merei and Zare took them on a night trip to his family orchards. Merei and Zare reluctantly agreed to follow him. Upon arriving, they discovered a group of unknown insurgents planting detonator on several Imperial seismic surveyors, which had been sent to look for minerals beneath Beck's orchard. The insurgents disappeared as soon as Merei and her companions arrived. Zare quickly contacted the Imperial authorities who sent men to defuse the explosives and to apprehend the insurgents. Merei and Zare quickly deduced that Beck was somehow sympathetic or linked to the insurgents when he misled the authorities by telling them that the insurgents had gone north; when in fact they had actually gone south. Despite their concerns, Merei and Zare agreed to conceal Beck's actions because they were teammates."}, {"tag": "p", "text": "The three friends did not discuss the orchard incident throughout the winter season. Whenever Zare or Merei questioned him, he would claim that he had to study for the final examinations. Later that year, the Junior AppSci's xenophobic athletic director Janus Fhurek unilaterally transferred the SaberCats' two alien players, the Aqualish Hench Sina and the Rodian Frid Kelio, to another school after Zare refused to exclude them from the team. When Zare expressed anger at the situation, Merei exerted a calming influence and advised her friend to pick the right battles. She reminded him that he was headed to a career as an agricultural scientist or Imperial military officer and that he should not let sports team politics bother him too much. Zare reluctantly agreed after recalling that he still had a team to lead."}, {"tag": "p", "text": "Later, Merei and Zare found an opportunity to get back at Fhurek. Using her hacking skills, Spanjaf discovered that the athletic director had made a bet that the SaberCats would win by eight points during the final grav-ball tournament match at the end of the winter season without alien help. Using this information, Zare carefully guided his team to victory over the Kothal Roughnecks by a margin of six points; causing Fhurek to lose his bet. For her part, Merei followed Zare's instructions during the game. After Fhurek retaliated by making life difficult for Zare, Merei encouraged her boyfriend to focus on his studies since Fhurek was connected to senior staff at the Academy for Young Imperials."}, {"tag": "h3", "text": "Spring of Rebellion"}, {"tag": "p", "text": "During the spring season, Merei, at the request of Zare, hacked into the Imperial Academy's records and discovered that her boyfriend's enrollment application was under review. Fhurek had sent a file questioning Zare's fitness for Imperial service. When Zare panicked, Merei told him to calm down and explained that she could not do anything since any attempts to manipulate the database would expose her hacking. Merei advised her friend again to keep his head down and to focus on getting good marks so he could enroll at the Academy. Zare complied and focused on his studies for the next two months. During this period, the couple spent more time together and explored Capital City's environs."}, {"tag": "p", "text": "After two months had elapsed, Merei discovered that Zare's Academy application status had progressed to \"Accepted\" despite Fhurek's objections. However, this good news was overshadowed by two developments in Zare's life. Firstly, Zare and Beck had witnessed Imperial stormtroopers under Lieutenant Piers Roddance opening fire on a group of farmers protesting their eviction. To add insult to injury, the Imperial authorities had claimed that the farmers had instigated the shooting by attacking Imperial surveyors and destroying mining equipment. Secondly, Zare and his family had been devastated by the mysterious disappearance of his sister Dhara Leonis, a star cadet at the Imperial Academy. While the authorities claimed that she had run away, Zare disputed that account."}, {"tag": "p", "text": "In response to these developments, Zare declined his acceptance offer to the Imperial Academy. He also enlisted Merei's services into helping find his sister Dhara. While fearful of the consequences, Merei agreed to help her boyfriend. Following their graduation from Junior AppSci, Merei still kept in touch with Zare. Despite Merei's best efforts to probe Imperial databases, she found no trace of Dhara. They were also unable to communicate with Beck, who was purportedly traveling with his cousins throughout Lothal before starting work as a harvest supervisor in the next fall. In reality, Beck had joined a cell of insurgents who were waging a campaign of sabotage against the Empire."}, {"tag": "p", "text": "After some difficulty, Merei managed to establish contact with Beck who arranged to rendezvous with his friends. Fearing that Beck was in danger, Zare advised Merei to stay behind while he went to meet Beck. Zare's suspicions were confirmed when he discovered that Beck was part of an insurgent cell which had been destroying Imperial mining droids. Following a brief skirmish, Beck narrowly escaped captured by an Imperial patrol at his former family orchards in the Westhills, which had been turned into a mine. Following his encounter with Zare, Merei commed him to warn him of a security alert in the orchard lands."}, {"tag": "p", "text": "The following day, Merei arranged to meet with Zare at Junior AppSci's grav-ball grid. There, the two of them were joined by Beck, who was worried because the Empire had discovered his speeder and were searching for its occupants. Merei convinced Beck to go into hiding. During their brief meeting, Beck conceded that now was not the right time to launch a rebellion against the Empire. He warned his friends particularly Merei to be careful that they were not caught by the authorities. Since a real resistance had not yet emerged on Lothal, Beck convinced Zare to infiltrate the Academy for Young Imperials in order to find his sister and to work against the Empire from within. While Zare was initially reluctant to infiltrate the Academy, Merei supported Beck and convinced him that this was the right thing to do. This marked the last time that Merei and her two friends met as a group."}, {"tag": "h3", "text": "Looking for Dhara"}, {"tag": "p", "text": "Following their meeting, Beck and his fellow insurgents were arrested by a stormtrooper patrol. Meanwhile, Zare enrolled into the Imperial Academy. Due to his intense training regiment, he was unable to meet Merei regularly. Meanwhile, Merei commenced her studies at the Vocational School for Institutional Security where she planned to hone her hacking skills in order to find Zare's missing sister, Dhara. In her spare time, she also developed a computer program on her datapad which allowed her to hack into the Lothal Academy for Young Imperials' computer database. She used this program to keep an eye on Zare and Dhara's statuses. Since her parents were working as data security experts for the authorities, Spanjaf made every effort to conceal her online activities."}, {"tag": "p", "text": "On one occasion, her father Gandr chanced upon her while she was searching an Imperial database for information about Dhara. Merei pretended that she was working on an intrusion counter-measures assignment which involved investigating an intrusion into an Imperial network. During their conversation, Merei also learned from her father two crucial pieces of information. When the Empire had first come to Lothal, they were so preoccupied with putting systems in place that they had neglected to properly secure them. He also mentioned that most of the data breaches came from intruders who had physically visited Imperial installations."}, {"tag": "p", "text": "At school, Merei came into contact with the local anti-intrusion club. She also met a male Pantoran youth named Jix Hekyl. Jix recommended that she use a snooper, a program that recorded information and transferred it to an outside source. To avoid detection, he recommended that Merei find someone who could configure a snooper for her. When Merei reiterated her interest in obtaining a snooper, Jix mentioned that he knew someone who could supply her with one but warned that his services were not cheap and came \"with strings attached.\" This individual was named Bandis Yong and was supposedly located in Lothal's Old City. Later, she visited Zare's mother Tepha to inform her that she was continuing her efforts to find Dhara."}, {"tag": "p", "text": "Two days later, Merei learned from her parents that the Transportation Ministry's database was a weak point which she could use to infiltrate the entire Imperial network on Lothal. She then traveled to Lothal's Old City to look for the mysterious Bandis Yong. Following Jix's instructions, she visited a store that was owned by an elderly human male. While the man was reluctant to help her, he instructed Merei to go to the East Interchange near Founder's Avenue. An unmarked speeder van would pick up from there and take her to meet Bandis Yong. After witnessing a pair of Junior AppSci girls selling raffle tickets to raise funds for a camping trip, Merei decided to pose as a schoolgirl from Phelarion School doing fundraising work in order to infiltrate the Transportation Ministry."}, {"tag": "p", "text": "At dawn, Merei waited for the speeder van at East Interchange and was picked up by a mustachioed alien driver and his companions. They drove her to Ake's Tavern in Capital City's alien quarter and northern market district, a disused cantina that served as the headquarters of the Gray Syndicate. This crime syndicate was involved in various activities on Lothal. She met the syndicate's leader Yahenna Laxo who agreed to supply her with a snooper in exchange for Merei delivering a package to an associate in Capital City's marketplace. After leaving the Gray Syndicate, she bought three network drives, a book of flimsy receipts, and a second-hand T-shirt from Phelarion School before returning home. At home, she carefully asked her mother Jessa about the Imperial security systems at the Transportation Ministry under the guise of working on an anti-infiltration course at her school."}, {"tag": "h3", "text": "Hacking the Transportation Ministry"}, {"tag": "p", "text": "The following day, Merei visited the Transportation Ministry where she posed as a Phelarion student named Kinera Tiree claiming to sell raffle tickets to help Clone Wars veterans. The receptionist allowed her to set up her stall in the building's cafeteria. While pretending to take a toilet break, she planted her three network drives at various locations throughout the Ministry building. These drives would upload a snooper program onto the Ministry's database which would allow her to hack into the Imperial network on Lothal. Before leaving the building, she managed to sell several raffle tickets to several Transportation Ministry employees."}, {"tag": "p", "text": "After planting snoopers in the Transportation Ministry, Merei visited her boyfriend Zare at the Imperial Academy on Visiting Day. After kissing her boyfriend, she informed Leonis that she had managed to use her snoopers to obtain the access codes of an Imperial personnel manager and a systems coordinator. The coordinator's access code would enable her to give the personnel manager the ability to create new IDs with full security clearance. When Zare expressed concerns that she would get caught, she calmly explained that she had programmed the snoopers to switch themselves off and to erase themselves from the system by the end of the week. She also reiterated her promise to find Dhara."}, {"tag": "p", "text": "Later, a young rebel named Dev Morgan infiltrated the Imperial Academy. He was part of a rebel cell on Lothal that was planning to steal a decoder so that they could intercept and destroy an Imperial shipment of Kyber crystals. When Zare confided his initial suspicions about Merei, she discovered that there were no records of Dev in the Imperial records and deduced that he was a rebel infiltrator. After Zare befriended Dev, Merei helped the two cadets forge a fake procurement order for podracer spareparts. Later, at Zare's request, she made contact with Dev's rebel companions Garazeb Orrelios, Sabine Wren, and Chopper. She convinced the rebels to give her Agent Kallus's stolen decoder after they had finished using it. This marked her first encounter with a rebel cell."}, {"tag": "p", "text": "Using the decoder, Merei discovered that Zare's sister Dhara was still alive and that she had been forcibly recruited into a secret Imperial program called Project Harvester. She had been removed from the Imperial Academy after meeting the program's special criteria, Force-sensitivity. Merei also discovered that Project Harvester was being run from a secret installation on the planet Arkanis that was connected to the local Imperial headquarters and the Arkanis Academy, an officer-training school. Merei contacted Zare via datapad to share this information. However, she ruled out forging documents to transfer Zare there since he would quickly be discovered by the Imperial authorities."}, {"tag": "p", "text": "After returning home, Merei was perturbed to learn from her parents that they had been dealing with an intrusion case at the Transportation Ministry. While two of the snooper programs had managed to delete themselves, her mother's team had managed to freeze the third program and preserve its code. Merei feared that her parents would eventually discover that she was the hacker they were pursuing but feigned curiosity and admiration for her parents' skills. Despite finding Dhara and encountering new potential allies, Merei realized that she had inadvertently drawn the attention of the Imperial authorities on Lothal."}, {"tag": "h3", "text": "Working for the Gray Syndicate"}, {"tag": "p", "text": "Due to her preoccupation with infiltrating the Empire's data networks and creating a fake identity to access secret files, Merei's grades at the V-SIS declined. This development alarmed her parents Gandr and Jessa, who were concerned about their daughter's well-being. When questioned at dinnertime, Merei claimed that she was still adjusting to a new school where the work was hard. She also tried to provide an alibi for her frequent absences from home by claiming that she was working with classmates in the anti-intrusion club. In an attempt to stay ahead of the authorities, Merei asked her parents about their ongoing investigation into the data breach at the Transportation Ministry. The Imperial investigators had taken a particular interest in the mysterious intruder who had impersonated a Phelarion School student named Kinera Tiree."}, {"tag": "p", "text": "After dinner, Merei commed her boyfriend Zare and exchanged pleasantries about their lives and schools. While chatting with Zare, Merei received a voice message from the Gray Syndicate crime boss Yahenna Laxo, who gave her another job assignment. Merei was unhappy that she had placed herself in debt to Laxo as the price for obtaining the snooper programs that had allowed her to infiltrate the Imperial data networks on Lothal. Knowing the drill, Merei waited to be picked up by Laxo's speeder van outside the abandoned repair shop on the outskirts of Capital City. Upon arriving at Ake's Tavern, she encountered her Pantoran classmate Jix Hekyl; the fellow V-SIS student who had first introduced her to the Syndicate."}, {"tag": "p", "text": "While meeting with Laxo in his office, the crime boss discussed his reasons for embarking on a career of crime. While Laxo had trained as a programmer, he was unwilling to allow the Empire to use his talents to spy on people and to restrict their freedom. Laxo had also ruled out working in government since the corporations were either controlled or in cahoots with the Empire. When Merei stated that she would not do anything illegal, Laxo assured her that he would not ask her to do anything that would trouble her conscience. However, Merei was skeptical of his ability to keep that promise. For her job run, Laxo instructed her to deliver a quintet of thumb drives to his associates across Capital City."}, {"tag": "p", "text": "The following morning, Merei left home early under the pretext of doing anti-intrusion revision with her classmates. Prior to her departure, her father Gandr gave her a powerful locator that was capable of transmitting signals through jamming fields. She promised to trigger the device if she encountered any serious trouble. After delivering the five thumb drives to Laxo's associates in Capital City, Merei made it to school just a few minutes before her classes. Upon arriving, she encountered Jix and revealed that she was working as a courier for Laxo. Jix regretted getting Merei involved with the Gray Syndicate and quickly deduced that Laxo was hiring her services because something had gone wrong with one of the snooper programs."}, {"tag": "p", "text": "Merei admitted this was indeed the case and confided that she was afraid that her mom's anti-intrusion team would soon discover that she was the intruder responsible for the data breach at the Transportation Ministry. Merei was worried about two things: the witness who spoke to her at the Transportation Ministry and whether the Imperial authorities could recover her account from her repeater service: Bakiska's. While Laxo had taught her how to bounce an encrypted request through multiple repeaters, she wanted to find out if she could permanently erase it. Jix confirmed that she could not do it remotely from her datapad but they had to access the actual machine where that information was warehoused. Bakiska's data center was heavily guarded. Unable to tamper with the repeater service, Merei settled for replacing her profile image at V-SIS with another one that the witness could not identify. With Jix's help, Merei selected the image of Hestia Tarleton, a student at the Young Ladies' Seminary of Lothal Settlers, and switched it with her own."}, {"tag": "h3", "text": "Moving up the Hierarchy"}, {"tag": "p", "text": "Due to her tampering with the V-SIS records, Jessa's team of investigators were unable to identify or locate the mysterious intruder at the Transportation Ministry. Several days later, Merei learnt that her mother's investigation team had decided to give the intrusion pattern to the repeater service and demand that they look for a match. Once they had obtained a match, the Imperial authorities could obtain a warrant for any records on that account. This would enable them to trace the origin point of whoever had accessed the snooper's data. Merei feared that the authorities would eventually trace the signal to her household. In the aftermath of the insurgent attack on Empire Day, the Lothalian courts were granting more security-related requests for warrants. Merei realized that it was only a matter of time that the Imperials would come after her."}, {"tag": "p", "text": "While traveling on an errand in Laxo's speeder van one day, the human thug Ort complained about having to accompany Merei in the van and suggested he could do a better job than a \"pipsqueak girl.\" When he coveted Merei's jumpspeeder, Merei insulted him by suggesting that his illiteracy was the reason why his duties were limited to riding around the back of Laxo's van. Enraged, Ort attempted to shoot Merei with his blaster but was stopped by the Rodian Rosey, who pointed a gun at his head and warned the two of them to shut up. Rosey then hinted that Laxo was favoring Merei; which she took as a sign that she was moving up in the Syndicate's hierarchy."}, {"tag": "p", "text": "Upon arriving at Ake's Tavern, the crime boss informed Merei that she would be carrying out her errands on foot to save them the work of having to ferry her back and forth. Merei revealed that she was up to the challenge since she had memorized the number of turns that the speeder van made during the trip and then plotted them out on a map. Laxo then told Merei that he had promoted her to the job of collecting Credits from fugitives who were paying Laxo to hide them. Later that night, she chatted with Zare, who revealed that the Imperials had subjected him to a strange test which involved looking at pictures on a datapad. Both suspected that the Empire was testing to see whether Leonis was Force-sensitive like his missing sister Dhara."}, {"tag": "p", "text": "Over time, Merei came to befriend one of Laxo's fugitives, an elderly poet and artist named Holshef, who lived in the lowest level of an Old City warehouse. Unlike the other fugitives, Laxo was not a criminal but a poet who had criticized the Empire for polluting Lothal's air and water. He even offered to paint her portrait. Later, Laxo assigned Merei the job of ferrying her classmate Jix for a special slicing job. He also paid her a thousand Credits for her work and boasted of eventually running Lothal's underworld. For that assignment, Merei transported Jix on her jumpspeeder."}, {"tag": "p", "text": "Later, Merei visited her boyfriend Zare at the Academy on Visiting Day. When Zare's mother Tepha invited her over for dinner, Merei said that she had to study for exams the following day and departed on her jumpspeeder. Following the exams, Merei visited Zare during the winter break and was shocked to see him exercising in a t-shirt and shorts on a cold winter's morning. While walking together, Zare told her about his problems with Oleg and Captain Roddance. When Merei told him about her involvement with the Gray Syndicate, he advised her to cut all ties with Laxo. Merei was unwilling to do so because she did not want to bring her illegal activities to the attention of the Empire."}, {"tag": "h3", "text": "Breaking free of Laxo"}, {"tag": "p", "text": "In response to increased rebel activity on Lothal, Governor Pryce announced a crackdown on all dissent and sedition on the planet. As a result of this crackdown, the authorities had also turned their attention to the Gray Syndicate's criminal activities. One of Laxo's warehouses and two of his gambling clubs were raided by stormtroopers. The crackdown had hit all crime syndicates on Lothal hard and the flow of money was disrupted. These law enforcement operations were led by Cadets from the Academy for Young Imperials, who were now required to do their training on the field."}, {"tag": "p", "text": "In response to these setbacks, Laxo ordered Merei to tell his fugitives that Rosey would be coming by to move them to new places. When Merei asked her boss about a certain fugitive named Pinson, he revealed that he had sold him to a bounty hunter for defaulting on his payments. As a result, Merei realized that Laxo was only concerned with making a profit and willing to turn on his clients if it benefited him. Thus, she knew that she could not trust him."}, {"tag": "p", "text": "Later at dinnertime that night, she learned that her parents' team of investigators had narrowed the intrusion pattern at the Transportation Ministry down to three repeater services. Jessa mentioned that she would file a search warrant with the Justice Ministry the following day and that they would obtain the account data within a few days. Once they had found the account data, they would be able to find the intruder. Fearing that it was only a matter of time before she would be discovered, Merei contacted Jix for help. Her fellow Syndicate associate suggested that they use a pulse-mag to scramble her data from Bakiska's warehouse. Thanks to a contact, Jix had discovered the location of the machine warehousing Bakiska's inactive and deleted accounts."}, {"tag": "p", "text": "Jix arranged to pick up Merei at school at 0700 in the morning. Together, the two visited Bakiska's warehouse and pretended to be on official business for the Gray Syndicate. However, the guards prevented them from carrying out their work and marched them out of the building. They also warned them to tell Laxo to arrange his work through private channels next time rather than sending his associates to do his work. After dropping Jix off back at school, she sent a voice message to her parents claiming that she had been kidnapped by the Gray Syndicate in order to force the authorities to stop their investigation. Merei had planned to send him to prison in order to free herself of her debt to the Gray Syndicate. She planned to use her locator to draw the Imperial authorities to Ake's Tavern. In addition, she borrowed Jix's pulse-mag with the intention of deleting the data stored there."}, {"tag": "p", "text": "While traveling on her jumspeeder to the tavern, she was contacted via comlink by Garazeb Orrelios, a member of the Lothal rebel cell known as the Spectres. He told her that they needed their help and asked her to contact her boyfriend Zare. Already in trouble, Merei rejected his request and told him and his companions to instead send Chopper to contact Zare. Unknown to Merei, the Spectres had learned that the dissident Senator Gall Trayvis was planning to visit the Lothal City Capitol Building in Capital City. However, they rightfully suspected that it was a trap."}, {"tag": "p", "text": "Upon arriving at Ake's Tavern, Merei was confronted by a furious Laxo who chastised her and Jix for visiting Bakiska's warehouse. As punishment, Laxo announced that he had sold her poet friend Holshef to a bounty hunter and that she herself would lead the bounty hunter to his new hideout at 1044 Chapel. Before Laxo could carry out his plan, several stormtroopers stormed the tavern and killed all of the criminals including Laxo himself. During the attack, Merei took the opportunity to jam Jix's pulse-mag into Laxo's data tower, effectively deleting the data before the Imperials could obtain it. Merei was spared by the stormtrooper commander who informed her that the authorities had received her distress message and detected her presence with her locator."}, {"tag": "p", "text": "Despite escaping the Gray Syndicate, Merei was guilt-ridden that her actions had led to the deaths of Laxo, Rose, and their associates. Following the destruction of the Gray Syndicate, Merei's parents thanked her for helping them to complete their investigation into the data breach at the Transportation Ministry. Merei's \"kidnapping\" saved the Imperial investigators the work of having to lock down and search three repeater services. Since the Empire had bigger priorities, they had temporarily suspended further investigations to determine the site where the intrusion had been launched from. However, the Imperial authorities had not formally closed the investigation into the Transportation Ministry data breach. In addition, Merei still blamed herself for causing Laxo and his associates' deaths."}, {"tag": "p", "text": "After learning that Zare was being transferred early to Arkanis, Merei used her fake Imperial Security Bureau account to access the network. Rather than a promotion, she quickly learned that Zare was being transferred to the Arkanis Academy to investigate his links to a rebel cell on Lothal. She quickly informed Zare's distraught mother Tepha, who now feared that she would lose both her daughter and son. After promising Tepha that she would let her know anything she heard, Merei sped away on her jumpspeeder."}, {"tag": "h3", "text": "Protecting Holshef"}, {"tag": "p", "text": "Before her former boss Laxo had died, he had ordered her to accompany a bounty hunter to Holshef's den. However, Holshef's life was still in danger. She traveled to his hideout at the abandoned warehouse where she managed to persuade the Lutrillian foreman to shelter Holshef for another week while she made alternate arrangements. She then met up with Holshef and informed him that he would be staying at the warehouse for another week until she had made arrangements to move him. Merei then made her way to the Vocational School for Institutional Security where she told her friend Jix Hekyl that she had managed to erase the Gray Syndicate's data with the pulse-mag he had supplied her with. While both were upset that several people were killed, they were relieved to escape Laxo's grip."}, {"tag": "p", "text": "Despite her vow to focus on her schoolwork, Merei's mind was unsettled by her anxiety for Holshef's safety and well-being. By the end of school, she had decided that it was unsafe for Holshef to remain on Lothal and that he had to go off-world. At dinnertime, Merei asked her parents about the Empire's ongoing efforts to crackdown on off-world travel. From her parents, Merei learned that the Empire had tightened up off-world travel to the extent that a wildcat launch from the hinterlands would attract a squadron of TIE fighters. While authorized off-world travel was still allowed, travelers were subject to an ID check and questioning by security personnel."}, {"tag": "p", "text": "For the next week, Merei toyed with the idea of finding a way to smuggle Holshef off-world while trying to keep up with her studies. She also managed to get the Lutrillian foreman to keep Holshef for another ten days by paying him double the rent. The Lutrillian reluctantly accepted her offer since he planned to use the poet's hiding place to store an incoming shipment of industrial energy cells from Lantillies. One night, she received a transmission from her boyfriend Leonis, who had been transferred to the Arkanis Academy. Leonis had managed to contact her from a comm-house on Arkanis using a secure feed. She warned him that the Imperial authorities had transferred him to Arkanis in order to investigate his links to Morgan's rebel cell and tried to persuade him to leave. However, Zare was adamant that he remain in order to find his sister Dhara."}, {"tag": "p", "text": "The following evening, Morgan's rebel cell seized control of the Imperial Communications Center at Jalath and managed to broadcast a transmission. In response, the Imperial authorities destroyed the tower; disrupting all off-world communications on Lothal. Merei was at school when her class instructor announced that the Imperial authorities would be scrutinizing the school's students for any involvement in illegal activities. Since Jix had earlier switched Merei's school photo with that of Hestia Tarleton, she convinced him to change it back during the free period in order to avoid getting an innocent party into trouble with the authorities. Later that night, she used her fake ISB account to download several classified Imperial intelligence, law enforcement, and military reports and documents into her datapad. In the process, Merei also discovered that the Empire had tried to cover up the deaths of Westhills protesters by creating fake departure records to mislead their families."}, {"tag": "p", "text": "The next day, Merei and her classmates at V-SIS were questioned by an Imperial investigator. However, the interrogator did not recognize he since Jix had failed to switch her V-SIS photo. Later, Jix told her that he had been unable to do so since the Imperial authorities had locked down the entire data network. Later that day, Merei traveled to the Ithorian Old Jho's Pit Shop. After she told him about her predicament with Holshef, Old Jho agreed to arrange his escape off-world and told her to bring her friend back in six days time. He told her that he had friends with off-world transportation. Merei then met up with Holshef and told him her plans. While Holshef was initially reluctant to leave his homeworld, he changed his mind after Merei told him about the ecological damage that the Empire had inflicted on his former home in the Westhills."}, {"tag": "h3", "text": "Evading the Empire"}, {"tag": "p", "text": "Four days later, Merei was at school when her friend Jix Hekyl was arrested by an Imperial officer and two stormtroopers. Earlier that day, Hekyl had been questioned by a seemingly friendly Imperial official who had questioned him about repeater services and info-houses. After the Imperials had left, Merei logged into the Imperial data network and discovered that the Empire had issued arrest warrants for several individuals including Jix and Hestia Tarleton, the girl whose image she had swapped on her repeater service account. Merei quickly realized that it was only a matter of a few hours before the Imperial authorities caught up with her."}, {"tag": "p", "text": "Merei quickly left school on her jump speeder and contacted her mother Jessa, telling her and her dad Gandr to leave Capital City right now and head to a set of coordinates in the Easthills. She warned her parents not to tell anybody and not to return to their apartment. She then raced to Holshef's warehouse hideaway and evacuated the poet, who reluctantly agreed to leave with his latest poems. Together, they departed Capital City on Merei's jumpseeder and reached the highway leading through the grasslands to the east of the city. On the way, they were pursued by a bounty hunter riding on a swoop. They managed to lose the bounty hunter after Holshef's bag of poems opened. One of the pieces of paper hit the swoop rider in the face, blinding him. The bounty hunter's swoop then collided with two fuel tanks hauled by a droid truck, which exploded."}, {"tag": "p", "text": "While the bounty hunter was killed, Merei and Holshef managed to escape to Old Jho's Pit Stop where they met Merei's parents. Old Jho was initially angry at the presence of Merei's parents since he regarded them as Imperial Intelligence \"types.\" Her mother Jessa was also furious with her for ruining their lives. At the Pit Shop's bar, Merei told her parents that she was responsible for the data breach at the Transportation Ministry and that she had also created a fake ISB account. In an effort to appease her mother, Merei revealed that she had also downloaded a lot of highly classified documents from the Imperial network. After reading these documents, Merei's parents were convinced that the Empire was bad for Lothal. While her mother Jessa was browsing through the Imperial network, she discovered that Merei's friend Zare had been arrested and was scheduled to face a military tribunal."}, {"tag": "p", "text": "Realizing that Zare's parents Leo and Tepha were in danger, Merei convinced her parents that they had to warn them. While Old Jho made arrangements with the rebel Garazeb Orrelios for their departure, Merei and Jessa traveled on their family speeder back to Capital City. Upon arriving there, they informed the Leonises and their nanny droid Auntie Nags. Leo, a staunch Imperial loyalist, initially refused to believe the reports. However, Tepha stood by Merei and Jessa. When Leo attempted to contact the authorities to \"straighten\" things out, Merei stunned him with her blaster. Together with Auntie Nags, they fled on the Spanjaf family speeder to the Westhills. However, they were stopped by an Imperial roadblock manned by two drivers on speeder bikes. Fortunately for Merei and her companions, Old Jho arrived in his freighter and opened fire on the Imperials. This enabled Merei, her family, and the Leonises to escape to the nearby planet of Garel."}, {"tag": "h3", "text": "Rescuing Zare and Dhara"}, {"tag": "p", "text": "After escaping Lothal, Merei, her mother Jessa, and three members of the Spectres—Dev Morgan, Zeb, and Sabine Wren—traveled on the modified VCX-100 light freighter known as the Ghost to the planet Arkanis to rescue Zare Leonis. They landed at Area Null, a secluded tower that was connected to the Arkanis Academy. Merei and her rebel allies landed on top of the tower and made their way downstairs where they encountered Zare and another classmate named Beck Ollet, who had been arrested earlier and sent to Project Unity. Zare and Beck initially mistook them for Imperials and opened fire on them but Ezra deflected their blasts with his lightsaber."}, {"tag": "p", "text": "When Zare recognized Merei, the two embraced each other and Merei introduced her new allies. While Jessa, Zeb, and Sabine made their way downstairs to access the main computer node and to lock the Imperials out of the tower and elevators, Merei along with Zare and Beck made their way to Dhara's cell. Meanwhile, Ezra stayed on the roof to guard the Ghost. After slicing into the tower's network with her datapad, Merei discovered that Dhara was housed in cell seventeen. While she remotely unlocked the door, Leonis went to free his sister. Meanwhile, Beck guarded the main lift. Dhara's rescue preceded the arrival of more stormtrooper reinforcements in the main control room."}, {"tag": "p", "text": "Before either Merei or Zare could object, Beck activated his thermal detonator and charged headfirst into the stormtroopers. The resulting explosion buried Beck and the stormtroopers under a deluge of rubble. With the Spectres and Jessa having trouble to contend with, Merei and her companions made preparations to climb the main elevator shaft. However, they were then cornered by an Imperial officer named Lieutenant Chiron and four stormtrooper reinforcements. Chiron had been Zare's mentor and was a principled man but was still loyal to the Empire. Zare attempted to reason with Chiron but the lieutenant was unmoved by his arguments. Before a fight could break out, Dhara used the Force to crush Chiron and his men under chunks of rocks and metal. Following Chiron's death, Merei witnessed Zare closing the fallen officer's eyes. When she asked him why he admitted he did not know but told her not to tell the other rebels."}, {"tag": "p", "text": "After escaping from Arkanis, Merei left Zare to spend time alone with Dhara in the Ghost's bunkroom. As the Ghost neared the planet Garel, she made Zare a mug of tea and sat beside him on the acceleration couch in the freighter's hold. After affirming their relationship, Merei told Zare that her father Gandr was working on creating new identities for both the Spanjafs and Leonises. Despite facing overwhelming odds against the Empire, the two young rebels resolved to continue their struggle. She also revealed that she had downloaded thousands of classified Imperial documents on Lothal including economic plans, industrial production reports, and military secrets. Upon landing on Garel, she watched as Zare and Dhara reunited with their parents Leo and Tepha."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Merei Spanjaf was a pretty young teenage girl with neck-long black hair, brown eyes, and light skin. Merei was a loyal and reliable friend of Zare Leonis and Beck Ollet, whom she had met while playing grav-ball with the AppSci SaberCats at the Junior Academy of Applied Sciences in Lothal's Capital City. Due to their shared passion for grav-ball, Merei developed a relationship with Zare. Merei's friendship with Zare and Beck drew her into the growing rebellion against the Galactic Empire on Lothal. While Merei was initially a lukewarm supporter of the Empire, she gradually became an underground insurgent and rebel sympathizer after learning more about the Empire's excesses and wrong-doings on Lothal."}, {"tag": "p", "text": "Merei demonstrated much courage and perseverance during her quest to help Zare find his missing sister Dhara Leonis. She was willing to risk breaking Imperial law by hacking into the Imperial data network on Lothal, creating a fake Imperial Security Bureau account, and illegally downloading high-classified government files. While Merei was willing to work with criminals like Yahenna Laxo and his Gray Syndicate in order to find Dhara, she was still uncomfortable with being associated with the underworld. Her desire to break free from her debt to Laxo led her to frame the Gray Syndicate for her kidnapping and the data breach at the Transportation Ministry. After Imperial authorities raided Ake's Tavern and murdered the entire syndicate, Merei was consumed by the guilt that she had indirectly caused the deaths of many innocent people."}, {"tag": "p", "text": "During the course of working for the Gray Syndicate, Merei developed a friendship with an older V-SIS student named Jix Hekyl, who became an informal technical adviser after introducing her for the Gray Syndicate. While working as a courier, Merei befriended Holshef, an elderly poet and painter who had incurred the wrath of the Galactic Empire by criticizing the pollution caused by its industrial development on Lothal. Merei's friendship with Holshef led her to concoct a plan with the Ithorian bartender Old Jho and the Spectres rebel cell to smuggle him off-world. Merei's latent dissatisfaction with Imperial policies, combined with the Imperial investigation into the Transportation Ministry data breach, led her to flee off-world to Garel with her parents and Holshef."}, {"tag": "p", "text": "Spanjaf had a quick wit and sharp tongue, which she could demonstrate either delivering barbs through another, such as the crime boss Yahenna Laxo or making up her own insults."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Gandr and Jessa Spanjaf"}, {"tag": "p", "text": "Merei had a good relationship with both her parents but was hesitant to disclose her involvement in the Transportation Ministry data breach due to their work as Imperial data-security contractors. While Merei's mother Jessa tended to scrutinize her daughter's activities (including grav-ball and boys), her father appeared to be more tolerant and care-free towards Merei. Merei's bond with her parents led her to accept a locator from her father Gandr. While Jessa was initially furious with her daughter after learning about her secret double life, Gandr was amused at Merei's efforts to hack into the Imperial data network and to elude the Imperial authorities. After learning about the Empire's excesses and atrocities, both parents willingly followed their daughter into a life of hiding from the Empire."}, {"tag": "h4", "text": "Zare Leonis"}, {"tag": "p", "text": "Due to their passion for grav-ball, Merei developed a romantic relationship with Zare. She stood by her boyfriend during several difficult periods including Janus Fhurek's harassment and the abduction of his sister Dhara. Merei's friendship and loyalty to Zare later led her to break Imperial law by consorting with criminals, acquiring snoopers that allowed her to hack into the Imperial data network, creating a fake Imperial Security Bureau account, and using a stolen Imperial decoder. While Zare's preoccupation with finding his sister and infiltrating the Imperial Academy strained their relationship, they reaffirmed their relationship when Merei rescued Zare from Area Null on Arkanis."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As the daughter of data-security experts, Merei Spanjaf was skilled with the datapad and knowledgeable of Imperial data systems. She wanted to follow her parents' footsteps by training as a data-security expert at the Vocational School for Institutional Security. Merei's slicing skills proved invaluable on several occasions. She proved instrumental in exposing the xenophobic athletic director Janus Fhurek's bet on the AppSci SaberCats during a grav-ball tournament. Later, Merei used her knowledge of Imperial data counter-measures to hack into the Imperial data network on Lothal and to create a fake ISB account in order to find information on Zare's missing sister Dhara."}, {"tag": "p", "text": "Besides being tech-savvy, Merei also had a passion for grav-ball, a team sport that was popular in the galaxy. As a strategist, she played an important role in the AppSci SaberCats' victories by scouting the opposing team's methods and helping the team's center-strike Zare Leonis to devise the best strategy for winning the game. Merei displayed much creativity and improvisation in her efforts to infiltrate the Transportation Ministry by posing as a fundraising student and later her efforts to evade Imperial investigators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Following the appearance of Spanjaf on the cover of Servants of the Empire: Imperial Justice, author Jason Fry received a tweet from a fan who thanked him for the character, as she had been told as a child that girls couldn't code. Merei Spanjaf's character was originally imagined as a foil for Zare Leonis and was to be a slicer and stat geek who would help the SaberCats, but not actually play on the team. She was added as a member of the team at the suggestion of Greg Weisman, a producer of Star Wars Rebels. The character's last name is a combination of the last name of two of Jason Fry's friends, Emma Span and Jay Jaffe. Fry has stated that he pronounces the character's name as \"muh-RAY,\" but doesn't mind if people pronounce it as \"merry.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}