{"url": "Mereel_Skirata", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Clan Skirata", "Category:Clone trooper lieutenants", "Category:Galactic Republic intelligence personnel", "Category:Null-class Advanced Recon Commandos", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Mereel Skirata"}, {"tag": "p", "text": "Mereel Skirata, formerly known as Null-7 or N-7 and better known as Mereel, was a lieutenant and one of six Null-class Advanced Recon Commandos created for use in the Grand Army of the Republic. He was named after former Mandalore Jaster Mereel, Jango Fett's mentor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "At the chronological age of two, he and his fellow Nulls were brought before the Kaminoan scientist Orun Wa, bounty hunter Jango Fett, and Sergeant Kal Skirata for review. When the Kaminoans attempted to terminate the Nulls, he snatched Skirata's holdout blaster and tossed it to his brother Null-11, nicknamed Ordo, who leveled it at Orun Wa. Skirata managed to get the weapon back, and received command of the Nulls as he was the only one who could control them. After that situation, Kal Skirata brought the Nulls up as sons."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Mereel and the other Null-class ARCs, though they worked for the GAR, Grand Army of the Republic, were constantly hunting for clues as to the location of the Kaminoan scientist Ko Sai so they and Kal Skirata could find out how to stop the clones' accelerated aging."}, {"tag": "p", "text": "Mereel participated in the black op in 21 BBY, led by Skirata, to destroy the Separatist terrorist cells operating on Coruscant along with his brother Ordo, Walon Vau, Delta Squad, Omega Squad, Etain Tur-Mukan, and Bardan Jusik."}, {"tag": "p", "text": "A few months later, he participated in an unauthorized mission to Kamino. Disguised as a normal clone trooper, he accessed the Tipoca City computer mainframe for any information on Ko Sai. Although he didn't find any, he did succeed in downloading part of a secret conversation between Supreme Chancellor Palpatine and Prime Minister Lama Su, that revealed that secret cloning facilities had been set up on Coruscant and that the Republic wasn't planning to order any future batches of clones from Kamino."}, {"tag": "p", "text": "As the search for Ko Sai intensified, Mereel´s single-minded patience paid off and led to the capture of the Kaminoan scientist. Not having happy memories of her, Mereel reintroduced himself to Ko Sai with his nerf prod, causing Kal Skirata to worry that Mereel would lose control. Of all the Nulls, Mereel had been the most carefree and charming, and it was because of these traits that Kal choose him for this delicate part of the mission."}, {"tag": "p", "text": "Later, Mereel would work with Etain to make Ko Sai create a cure for the clones' accelerated aging, while becoming a journeyman expert himself in genetics. When Ko Sai finally came to the end of her rope and hung herself, Mereel gathered his brothers to \"prepare\" the body for shipping. Mereel´s trademark smile, an indication he didn´t have a care in the galaxy, never faltered."}, {"tag": "h3", "text": "Post-Clone Wars"}, {"tag": "p", "text": "Mereel would later desert with the rest of the Nulls shortly after Order 66 was issued, and would start anew with his brothers on Mandalore. When Kal nearly broke down after seeing Tallisibeth Enwandung-Esterhazy (nicknamed Scout), because of her looking similar to Etain, Mereel helped Kal back inside of their home. Mereel also managed to get along with Kina Ha, the Kaminoan Jedi which was amazing as he hated all Kaminoans. Like the other Nulls, Mereel was disgusted with the release of the virus FG36 by the Empire on Gibad, and plans with them to hide in the water reservoir or the fuel tank of Nyreen Vollen's ship, Cornucopia to avoid Imperial inspection once they retrieve Darman Skirata and Niner Skirata from Coruscant."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mereel was the most “charming, entertaining, and sociable” of the Nulls, and was relatively well adjusted to life outside Kamino. A ladies' man, his romances tended to be minor and brief. Thanks to his influence, Corr also behaved in this manner."}, {"tag": "p", "text": "Mereel was able to easily cope in most social situations. At one time he “held court” in the Coruscant Security Force Staff and Social club, entertaining commandos and CSF officers alike by reciting swear words in other languages. He reacted to many situations in a calmer manner than his brother, Ordo, and had a good sense of humor, often joking around or making witty remarks."}, {"tag": "p", "text": "Mereel was frequently described as a “daredevil lunatic”, a trait that often caused his \"father\" and brothers occasional anxiety. He sought out thrills, purposely skating on thin ice in everything from negotiations with techs to piloting and rapid-roping. Kal noticed that Mereel seemed to feel the need to take risks and excel in order to edge out of Ordo's shadow."}, {"tag": "p", "text": "He also shared many traits with his Null brothers. He had a peckish appetite, and a sweet tooth, which Skirata theorized might be due to his maturation, and the metabolic need to fuel his rapid aging. Due to the Kamioans genetic tinkering, Mereel and the other Nulls had very intense loyalties- either they would die for you, or you would end up dead. Like his brothers, Mereel was loyal only to Kal Skirata, and his family."}, {"tag": "p", "text": "The Kaminoans changed the Null's genes so that Mereel and his brothers had perfect memories. This often came in handy during Mereel's work, allowing him to memorize codes, manuals, and other information. These abilities eventually lead to his specialization in slicing and genetics. However, the same genetic tinkering, paired with his brutal childhood lead Mereel and the other Nulls to possess a fierce, resounding hatred of Kaminoans."}, {"tag": "p", "text": "Mereel enjoyed piloting Gi'ka, a Wave Chaser submersible bought on Doruuma. He favored Merr-Sonn heavy weapons; his weapons of choice were the Z-6 rotary blaster cannon and the Reciprocating quad blaster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}