{"url": "Meres_Ulcane", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Imperial warlords", "Category:Males"], "nodes": [{"tag": "h1", "text": "Meres Ulcane"}, {"tag": "p", "text": "Meres Ulcane was a soldier in the Imperial Army, who later staged a mutiny aboard his own ship and formed the Kaarenth Dissension in the Outer Rim."}, {"tag": "p", "text": "Meres Ulcane joined the Imperial Academy at the age of 17, thanks to the efforts of an influential uncle. However, Ulcane did not possess the skill needed to get ahead in the armed forces, and when he was assigned to a demolitions squad upon graduation, Ulcane suspected his superiors were trying to kill him off. Realizing a quick promotion was the only way forwards, Ulcane betrayed his squad, locking them in a warehouse owned by the Rebel Alliance and destroyed it."}, {"tag": "p", "text": "Not only did Ulcane get away with this audacious act, but he was promoted for taking out a strategic enemy site and surviving the assault that claimed the lives of his squad-mates. Ulcane turned this luck to his advantage, progressing through the ranks under a number of similarly unusual circumstances. Now-Captain Ulcane eventually became a student of alien cultures, in part because he was considered an outsider by his peers, and staged a mutiny on his own ship following the Battle of Endor."}, {"tag": "p", "text": "Fleeing into the Outer Rim Territories, Captain Ulcane met another Imperial deserter, and together they formed the Kaarenth Dissension, designed to incite the alien races of the Outer Rim against the fledgling New Republic. However, Ulcane was discovered on Betha II by Republic agents, and fled to the Spawn Nebula, where the Dissension starfleet lay in hiding."}, {"tag": "p", "text": "The New Republic tracked Ulcane to the nebula, and engaged his fleet in battle. A large portion of the fleet was destroyed, and it was believed that Meres Ulcane was killed aboard the Dissension repair station also destroyed by New Republic forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}