{"url": "Merf", "categories": ["Category:Legends articles", "Category:Freelies", "Category:Males", "Category:Vorzydiaks"], "nodes": [{"tag": "h1", "text": "Merf"}, {"tag": "p", "text": "Merf was a male Vorzydiak member of the Freelies gang on the planet Vorzyd V during the era of the Galactic Civil War. A loyal member of the Freelies, Merf participated in a daring ransom scheme in 1 ABY, when his gang kidnapped prominent Rebel leader Leia Organa and attempted to sell her back to the Alliance for a large sum. However, a squad of stormtroopers soon stormed the Freelies' hideout, Organa escaped in the firefight and Merf and his friends ended up with nothing."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Vorzydiak, Merf was a native of the Outer Rim world Vorzyd V, better known by the moniker \"the Gambler's World.\" By 1 ABY, Merf had become a member of the Freelies, a delinquent youth gang led by a Human named Jax. Merf and his friends were known to patrol the dingy streets of the capital city of Efavan looking for scores, and one night they happened across a pair of valuable-looking droids wandering alone. Although Merf and the gang attempted to claim the droids, C-3PO and R2-D2, for themselves, they quickly realized that they had forgotten the tool they needed to remove C-3PO's restraining bolt, which gave R2-D2 the time it needed to call a police droid which chased the Freelies off."}, {"tag": "p", "text": "However, Merf and his friends soon encountered those same droids again, after the Freelies entered a weapons shop intending to pull a caper. The droids were trying on automatic defensive weapons, which soon went haywire and damaged the store, convincing the Freelies that they'd be better served keeping their distance. Instead, they hung back and followed the droids to a starship belonging to their owner, Rebel hero Luke Skywalker. There, the Freelies tricked C-3PO into letting them aboard and kidnapped prominent Rebel leader Leia Organa, bringing her back to their hideout and demanding five million credits in exchange for the Princess' safe return to the Alliance."}, {"tag": "p", "text": "However, a significant wrench was thrown in the Freelies' plans when Bemmie was captured by Imperial stormtroopers also looking for Organa. Bemmie was rescued from brutal torture by Skywalker, and the grateful Vorzydiak led Skywalker back to the Freelie hideout. Although Jax refused to trust Skywalker, the two groups were briefly forced to take up arms together when the hideout was stormed by a squad of stormtroopers. Jax planned to sell Skywalker and Organa once he managed to contact the troops' leader, but Bemmie led the Rebels to a secret passage out of the hideout, freeing them from the schemes of Merf and the Freelies."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Merf was a loyal foot soldier in the Freelies gang, obediently following Jax's commands and subscribing to the group's philosophy that the most important thing was that the Freelies be left to their own devices. Merf coveted the two droids C-3PO and R2-D2, and was hardly able to fathom the idea of actually having two droids to call his own."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Merf made his first and only appearance in the Star Wars Legends continuity in Gambler's World, a comic strip story arc written and illustrated by Russ Manning and released in 1979. At first, Merf is mistakenly identified as fellow Vorzydiak Bemmie, but that mistake is rectified later in the story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}