{"url": "Arok/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Hutt Council", "Category:Hutts of the Besadii clan", "Category:Kajidiis", "Category:Males"], "nodes": [{"tag": "h1", "text": "Arok"}, {"tag": "p", "text": "Arok was an elder Hutt and a member of the Hutt Ruling Council during the Clone Wars. He led the Besadii kajidic during the Clone Wars and sat on the Council until 15 BBY, when he mysteriously disappeared and was replaced by Aruk Besadii Aora."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born within the mighty Besadii clan somewhere on one of their controlled worlds in Hutt Space, Arok was an influential member of his clan. At some point, he became the head, or Kajidii, of the Besadii clan and earned a position on the Hutt Grand Council. He also had the symbol of his clan tattooed on his upper left arm."}, {"tag": "p", "text": "Around 21 BBY, during the galaxy-spanning Clone Wars, Arok discussed the plans to release Ziro Desilijic Tiure from Republic custody with other Hutt council members including Jabba Desilijic Tiure, Gorga Desilijic Aarrpo, Oruba, and Marlo. They sought his release not out of loyalty, but rather because Ziro had potentially damaging information about Hutt activities."}, {"tag": "p", "text": "After the bounty hunter Cad Bane succeeded in freeing Ziro by holding the Republic Senate hostage, Ziro was brought before the Hutt Council on Nal Hutta. When he informed the council he knew all too well that his release was due to a holodiary he possessed which contained the Hutt Council records, Arok angrily implied that the council could just as easily kill him. Ziro casually shrugged off the threat and stated that if he were killed, the diary would end up on the steps of the Senate. Afterwards, Ziro was taken to a holding cell."}, {"tag": "p", "text": "Later, Arok and the council were entertained by the singer, Sy Snootles, who performed the musical number Daa Hutt muna. Arok found the Pa'lowick very entertaining."}, {"tag": "p", "text": "Arok did not speak when Jedi Knights Obi-Wan Kenobi and Quinlan Vos appeared before the Council and informed them of Ziro's escape. Later, Arok, Gardulla Besadii the Elder and Gorga found that Ziro had escaped from his cell and claimed that the Jedi had freed the Hutt. Cad Bane disagreed and informed the Hutts that Ziro had been freed a long before the Jedi had arrived. Arok and the other Hutts managed to persuade Bane to attempt to recapture Ziro before the Jedi were able to return him to Republic custody."}, {"tag": "p", "text": "A year later, a Sith named Darth Maul, his apprentice Savage Opress and the leader of Death Watch, Pre Vizsla, arrived in the Hutt Council chambers, requesting their allegiance and their territories in exchange for their lives being spared. Arok, Marlo and Oruba were the only Hutts present, while Gorga and Jabba attended by hologram. The Hutt council laughed at the Sith's demands and summoned numerous bounty hunters to attack the intruders. During the skirmish, one of the bounty hunters was thrown into Marlo, which Arok was shocked by because the intruders proved to be more powerful than the bounty hunters. When Maul and his forces retreated outside, Arok and Marlo managed to escape, but left Oruba behind, leading to his death."}, {"tag": "p", "text": "Some months later, Arok was a guest of Prime Minister Lom Pyke on Oba Diah. Along with Gorga, Arok was present when Anakin Skywalker and Obi-Wan Kenobi arrived to speak to Lom about Silman and Sifo-Dyas."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Hermaphrodite like the rest of his species, he took on a masculine personality. Already considered an elder Hutt by the Clone Wars, he seemed to have enough power in his kajidic that he became the clan's kajidii. It was said that he also had a smoking habit and thus carried with him a cigarette-type Hookah."}, {"tag": "p", "text": "Arok was a Hutt with average build and blue and yellow skin. He also had orange eyes and a different type of wrinkles on his body than other Hutts. At some point, like most of the Hutt Council, he had the symbol of his clan—the Besadiis—tattooed on his left arm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arok is voiced by Dee Bradley Baker. Just as his \"Hunt for Ziro\" co-star Marlo the Hutt is patterned after actor Marlon Brando, Arok's voice and appearance are styled after another actor famous for playing criminals, Edward G. Robinson."}, {"tag": "p", "text": "Arok is also seen in the 9th edition of the Star Wars: The Clone Wars Magazine, by Titan Magazines. In it, he was identified of having a smoking habit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}