{"url": "Meridian_Complex", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Buildings", "Category:Corellia locations", "Category:Shipyards"], "nodes": [{"tag": "h1", "text": "Meridian Complex"}, {"tag": "p", "text": "The Meridian Complex was a shipyard in the surface of the planet Corellia, built after the Galactic War between Galactic Republic and Sith Empire. It was the main target of the Sith Empire's attack in a decisive battle of the renewed conflict."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Meridian Complex was a massive and towering shipyard located alongside Coronet City's shoreline. It was composed of high corridors which make their way inward like a metallic labyrinth ending at the main production spire. The structure was developed by the engineer Tharan Cedrax and rumored to be derived from Iokath's advanced technologies. Once finished, it was able to produce warships three times faster than other shipyards and needing only a fraction of their energy consumption. Components for the shipyard were sourced from the salvage of Eternal Empire ships and its design won Cedrax the Silver Quasar Award for Excellence in Engineering."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Finished at the start of the galactic conflict between Galactic Republic and Sith Empire, it was seen by the Empire as a major threat and as such it became the location of a decisive battle in 3627 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ultimate fate of the Meridian Complex is determined by the player's allegiance during the \"Jedi Under Siege\" and \"Onslaught\" storylines. If the player is a loyal Imperial character, they will deactivate the shields and allow the Empire to destroy the complex. If the player is a loyal Republic character, they will raise the shields and the complex will be saved. Saboteur players can decide to support or sabotage their own faction by choosing either outcome."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}