{"url": "Meridian_trench/Legends", "categories": ["Category:Legends articles", "Category:DS-1 Orbital Battle Station locations"], "nodes": [{"tag": "h1", "text": "Meridian trench"}, {"tag": "p", "text": "The Meridian trench, located on the first Death Star, was a trench encompassing a portion of that battlestation. It housed the station's greatest weakness: a thermal exhaust port situated near the station's north pole, which is why it was also known as the Polar Trench. If weaponry was fired into it, the exhaust port would cause the Death Star to under go a critical chain reaction. The Alliance to Restore the Republic utilized this trench to destroy the Death Star before it blew up their base on Yavin 4."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The meridian trench was one of the eighteen narrow canyons that converged on the poles of the Death Star, a moon-shaped deep-space mobile battlestation built by the Galactic Empire. Those large furrows that stretched across the Death Star's surface could be easily spotted, even at a distance, and they gave access to multiple docking bays and hangars. The most visible of the trenches ran around the battlemoon's equator, separating its northern and southern hemispheres, while the others ran parallel to those. The meridian trench itself was located near the \"north pole\" of the Death Star. Like the other trenches, the Meridian trench acted as directional markers for Starfighter and shuttle pilots. It was protected to some degree by low-energy shield projectors in terms of entry points as well as disposal ports. The trench overall was wide enough to accommodate three single-pilot starfighters in attack formation."}, {"tag": "p", "text": "The trench itself's height was the equivalent of at least three sub-surface levels. In addition, it contained energy flush vents as well as heat sinks, communications arrays, power distribution nodes, service access ports, shuttle landing pads, cosmic ray sinks, sensor suite fields, defense-field generators, as well as various shield projection towers on the surfaces near the trench."}, {"tag": "p", "text": "Like all the other trenches, it proved treacherous to even the most skilled starfighter pilots, as it was fitted with many XX-9 heavy turbolaser towers (which acted as the primary source for protection), several even being on the floor of the trench in addition to just outside of it, and thus left little room for evasive maneuvers. The defensive systems were also programmed in such a way to avoid the turbolaser batteries from either accidentally blasting each other or otherwise damaging the station's hull and surface structures. While the Death Star had been designed to withstand massive assaults by a full enemy starfleet, a successful attack by small fighters had never been anticipated during conception. Therefore, the meridian trench granted access to the station's major weakness, the thermal exhaust port. Despite this, however, it nonetheless was equipped with a field generator that caused various sensors save for sight to be negatively affected, and generated a distortion field potent enough to cause even enemy starfighters' maneuverability to be negatively effected to the extent of decreasing to point three. In addition, although the designers for the Death Star had anticipated the possibility that the trenches would be accessible to enemy Starfighters, they were confident that Imperial firepower would readily defeat the threat, and would not cause significant damage, and also included ray-shield projectors around the area of the thermal exhaust port specifically to ensure that it could not be set off by laser bombardment."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 0 BBY, the Alliance to Restore the Republic planned on destroying the Death Star over the gas giant Yavin Prime. The plan depended on the ability of a single T-65 X-wing starfighter to navigate the meridian trench while avoiding the Imperial TIE fighters and the turbolaser towers, and fire two proton torpedoes into the vent reactor core. With the aid of the Force and the timely intervention of Han Solo, the young Tatooinian farmboy Luke Skywalker accomplished the mission. His torpedoes traveled into the reactor core, starting a chain reaction that blew up the battlestation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Death Star's meridian trench first appeared in Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy. For the final dogfight of the movie, Industrial Light & Magic used a puzzle of patterned pieces fitted together on larges tables. In the process, a three feet deep model of the meridian trench and a full-scale thermal exhaust port were also completed."}, {"tag": "p", "text": "Originally, the meridian trench was intended to get denser and more detailed toward the station's poles. This shows in the conceptual drawings by Joe Johnston appearing in the early reference book The Star Wars Sketchbook. This was to some extent retained in Star Wars: The Arcade Game, as well as the Trench Run sequences in the Rogue Squadron series, in order to make the level more challenging."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}