{"url": "Aron_Harcourt", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Aron Harcourt"}, {"tag": "p", "text": "Aron Harcourt was a disgraced former captain of the Imperial Navy, who served administratively on a remote outpost in 0 ABY. Harcourt was once renowned as a hero of the Galactic Empire, commanding the Imperial-class Star Destroyer Anya Karu - but the Anya Karu was destroyed by Rebel saboteurs by 3 BBY and he was forced to abandon ship, leaving it derelict on a desolate planet. He was blamed for the loss of the Anya Karu in the subsequent inquiry and removed from the command structure of the Imperial Navy. By 0 ABY, Harcourt decided to have a holographic recording of his late wife, Janelle, recovered from the Anya Karu, before the wreck was scuttled. Lacking the requisite finances, Harcourt nonetheless enlisted the bounty hunter Boba Fett to recover the hologram. Although the recording was retrieved and Harcourt was able to view it once more, his inability to pay the bounty hunter resulted in Fett terminating his life."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Aron Harcourt was a Human male who began a naval career during the Great Peace of the Republic. While studying at an academy, he met a woman named Janelle, whom he later married. Harcourt ultimately served in the Imperial Navy and was given the captaincy of the Imperial-class Star Destroyer Anya Karu. He gained a reputation as a hero of the Galactic Empire and was bequeathed a RHTC-560 Hunter Trainer droid and RHTC-560 HT Drones by a Rodian warlord. With nothing for the droids to hunt, Harcourt put them to use as his personal bodyguards, which normally would have been against naval regulation but was allowed due to his renown."}, {"tag": "p", "text": "By 3 BBY, Alliance to Restore the Republic saboteurs attacked the Anya Karu. As a result, Harcourt was forced to give the order to abandon ship. The Anya Kuro crashed on a desolate planet as a result of the sabotage, leaving Harcourt subject to an inquiry. Despite his years of service, Harcourt was blamed for the loss of the ship—the captain speculated, however, that the decision was a political attempt to cover up the fact that the Alliance had been able to sabotage an Imperial capital ship. At some later point following the Anya Karu's wreckage and by 3 BBY, Janelle died, leaving only a brief holographic recording of herself to be remembered by. Harcourt treasured the recording and kept it in his personal quarters on the Anya Karu."}, {"tag": "p", "text": "Ultimately Harcourt was removed from the Imperial Navy command structure and placed in charge of a remote outpost. In 0 ABY, he decided to have his hologram of Janelle recovered. The Imperial I-class Star Destroyer Adjudicator had been dispatched to the barren world to scuttle what was left of the wreckage of the Anya Karu, if it was destroyed, he would never see his wife again. Harcourt's only hope was to enlist the services of the bounty hunter Boba Fett, despite only having enough money to pay for half of Fett's fee. Using deceit, the former captain made a deal to pay half of the fee before retrieval of the hologram and another half later. In truth, however, he paid Fett all the money he had up front. The bounty hunter made his way to the wreck of the Anya Karu, braving TIE/LN starfighter patrols and Harcourt's \"bodyguards\" before successfully finding the recording of Janelle and bringing it back to the outpost."}, {"tag": "p", "text": "When Fett presented him with the holorecording, Harcourt immediately began watching the short loop of his wife and reminisced about their first meeting. The former captain was pleased with the bounty hunter's work, but when Fett demanded payment, Harcourt was forced to admit that he had nothing with which to pay the bounty hunter. He suggested that he would not tell anyone else if Fett overlooked the shortfall, so as to preserve the bounty hunter's reputation, but Harcourt soon realized that Fett was not interested in such a bargain and intended to kill him for the transgression. Reflecting on the holorecording of his wife once more, Harcourt conceded that he had lived a good life, albeit a lonely one in the wake of Janelle's death and the loss of his command. He admitted to Fett that he had only wanted to see his wife's visage and hear her say his name once more. As Harcourt professed his love for his wife one more time, Fett shot him in the back of the head, ending the former captain's life as the holorecording repeated its short loop."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Harcourt was an officer of great distinction, hailed in his own time as a \"hero of the Empire.\" His position afforded him privileges above and beyond those of a normal Star Destroyer captain, although he could not save himself from being held accountable as a scapegoat for his ship succumbing to Alliance sabotage. Harcourt was critical of the Empire in that instance, musing on the fact that his three decades of dedicated service were not even a consideration during the Anya Karu inquiry. Nevertheless, the captain took great pride in his ship even after it had been lost, keeping a model of it on his desk after being reassigned."}, {"tag": "p", "text": "Harcourt loved his wife dearly, and the feeling was reciprocated by Janelle. After her death, he valued his brief recording of her, to such a degree that he was willing to have his life ended just to see and hear the recording again."}, {"tag": "p", "text": "He had brown hair, which was graying at the temples, blue eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Harcourt wore the standard olive-green uniform of an Imperial officer while administrating his remote outpost."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aron Harcourt first appeared in Empire 28 (2004), written by Ron Marz and penciled by Adriana Melo. The character was later referenced in The Complete Star Wars Encyclopedia (2008)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}