{"url": "Merrejk", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Death Squadron personnel", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Merrejk"}, {"tag": "p", "text": "Merrejk was a Human male commander of the Imperial Navy during the height of the Galactic Civil War. As an elite Imperial spy and scout, he often posed as a freighter captain making supply runs to the Outer Rim Territories, monitoring Rebel and criminal activity. By 4 ABY, Merrejk was assigned to Darth Vader's flagship, the Super Star Destroyer Executor, where he served on the bridge under the command of Admiral Firmus Piett. During the early stages of the Battle of Endor, Merrejk notified Piett that the Executor had reached attack position, to which Piett responded that the warship would hold its position in order to allow the secretly operational superlaser of the second Death Star battlestation to wreak havoc upon the Alliance Fleet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Merrejk was a commander of the Imperial Navy during the Galactic Civil War. An elite spy and scout of the Galactic Empire, he often masqueraded as a freighter captain making supply runs to the Outer Rim Territories. His primary duties included watching for illegal Rebel and other criminal activity. By 4 ABY, Merrejk was assigned aboard the Dark Lord Darth Vader's flagship, the Super Star Destroyer Executor, during its watch-guard role of the second Death Star battlestation, under construction in orbit over the remote Forest Moon of Endor."}, {"tag": "p", "text": "During the early stages of the pivotal Battle of Endor, Merrejk was stationed aboard the Executor's bridge under the command of Admiral Firmus Piett, where he informed his superior officer that the warship, at the head of the massive Imperial Fleet waiting in ambush of the recently arrived Alliance Fleet, had reached attack position. However, Piett ordered Merrejk to hold their current position, revealing to a nearby flabbergasted Commander Gherant, another of the Super Star Destroyer's officers, that the Executor's duty was only to keep the Rebel Fleet from escaping, for Emperor Palpatine had a specially designed present waiting to destroy them—the fully operational superlaser of the uncompleted Death Star."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an expert spy and scout, Merrejk would often use his skills in service to the Empire to keep tabs on Rebel and criminal activity, frequently posing as a freighter captain making trips to the Outer Rim. Merrejk had brown hair, bluish eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Commander Merrejk wore the black variant of the standard-issue Imperial officer's uniform, sans rank insignia, and a chrome utility belt during the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Merrejk first appeared in the 1983 film Star Wars: Episode VI Return of the Jedi as an unidentified character extra, portrayed by an uncredited actor. His single line, alerting Admiral Firmus Piett of the Executor's ready status, is unique to the movie and not included in the Return of the Jedi novelization, in which Piett independently determines that the warship will hold at its given position. The Merrejk character was first identified by name and provided a brief backstory on the \"Commander Merrejk\" card as part of the July 2000 Death Star II Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "p", "text": "While no official Star Wars source discusses Merrejk's fate during the Battle of Endor, in which the Executor is ultimately destroyed, Leland Chee, keeper of Lucasfilm's Holocron continuity database, when asked whether Merrejk was killed during the Executor's destruction, has stated on his personal Facebook fan page that he's \"Not sure why we'd go out of the way to say he's alive,\" and that it is \"Best to presume dead unless proven otherwise.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}