{"url": "Merrick_Simms", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Blue Squadron personnel", "Category:Green Squadron personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Merrick Simms"}, {"tag": "p", "text": "Merrick Simms was a Human male starfighter pilot in the Alliance Starfighter Corps who commanded Blue Squadron at the battles of Yavin and Endor. Simms joined the Alliance to Restore the Republic early in the Galactic Civil War and, following a victory near Dantooine in 1 BBY, was quickly promoted to captain. The following year he was stationed at Anchorhead Base on Tatooine and fought against Imperial forces who attacked the base in 0 BBY, though he was unable to prevent its destruction."}, {"tag": "p", "text": "After fleeing to Yavin Base on the fourth moon of Yavin, Simms led Blue Squadron in the Battle of Yavin against the Empire's Death Star battlestation. Four years later, he once again took command of Blue Squadron in the Battle of Endor, fighting against the second Death Star. During the battle, Simms joined General Lando Calrissian, Wedge Antilles and \"Green Wing\" in an assault on the Empire's main communications ship. Though the group eliminated the vessel, Simms' B-wing starfighter was caught in the resulting shock wave and he was killed when he collided with another Imperial starship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "The Human male Merrick Simms joined the Alliance to Restore the Republic early in the Galactic Civil War, serving as a starfighter pilot in the Alliance Starfighter Corps. In 1 BBY, Simms was involved in a highly-acclaimed victory near Dantooine. As a result, he was quickly promoted to captain, despite his young age."}, {"tag": "p", "text": "By 0 BBY, Simms was assigned to Green Squadron and stationed at Anchorhead Base on Tatooine, where he flew under the call sign Green Leader. Among his duties was helping to train rookie pilots by conducting trials through the nearby Beggar's Canyon and the surrounding area. Pilots were required to follow two members of Green Squadron through the treacherous canyon in a T-16 skyhopper. At one point in the course, the two more experienced pilots would split up, each taking a fork in the canyon. The rookie pilot was given the choice between taking the easier path or following Simms on the more difficult route. After the paths merged, the group would leave the canyon for the second trial—the rookie was required to keep formation while engaging target drones and navigating through rocky terrain. Among the trainees at Anchorhead Base was the pilot nicknamed \"Rookie One\", who passed his trials under Simms shortly after the Battle of Toprawa, in which Rebel agents acquired the plans to the Galactic Empire's Death Star battlestation."}, {"tag": "p", "text": "Soon after Rookie One completed his trials, the CR90 corvette Tantive IV arrived at Tatooine, carrying Princess Leia Organa, custodian of the stolen Death Star plans. When Dark Lord of the Sith Darth Vader arrived aboard the Imperial-class Star Destroyer Devastator to capture it, Organa dispatched the plans to Tatooine in the care of the droids R2-D2 and C-3PO. Realizing that the plans were no longer aboard the Tantive IV, Vader ordered his forces to begin searching Tatooine. This search eventually led the Imperials to discover Anchorhead Base."}, {"tag": "p", "text": "The Rebels were quick to call for help from their Pilot Training Center on Kolaador, but the reinforcements—three T-65 X-wing starfighters led by Commander Ru Murleen—arrived too late to prevent Anchorhead Base's destruction by TIE/LN starfighters. Attempting to defend the base in his own X-wing, Simms escaped Anchorhead Base's destruction and joined up with Murleen's group after their arrival. Murleen soon detected that Imperial ground forces were being deployed at the nearby Mos Eisley spaceport. Though he knew that the Rebels would soon be outnumbered, Simms suggested that they do what they could to halt the Imperial advance on Mos Eisley before regrouping at the Alliance's Gamma Base on the ice-world of Hoth. Murleen agreed and sent Rookie One and Thurlow Harris to help Simms in Mos Eisley, while she moved to cut off the Imperial supply lines. Simms led the three X-wings to Mos Eisley and the group engaged All Terrain Scout Transports and Imperial landing craft until Simms detected TIE fighters and interceptors approaching and gave the order to withdraw. Though the TIEs followed the Rebels out of the atmosphere, Simms led his group into the nearby asteroid field, losing their pursuers before escaping to hyperspace."}, {"tag": "h3", "text": "Battle of Yavin"}, {"tag": "p", "text": "Following the subsequent evacuation of Gamma Base, Simms was assigned to Yavin Base on the fourth moon of Yavin. However, though the stolen Death Star plans were eventually delivered to Yavin Base, the Imperials learned of the Rebel base's location and the Death Star was dispatched to destroy it. The plans revealed a weakness in the battlestation which General Jan Dodonna formulated a plan to exploit; a direct proton torpedo hit on a small thermal exhaust port would trigger a chain reaction in the Death Star's main reactor and destroy it. Simms was given command of Blue Squadron, a group of four X-wings which also included Murleen, Rookie One and Harris, and charged with attacking the Death Star's superlaser directly, in an attempt to both damage it and divert attention away from Red and Gold Squadrons while they attacked the exhaust port. After a briefing by Dodonna, the pilots were split into their assigned squadrons for exercises that would prepare them for the Death Star's arrival. Blue Squadron's training exercise required them to destroy target drones while navigating through a narrow river bed on the jungle moon. By the time the group finished the exercise, the Death Star had arrived in the system, and Simms took Blue Squadron to rendezvous with the other Rebel fighters."}, {"tag": "p", "text": "As Blue Squadron approached the Death Star, a Star Destroyer in its support fleet launched TIE fighters to intercept them. The group battled their way through the incoming TIEs, but three of the Imperials were able to get on Simms' tail. Harris, acting as Simms' wingman, was unable to get a lock, but Simms managed to evade the TIEs long enough for Rookie One to come to his aid. After the Rebels made it past the perimeter, Simms instructed Murleen and Rookie One to commence strafing runs on the Death Star's turbolaser batteries. The thermal exhaust port was located in a trench along the surface of the battlestation, but before any of the Rebels could enter the trench, they needed to eliminate a heavy cannon situated near the exhaust port. Simms dispatched Murleen and Rookie One to attack the cannon—the pair opened a gap in its shielding and flew into the superstructure, destroying several power relays and disabling the weapon. With the threat of the heavy cannon neutralized, the way was clear for the Alliance forces to begin their trench runs. Though the initial attempts failed, Red Squadron pilot Luke Skywalker ultimately succeeded in delivering a killing blow to the Death Star."}, {"tag": "h3", "text": "Death at Endor"}, {"tag": "p", "text": "Four years later, the Alliance learned that the Empire was constructing a second Death Star in orbit of the forest moon of Endor. Believing that the battlestation was not yet operational and protected only by a deflector shield projected from Endor, the Alliance planned an assault on the station, timed to coincide with a visit to the construction site by Emperor Palpatine. General Han Solo was to lead a strike team to the forest moon to neutralize the deflector shield, while Admiral Gial Ackbar led the Alliance Fleet against the battlestation itself. Simms was again selected to lead Blue Squadron, one of the Alliance's battle wings for the mission."}, {"tag": "p", "text": "The Rebels emerged from hyperspace to find the Death Star's protective shield still in place and the Imperial Navy awaiting them. When the Death Star opened fire with its supposedly unfinished primary weapon, destroying the Mon Calamari Star Cruiser Liberty, General Lando Calrissian realized that the Rebels' best hope of survival was to engage the Empire's Star Destroyers at point-blank range while they waited for Solo's team to bring the shield down. As the battle progressed, the Empire's main communications ship, the Pride of Tarlandia, which had been jamming the Alliance forces' sensors to prevent them detecting the status of the deflector shield, was disabled by heavy fire from a Rebel cruiser, which was subsequently destroyed. With the Imperial crew beginning to repair the damage, the Rebels had to move quickly to destroy the communications ship. Simms joined up with Gold Leader Lando Calrissian, Red Leader Wedge Antilles and \"Green Wing\" to launch an assault on the crippled vessel."}, {"tag": "p", "text": "Calrissian led the group in at an angle that kept them out of range of the bigger ship's weapons and left them virtually invisible to its crew. Increasing power to their front deflectors and closing formation, the group began a dive perpendicular to the communications ship's axis, before making a right-angle turn to race along its hull. The Rebels came under heavy fire as they began their attack, focusing their assault on a damaged section. Green Wing was soon hit by enemy fire and drove his damaged fighter into the forward weapons, destroying them in the resulting explosion—Simms quickly offered his thanks for his comrade's sacrifice. With the way now clear of enemy fire, the remaining Rebels proceeded to the cargo bay which housed the ship's reactor core. Under the combined fire of all three Rebels, the reactor was soon destroyed and the Rebels attempted to pull away before the vessel exploded. However, Simms' B-wing starfighter was caught in the shock wave that followed the resulting explosion, and he was thrown against the hull of another Imperial ship, killing him and destroying both vessels. Though the Death Star's shield was still active, the communications ship's destruction allowed the Rebels to detect when Solo's team finally succeeded in destroying the bunker which powered it. Calrissian and Antilles led Rebel fighters into the battlestation's superstructure and destroyed its main reactor, giving victory to the Alliance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Merrick Simms was a skilled pilot, who always kept his cool and was promoted to captain at a young age following his involvement in a Rebel victory near Dantooine. He believed life should be entertaining and found combat against the Empire to be particularly enjoyable. Outside of combat, he was willing to allow pilots under his command to show off their skills and perform stunts during training missions. However, he also understood that discipline was needed to confront Imperial forces. If pilots chose to follow him on the more difficult route through the Beggar's Canyon training flight, he would talk them through it and ensure that they emerged in one piece. In combat, he was professional and ensured that his pilots stayed focused on their task and cut any unnecessary conversations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Merrick Simms was created for the 1993 LucasArts video game Star Wars: Rebel Assault and his backstory was expanded in the game's manual. His appearance in the game was based on LucasArts artist Peter Chan. Simms is a non-player character in the game, who serves in the same squadron as the player's character, Rookie One. In the game's twelfth mission, \"TIE Attack\", Simms comes under attack from three TIE fighters. The player must move quickly to eliminate the threat—if Simms is killed, the mission is a failure."}, {"tag": "p", "text": "Rebel Assault depicts Simms, as part of Blue Squadron, taking part in a trench run at the Battle of Yavin which contradicts the battle as depicted in Star Wars: Episode IV A New Hope. The trench run in the game is almost identical to that of the movie—only the persons involved are different. The game depicts Blue Squadron attempting a trench run with Simms entering first while Rookie One joins Murleen and Harris in providing cover. As they negotiate down the long trench the group is pursued by three TIE fighters, including a TIE Advanced x1 which was presumably intended to be the one used by Vader in the movie. The TIEs open fire, killing Harris and forcing Murleen to pull out, echoing the fates of Biggs Darklighter and Wedge Antilles in the movie. Simms finally reaches firing range but his torpedoes impact on the surface, leaving Rookie One next to make an attempt, mirroring Garven Dreis's failed attempt. In the game, it is Rookie One's shot that is depicted as destroying the battlestation, as opposed to Skywalker's."}, {"tag": "p", "text": "In December 2006, Leland Chee commented on the StarWars.com Message Boards that Rookie One's trench run was non-continuity. The Essential Guide to Warfare (2012) later confirmed that Blue Squadron were assigned to attack the Death Star's superlaser while Red and Gold Squadrons attacked the trench."}, {"tag": "p", "text": "The character was retconned by 1998's Star Wars Encyclopedia as being Blue Leader as depicted in the novelization of Star Wars: Episode VI Return of the Jedi. This retcon was later repeated in Star Wars: Behind the Magic and the third edition of A Guide to the Star Wars Universe. All three sources misspell the character's name as \"Merrick Simm.\" The first and second editions of A Guide to the Star Wars Universe featured information on the characters as \"Blue Leader\", as did the Star Wars PocketModel TCG."}, {"tag": "p", "text": "Simms' entry in The Complete Star Wars Encyclopedia established that he \"believed life should be entertaining and could think of no more enjoyable place to be than engaged in combat with the Empire.\" This description had been previously used to describe Ace Merrick, a character from Rebel Assault's sequel, Star Wars: Rebel Assault II: The Hidden Empire. Despite their similar names, the two are different characters—Merrick dies in combat with TIE Phantoms during 3 ABY while Simms is killed later at the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}