{"url": "Merumeru/Legends", "categories": ["Category:Legends articles", "Category:Kashyyyk residents", "Category:Males", "Category:Officers", "Category:Wookiee Chieftains", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Merumeru"}, {"tag": "p", "text": "Merumeru was a male Wookiee Chieftain who fought during the Clone Wars. He was a commander in the Battle of Kashyyyk, leading an army of volunteers against the invading Confederacy of Independent Systems. Merumeru was also a highly respected Wookiee Chieftain. However, at only 250 years old, he was considered relatively young for such a rank."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Merumeru was considered young for a chieftain, at the age of 250 standard years. His mental prowess was refined by playing dejarik and other similar games. In practice, he developed effective tactics in defending Wookiee territories and outposts from Trandoshan raiders."}, {"tag": "p", "text": "During the battle for Kachirho, Captain Merumeru led the beachfront defense, leading his volunteer soldiers against the invading droid armies. Among the capable warriors following him into battle were Guanta, Lachichuk and Salporin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Merumeru had a very sharp mind honed through playing dejarik and other games. He was a skilled tactician, whose tactics proved very useful in defending Wookiee outposts and territories against Trandoshan slavers. In combat he wielded a battle staff and bowcaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Merumeru was played by Axel Dench. He was unnamed during production, and was referred to in the script as \"a Wookiee chieftain.\""}, {"tag": "p", "text": "The helmet that Merumeru wore in Revenge of the Sith wasn't completed in time for production, so he wore a blue helmet on his head for this scene. The blue headgear was later replaced with a digital helmet in the final version."}, {"tag": "p", "text": "Merumeru wore the crest of the Kachirho clan during the Battle of Kashyyyk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}