{"url": "Mesa_291", "categories": ["Category:Legends articles", "Category:Bothawui locations", "Category:Mining areas"], "nodes": [{"tag": "h1", "text": "Mesa 291"}, {"tag": "p", "text": "Mesa 291 was a mine on Bothawui."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mesa 291 was a lidium mine located in a barren area of the planet Bothawui. The mesa jutted out of the ground, and had two main entrances; one leading to the main tunnel on Level 1, while a second entrance lead to a large cavern on Level 2. Various branch tunnels lead off from the main tunnels on Levels 1 and 2, and a main shaft, one of the deepest artificial shafts in the galaxy dropped into the planet's surface. On Level 2, the cavern was large enough to hold several starfighters and a shuttle. The structure descended five hundred levels below the surface, and was serviced by elevators. A foreman's office had access to a public address system. Formex comprised the bulk of the building materials."}, {"tag": "p", "text": "After the disaster that led the mine being abandoned, plasma fires raged in the lower levels, with only the top five levels accessible. Due to the abandoned nature of the mine, items such as plastics and metals were left lying around, as well as tools such as hydrospanners, vibrosaws, beamdrills, power prybars, cables, pipes, hinges, servomotors, halon fire extinguishers, tool kits, and syntherope, as well as a loadlifter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mesa 291 was an active lidium mine until two generations before the Galactic Civil War, when a disaster struck. The resulting catastrophe triggered plasma fires that continued to burn years later, and explosions regularly shock the abandoned structure. The mine became unstable and susceptible to collapses and cave-ins; only the top five levels were left accessible by the incident, and of them, the lower three were extremely unstable."}, {"tag": "p", "text": "Mesa 291 became a secret Alliance to Restore the Republic cache, and affiliated with Clan Alya. Alliance Intelligence agent Tay Vanis used Mesa 291 as a rendezvous for four new recruits to the Alliance—Raleigh Dawn, Sammie Staable, Raal Yorta, and Smileredon-Verdont—but the meet was discovered by officer Mar Barezz of the Imperial Security Bureau. Vanis left his astromech droid, R2-D0, to guide the new Rebels to an escape shuttle in the cavern, while he attempted to draw off pursuit in his T-65 X-wing starfighter."}, {"tag": "p", "text": "The four Rebels followed R2-D0 through the mine, traversing the main shaft to do so and encountered and injured Vanis in the cavern; his X-wing had been shot down and he had crashed into their escape shuttle. Thankfully, Vanis had stashed several BTL Y-wing starfighters in the cavern as well, and the five Rebels escaped the facility."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}