{"url": "Mess_Boulanger", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Quartermasters", "Category:Republic Army officers"], "nodes": [{"tag": "h1", "text": "Mess Boulanger"}, {"tag": "p", "text": "Mess Boulanger was a male Human who served in the Grand Army of the Republic during the Clone Wars as a quartermaster. Boulanger participated in the Battle of Praesitlyn, providing logistical support to the liberation of the Republic's Intergalactic Communications Center from a Separatist occupation force."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars in 22 BBY, the male Human Mess Boulanger was assigned to the post of quartermaster within a Republic military expedition dispatched to Praesitlyn, where a Republic listening post had come under attack from a Separatist taskforce led by Admiral Pors Tonith. Traveling to Praesitlyn with a clone trooper detachment under the command of Jedi Master and General Nejaa Halcyon, Boulanger meticulously planned and prepared the necessary supplies well in advance of battle and thoroughly briefed Commander Anakin Skywalker on the importance of logistics."}, {"tag": "p", "text": "While on Praesitlyn during the Republic incursion, Boulanger encountered Zozridor Slayke, the leader of a pro-Republic splinter group that had been fighting against the Separatist occupation force. Slayke mistook Boulanger for the General in charge of the relief effort, prompting Boulanger to indicate Commander Skywalker as a more suitable contact. As the fighting intensified, Boulanger took charge of the supply chain, directing the transports carrying provisions to and from Praesitlyn and having several troopships modified to serve as cargo carriers to deal with the sheer amount of supplies, which Boulanger and his staff had planned to last for the estimated week needed to unseat Tonith's grip on the communications facility. Despite the quartermaster's best efforts, persistent attacks from Tonith's forces meant that Boulanger's shuttles had to negotiate ever more hazardous conditions to land on Praesitlyn, resulting in many of the ships being destroyed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mess Boulanger was a logistician at heart; his dedication to ensuring that the Republic expedition to Praesitlyn was adequately supplied was absolute, and he took great pride in informing others of that fact, espousing the use of the acronym COMETS-Q to help remind others of what a military force needed to function adequately. As a quartermaster specialising in the supply and support of an organic army, Boulanger was disdainful of battle droids, though he freely admitted that managing provisions for droids, such as spare parts and lubricants, also counted as logistics. An older male Human, Boulanger had a pot belly, blue eyes and a drooping brown mustache."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mess Boulanger first appeared in Jedi Trial, a novel written by David Sherman and Dan Cragg and released in 2004 as part of the Clone Wars multimedia project."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}