{"url": "Metal-Crystal_Phase_Shifter", "categories": ["Category:Legends articles", "Category:Imperial projects and operations", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Metal-Crystal Phase Shifter"}, {"tag": "p", "text": "The Metal Crystal Phase Shifter (MCPS) was a superweapon capable of altering the molecular structure of metallic substances."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The sole purpose of the project was to create a weapon that would be able to penetrate the shields of a starship and damage its hull; once encountering the area of the phase shifter's effect, the metal within the target's hull would be turned into powder and thus be weakened greatly during the attack. While the MCPS did not dramatically turn an entire ship's hull into powder, it did create many tiny cracks and weak spots throughout the hull, which was sufficient to make the vessel lose critical structural integrity and collapse on itself. The field was strong enough to render durasteel vulnerable to it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A prototype model was constructed by scientists within the Imperial Maw Installation at some point during the early portion of the Galactic Civil War. Bevel Lemelisk of the Imperial Department of Military Research was particularly fond of the technology, although he acknowledged that it would require a rename before being put to active service, as he noted in the official field manual for prospective officers for the Imperial Military, the Imperial Handbook: A Commander's Guide. Sometime after the Battle of Endor, the Rebel Alliance acquired a copy of the Imperial Handbook, and learned of the MCPS. Because of this, Mon Mothma, one of the leaders of the Rebel Alliance, made a mandatory request that any and all superweapons listed in the field manual as either \"experimental\" or \"planned\" need to be forwarded to Admiral Drayson of Intelligence. The technology used in the construction of the device was thought lost forever as the sole working prototype was destroyed by the New Republic during their attack on the Maw Installation, although the Metal Crystal Phase Shifter successfully destroyed a New Republic CR90 corvette before being disabled."}, {"tag": "p", "text": "Shortly before the destruction of the Maw Installation, during the Battle of the Maw, Admiral Daala succeeded in downloading all the superweapon designs, presumably including the one for MCPS, to her Star Destroyer, the Gorgon. The Installation then exploded and the Gorgon disappeared, leaving the New Republic to believe that the designs were destroyed."}, {"tag": "p", "text": "During the Second Battle of Fondor, most of the ships in Admiral Daala's Maw Irregular Fleet were outfitted with functional Metal Crystal Phase Shifters. It turned the tide of the battle and forced the withdrawal of Darth Caedus' forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the profile of the Omega Frost featured in the Star Wars Homing Beacon #209, the MCPS was said to be \"a conceptual cousin\" of the Omega Frost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}