{"url": "Arqet", "categories": ["Category:Legends articles", "Category:Carnivorous creatures", "Category:Creatures of Pellastrallas", "Category:Endothermic species", "Category:Species of undefined sentience", "Category:Ungulates"], "nodes": [{"tag": "h1", "text": "Arqet"}, {"tag": "p", "text": "The arqet was a species of mountain carnivores and predatory ungulates native to the planet Pellastrallas. A ferocious and patient hunter, arqets were utilized for gladiatorial combat by the Circus Horrificus, leading to chaos after one escaped and gored numerous spectators on Nar Shaddaa."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Arqets were warm-blooded predators with rigid hides comprised of dense dorsal and spinal plates capable of withstanding energy projectiles and slug-throwing weapons. These ridges gave them the appearance of armadillos. The animal's skin varied in hue depending on the amount of solar radiation they were exposed to, and allowed the arqet to blend into its surroundings. An arqet's skull was flanked by two curved horns longer than the head itself, which were used to hunt and kill prey along with their sharp, piercing teeth. They also had split hoofs ending in claws capable of inflicting damage, and were typically sure-footed in their rocky habitats."}, {"tag": "p", "text": "They were solitary hunters, and preyed on smaller species of their region including the Ixzinian rock ram and the Uthori breix. Known for their legendary patience, arqets remained motionless to the point of appearing as immobile as a standing rock. Staying hidden until their prey came within range, arqets attacked at the last minute, skewering smaller creatures with their horns. They were also known to lure victims in by taking damage, then lunging upon their unsuspecting attackers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Arqets inhabited the mountain ranges of Pellastrallas, preying on smaller species including the Ixzinian rock ram and the Uthori breix. They were infamous as one of the most ferocious warm-blooded predators in the Agarix sector, and their extreme patience while hunting became legendary. Some arqets were targeted by armed Humanoids, and were able to take hits from energy and slug-thrown weapons in order to dissuade their attackers, or to lure them into range for a last, desperate lunge."}, {"tag": "p", "text": "The Circus Horrificus captured ferocious arqets from their homeworld to be used in gladiatorial arenas alongside beasts such as akk dogs. Perhaps the most famous instance of this was the importation of an arqet by the Circus in Nar Shaddaa's Ko Hentota district in 22 BBY. When the arqet was revealed to the crowd, it promptly shook off its restraints and began to attack the spectators, killing twelve. Attempts to subdue it were futile, and the beast fled into the ventilation system. The disaster caused the operators of the Circus to scatter and marked the end of its illegal shows."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}