{"url": "Metellos_Exchange", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Markets"], "nodes": [{"tag": "h1", "text": "Metellos Exchange"}, {"tag": "p", "text": "The Metellos Exchange was an auction based on Metellos 3, a moon of the planet Metellos, during the Mandalorian Wars. It used scientific data collected on the moon to auction off the rights to newly discovered and often unexplored celestial objects for a profit. The operation was run by the Raff Syndicate, which intentionally exaggerated the benefits of the data to encourage more competitive buying and, as a result, more profits. The market was run by Chev slaves owned by a Chevin named Nunk Plaarvin. The Chevin was removed from his position by the black marketeer Marn Hierogryph and his conning group, Cargryph Capital Management, in 3963 BBY when they conned the system using the planet Italbos. After managing to trick Plaarvin into leaving Metellos 3, the auctioneer—one of Plaarvin's Chev slaves, Cipiter—was left to run the Metellos Exchange for the Raff Syndicate."}, {"tag": "h2", "text": "Concept"}, {"tag": "p", "text": "The theory of the Metellos Exchange was devised by Cipiter, a Chev slave belonging to the Chevin Nunk Plaarvin. It worked on the fact that explorations into the Outer Rim were expensive and the explorers' investors would want to know what potential rewards lay in wait to pay for the expeditions. The Metellos Exchange was set up on Metellos 3, a moon of the planet Metellos, where telescopic devices were used to explore the galaxy and discover new astronomical bodies during the renewal of exploration after the Great Sith War. This data would be provided to the market, and the claims to rights such as hyperspace transit agreements, the extraction licenses and environmental concessions required for mining, and rights to supply water would be auctioned off. Often, the planetary claims would be sold for millions of credits years before anybody actually visited the planet. The organization that ran the Metellos Exchange, the Raff Syndicate, had the data presented to the market embellished to encourage more competitive bids and, ultimately, more profits for the Syndicate taking its cut. To ensure that they received the correct cut, the market was highly regulated by Raff Syndicate members inspecting the Metellos Exchange."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Metellos Exchange was set up on Metellos 3 shortly after the Great Sith War where it, with the co-operation of the Galactic Republic, became the first of numerous \"Planetary Futures Exchanges.\" When the market operated during the Mandalorian Wars, trade franchises with planets held by the Mandalorians—the nomadic warriors fighting the Republic—such as Mandalore would be auctioned."}, {"tag": "p", "text": "In 3963 BBY, the flaws in the market's method of trading rights were exploited by the Snivvian black marketeer Marn Hierogryph and Cargryph Capital Management, Hierogryph's group of friends and business partners. One member of Cargryph Capital, a female Arkanian Offshoot named Jarael, disguised herself as an explorer who had discovered the planet Italbos before those who had bought the claims on the world—as sold by the Metellos Exchange—had visited it. Her companion, the Mandalorian Rohlan Dyre, was disguised as a native of Italbos who was displeased by the prospect of being someone else's property. They interrupted the sale of claims to a planet in the Anoat sector, Bespin, to make themselves heard. Hierogryph, under the guise of \"Professor Gryphomarn,\" acted as an advocate in the matter and invalidated the claims on Italbos. Jarael then caused further outrage by claiming that the Metellos Exchange's mineral projections were much lower than reality. Cipiter, the auctioneer, was forced to halt proceedings until the next day due to the sudden demand to auction the new, more valuable claims for Italbos."}, {"tag": "p", "text": "Later, Nunk Plaarvin, the manager of the Metellos Exchange, saw through this ruse and ordered Jarael and Dyre to be taken to the Negotiating Room, where they were to be subjected to intensified sunlight intended to burn them to death. As a result of Jarael's revelation, the original buyers of the claims on Italbos were demanding a refund ahead of the re-auction the next day. Plaarvin would have to announce that Jarael's claim was correct and that Italbos was rich with minerals in order to make a profit from the re-auction. If the proceedings went as planned, the Chevin would be able to pay the Raff Syndicate's required cut."}, {"tag": "p", "text": "Having overheard Plaarvin order Jarael and Dyre, Hierogryph and his Jedi cohort, Zayne Carrick, brought the Trandoshan Slyssk, a former member of the Raff Syndicate and the final member of Cargryph Capital, disguised as a Raff captain to confront Plaarvin in order to rescue Dyre and Jarael. Carrick first attacked the Sentinel droids guarding the Chevin to stop them from interfering. Hierogryph criticized Plaarvin, saying that the Chevin had fouled the Raff Syndicate's operation on Metellos 3. Slyssk entered under the guise of the Raff captain and repeated the Snivvian's assertion. Hierogryph reasoned that they knew Plaarvin could be making more money, with his Trandoshan companion interjecting that the Chevin could easily be conned and accusing him of skimming off profits. Employing Plaarvin's fear of angering the Raff Syndicate, the duo tricked the Chevin into going to the recently decimated Jebble, where the Syndicate were supposedly waiting for him."}, {"tag": "p", "text": "Falling for the con, Plaarvin departed, leaving Cipiter in charge of the Metellos Exchange by default. Meanwhile, Jarael and Dyre had already managed to free themselves from their shackles with little harm being done, and were reunited with Carrick and Hierogryph. Since Plaarvin was no longer in charge, Carrick revealed to the traders that the claims they had made about Italbos were false. However, the Metellos Exchange still insisted on buying the rights from Cargryph Capital."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Metellos Exchange's first and only appearance has been in the Prophet Motive story-arc of the Knights of the Old Republic comic series. The story arc was written by John Jackson Miller and penciled by Bong Dazo."}, {"tag": "p", "text": "Miller created the Metellos Exchange to show readers places in the Star Wars story that they hadn't seen before. He took inspiration for the concept from real-world economies and his fascinations with the decisions made to choose what to buy and sell. Miller had already devised the storyline for the issues before the financial crisis in late 2008 and found the release of the first issue in the arc around the same time ironically opportune."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}