{"url": "Meteor_Squadron", "categories": ["Category:Canon articles", "Category:New Republic stubs", "Category:Meteor Squadron personnel", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Meteor Squadron"}, {"tag": "p", "text": "Meteor Squadron was a New Republic starfighter squadron that was stationed on the New Republic flagship Lodestar as part of the Barma Battle Group. Their X-wing starfighters were decorated and personalized with brightly colored paintings of rock and ice."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Meteor Squadron was a starfighter squadron comprised of X-wing starfighters, which served the New Republic's starfighter corps. The X-wings were decorated with brightly colored paintings of rock and ice."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mission to Chazwa"}, {"tag": "p", "text": "In 4 ABY, sometime after the Battle of Endor, Meteor Squadron were tasked with a mission to Chazwa. New Republic Intelligence agent, Caern Adan, had to brief the squadron on what to watch for at Chazwa."}, {"tag": "h3", "text": "Skirmish on Argai Minor"}, {"tag": "p", "text": "Sometime later, the New Republic attacked Imperial forces in the Treinhaus Citadel on Argai Minor. Barma Battle Group sent Vanguard Squadron to aid ground forces. They were later joined by Meteor Squadron and Hail Squadron. The fighting on Argai Minor had been brutal and later became a salvage operation. Syndulla brought in Alphabet Squadron to help with patrols, and allow a New Reublic salvage team to collect data from the wreckage. New Republic Intelligence suspected Imperial forces planetside had received logistical support from elsewhere. The enemy had been decimated by orbital bombardment and precision strikes from the fleet. The citadel, a fortress full of gun emplacements, had been wrecked, its kilometers-high eastern wall was destroyed by Imperial sappers, and the battlefield was littered with speeders, troop carriers, walkers and other vehicles, destroyed by Imperial guerrillas. The mission was a success."}, {"tag": "h3", "text": "Cerberon system"}, {"tag": "h4", "text": "Troithe operation"}, {"tag": "p", "text": "Around 5 ABY, General Hera Syndulla's forces took part in a campaign in the Cerberon system, in which Meteor Squadron were deployed and participated in the Troithe operation, alongside Hail and Alphabet Squadron. The squadrons provided aerial support for the ground forces, which stretched on for weeks."}, {"tag": "h4", "text": "Battle above Catadra"}, {"tag": "p", "text": "When the 204th Imperial Fighter Wing initiated their attack on Cerberon, Meteor Squadron was scrambled for the battle above Catadra, alongside the remaining members of Alphabet Squadron, who deferred command to Meteor Leader due to a shortage of starfighters and crew."}, {"tag": "h3", "text": "Nadiri Dockyards"}, {"tag": "p", "text": "Four years after the battle at Fostar Haven, General Hera Syndulla sent Meteor and Hail Squadrons to secure the Nadiri Dockyards after it was attacked by Imperial forces led by Captain Terisa Kerrill."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}