{"url": "Arquitens-class_light_cruiser/Legends", "categories": ["Category:Legends articles", "Category:Arquitens-class light cruisers", "Category:Galactic Republic starship classes", "Category:Light cruiser classes"], "nodes": [{"tag": "h1", "text": "Arquitens-class light cruiser"}, {"tag": "p", "text": "The Arquitens-class light cruiser, known more commonly as the Republic light cruiser or the Jedi light cruiser, was a Galactic Republic ship used by the Republic Navy during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Arquitens-class resembled a smaller version of the Venator-class Star Destroyer, with engines similar to the smaller Consular-class space cruiser. A docking ring was located on each side of the ship and a deep split cleaved the bow into two prongs."}, {"tag": "p", "text": "Atop the main hull was a small T-shaped command tower, with two quad laser turrets flanking it. Two identical emplacements were located on the ventral bow, while four dual-barreled turbolaser batteries were located on the sides of the cruiser. Large slits on either side of these cannons allowed them to be repositioned for frontal, broadside or backwards firing. This function, combined with the dorsal & ventral turrets, granted the ship a good arc of fire."}, {"tag": "p", "text": "All gun emplacements were retracted into the hull during re-entry to prevent the barrels from being damaged by sudden drag force. The bridge/bow turrets descended/ascended into large trap-door hatches, while the flank cannons receded into the bow prongs."}, {"tag": "p", "text": "The ship also had two pairs of missile tubes on the edges between its turbolaser cannons."}, {"tag": "p", "text": "Like the refitted Consular-class cruisers, ships of this kind were regarded as \"escort-class\" by the Confederacy of Independent Systems, contrasting the Venator-class which was identified as \"cruiser-class.\""}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Arquitens-class light cruiser was often used as an escort for larger ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jedi General Obi-Wan Kenobi commanded one of these ships during the Battle of Saleucami, during which it was used to attract General Grievous as a distraction for the boarding party. The ship was destroyed during the battle, along with two clone pilots who were trying to pull away from the Separatist cruiser that had docked onto it."}, {"tag": "p", "text": "Several Arquitens-class light cruisers formed part of the fleet that protected Kamino when it was attacked by General Grievous and Asajj Ventress. Arquitens-class ships were also part of the fleet that engaged Ventress's fleet in the Sullust system later on."}, {"tag": "p", "text": "Following a distress call from the Togruta colonists of the planet Kiros, Master Yoda deployed a group containing Arquitens-class light cruisers and a Venator-class Star Destroyer to investigate."}, {"tag": "p", "text": "An Arquitens-class fought in the Battle of Ringo Vinda late in the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Arquitens-class light cruiser first appeared in \"Grievous Intrigue,\" though it did not receive a specific starship class until the publication of Star Wars: The Clone Wars Official Episode Guide Series 1 & 2. Star Wars: The Clone Wars Comic UK 6.10's section on \"Grievous Intrigue\" incorrectly stated that Kenobi dueled General Grievous aboard the latter's flagship instead of Kenobi's light cruiser."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}