{"url": "Arr-Nine-Nineteen", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Droids of unspecified degree", "Category:Hutt Clan individuals", "Category:Masculine programming", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Arr-Nine-Nineteen"}, {"tag": "p", "text": "Arr-Nine-Nineteen was a droid who claimed to be a Jedi hunter, but was a Hutt Clan spy in reality. During the Imperial Era, he was one of several individuals hired by the Hidden Hand crime syndicate's leader, Gwi, as part of a team tasked with hunting down the Sith Lord Darth Vader. When the cyborg bounty hunter Beilert Valance was introduced to the team, he destroyed Arr-Nine-Nineteen, and the droid's true purpose was revealed to the rest of the team."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point prior to the Battle of Hoth in 3 ABY, Arr-Nine-Nineteen was built with a spying device inside his body and tasked by the Hutt Clan to conduct espionage on the Hidden Hand criminal syndicate. He eventually forged the reputation of a Jedi hunter and was hired by the Hidden Hand's leader, Gwi, to join a team of bounty hunters created to hunt down and kill the Sith Lord Darth Vader."}, {"tag": "p", "text": "When recruiting the cyborg Beilert Valance, Gwi described the droid as a \"Jedi hunter who never retired.\" Upon seeing Valance, Arr-Nine-Nineteen was burned by the cyborg's palm blaster. Gwi claimed that the team needed the droid, but Valance revealed that the droid was a mole for the Hutts, stating that Arr-Nine-Nineteen's career as a Jedi killer was falsified before removing the spying device from inside his body and crushing it. Valance and his team then began their mission despite Arr-Nine-Nineteen's destruction."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Arr-Nine-Nineteen was a masculine-programmed droid with four arms and plating colored in blue, white, brown, and red, with red photoreceptors."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Arr-Nine-Nineteen wore a red cape and several equipment pouches around his torso. He was able to utilize multiple blasters simultaneously. Within his body, he carried a device that was used to spy on the Hidden Hand."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arr-Nine-Nineteen appeared in the first issue of the 2019 comic-book series Star Wars: Target Vader, written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and published by Marvel Comics on July 3, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}