{"url": "Mexeluine/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Anoat sector planets", "Category:Corellian Trade Spine", "Category:Galactic Republic planets"], "nodes": [{"tag": "h1", "text": "Mexeluine"}, {"tag": "p", "text": "Mexeluine was a thriving trade world lying along the Corellian Trade Spine in the Anoat sector of the Outer Rim Territories. Originally settled during the Galactic Republic's efforts to harvest the economic potential of the Greater Javin region centuries before the Galactic Civil War, Mexeluine grew wealthy as a result of Figg & Associates' commercial development of the region. Mexeluine successfully positioned itself as a cheaper alternative to neighboring Gerrenthum, the region's commercial capital."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Mexeluine, the namesake of the Mexeluine system, was located in the Anoat sector, within the Greater Javin region of the Outer Rim Territories' Western Reaches. Mexeluine lay along the Corellian Trade Spine hyperlane, just Coreward of the megaworld Gerrenthum and positioned between the sprawling Twin Nebulae gas clouds."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A millennium prior to the events of the Galactic Civil War, Mexeluine sat in a largely uncharted region of space beyond the Mid Rim that was then considered a part of Wild Space. In an era before the Corellian Trade Spine extended past the edge of the Mid Rim, only scouts and the most daring traders braved this imperfectly surveyed galactic frontier. The presence of the vast Twin Nebulae proved the chief impediment to navigation efforts through the region, stymieing countless hyperspace explorers who dreamed of opening the Trade Spine to greater commercial opportunities."}, {"tag": "p", "text": "Fortunes began to change following the conclusion of a brief, one-sided war between the Galactic Republic and the region's native Mugaari, which left the Republic free to colonize a number of planets along the Trade Spine in the newly established Javin sector, much of which was later reorganized as the Anoat sector circa 400 BBY. Staging from these newly settled worlds, including Mexeluine and neighboring Gerrenthum, Republic traders continued to search for a hyperspace shortcut through the Twin Nebulae, but it would be centuries before entrepreneur Ecclessis Figg succeeded where his predecessors had failed."}, {"tag": "p", "text": "Figg's new hyperspace routes turned the Twin Nebulae region into an economic powerhouse. Gerrenthum, in turn, reaped the benefits of its fortuitous position at the junction of three lucrative trade routes, developing into the region's commercial capital as the headquarters of various Figg corporations. Left to compete with its bustling neighbor, Mexeluine grew into a wealthy and thriving trade world from the money that Figg & Associates infused into the sector, by successfully offering cheaper starport rates than Gerrenthum."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Mexeluine was the homeworld of Human male Gir Endac, a member of Baron Administrator Lando Calrissian's Bespin Wing Guard during the Galactic Civil War. Endac helped fight corruption within the Cloud City Miner's Guild."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mexeluine was created for \"Galactic Gazetteer: Hoth and the Greater Javin,\" a 2004 online supplement for Wizards of the Coast's Star Wars Roleplaying Game. Subsequent sources, including The Essential Atlas (2009) and the \"Rogues Gallery\" department from Star Wars Insider 148 (2014), further developed Mexeluine's lore."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}