{"url": "Meysen_Kayson", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Alliance to Restore the Republic members", "Category:Business owners and executives", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Meysen Kayson"}, {"tag": "p", "text": "Meysen Kayson was an entrepreneur, founder and owner of Greel Wood Logging Corporation, which harvested greel wood from Pii III and Pii IV. Kayson was also a supporter of the Rebel Alliance. He also owned several properties on Ord Mantell, Kemal Station, Cloud City, Cranan 12, and the Austan Asteroid Cluster. In addition to his ventures into greel wood harvesting, he also owned Galactic Recreational Equipment Industries and seven other companies all under the umbrella of MK Enterprises. He also owned a percentage of the holdings of Kwenn Space Station."}, {"tag": "p", "text": "Kayson avoided the Imperials during the rise of the Empire, after vehemently opposing Palpatine's ascension to Emperor. After paying numerous fines and issuing a public apology, he was allowed to continue with his normal business interests. Kayson was friends with Xenon Nnaksta and hired him to work at his company. Kayson also conferred with Nnaksta about the Rebel Alliance and probably convinced him to join their cause. Kayson also befriended Kassar Kosciusko, after the latter saved Kayson's life on Pernam Minor."}, {"tag": "p", "text": "Decades before the Battle of Yavin, Kayson was visiting the Mos Eisley Spaceport at Tatooine, coming across an orphaned alien child of unknown species. Taking pity on the hungry infant, he took the unnamed child into his care and raised him as his own, giving him all of the necessary business skills in addition to weapons usage and gun-running. The child matured, taking Kayson's name as his own, and founded Kayson's Weapons Shop, which was occasionally run by Meysen Kayson himself when required."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}