{"url": "Mezgraf", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Character stubs", "Category:Males", "Category:Slaves", "Category:Smugglers", "Category:Togorians"], "nodes": [{"tag": "h1", "text": "Mezgraf"}, {"tag": "p", "text": "Mezgraf was a white-furred Togorian, and a member of the crew of the Uhumele. Prior to joining the crew, he was a slave on Orvax IV. A much-scarred slaver's mark was still visible through the fur on his right shoulder and Mezgraf often wore a long-sleeved jacket to cover it."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Once a former slave, Mezgraf eventually joined the crew of the Uhumele. He soon encountered Dass Jennir and Bomo Greenbark after he attempted to sneak onboard the ship. After he heard of their mission to free Bomo's wife and daughter he vowed to assist because he stated he couldn't ignore the troubles of other slaves. He told Dass Jennir and Bomo Greenbark of the misery to be found on Orvax IV, where they figured they had been taken, and this took them to Orvax IV where Mezgraf was identified by a beast keeper because he had seen a faded branded mark on his shoulder after Mezgraf used his jacket to calm the beast keeper's beast."}, {"tag": "p", "text": "After Bomo had almost gotten them caught by attempting to run off, Mezgraf was forced to cover Bomo's mouth and carry him back to the Uhumele where They waited for Dass Jennir to return with the location that Resa Greenbark's buyer resided at. Dass Jennir returned moments before the would have left without him to reveal Resa's buyer was Dezono Qua, who resided on Esseles. They rushed there to find they were mere hours late to save Resa from being eaten by Dezono Qua. After Bomo revealed Dass Jennir was a Jedi in his rants of anger for Dass Jennir not letting him kill Dezono himself, the crew of the Uhumele left with Bomo Greenbark. Mezgraf expressed interest in taking Dass Jennir with them to the Uhumele's captain, Schurk-Heren, while leaving Esseles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}