{"url": "Miaria_Prrt", "categories": ["Category:Legends articles", "Category:Felacatians", "Category:Females", "Category:Galactic Republic individuals", "Category:Queens"], "nodes": [{"tag": "h1", "text": "Miaria Prrt"}, {"tag": "p", "text": "Miaria Prrt was the female Felacatian Princess of Felacat and became Queen during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Traveling with Villie"}, {"tag": "p", "text": "The female Felacatian Princess of Felacat, Miaria Prrt was next in line to the throne of the planet of Felacat. Circa 32 BBY, Prrt was kidnapped in deep space, but when the ship jumped to hyperspace, the stress of the jump forced Prrt into changing into the Felacatian's secondary form and she killed the entire crew."}, {"tag": "p", "text": "The ship then arrived on the planet of Tatooine, where Prrt located a smuggler named Vilmarh Grahrk and hired him to return her to her homeworld. Prrt was forthcoming with Grahrk and warned him that any severe stress—such as a prolonged hyperspace jump—would force her to change, and the trip would therefore be slow-going. Grahrk readily agreed, and after settling a debt with a local junk dealer named Watto, who provided the Devaronian with three pit droids, the pair made their way offworld in Grahrk's ship, the Inferno."}, {"tag": "p", "text": "After being in hyperspace for some time, Prrt began to suffer from headaches that prefaced the change. Grahrk attempted to revert to realspace, but found he was unable to. Unknown to Grahrk, the pit droids had faulty programming, and sought to constantly \"fix\" anything they could find, and had disabled the ship's hyperdrive brakes. While he went to investigate the cause of their problem, Prrt began to change."}, {"tag": "p", "text": "Though he found the droids disassembling the navigation computer, the uncontrollable Prrt confronted and attacked him. Grahrk escaped into a nearby crawl chute, but was informed by the ship's AI, NT 600, that the droids were now beginning to break down the vessel's core processor, which would leave them dead in space. Grahrk managed to shut down the droids while evading Prrt, and finally trapped the princess inside an escape pod until they arrived on Felacat."}, {"tag": "p", "text": "After landing, Prrt was returned to her people. Grahrk, angry over the trouble and damage she had caused, sought compensation from the planetary leaders. The king and his guards then threatened to transform themselves, saying that Grahrk would be wise not to stress them. Once back aboard his ship, Grahrk began to smile. NT was curious as to how he could be happy, and Grahrk replied that he had left the malfunctioning pit droids planetside, with instructions to \"fix the planet to death\". And that made Vilmarh very happy indeed."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "By the time of the Clone Wars, Prrt had become the Queen of Felacat. Over the last ten years, she had ruled with the ideal of teaching her people to control their animalistic side, and to overcome their involuntary changes under duress. Through her teachings, she succeeded in drastically changing their culture, creating a peaceful and sophisticated society that could be a welcome addition to the Galactic Republic."}, {"tag": "p", "text": "Circa 21 BBY, the Confederacy of Independent Systems, in their war against the Republic, sought to conquer Felacat. With their buildings in ruins, the Royal Felacatian Palace came under siege, and Prrt could do little but watch from above as her soldiers sought to turn back the waves of battle droids thrown against her. For over six weeks, the CIS attacked the Felacatians with droids and Armored Assault Tanks. Queen Prrt requested help from the Galactic Senate time and time again, but they received nothing but platitudes for their efforts."}, {"tag": "p", "text": "With resources stretched thin the galaxy over, the Senate was only able to dispatch the Togruta Padawan, Ahsoka Tano, to assist Prrt and her people. Tano and her astromech droid, R7-A7, navigated her starfighter around the battle and landed on a docking platform atop the palace. Tano was shocked to find the palace in such a state of damage, but when she rushed toward the guards, they ordered her to surrender rather than welcoming her assistance."}, {"tag": "p", "text": "Tano was taken to Prrt, who stood upon a high balcony, watching the battle in despair. The guards offered to execute Tano, but Prrt derided their intelligence, noting that she was clearly a Jedi. Tano told Prrt that she was there to evacuate the queen from the planet, but Prrt was disgusted by the idea, and told Tano that she should leave instead. She told the Padawan how their pleas had fallen on deaf ears, and now that they had managed to hold off the invaders for nearly a month, they had no need of Tano anymore. At that moment, however, the Separatist's B2 super battle droids breached the main gateway of the palace, sending Prrt's soldiers fleeing in fear."}, {"tag": "p", "text": "Prrt declared that it was time for her to do her part, and while Tano believed this meant she would retreat as well, Prrt instead began to transform into her more aggressive form. Completing the changes, Tano questioned how she was able to transform at will, but Prrt charged into battle instead, with the Padawan trying to keep up. Prrt smashed into the attacking droids, breaking them apart with her claws. Her own soldiers were shocked to see her in her different form, and when Tano asked the queen why she was the only one to do so, she told Tano of how she'd trained her species to subdue the beast within themselves. While tearing apart a tank, she told Tano that she had been wrong to trust the Republic when all she had done was weakened her people in the end. Tano sought to convince the queen that the Republic was still worth fighting for, and that they would never ask a peaceful people to change, but Prrt believed that with her palace fallen and her soldiers in retreat, the end for her civilization was at hand."}, {"tag": "p", "text": "As the pair felled a large pillar together, Prrt with her claws and Tano with her lightsabers, the queen's guards halted their retreat and watched the ferocity that both women fought with. Prrt told Tano that she had been left alone by the Republic she believed in, but Tano in turn pointed out that she was not alone—she was fighting alongside Prrt. The pillar collapsed, crushing many droids beneath its weight, and Prrt realized that Tano was right. She apologized to the Padawan, but said that they would die together despite her misjudgement. Suddenly, the rest of the Felacatians transformed as well, inspired by the sight of their queen's bravery. They charged into the front lines, cutting apart the Separatist forces. The droids attempted to retreat, but the Felacatians gave pursuit and destroyed them. Later, atop the pillar they'd knocked down, Prrt stood swathed only in the flag of her people and spoke with Tano. Prrt thanked Tano for her help and told her that she would once more resume talks of alliance with the Republic, but that she had to find something besides the flag to wear first."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}