{"url": "Mich_Matt", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic members", "Category:Ishi Tib", "Category:Males", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Mich Matt"}, {"tag": "p", "text": "Mich Matt was an Ishi Tib male who worked as a technician on the planet Coruscant's central power generator. He was approached by the Galactic Empire, who attempted to hire him away from his job. When Matt refused, as he did not want to leave his family, the Empire took him anyway, to work on a secret project. Sometime later, Matt was held as a prisoner aboard Freighter 2716, along with his fellow technicians, before being rescued by Sabine Wren, Ezra Bridger, Saw Gerrera and Chopper. After he and his fellow prisoners were rescued by the rebels, they decided to join the Rebel Alliance, as they felt that if the Empire had wanted to use their skills so badly that it would take them prisoner, it would be worth joining the rebellion instead."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Imperial Era, Mich Matt worked as a technician at Coruscant's central power generator, which he used to support his family. Around 1 BBY, he was approached by the Galactic Empire, who tried to entice him to work for a secret project. Unwilling to leave his family, Matt refused. The Empire then kidnapped him and shipped him on Freighter 2716 with several other power and reactor technicians of various species. Matt and his fellow prisoners were held in the restricted hold 17, which was guarded by stormtroopers. The freighter was also carrying a large kyber crystal."}, {"tag": "p", "text": "En route to the Tonnis sector, the Partisan leader Saw Gerrera and the Spectres Sabine Wren, Ezra Bridger, and Chopper infiltrated the freighter and rescued Matt and his fellow prisoners. Matt informed his liberators that he had overheard the stormtroopers talking about the Jedha system. At the urging of Ezra and Sabine, Saw agreed to let Chopper lead the prisoners to the escape pods. However, the death trooper commander DT-F16 alerted the freighter's captain, Wells to the rebel presence. In response, Wells jettisoned the escape pods, preventing the technicians from escaping."}, {"tag": "p", "text": "After Saw destabilized the kyber crystal in the engine room, Chopper managed to lead Matt and the other technicians to an Imperial shuttle in hold 12. After Chopper took out the two stormtrooper sentries, Matt and the others boarded the shuttle. Before DT-F16 and her remaining troopers could stop them, Ezra and Sabine arrived and fought them off. The group then escaped aboard the shuttle before the kyber crystal exploded and destroyed both Freighter 2716 and Captain Slavin's Star Destroyer. After being rescued by the Spectres' leader Hera Syndulla, Matt informed her on behalf of the technicians that they would be joining the Alliance to Restore the Republic out of gratitude to their rescuers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mich Matt was a male Ishi Tib with yellow eyes and green skin. Matt was a technician by trade and worked at Coruscant's central power generator. Matt cared for his family and refused an Imperial offer to work for a secret project. Following his kidnapping by the Empire and subsequent liberation by the rebels, Matt and his fellow prisoners joined the Rebel Alliance out of gratitude to their liberators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mich Matt was voiced by David Shaughnessy, who also voiced Cumberlayne Aresko and Myles Grint in Star Wars Rebels. His name is a reference to Matt Michnovetz, who wrote episodes for both Star Wars: The Clone Wars and Star Wars Rebels. His work also includes \"In the Name of the Rebellion,\" the only episode with Mich Matt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}