{"url": "Michelle_Taylor", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Star Wars production staff", "Category:Star Wars: Episode I The Phantom Menace actors"], "nodes": [{"tag": "h1", "text": "Michelle Taylor"}, {"tag": "p", "text": "Michelle Taylor is a make-up artist and special effect designer and worked on Star Wars: Episode I The Phantom Menace. She is not to be confused with an actress or a TV-movie director by the same name."}, {"tag": "p", "text": "Taylor began her career on the 1990s, first as an assistant makeup artist with the prosthetics in Kenneth Branagh's Frankenstein (1994), alongside other makeup artist like Mark Coulier."}, {"tag": "p", "text": "She would also be a makeup artist for the movie Judge Dredd, being one of those responsible of a fan-favorite character: Mean Machine."}, {"tag": "p", "text": "On 1997, she was quite busy working as a make and prosthetic artist in different movies, including disturbing Snow White: A Tale of Terror and action sequel Mortal Kombat: Annihilation, where she was the main responsible of the makeup crew (notice that this movie marked the first appearance of creatures like Baraka). She also worked in blockbuster The Fifth Element as the main responsible under department head Lois Burwell but, due to unknown reasons, her name did not appear in the ending credits."}, {"tag": "p", "text": "On 1998, she only worked on TV movie Getting Hurt."}, {"tag": "p", "text": "1999 marked her first and, up to today, only collaboration with Star Wars. She was one of the main designers for animatronic models, alongside with old acquaintance Coulier, and she played a little role during the \"Jedi Temple\" and \"parade\" scenes: She was the long-necked Jedi Master Yarael Poof."}, {"tag": "p", "text": "On the same year, she was again a main animatronic model designer, again with Coulier, for blockbuster The Mummy."}, {"tag": "p", "text": "On 2000, Taylor left science-fiction to work in historical adventure movies like In the Beginning and particularly Gladiator, as a prosthetic floor supervisor."}, {"tag": "p", "text": "Her career became even more successful in the 2000s. She began with Tom Hanks' mini-series Band of Brothers as a makeup artist, and as a second unit makeup artist for both the first and the second movies in the Harry Potter series (Harry Potter and the Sorcerer's Stone and Harry Potter and the Chamber of Secrets, respectively)."}, {"tag": "p", "text": "She also became the head make-up artist for the second installment of Blade. This work was nominated for both the Academy of Science Fiction, Fantasy & Horror Films Award and the Saturn Award."}, {"tag": "p", "text": "She probably liked working with comic-book characters, as she then became the hair and makeup designer for adaptation of Alan Moore's comic-book The League of Extraordinary Gentlemen."}, {"tag": "p", "text": "More recently, she worked again in a movie starring Natalie Portman: Closer. In this romance, she was the hair stylist of superstar Jude Law."}, {"tag": "h2", "text": "External links"}]}