{"url": "Mickey_Mouse", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Non-canon Legends articles", "Category:Crossover characters", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Mickey Mouse"}, {"tag": "p", "text": "Mickey Mouse, also known as Jedi Mickey, was a pint-sized male Jedi Master who belonged to a species of sapient mice. On occasion, he fought alongside the equally diminutive Yoda, the Grand Master of the Order. During the Clone Wars, he assisted the Galactic Republic in its fight against the Confederacy of Independent Systems, with the help of his customized Jedi interceptor and his droid partner R2-MK. Following the end of the war, Mickey Mouse escaped the Great Jedi Purge and became an adversary of the newly-formed Galactic Empire. During his career, Mouse would never part with his signature white gloves, and he would customize most of his possessions with his personal crest, a stylized version of his head."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mickey Mouse, a male mouse, was born on the planet of Hyperion during the twilight years of the Galactic Republic, a government that ruled over most of the galaxy. He was Force-sensitive, meaning that he could sense and manipulate the Force, an ubiquitous and binding power that suffused the whole Known Universe. Mouse ended up joining the Jedi Order, an ancient society of warriors who maintained peace in the Galactic Republic thanks to their wisdom and special powers. With the Order, he was taught to wield the Force, and to fight with a lightsaber, a formal melee weapon that emitted a blade of pure plasma. Mouse raised in the ranks until becoming a Jedi Master, the highest formal title obtainable by a member of the Order."}, {"tag": "p", "text": "During his career, he often joined forces with other Jedi Knights in their battles to fight the dark forces in the galaxy wherever they were found. On at least one occasion, Mouse even teamed up with Yoda, the Grand Master of the Jedi Order himself. Mouse greatly benefited from his superior's erudition and understanding nature. Together, the diminutive masters proved that no warrior should be judged by their size, and that defeatism could be conquered. In the fifth month of 22 BBY, an alliance of seceding star systems known as the Confederacy of Independent Systems declared war against the Republic. During the resulting conflict, known as the Clone Wars, the Jedi were heavily called on to lead the Republic's newly formed Grand Army, and Mouse was no exception. Mouse was granted his own Eta-2 Actis-class interceptor, in which he flew with his astromech droid partner, R2-MK."}, {"tag": "p", "text": "After the end of the Clone Wars in 19 BBY, the Supreme Chancellor of the Republic Palpatine established a new regime called the Galactic Empire and undertook to eliminate those Jedi who had not perished during the conflict. Mickey Mouse, however, survived the purge of the self-anointed Galactic Emperor, and he decided to resist the oppression of Palpatine's Galactic Empire, using his customized interceptor to shoot down entire squadrons of Imperial TIE/LN starfighters. During the Dark Times that followed the birth of the Empire, Mouse experienced many adventures throughout the galaxy with R2-MK. At some point during the early stages of the Galactic Civil War, Mickey alongside R2-MK, joined the Alliance to Restore the Republic to resist the rule of the Empire. One of his missions involved getting into a dogfight with various Imperials. He accompanied Bree Starlighter, along with the droids C-3PO and R2-D2, at the unveiling of Star Tours' first hub in the Earth system."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mickey Mouse was a diminutive individual, measuring only 0.66 meters. He was in fact the same height as Grand Master Yoda, who would later teach to his last pupil that \"size matters not.\" Mouse had black hair and large eyes of the same color. When ready for combat, he would sport a wide grin and a determined frown."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "He used to wear the traditional, humble trappings of the Jedi Order. He owned at least two outfits, one of which was made of a yellow tunic with cream-colored outer robes, while the other featured a beige tunic and a brown cloak. Similarly, he was known to have owned pairs of yellow and brown boots, and he used to wear a pair of white gloves at all time."}, {"tag": "p", "text": "The Jedi Master would customize some of his possessions with his personal emblem, which consisted of two little circles put on top of a bigger one—a design that reflected the shape of his head viewed from the front. Notably, the wings of his Jedi interceptor bore that crest, and the droid R2-MK had been given a pair of round ears as a whimsical embellishment."}, {"tag": "p", "text": "Most of all, his lightsaber was very personal. Like the weapon carried by Yoda, it was shorter than a normal lightsaber to match its bearer's small stature, with its hilt measuring at only 14.00 centimeters and its blade around a half-meter. Its silver and black cylindrical hilt bore unique markings that harkened back to Mouse's personality. The top of the hilt featured three lines pointing toward the blade, which were reminiscent of the markings on Mouse's signature gloves. The activation stud was shaped like the trefoil emblem of Mouse, which itself reflected the shape of his head. Below that ignite button was also a frieze of such trefoils that went around the hilt of the lightsaber. Finally, the pommel was ornated with Mouse's initial in High Galactic alphabet. When activated, the weapon emitted a blue energy blade, the traditional Jedi lightsaber color."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Mouse, being a Jedi Master, showed exceptional skills and devotion to the Force, as well as great talent in lightsaber combat. In spite of his small stature, he was powerful. He was also a capable pilot, as he could fly an Eta-2 Actis-class interceptor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The non-canon character of Jedi Mickey was one of the life-size interactive costumed characters at Star Wars Weekends, an annual Star Wars festival that was hosted at Disney's Hollywood Studios theme park of the Walt Disney World Resort. He was inspired by Mickey Mouse, the seminal cartoon character and mascot of The Walt Disney Company, who made his screen debut on November 18, 1928 as star of the first synchronized sound cartoon, Steamboat Willie. Since December 21, 2012, The Walt Disney Company officially owns Lucasfilm Ltd., the company founded by George Lucas and best known for producing the Star Wars franchise."}, {"tag": "p", "text": "A series of Jedi Mickey-themed toys were designed by a team of Disney Parks product developers led by Brad Schoeneberg. The Hasbro toy company first released a double-character toy package featuring Jedi Mickey and Yoda as part of its Star Wars: Star Tours toy line in 2005. In 2007, Schoeneberg's team created Jedi Mickey's official lightsaber toy. Three years later, Disney Parks added R2-MK, Mickey's astromech droid sidekick, to its attraction, and subsequently released a double-character toy package that included the two characters together. The Jedi Mickey-R2-MK packaging provided specific details regarding Jedi Mickey's inclusion in the Star Wars galaxy. That same year, Star Wars creator George Lucas, posed alongside Jedi Mickey, R2-MK and other characters at Walt Disney World Resort to promote the \"Last Tour To Endor,\" a fan event that celebrated the last year of the original ride Star Tours before its upcoming replacement by Star Tours: The Adventures Continue."}, {"tag": "p", "text": "In addition to the original character of Jedi Mickey, the mascot of the Walt Disney Company has also portrayed Luke Skywalker in various Star Wars/Disney crossover action figures. The series includes other Disney characters assuming Star Wars personæ, such as Minnie Mouse as Princess Leia Organa, Donald Duck as Han Solo, Goofy as C-3PO, and Black Pete as Boba Fett."}, {"tag": "h3", "text": "Development and influence"}, {"tag": "p", "text": "In 2008, a character key of Jedi Mickey was released by Acme Archives Direct, the official licensee for original and fine art for Disney, Star Wars and other franchises. That limited edition character key first mentioned Mouse's homeworld as \"Hyperion.\" In real-life, Hyperion is a small moon of the planet Saturn and the Burbank street where the Walt Disney Studios were located in the 20s and 30s when Mickey was first created. The character key also gave Jedi Mickey's size as 1.35 meters, but that information contradicts the appearance of the Hasbro toys. Additionally, he was explicitely described as small on the back of the \"Jedi Mickey & Yoda\" pack."}, {"tag": "p", "text": "On April 1, 2012, the news website Live Geek or Die announced that Jedi Mickey would be a playable character in the upcoming action role-playing video game Diablo III published by Blizzard Entertainment. The article stated that Jedi Mickey would have upgradable force powers and the ability to summon his pet dog Pluto to assist him in a fight. However, this was later revealed to be a practical joke for April Fool's Day."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "While Hasbro's toy releases are generally included in canon, Holocron continuity database administrator Leland Chee, on May 24, 2012, confirmed via Twitter that Jedi Mickey and related toys are currently non-canon in the Holocron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}