{"url": "Arrests_on_Zeitooine", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Events during the Imperial Era"], "nodes": [{"tag": "h1", "text": "Arrests on Zeitooine"}, {"tag": "p", "text": "Seven months after the Battle of Yavin, Imperial stormtroopers on Zeitooine arrested a local family after the parents persistently violated a ban on independent publications. The stormtroopers forcibly dragged the family out of their home. When the mother pleaded for the stormtrooper captain not to imprison her daughters as well, the captain slammed his blaster rifle into her face while another trooper cuffed her. The incident was witnessed by Thane Kyrell, a disillusioned former TIE fighter pilot who had deserted the Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Zeitooine was a cold, forested planet in the Inner Rim. During the Age of the Empire, an unidentified family circulated independent publications that were proscribed by the Galactic Empire, which ruled the planet. Despite being repeatedly warned by the local Imperial authorities to cease and desist, the husband and wife continued circulating independent publications. The couple had two daughters: a thirteen-year-old and a five-year-old. Seven months after the Battle of Yavin, the Imperial authorities took action against the family and imprisoned them without term."}, {"tag": "h2", "text": "The crackdown"}, {"tag": "p", "text": "At least twelve stormtroopers under the direction of a stormtrooper captain were tasked with arresting the family. While the stormtroopers arrested the family, other stormtroopers stood guard outside the family home to keep neighbors and bystanders from intervening. One stormtrooper was seen dragging out the couple's thirteen-year-old daughter by her long hair, causing her to weep in distress. The girl's mother pleaded with the captain to show some clemency in return for paying their fines or confiscating their house and possessions. However, the captain reiterated that repeated violations of the ban on independent publications were punishable by imprisonment without term."}, {"tag": "p", "text": "A third stormtrooper brought out the couple's five-year-old daughter, who was too petrified to cry for help. The crowd did not intervene due to the presence of the armed stormtroopers. Desperate, the mother continued petitioning the stormtrooper captain and pleaded for some clemency to be shown to her children. Losing patience, the officer slammed his blaster rifle butt into her face, causing her to fall down to the ground weeping. A fourth stormtrooper then handcuffed her. One of the bystanders was Thane Kyrell, a former TIE fighter pilot who had deserted the Empire due to his disillusionment with the destruction of Alderaan and the treatment of Bodach'i slaves on Kerev Doi."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Thane Kyrell was troubled by the incident on Zeitooine and tried to forget it. Later, he joined the Rebel Alliance and entered the fight against the Empire. Their arrest foreshadowed a greater Imperial crackdown on Zeitooine that helped motivate Thane to join the Rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The arrests on Zeitooine first appeared in Claudia Gray's 2015 Star Wars debut novel, Lost Stars. It is told from the point of view of Thane Kyrell, one of the novel's two main protagonists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}