{"url": "Middle_City", "categories": ["Category:Legends articles", "Category:Cities", "Category:Galactic Republic cities", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "Middle City"}, {"tag": "p", "text": "The Middle City was a level of the Tarisian world-city, between the Upper City and the Lower City. It was constructed a couple of centuries before the planet had become a major hub. Many small business owners lived here, and most average people came to the Middle City to conduct business. Swoops and air speeders traversed through the air-traffic ways that cut through the many avenues of the Middle City towers."}, {"tag": "p", "text": "The Middle City was also the largest area, since a large portion of buildings were included in the jurisdiction of the \"middle area\". It was the fourth city to be built by the Taris Civil Authority which was above the Lower City, Undercity and the Promised Land and eventually the Upper City was built above the Middle City. The most populous level of the planet, home to the lower and middle classes of the Human population since the Tarisian Civil War, though some Aliens did remain and were more there than those of the Upper City."}, {"tag": "p", "text": "In 3964 BBY, following Zayne Carrick's second escape from the Jedi Tower, the Middle City was wracked by large-scale rioting. During the Taris Siege, the Middle City was heavily bombarded by Mandalorian Kandosii-type dreadnaughts."}, {"tag": "p", "text": "Although not entirely devoid of crime, the Middle City was more notably peaceful than the other levels of Taris, though not to the extent of the Upper City."}, {"tag": "p", "text": "The Sith presumably had patrols in the Middle City during their occupation, as well as presumably also being plagued by Exchange thugs. It is likely that most of the Middle City citizens perished in Taris's destruction."}, {"tag": "p", "text": "By 3 ABY the Middle City had been rebuilt by Human colonists, but never again had it become a place where only the middle and lower class Humans were allowed to live."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}