{"url": "Midi-chlorian_manipulation", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Alter powers", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Midi-chlorian manipulation"}, {"tag": "p", "text": "Midi-chlorian manipulation was a form of Sith alchemy mastered by Darth Plagueis. Requiring immense knowledge of the dark side of the Force, it was the ability to create, maintain, or save life through the influencing of midi-chlorians to a certain degree. Palpatine told Anakin Skywalker that Plagueis used this power to save the ones he loved from dying. Indeed, Plagueis was able to use this ability to make creatures give birth without a second partner, referred to by his droid servant 11-4D as the Magister's \"pregnancies\". Plagueis was able to kill the comatose Darth Venamis and then bring him back to life several times, before the Bith's organs failed, and Plagueis granted him everlasting death. In addition, he turned this power on himself, in order to heal his many injuries afforded to him by the Maladian assassins who almost killed him in 52 BBY, and was confident that he would stop aging at all with this power. However, despite all this, Plagueis was still unable to keep himself from dying at the hands of his apprentice."}, {"tag": "p", "text": "Darth Plagueis stated that a child born of this power would be the embodiment of the Force. The Muun tried to impose his will on the Force into creating a Forceful being, but considered this a failure, as Anakin Skywalker was created by the Force itself to bring an end to the Sith once and for all. Later, Palpatine used the promise of this power's effects to entice Anakin Skywalker further to the dark side. He had also made the same proposition to Ferus Olin, telling him that he would teach him powers to defeat Darth Vader and the power over life and death. Palpatine himself also possessed this power to a limited degree, having participated with Darth Plagueis in the aforementioned experiment that ultimately resulted in Anakin's conception. However, he was unable to fully master the ability prior to slaying Plagueis, forcing him to utilize Transfer essence regarding clones to cheat death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Midi-chlorian Manipulation can be dated back to the rough draft of Revenge of the Sith. In the draft, Palpatine seduces Anakin Skywalker to the Dark side, revealing Anakin's \"mysterious birth\" in the process."}, {"tag": "p", "text": "This ability bears resemblance to the real-world alchemic concoction called the elixir of life, which was said to grant the drinker eternal life and/or eternal youth, and create new life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}