{"url": "Mierme_Unill", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Mierme Unill"}, {"tag": "p", "text": "Mierme Unill was a female Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive female, Mierme Unill was educated in the ways of the Force by the Jedi Order, attaining the rank of Jedi Knight. Dispatched to the planet of Mon Gazza as a Knight, Unill was tasked with investigating the murder of two Mon Gazzan ore traders. Upon further investigation, Unill discovered that a young Initiate named Zett Jukassa at the Coruscant Jedi Temple was having visions of the crime scene. Upon reviewing the boy's records, Unill discovered that the young Jukassa was indeed the son of the ore traders."}, {"tag": "p", "text": "Seeing potential in the boy's visions, Unill petitioned the Jedi High Council to allow him to reveal the murder of his parents to Jukassa. Receiving approval from the Council, Unill told Jukassa all that she had learned, and with the Initiate's visions becoming clearer, Unill was able to trace the murders back to the criminal organization known as Black Sun. Making several arrests, Unill was able to successfully close the case. Having been impressed with Jukassa's calm demeanor and detachment as he learned of his parents' deaths and aided in the investigation, Unill selected the child as her Padawan, training him in the ways of the Force as they traveled the galaxy."}, {"tag": "p", "text": "When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Master Unill took up the rank of General in the newly formed Grand Army of the Republic. During the war, Unill was slain, and Jukassa was left orphaned, permanently assigned to the Coruscant Jedi Temple where Temple battlemaster Cin Drallig took over his training. Jukassa himself would later fall in battle at the end of the war, gunned down by Sergeant Fox during Operation: Knightfall."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}