{"url": "Mighella", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Assassins", "Category:Black Sun members", "Category:Guards", "Category:Nightsisters"], "nodes": [{"tag": "h1", "text": "Mighella"}, {"tag": "p", "text": "Mighella was a Human female Nightsister from the planet Dathomir. She served as the personal bodyguard and enforcer of crime lord Alexi Garyn, leader of the infamous Black Sun criminal syndicate. Mighella executed the will of Lord Garyn unquestioningly, with her sword and the power of the dark side of the Force. In 33 BBY, Mighella's service to Alexi Garyn came to an end when a mysterious Force-wielding assassin known only as \"Maul\" eliminated each Vigo of the Black Sun and their minions."}, {"tag": "p", "text": "When the assassin arrived on Garyn's homeworld of Ralltiir, Mighella sensed him as a disturbance in the Force and urged her Lord to make haste his exit lest he also fall victim to Maul's wrath. Her master did as advised while Mighella confronted the assassin in the depths of Garyn's fortress, where she engaged Maul in combat to buy time for Garyn to escape. She held her fellow darksider and Nightbrother at bay for a short while before she was eventually overcome by his superior battle prowess. Mighella was killed when her opponent sliced her in two with his double-bladed lightsaber, mere moments after she recognized Maul for what he truly was: a Sith Lord."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Mighella was a Human female native to the planet Dathomir. She was also Force-sensitive, but chose to embrace the power of its dark side. In doing so, Mighella became a Nightsister, a clan of Dathomiri women who were considered evil by their light side–wielding counterparts. Over time, Mighella became extremely proficient as a warrior and in her command of the dark side, so much so that her skill caught the attention of crime lord Alexi Garyn, leader of the notorious Black Sun criminal empire. She was offered an opportunity by Garyn—who was impressed with her talents—to leave Dathomir and serve as both his personal bodyguard and assassin, an offer which she accepted. Mighella then accompanied Garyn to his homeworld of Ralltiir, where she was most often seen by his side. In her service to him, Mighella wielded a sword that could withstand contact with a lightsaber, albeit for a limited amount of time. Her presence also struck fear in the hearts of her master's subordinates, and she would cut them down without a moment's hesitation should he so order."}, {"tag": "h3", "text": "Disturbance in the Force"}, {"tag": "p", "text": "Around 33 BBY, Black Sun came under attack from a mysterious assassin. Two of the organization's Vigos perished before news of the massacre reached Mighella's master; when Garyn did learn of their deaths at the hands of a man known only as \"Maul,\" Mighella predicted that they would not be the last and that each of Black Sun's nine underlords would fall victim to the same fate. In light of this, Garyn summoned the remaining Vigos to his stronghold on Ralltiir, where he hoped to devise a plan of attack against the assailant. However, terror and suspicion had arisen amongst the Vigos to such a degree that the meeting quickly degenerated into panic and accusations of treachery from one to the next. To quell the infighting, Lord Garyn threatened to call upon Mighella and have her end the quarrel with deadly force. Her sword drawn, Mighella stood silently near her master, prepared to enforce his will should anyone present decide to disobey Garyn's call for order. As the surviving members of Black Sun calmed themselves and began to appraise the situation, they decided to hold fast within Garyn's home and wait for the assassin to come to them, believing that their strength in numbers would provide ample protection. Though he was certain that Maul would never be able to breach his fortress and endure the finest warriors Black Sun had to offer, Garyn took comfort in knowing that should what he considered the impossible happen, Mighella would be there to defend him."}, {"tag": "p", "text": "When Maul arrived on Ralltiir, Mighella immediately sensed his presence as a disturbance in the Force. Because of this, her master questioned whether or not it was a Jedi who hunted Black Sun, but Mighella affirmed that it was not—even though she was unsure as to exactly what Maul was, since he felt to her like nothing she had ever experienced. Nonetheless, Lord Garyn believed in the abilities of those who guarded his fortress, and was confident that the intruder would not succeed. Mighella, however, assured him that he was wrong and that all of his warriors would die in his defense."}, {"tag": "p", "text": "As Maul made his way further into Garyn's fortress, Mighella followed her master as he prepared to make his escape from Ralltiir before the assassin could overtake him. The bodyguards were unsuccessful in even slowing the intruder's advance, and Mighella advised Garyn that while this Maul was similar in nature to her, he was still something else entirely. Slightly frustrated with her assessment, Garyn ordered his personal aide, Oolth, to prepare his private yacht for immediate departure as the trio entered the lowest level of the Black Sun fortress. Mighella held back when she felt the approach of Maul through the Force, and she ordered her master and his aide to leave without her. She was initially refused by Garyn, who valued Mighella for her own killing abilities and preferred not to lose her needlessly in battle; Mighella refused in turn and demanded that Garyn get away, so that she might deal with the intruder."}, {"tag": "h3", "text": "Confronting a Sith Lord"}, {"tag": "p", "text": "When Maul appeared before her, Mighella barred him from proceeding any further, while inquiring of him if he was familiar with those of her kind. Maul recognized her as a Nightsister of Dathomir, one well seasoned in the application of the Force's dark side. In return, Mighella recognized the tattoos on Maul's body, signifying him as a Nightbrother. However, when he remarked that she was inexperienced in doing battle with one of his kind, Mighella attacked, intent on proving him wrong. They dueled, trading blows with neither being able to penetrate the other's defenses, until Mighella's sword broke in two, no longer able to withstand the energy of Maul's double-bladed lightsaber. The Nightsister had other weapons at her disposal though and subjected her opponent to a barrage of Force lightning, which brought Maul to his knees. Believing that he had been humbled by the power of the dark side, Mighella began to gloat over her seemingly defeated enemy, only to stare at him in disbelief as he began to resist her conjured electricity. It was in that moment when she recognized that Maul was much more than an ordinary assassin; he was in fact, a Lord of the Sith. Mighella's realization lasted mere seconds as Darth Maul recovered and swiftly killed her by slicing her in half at the waist, eliminating the last means of protection for Mighella's master—whom Maul killed shortly thereafter."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mighella was a pale, white-skinned woman with full brown hair and eyes yellowed as a result of prolonged use of the dark side. She bore facial tattoos over her eyes, nose, and cheeks, as well as ones on either side of her lips that gave the impression that she was constantly smiling—even when she was not. She also wore a golden jeweled pendant in the shape of an arrowhead affixed to her forehead."}, {"tag": "p", "text": "Mighella was not often given to speech, but when she was it was usually in response to her master, Alexi Garyn. The fact that Mighella even served a man was unusual, as women of Dathomir regarded males as inferior and subjected them to lives of slavery. Mighella respected her master, however, and fulfilled her role as his bodyguard to his satisfaction; her loyalty was evidenced when she demanded that he save his own life, while she attempted to deal with that which threatened it. She was ultimately unable to perform the task for which the leader of Black Sun brought her from Dathomir, as she was killed in combat by Darth Maul just prior to him killing Lord Garyn."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Mighella was considered one of the more powerful Nightsisters and had a considerable mastery of the dark side of the Force. She displayed talent with precognition, evidenced when she predicted the deaths of all of Black Sun's Vigos. She was also able to sense disturbances through the Force, and was aware of Darth Maul's presence and approach on Ralltiir. Mighella was able to apply the dark side offensively, in the form of Force lightning. Though a powerful attack, her lightning proved to be inadequate against Darth Maul, who eventually overcame it before he killed her."}, {"tag": "p", "text": "She was a highly skilled warrior, who fought with a semi–lightsaber-resistant sword. Her combat prowess was such that it ensnared the attention of the leader of Black Sun, Alexi Garyn, who removed her from Dathomir to serve him as his personal enforcer. In battle, she was more formidable than any of Garyn's other guards and warriors; she was able to contend blow for blow with a Sith Lord, holding him at bay temporarily and even bringing him to his knees under her mastery of the dark side. Her power was ultimately insufficient, however, as Darth Maul's superior command of the dark side allowed him to defeat her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mighella first appeared in the third installment of author Ron Marz's Darth Maul comic series. She next appeared in the fourth and final issue and was drawn by artist Jan Duursema in both. Mighella has only made these two appearances to date, but was featured in a picture of Dathomir's Nightsisters that was included in Jedi vs. Sith: The Essential Guide to the Force, drawn by Chris Trevas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}