{"url": "Miid_ro%27ik", "categories": ["Category:Legends articles", "Category:Miid ro'ik", "Category:Yuuzhan Vong starship classes"], "nodes": [{"tag": "h1", "text": "Miid ro'ik"}, {"tag": "p", "text": "The miid ro'ik warship was a Yuuzhan Vong bio-engineered capital starship and the rough analog to an Imperial-class Star Destroyer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The warship was unique in its ability to recycle other Yuuzhan Vong starships. Whenever a coralskipper, Kor Chokk, or even a worldship began to die, its organic material was fed to the miid ro'ik. The dying matter was converted into fuel for the warship's yaret-kors and other systems. Some of this material was also transformed into viscous secretions that oozed onto the vehicle's hull and hardened into gloss, black armored plates which could withstand blaster fire and collisions.\nThe remainder of the ship was composed of durable yorik coral, with several long coral arms sprouting from the vessel's sides. These red-and-blue arms latched onto coralskippers, transporting the starfighters through space."}, {"tag": "p", "text": "While the warship's coralskipper complement could provide covering fire under attack, the miid ro'ik's main weapons consisted of sixty yaret-kors, arrayed across the hull, and often secreted within deep crags in the yorik coral."}, {"tag": "p", "text": "In addition, the warship's hundreds of dovin basals—which locked onto gravitational fields to pull the vessel through space—could be used to drag enemy vessels closer to the deadly magma cannons, in much the same way as the New Republic employed tractor beams. Dovin basals projected gravitic anomalies that defended the miid ro'ik from incoming fire and provided the vessel with greater speed than other Yuuzhan Vong starships."}, {"tag": "p", "text": "The most terrifying feature of the miid ro'ik was the Qworlth skaal hidden in the belly of the warship. This huge, grotesque creature extended from the vessel to consume enemy starfighters or personnel."}, {"tag": "p", "text": "The Yuuzhan Vong warship carried approximately 3,000 troops and various bio-vehicles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Miid ro'ik warships, commonly referred to as Yuuzhan Vong warships, were deployed by the invasion forces as command ships, blockade vessels and assault starships."}, {"tag": "p", "text": "Miid ro'ik were responsible for securing a perimeter during a space engagement. To prevent enemy ships from escaping, the warship's dovin basals produced a unified gravity well to prevent hyperspace retreats."}, {"tag": "h2", "text": "Known ships"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name of the miid ro'ik is misspelled as \"miit ro'ik\" in Karen Traviss's novella Boba Fett: A Practical Man."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}