{"url": "Mikkian", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Expansion Region species", "Category:Mikkians"], "nodes": [{"tag": "h1", "text": "Mikkian"}, {"tag": "p", "text": "Mikkians were a humanoid species that were native to the planet Mikkia, identifiable by their manes of head-tendrils and their bright skin pigmentation. The twin sisters Tiplar and Tiplee, who fought and died in the Clone Wars as Jedi Masters, were Mikkians. Another member of the species, a female named Sakas, fought with the Alliance to Restore the Republic in the Galactic Civil War."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Mikkians were a species of brightly colored humanoids. Members had four limbs: two legs, and two arms with five-fingered hands, including an opposable thumb. Their heads had two forward-facing eyes, whose irises could be blue."}, {"tag": "p", "text": "However, the Mikkians' most distinctive feature were their motile head-tendrils, the number, form, and pattern varying between individuals. These head-tendrils primarily served as sensory organs, particularly detecting sound as a replacement for an ear common in other species. However, some Mikkians, such as Zeen Mrala, possessed ears in addition to head-tendrils."}, {"tag": "p", "text": "Mikkian head-tendrils also could detect other information, such as humidity, temperature, magnetic direction, and radiation. This radiation detection was sensitive enough that Mikkians could \"see\" light and dark, although their eyes were still their primary visual organs."}, {"tag": "p", "text": "Mikkians' skin ranged in pigmentation from bright yellows and greens to reds with blue highlights and pinks. Coloration varied greatly even among closely related individuals. For example, even twins, such as Tiplee and Tiplar, had vastly different skin pigmentations. Parents and children could also have very different colors."}, {"tag": "p", "text": "Some members of the species were sensitive to the Force."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Mikkians placed kinship and integrity above all. In fact, their honesty could come across as blunt or even rude to other sentients. Conversely, Mikkians often had trouble adjusting to the more flexible views of other races. Their complex code of honor encompassed all things in life, with a particular insistance on matters of warfare. Although they respected warrior traditions, the Mikkians nevertheless valued discipline and honor over victory or physical might."}, {"tag": "p", "text": "Their native language was a melodic, flowing tongue made up of several ancient dialects. Although most Mikkians were proud of their language, they had no qualms about learning Galactic Basic Standard."}, {"tag": "p", "text": "Different religious traditions existed among the Mikkians, but belief in the Force played a central role in all of them. As such, when the Jedi Order were branded as traitors by the Galactic Empire, Mikkians were quick to question the Empire's reasoning."}, {"tag": "p", "text": "In Mikkian society, their head-tendrils had important cultural significance, and as such tendril-reading was used by Mikkian mystics to predict their future. Every facet of the head-tendril contributed to that meaning."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mikkians hailed from the Expansion Region planet Mikkia. A secretive species, much about them remained a mystery to the larger galactic community, however, Mikkia itself had been part of the Galactic Republic for millennia, and still held a seat at its dissolution."}, {"tag": "h2", "text": "Mikkians in the galaxy"}, {"tag": "p", "text": "Millennia before the Galactic Civil War, the Mikkians joined the Galactic Republic. During the High Republic Era, the Mikkian Zeen Mrala and her parents were members of the Elders of the Path, a wandering religious group that disdained the use of the Force. Mrala's Force-sensitivity, which she had spent her entire life attempting to conceal, eventually revealed itself during an Emergence of the Great Hyperspace Disaster at Trymant IV, leading to a rift with her best friend Krix Kamerat."}, {"tag": "p", "text": "In the waning years of the Galactic Republic, the Mikkian twin sisters Tiplee and Tiplar were both part of the Force-wielding Jedi Order. By the time of the Clone Wars, they had attained the rank of Jedi Master and served as Jedi Generals in the Grand Army of the Republic. In that capacity, they led clone troopers in battle against the forces of the Confederacy of Independent Systems. One red-skinned Mikkian was a Jedi during the war and the master to a Padawan. However, both were killed by General Grievous near the Ledeve Jedi Temple."}, {"tag": "p", "text": "During the Battle of Ringo Vinda, Tiplar was killed by one of her soldiers, the clone trooper CT-5385 \"Tup,\" whose inhibitor chip had malfunctioned, forcing him to execute Order 66 prematurely. Later in the war, her sister led an assault on Vizsla Keep 09, where the Sith Lord Maul was hiding. Tiplee was stabbed through the chest during a lightsaber duel with Count Dooku, leader of the Confederacy, who had formed an alliance with Maul."}, {"tag": "p", "text": "Decades later, during the Galactic Civil War, a female Mikkian named Sakas served in the Alliance to Restore the Republic, a resistance movement that fought the autocratic Galactic Empire. As a member of the Rebel Alliance Special Forces, she participated in a raid against an Imperial black site at the Wretch of Tayron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mikkians first appeared in \"The Unknown,\" the first episode of the Star Wars: The Clone Wars television series' sixth season, which first aired in Germany on February 15, 2014. Their design was based on an unused piece of concept art for a female Sith that Iain McCaig created for the film Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "However, the species' name was only revealed in June 2015, on the official website for Kabam's then-upcoming mobile game Star Wars: Uprising. At the time, future players were given the opportunity to vote for either Mirialans or Mikkians to become the game's fourth playable species. The Mikkian icon depicted a female whose mane of tendrils resembled those of Tiplar and Tiplee."}, {"tag": "p", "text": "After Amy Ratcliffe pointed out the resemblance on Twitter, the official Star Wars account confirmed that the Jedi twins were indeed Mikkians, and that a new entry reflecting that fact would soon be added in the official StarWars.com Databank. Once the vote ended on June 30, the Mirialan species won and was added to the game. Nevertheless, a PNG image titled npc_sister_mikkian_portrait could still be found in the game's files."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}