{"url": "Mikoan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles from unlicensed sources", "Category:Colonies species", "Category:Mikoans", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Mikoan"}, {"tag": "p", "text": "The Mikoans were a sentient species native to Miko. They were humanoid, and appeared Human, bar their green skin pigmentation. The Mikoans resisted the Galactic Empire until their homeworld was bombarded by Moff Delurin from aboard the prototype Dragon-class heavy cruiser. That overwhelming show of force compelled them to surrender. However, they were saved when Delurin abandoned the star system to establish his own splinter faction of the Empire, as the \"Warlord of Wild Space.\" The Mikoans were again attacked by Delurin just as they were about to join the New Republic."}, {"tag": "p", "text": "A notable Mikoan was Jade, a mercenary who did some work for the Alliance to Restore the Republic. She played a role in ensuring that the Alliance received intelligence that alerted them to the presence of the Galactic Emperor aboard the Death Star II at the time of the Battle of Endor."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Mikoans were a humanoid sentient species that could easily pass for Human but for their green skin. The Mikoan Jade had green eyes and black hair. Members of the species could grow to 1.8 meters in height."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mikoans were native to the planet Miko of the Sorella system. It was located within the Colonies' Tapani sector, part of the Three Ellas Run hyperlane between the Dorella and Tavya systems. While the Tapani sector was largely dominated by the powerful Tapani Noble Houses, the Mikoan homeworld was part of the Freeworlds Territory, which had a degree of independence from the Noble Houses."}, {"tag": "p", "text": "In 4 ABY, during the Galactic Civil War, the Mikoans refused to submit to the authority of Galactic Emperor Palpatine. In retaliation for their insubordination, Moff Delurin of the Galactic Empire was dispatched to subdue the recalcitrant humanoids. Delurin, who was overseeing the final test run of a prototype capital ship known as the Dragon-class heavy cruiser, took the ship directly to the Sorella system and ordered the crew to open fire on cities on Miko's surface. The Mikoans initially resisted as turbolaser fire and concussion missiles rained on their planet. However, they eventually sued for peace, begging Delurin to cease his assault. Just as he was concluding the bombardment, Delurin received word of the death of the Emperor at the Battle of Endor. Ignoring orders to regroup in the Core Worlds, Delurin left Miko to form his own splinter territory from the Empire, declaring himself the \"Warlord of Wild Space.\""}, {"tag": "p", "text": "Following the departure of Delurin, the Mikoans considered joining the New Republic. As diplomatic negotiations were about to successfully conclude, Delurin returned to the star system with his cruiser, christened the Galaxy Dragon. Psychologically scarred by the previous bombardment, the Mikoans were frozen with indecision at his arrival, leaving the New Republic diplomatic corps and a small group of special-operatives to rally resistance to the Warlord."}, {"tag": "h2", "text": "Mikoans in the galaxy"}, {"tag": "p", "text": "A Mikoan named Jade ventured off her homeworld as a young woman, finding work as a mercenary. She considered herself unaffiliated during the Galactic Civil War, but took paying jobs from the Alliance to Restore the Republic. For one such task, Jade was stationed on Gellefon in the Korness system, where she regularly received information from a faction of Bothan spies known as \"Deep Ear.\" In this capacity, Jade received a high-security transmission with intelligence that the Galactic Emperor, Palpatine, would be aboard the Death Star II in orbit over Endor at the time of the pending Alliance assault on the battle station."}, {"tag": "p", "text": "Jade immediately contacted Alliance High Command and requested immediate evacuation from Gellefon. However, her message was garbled and the Alliance sent only a small team of operatives, believing the mission to be a routine pick-up of intelligence. Just as Jade was making contact with the Rebels, she was met by Borsk Fey'lya, bearing news of the capture and imprisonment of the Deep Ear team on Gellefon. Jade, Fey'lya and the small group of Rebel operatives linked up with a local resistance movement, the Gellefon Freedom Fighters, and succeeded in breaking out the Bothans from their imprisonment. They then fled the planet and delivered their intelligence to the Alliance commanders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mikoans were created by Bill Slavicsek for the roleplaying game article \"The New Republic Campaign: Preparing to Move Beyond the Movies\", published in Polyhedron 86 in 1993. At this time, and up until 2003, the Polyhedron magazine was not a canonical source. In 2003, Polyhedron became officially licensed, and all issues published since this time are canonical. This is not retrospective, however, so the Mikoans remain outside canon. In addition to the Polyhedron article, Slavicsek also included Mikoans in his article \"The Galaxy Dragon and crew,\" published in Dragon Magazine 200 later in 1993. Dragon Magazine is also an unlicensed source. While Slavicsek placed the Mikoan homeworld in a pre-existing canonical star-system from Lords of the Expanse, however, this has no impact on the canonicity of the Mikoans themselves."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}