{"url": "Milak_Sonloam", "categories": ["Category:Legends articles", "Category:Almas residents", "Category:Humans", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Milak Sonloam"}, {"tag": "p", "text": "Milak Sonloam was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic during the time of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Brought into the Jedi Order at an unknown age, Milak Sonloam was trained under the experimental curriculum of the Almas Academy, which allowed older students into its ranks. Eventually passing his Trials of Knighthood put forth by the Almas Council and acknowledged by the Jedi High Council on Coruscant, Sonloam was elevated to the rank of Jedi Knight."}, {"tag": "p", "text": "Well respected by his peers, Sonloam was an expert with a lightsaber and notorious for his fighting courage. When the Clone Wars engulfed the galaxy, the High Council on Coruscant issued an order to the academy's Masters, demanding that all non-essential personnel be sent to the Jedi Temple to receive assignment within the ranks of the Grand Army of the Republic. Outraged by the High Council's decision to engage the Confederacy of Independent Systems in all out war, Sonloam refused the rank of General and remained in the Cularin system, performing missions solely from the Almas Council."}, {"tag": "p", "text": "Giving the Knight a hefty assignment, the Council ordered him to the abandoned fortress of Darth Rivan with a research team of fourteen Jedi. The fortress had been captured by the Jedi but had not been completely explored as the dark side was imbued in the very stones of the structure. The Jedi were not the only ones who wanted to explore the fortress, the dark side cultists known as the Believers wished to possess the ancient knowledge within the structure for their malevolent uses. Accompanied by five of his fellow Knights, Agai'i took to protect the structure from imminent attack. Taking up a defensive position on the southern entrance to the fortress, Sonloam and the other guards waited as the research team explored the edifice."}, {"tag": "p", "text": "While the team was inside, a sandstorm provided cover for Phylus Mon, his nine adepts, and their giant Force-sensitive Wampa. The ambush was successful, Sonloam and the other Jedi guarding the fortress were overwhelmed and slain, leaving the fortress and the research team vulnerable. Performing a ritual in the heart of the fortress, the adepts avoided the research team which were occupied trying to raise the academy through the storm. By the time Master Lanius Qel-Bertuk organized search teams to investigate the deaths, the raiders were long gone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}