{"url": "Military_Creation_Act/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Galactic Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Military Creation Act"}, {"tag": "p", "text": "The Military Creation Act was a bill proposed in the Galactic Senate during the Separatist Crisis, in the years leading up to the Clone Wars. Created in response to increasing secessions from the Galactic Republic, the Act authorized the creation of an Army of the Republic, to aid the local security forces, Judicials, and Jedi that made up the Republic's peacekeeping forces. The Act remained in limbo for two years until, on 13:3:6, a vote was at last set for it two months hence. Over the following weeks, vociferous debate and intense campaigning ensued as Senators and many others sought to either advocate or oppose the measure."}, {"tag": "p", "text": "A number of major events marked the course of the Military Creation Act's debate, including the closing of Corellia's borders, protests from Chandrila to Coruscant, a plea from Supreme Chancellor Palpatine to Separatist leader Count Dooku for peace, and an outpouring of arguments, demonstrations, and endorsements. Senator Onaconda Farr produced an allegorical play favoring the Act, while Senator Jollin Resbin secured the endorsement of podracer Boles Roor. Jedi Depa Billaba and Sar Labooda joined the opposition as the planet Carida, home to a prestigious military academy, supported the Act."}, {"tag": "p", "text": "On the day of the vote, 5:16, leading member of the opposition Padmé Amidala was attacked by an assassin. In the wake of the attack, the vote was postponed and Amidala was sent offworld. Meanwhile, a clone army was discovered on Kamino, and after it was learned that the Separatists were raising an army of their own, Representative Jar Jar Binks called for emergency powers to be granted to Chancellor Palpatine so he could activate the clone army for Republic use. The motion was successful, and the new Grand Army of the Republic went on to fight in the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Military Creation Act authorized the formation of an Army of the Republic. Chancellor Palpatine did not reveal the articles of the Act or the scope of the vote beforehand, but had it been put to a vote, it would likely have been a yes/no matter on the issue, according to HoloNet News. If then passed by the Galactic Senate, a commission of Senators would need to be established to determine resource allocation for the Republic's new military. Certain sector and planetary forces would be chosen to contribute to the Army, though which forces would be used was a matter for further discussion. Military academies on worlds such as Carida, Raithal, and Corulag would serve to train the soldiers, and the Jedi were proposed by some as leaders of the eventual army."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic change"}, {"tag": "p", "text": "At the time of the Separatist Crisis, the Republic had enjoyed peace for a thousand years, with planetary security and sector forces, Judicial Forces, and the Jedi Order serving as its peacekeepers. The Stark Hyperspace War of 44 BBY, however, had led some to conclude that these peacekeeping forces were merely a stop-gap solution and a more unified military, led from Coruscant, was needed. In 24 BBY, former Jedi Master Count Dooku reappeared on the galactic stage, decrying the Republic's corruption and preaching separatism. Dooku formed a new, secessionist government, the Confederacy of Independent Systems, and thousands of planets began to rally to him. Rumors of a Military Creation Act began to circulate before the Act was announced, but Supreme Chancellor Palpatine refused to come out in favor of an army. That year, the official Military Creation Act was at last proposed in response to the Separatist threat, allowing for the creation of an Army of the Republic to counter Separatist threats."}, {"tag": "p", "text": "However, this would not be resolved swiftly. Two years of bureaucratic stalemate began, with the Act going nowhere as more worlds joined the Separatist cause. 22 BBY arrived with no solution to the deadlock; meanwhile, the issue itself pushed away other worlds, including Ando, which was insulted by the Republic's own plan to militarize after the forced demilitarization of their world. On 13:3:6, Chancellor Palpatine at last announced, in an address on the HoloNet, a vote date for the Act: 5:16, two months later. This gap would give time for Senators to return to Coruscant, as well as poll their constituencies. Both support and opposition forces to the Act were relieved to see an end to the stalemate, though both cautioned the consequences of a wrong vote; Senator Tikkes was concerned of the time that additional discussions would take. Despite being publicly against the Act, Palpatine made no partisan comments during his announcement. In response to the announcement, the 575 employees of Chandrila's Public Safety Commission staged a walk-out in protest."}, {"tag": "h3", "text": "The great debate"}, {"tag": "p", "text": "Seven days after Palpatine's announcement, following a week of closed-door discussions between Corellian Senator Garm Bel Iblis and Diktat Shyla Merricope, Corellia surprised the Republic by announcing that it was invoking its right of Contemplanys Hermi and closing its borders. Withdrawing his vote on the Act, Bel Iblis announced that it was a threat to Corellia's sovereignty, and Corellia would not be party to it. Merricope concurred, declaring that Corellians would not be drafted to fight the Republic's wars, nor would they allow the Republic's soldiers to be placed in their homes. The next day, HoloNet News published a \"Point/Counterpoint\" article on the Act, with Judicial Terrinald Screed endorsing it and Caamasi Senator Eeshrin Ot'Hyne arguing for the opposition."}, {"tag": "p", "text": "Some still continued to push for peace. Chancellor Palpatine made a 12-minute public address on the HoloNet—overriding almost every channel and feed—to the secretive Count Dooku, asking for a parley so the two could come to a peaceful solution. Senator Onaconda Farr of Rodia criticized Palpatine for the move, believing it to be a cowardly attempt to stop the Act. On 3:20, Senator Horox Ryyder of Gravlex Med, one of those who had campaigned against the Act, retired. His successors Zo Howler and Fo Kuna promised to continue his work opposing it. Palpatine received further criticism from some in the Senate when he revealed the members of the Republic's new Loyalist Committee—an advisory body for dealing with the Separatist Crisis—on 3:28. Though the committee consisted of Senators on both sides of the Military Creation Act debate, many Senators believed that Palpatine was forming a partisan body to affect the impending vote, with Farr again claiming that the Chancellor was trying to subvert it by gathering his allies."}, {"tag": "h3", "text": "Campaigning"}, {"tag": "p", "text": "As the final month before the vote began, the debate continued. On Chandrila the Legislative Youth Program held a mock vote on the Act, using a conjectural version of its as-yet-unknown articles. Presided over by Junior Chancellor Kennis Radi, the mock Senate session included Needo Farr of Rodia in the support and Dashé Borreno of Naboo in the opposition; many delegates could not attend, some because their homes had seceded, some due to fears of travel in the current situation, and in the case of Trevor Insevade of Alderaan, due to illness. The Act passed with a margin of 52-48 percent; Borreno believed that Insevade could have turned the vote had he been present. In the real Senate, the expected vote tally was even in the last weeks. Rumors that Palpatine was dealing with health problems, and would take a vacation before the vote, were meanwhile denied by his aide Sate Pestage."}, {"tag": "p", "text": "On 4:18, the government of Carida, home to the longstanding Academy of Carida, joined the campaigning for the Act, donating billions of credits towards regional campaigning efforts and offering the Academy for Republic use in training its new army, if the Act passed. Ambassador Golfhan of Carida vowed to continue the military traditions of the Republic that had given rise to the Academy. The move was met with praise by some, including Terrinald Screed, but others like Senator Padmé Amidala of Naboo—campaigning against the Act in her native Chommell sector at the time—saw it as a bid solely to promote the interests of the Academy."}, {"tag": "p", "text": "Senator Farr, meanwhile, aided in his side of the campaigning by bankrolling and writing the story of a play that was also a political message: The Trickery of Vosdia Nooma, produced by the Rodian government's Drama Council. Laden with allegory and symbolism, the play promoted Farr's pro-military positions and a pro-Military Creation Act stance in particular. Farr himself had a cameo in the play, though drama editor Korvit Domesa of HoloNet News, who reviewed the play, believed this was a mistake that could hurt his platform; Domesa nonetheless thought that the production would inspire discussion on both sides of the debate. But all interactions were not peaceful; in the weeks leading up to the vote, the number of vocal opponents and supporters rose outside the Senate Rotunda on Coruscant. Approximately 7,000 activists gathered around the building, most in protest; a number of isolated fights broke out between them and the smaller—but still vocal—group of pro-Act demonstrators. On 5:9 the Senate Guard attempted to relocate the crowds. When the protesters pushed back, violence broke out, and the guards fired stun blasts into the crowd. Thirty-eight individuals were arrested, many of them students from the University of Coruscant, and four activists and two guards had to be rushed to the hospital."}, {"tag": "p", "text": "As the vote neared, Senators and representatives began their final tallies of the consensus of their constituents. The Mid Rim in particular filled with campaigning as every sector tried to make its voice heard. Though each Senate vote was decided by the local custom of the sector, most used some sort of referendum to hear the will of their constituency. Senator Amidala continued her efforts against the Act in the Chommell sector, while Senator Yudrish Sedran of Chalacta came out against it as well after consulting with the Chalactan Temple of Illumination, a decision that was supported by Chalactan Jedi Depa Billaba and Sar Labooda. Meanwhile, Senator Jollin Resbin of Sneeve, a supporter of the Act, gained the endorsement of retired podracing champion Boles Roor, who not only appeared in advertisements for Resbin, but even came out of retirement to participate in a series of charity races around the Mid Rim to spread the Senator's message. However, political analysts agreed that it would ultimately be the say of the Core Worlds that decided the vote. With seven days left until the vote, many Senators began returning to Coruscant."}, {"tag": "p", "text": "The night before the vote, 5:15, Palpatine made an address to the Republic announcing his confidence in negotiations towards a peaceful sentiment, regardless of whether the Act passed; his words were perceived by the media as acceptance of a likely \"yes\" vote."}, {"tag": "h3", "text": "Assassination attempt and the Grand Army of the Republic"}, {"tag": "p", "text": "5:16, the day of the vote, came at last. Senator Amidala was amongst those returning to Coruscant, and with many knowing that fact and not wanting her to cast her vote, she was under heavy protection. As her starship landed on one of Coruscant's platforms and her decoy Cordé disembarked, a bomb detonated, killing Cordé but leaving Amidala alive. The would-be assassin was Zam Wesell, a bounty hunter hired by Jango Fett, in turn an employee of Count Dooku. Amidala was presumed dead, and HoloNet News even published an obituary shortly thereafter."}, {"tag": "p", "text": "As these events were occurring, the Act was at last coming to a vote in the Senate, intended to be decided by 0800. The recent demonstrations around the Senate and general atmosphere of fear had driven the Senators into an uproar, but they were soon silenced when Palpatine announced that Amidala had been assassinated. Even this news would not stop the call for a vote, however, and Ask Aak of Malastare declared that Amidala's death was further proof of the need for an army. Palpatine urged the Senate to push for peace and a storm of arguments again rose, but the Senate was silenced for a second time when Amidala herself appeared. After concurring with the Chancellor's plea for peace, the Senator made an announcement to the surprised body of legislators, announcing her suspicion that one of her political enemies had been behind the attempt to kill her. Amidst another round of argument, Senator Orn Free Taa moved that the vote be deferred, and Palpatine adjourned the Senate and delayed the vote until a later session the following day. The pro-military faction soon claimed that Palpatine had overstepped his authority in the delay, with Senator Candabrine Bu of Lansono doubting that the Chancellor had ever intended the vote to be held that day. Palpatine meanwhile conferred with the Jedi Order, expressing his desire to hold off the vote and his fear that it would tear the Republic apart."}, {"tag": "p", "text": "Palpatine had other motives, though, as he secretly wanted the measure passed. To remove Amidala and her vote from the Senate, he assigned the Jedi Obi-Wan Kenobi to protect her, knowing full well that his apprentice, Anakin Skywalker—who he knew harbored feelings for the Senator— would be present with him, to protect her, and after another assassination attempt on Amidala's life that night, the Chancellor ordered her to go into hiding with Skywalker on Naboo. Though upset that she would not be on Coruscant to spearhead the opposition to the Act, Amidala complied. Meanwhile, Skywalker's master Obi-Wan Kenobi, in the process of investigating the assassinations, discovered a clone army on the world of Kamino, commissioned by the long-dead Jedi Master Sifo-Dyas. Kenobi soon came across evidence that the Separatists had developed an army of their own and were preparing to use it against the Republic. With the Senate still deadlocked over the issue of the army, the Loyalist Committee, heads of the Jedi Order, and Chancellor Palpatine decided on a new tactic. Representative Jar Jar Binks, standing in for Amidala while she was away, would call for emergency powers to be invested in the Chancellor, allowing him to activate the clone army. With Amidala's noted anti-military stance, the support of Binks, as her proxy, would draw over many of the others on her side. It was successful; Palpatine was granted the powers, activating the clones to form a Grand Army of the Republic. The Clone Wars began with their first action on Geonosis. After the outbreak of war, the former opposition to the Act received significant criticism from the pro-military factions, who saw the war as the danger they had sought to protect the Republic from."}, {"tag": "h2", "text": "Controversy"}, {"tag": "p", "text": "Senate and public opinion were deeply divided over the issue of the Military Creation Act. In a HoloNet News poll on the Act, the day after Palpatine's scheduling of the vote, the results were 70% in favor and 30% opposed. Endorsements came out for both sides, from the public appearances of celebrity podracer Boles Roor for the Act to the quieter opposition of Jedi Depa Billaba and Sar Labooda. Advocates of both sides could be extremely vocal, and violence was known to occur between them, with large-scale rioting on the verge of breaking out on Coruscant."}, {"tag": "h3", "text": "Support"}, {"tag": "p", "text": "Those who supported the Act, like Republic Judicial Terrinald Screed, believed that the scope of war had gone beyond that which the extant Republic peacekeeping forces, such as sector security or the Jedi, were capable of handling. They pointed to the inefficiencies of the Stark Hyperspace War as an example of the necessity of a unified military. With sectors and worlds seceding, local forces could not be indefinitely relied on to support the Republic, and private armies, many consisting of droids that were both cheap and numerous, were more common. If the Separatist forces were to consolidate an army, an army would be needed to oppose them; the victory of the Gungans over the Trade Federation in the Invasion of Naboo ten years prior was pointed to as an example of the value of keeping a standing military in peacetime. Screed also saw support of the Act as a matter of loyalty, and along with Ambassador Golfhan of Carida, whose government donated billions of credits towards campaigning efforts for the Act, appealed to the military tradition of the Republic as a source of pride."}, {"tag": "p", "text": "Some Senators, like Onaconda Farr, thought war was inevitable. Farr's Rodian culture, as well, gave him a long tradition of militarism that drove him to support the Republic's efforts towards an army. Senator Aks Moe of Malastare believed the lack of an army gave the Separatists time to conspire against the Republic, and Senator Tikkes worried that at the rates of secession there would be no worlds left in the Republic by the time it got an army. In the brief time that Senator Amidala was believed to be dead, her presumed assassination provided further proof for the Act's supporters that an army was needed. Other supporters included Darsana of Glee Anselm; Jollin Resbin of Sneeve; Candabrine Bu of Lansono; Ask Aak of Malastare, a longtime proponent of greater military force and a critic of the Jedi; and Ronet Coorr of Iseno, whose homeworld had a long history of military presence. Two were more uncertain: Orn Free Taa, who was expected to vote for the army but against any spending increases that came out of his budgets; and Bail Organa of Alderaan, who despite not being a strong militarist had spent the last years calling for action against the Separatists."}, {"tag": "h3", "text": "Opposition"}, {"tag": "p", "text": "A wide variety of arguments existed against the Act. Some, like Senator Tendau Bendon of Ithor, argued that authorizing a military would provoke the Separatists into war. Caamasi Senator Eeshrin Ot'Hyne took this view as well, arguing that the pro-army stance was rooted in fear and that rather than being a solution to that fear, a military would only increase violence, a cycle that he said occurred many times throughout the Republic's history. Ot'Hyne beseeched the Republic to address the causes that would lead to a war, saying this would prevent war itself. Senator Padmé Amidala—a particularly vocal opponent of the Act who, despite having campaigned against the Act since its announcement, nonetheless left her vote to the choice of her constituency—believed it would be a threat to the Galactic Constitution. Amidala headed the Campaign against Republic Militarization, which received a share of controversy. Amidala's strong opposition to the measure would, ultimately, be what led to the creation of an army; the trust she earned among the rest of the opposition provided the political capital that her proxy, Representative Binks, needed to reverse her position and grant emergency powers to Chancellor Palpatine."}, {"tag": "p", "text": "Pragmatic arguments existed as well. Chandrilans working in public safety, like Ocandra Leeds, argued that taxes reserved for local forces would have to be transferred to the Republic, depersonalizing the services they offered. The Aqualish of Ando saw it as an insult, as the Republic had many times before ordered them to demilitarize. Ot'Hyne suggested that the military funds would be better spent on the Diplomatic Corps and Refugee Relief Movement, and he declared that commercial interests wanted to capitalize on the conflict for their own ends. Senator Garm Bel Iblis of Corellia, meanwhile, argued that the costs of the Army would be great, and would all come from Republic taxpayers; planetary security forces, he stated, had worked and would continue to work, and worlds like his own would not want to pay for both an Army of the Republic and their own forces. Bel Iblis also believed that the Act threatened Corellia's sovereignty, and the Diktat of Corellia did not wish for Corellians to fight and die for the Republic, far from their home planet, nor for soldiers to be billeted in Corellian homes."}, {"tag": "p", "text": "While the pro-Act movement had several large special interests providing funding, the opposition did not have any donors nearly as sizable. In the final month before the vote, a number of students from the University of Coruscant protested the Act in front of the Senate Rotunda. Other opponents included Horox Ryyder, Zo Howler, and Fo Kuna of Gravlex Med, Yudrish Sedran of Chalacta, Mon Mothma of Chandrila, Fang Zar of Sern Prime, and Lexi Dio of the peaceful and independent agriworld Uyter. Supreme Chancellor Palpatine himself publicly stated he opposed the Act, though in several announcements he remained nonpartisan on the issue; some Senators, however, believed many of his political actions were attempts to undermine it. In secret, Palpatine sought to pass the Act, even attempting to remove influential votes against it like those of Senator Amidala."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Created as a major element for the plot of Star Wars: Episode II Attack of the Clones, the Military Creation Act was introduced in HoloNet News, a regular online feature preceding the release of Attack of the Clones. The Act, and the circumstances surrounding it, formed a running narrative throughout HoloNet News up until the movie's release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}