{"url": "Military_revolt_on_Coruscant", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles of Coruscant", "Category:Battles of the early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Military revolt on Coruscant"}, {"tag": "p", "text": "A military revolt was orchestrated on Coruscant by Headmaster Gentis during his attempted coup. Gentis successfully took control of Coruscant for a brief time, but was defeated shortly afterward."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Though the Clone Wars had ended, many Imperial soldiers kept dying because of the Emperor's warmongering, a fact that led the Headmaster of the Imperial Academy, Gentis, to launch an coup, with the goal of killing Palpatine and stopping the endless killing that cost him all but one of his sons. Using his position, Gentis struck the night of the graduation of the first class of Imperial officers."}, {"tag": "h2", "text": "Revolt"}, {"tag": "p", "text": "Explosions rocked the cityscape for kilometers around, eliminating seventy-two Imperial targets within minutes. The officer's club, various Stormtrooper garrisons, the Comm Towers, and a supply depot were all destroyed. Imperial Plaza became ground zero in the battle that erupted, as \"terrorist\" forces swarmed through the city streets, fighting with the Empire's clone forces. The stormtroopers were losing the battle until Darth Vader appeared, rallying the troops and driving the enemy forces back. In the madness, Tohm had escaped from the prototype starfighter by engaging its ejection seat and landing in the midst of the battle. Tohm joined the stormtroopers in following Vader, but when one of the terrorists grabbed his ankle, he bent and removed the man's mask, revealing his friend Shens. Shens begged Tohm to help them kill Palpatine, the main target of their assassination attempts that night."}, {"tag": "p", "text": "As Shens lay dying, he then asked Tohm to kill Vader, but Tohm told his friend that he should have included him earlier, and shot Shens in the head. Tohm then bowed to Vader, who instantly respected his bravery and loyalty. As the pair made their way from the plaza, another explosion tore through the nearby buildings, unleashing a powerful necrotic virus known as Aorth-6. Dozens of Imperials, including Royal Guardsmen, were killed by the aerosolized virus, which liquified them from the inside out. Tohm donned a breathing device that he had taken from the TIE fighter when he ejected and followed Vader inside. There they found a mortally infected Palpatine and Moff Trachta. Palpatine was using the dark side of the Force to keep the virus at bay, but was losing the battle even with his formidable powers. Vader accused Trachta of being in league with the conspiracy, but the Moff vehemently denied it, saying they needed to get the Emperor into hiding; fear of his power was the only thing keeping the Empire together. The trio escorted Palpatine to secret hangar below the Imperial Palace, where they loaded him aboard a stealth transport."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}