{"url": "Millaflower/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Drugs and medicine", "Category:Fruits and vegetables", "Category:Perfumes", "Category:Plants of Naboo", "Category:Spice variants"], "nodes": [{"tag": "h1", "text": "Millaflower"}, {"tag": "p", "text": "The Millaflower was an especially aromatic flower from Naboo, and one of their more exotic and lucrative exports."}, {"tag": "h2", "text": "Physical characteristics"}, {"tag": "p", "text": "Growing wild in isolated valleys on Naboo, the millaflower was a ground flower that came in several bright colors, with red and blue being the most common. Popular with the native Naboo and Gungans, the flower was commonly cultivated in flower-boxes and gardens, and when gifted was culturally considered to honor the recipient by signifying respect."}, {"tag": "h2", "text": "Pharmacological uses"}, {"tag": "p", "text": "Despite their great beauty, the millaflower was primarily valued for an airborne chemical that they exuded, which caused most oxygen breathing species to feel at ease. The more flowers concentrated in an area, the more pronounced this effect became - with a field of millaflowers in an enclosed space producing a mild tranquilizing effect. For this reason, the plant was very popular for use in aromatherapy."}, {"tag": "p", "text": "When extracted and distilled, this natural chemical becomes an organic tranquilizer with a bitter chalky flavor, powerful enough to kill if administered in sufficient dosage. For this reason, Naboo law prohibits anyone but licensed drug manufacturers from producing the extract, and anyone but a licensed pharmacist from buying it. Prescribed by many homeopathic physicians, both plant and extract were a major Naboo export, with the doctors of Kuat commonly known to prescribe the extract for everything ranging from relaxation to muscle aches."}, {"tag": "h2", "text": "Illegal use"}, {"tag": "p", "text": "Despite the flower's myriad uses, illicit uses existed as well. Most notably, the drug could be used to intentionally intoxicate or kill if administered in a high enough dose. Typically, those wishing to administer the drug secretly would use food or wine to mask the taste, though in doses of three or more, the taste was detectable regardless. Under the influence, onset could take up to an hour, with a drugged sentient feeling a continual increase in well being until the full effects of the drug kicked in. In a standard Human, the full effects could be felt for up to ten hours, and varied in severity depending on dose. Commonly, a single dose produced relaxation, two made a sentient uninhibited, three doses intoxication, four doses a deep sleep and unconsciousness, five doses paralyzation, and six doses producing heart failure and death."}, {"tag": "p", "text": "In addition to the extract's potentially deadly use, some exported plants found their way into the hands of illicit drug manufacturers, who experimented with the extract as a potential spice."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Due to the dangerous nature of the plant, as well as its potential to be used as a spice, the millaflower went under review in 32 BBY by a Senate subcommittee. Though, at the time, both plant and extract were legal everywhere, despite the extract being controlled on Naboo."}, {"tag": "p", "text": "Soon after 32 BBY, the Gungans transported millaflowers and other vegetables and animals to the moon of Ohma-D'un to try and establish an ecosystem. Most of the flora and fauna of Ohma-D'un, however, was destroyed by Separatists during the Battle of Ohma-D'un.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}