{"url": "Millennium_Falcon_(novel)", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Millennium Falcon (novel)"}, {"tag": "p", "text": "Millennium Falcon is a novel by James Luceno about the history of the Millennium Falcon. It was originally set to be released on December 30, 2008, but was pushed up to October 21, 2008. At the end of the book is an introduction to Fate of the Jedi: Outcast, the first novel in the Fate of the Jedi series. There is also an excerpt of Millennium Falcon in the paperback version of Darth Bane: Rule of Two. The paperback version was released on November 24, 2009."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Back cover"}, {"tag": "p", "text": "Climb aboard, buckle up, and prepare to jump to hyperspace for the ultimate flight of the ship that launched a thousand fates."}, {"tag": "h3", "text": "Internal flap"}, {"tag": "p", "text": "Two years have passed since Jacen Solo, seduced by the dark side and reanointed as the brutal Sith Lord Darth Caedus, died at the hands of his twin sister Jaina, Sword of the Jedi. For a grieving Han and Leia, the shadow of their son's tragic downfall still looms large. But Jacen's own bright and loving daughter, Allana, offers a ray of hope for the future as she thrives in her grandparents' care. The eager, inquisitive and Force-strong girl makes a curious discovery aboard her grandfather's beloved spacecraft—the much-overhauled but ever-dependable Millennium Falcon. The Solo family then finds itself at a new turning point, about to set out on an odyssey into uncertain territory, untold adventure, and unexpected rewards."}, {"tag": "p", "text": "To Han, who knows every bolt, weld, and sensor of the Falcon as if they were parts of himself, the strange device Allana shows him is utterly alien. But its confounding presence—and Allana's infectious desire to unravel its mystery—are impossible to dismiss. The only answer lies in backtracking into the past on a fact-finding expedition to retrace the people, places, and events in the checkered history of the vessel that's done everything from making the Kessel Run \"in less than twelve parsecs\" to helping topple an evil Empire."}, {"tag": "p", "text": "From the moment the Falcon broke loose from a Corellian assembly line like an untamed creature with a will of its own, it seemed destined to seek out trouble. It wasn't long before the feisty YT-1300 light freighter went from shuttling cargo to smuggling contraband. But it's a fateful rendezvous on Coruscant, at the explosive height of the Republic/Separatist uprising, that launches a galaxywide cat-and-mouse game whose newest players are Han, Leia, Allana and C-3PO. And they're not alone: Crime lords, galactic pirates, rogue politicians and fortune hunters alike loom at every turn of the quest—each with his or her own desperate stake in the Millennium Falcon's most momentous mission."}, {"tag": "p", "text": "Through the years and across the stars, from the Rim Worlds to points beyond, the race will lead them all to a final standoff for a prize some will risk everything to find—and pay any cost to possess."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "The novel starts off a few years before the Battle of Yavin when Han Solo had won his famous ship, the Millennium Falcon, from a game of sabacc from his friend, Lando Calrissian, and gawking at the beauty and efficiency of the ship. But despite his love-at-first sight for the Falcon, he would have no idea of the ship's history for years to come."}, {"tag": "p", "text": "After this, the novel goes to 60 BBY and shows how the Millennium Falcon had come off of its assembly line in an erratic manner, like an animal trying to get loose as the factory supervisor, Soly Kantt, watches in surprise and shock at this event. Several decades later, in 19 BBY, the final year of the Clone Wars, the new owners of the Falcon, Captain Tobb Jadak and his copilot Reeze Duurmun, fly their ship, which they have christened the Stellar Envoy, straight into the Battle of Coruscant. Despite the difficulties navigating through the battlefield, they reach the planet and meet up with the members of the Republic Group. The members of the Group tell Jadak and Duurmun to go to the world of Toprawa where they are to meet up with an individual named Folee who will help them find a treasure that will restore the power of the Republic from Supreme Chancellor Palpatine's rule. However, Republic Director Armand Isard, an avid supporter of Palpatine, finds out about Jadak and Duurmun's mission and sends out a clone trooper squadron to stop them. But Jadak and Duurmun pilot the Stellar Envoy off of Coruscant to go to Toprawa; however, they are forced to make an erratic jump to Nal Hutta to avoid their pursuing forces. They end up in a crash against another ship. A month later, technician Bammy Decree makes a sale of the Stellar Envoy, which was collected from the crash barely intact with both Jadak and Duurmun apparently dead, to crime boss Rej Taunt. Taunt buys the ship after its repairs and uses it to make trade with the insectoid species known as the Colicoids, which is botched due to their savage nature."}, {"tag": "p", "text": "The novel then transitions several decades later in 43 ABY after the occurrences of the Galactic Civil War and all the other wars and crises in which the Millennium Falcon has been involved in under the piloting of Captain Han Solo. His granddaughter, Allana, finds a strange device on the ship's hull that Han has never noticed before in all of his years of flying and maintaining his ship. Curious as to what the device is, the Solos decide to go on a fact-finding journey where they will find out about everyone who piloted the Millennium Falcon before Han, starting from Lando Calrissian to Quip Fargil, the man who had originally named the Falcon as it is today. During this journey, they come across Jedi Knight Seff Hellin, who acts erratic and unnecessarily violent; as well, Allana believes that she sensed her late father's presence in the Force."}, {"tag": "p", "text": "Meanwhile, Captain Jadak wakens from his sixty-two-year coma on Obroa-skai, having survived the crash at Nal Hutta while Reeze Duurmun had died. Jadak is caught up on the history of the galaxy as it has been for more than the past six decades, and decides to find out where the Stellar Envoy went. Going to Nal Hutta, where the crash that put him in the coma occurred, he recruits a ne'er-do-well named Flitcher Poste on his mission to find out where the Stellar Envoy went. And while he sets out for his journey, Lestra Oxic, the man who had funded Jadak's stability in his coma for all these years, sends his agents to keep tabs on him so that he could eventually lead Oxic to the world where the Republic treasure is stored."}, {"tag": "p", "text": "Eventually, Jadak and Poste's path crosses with the Solos on the world of Vaced, and the two parties agree to put the mysterious device that Allana found back to its planet of origin. It turns out that the device was placed there by a Jedi Master named J'oopi Shé who was a member of the Republic Group, and they travel to the world of Tandun III, which the device leads them. They all find the treasure for which Oxic had been using Jadak and Poste as a tracking beacon for, which was merely an Old Republic artifact that would have bolstered the spirits of Palpatine's enemies to overthrow him. However, Oxic finds out that the artifact is a fake as the world begins to undergo an apocalypse due to ecological disaster brought upon by the Yuuzhan Vong invasion years earlier. Oxic hires out Jadak and Poste to help him find the real artifact as they leave the destroying planet, and the Solos leave the device on the dying world as they themselves leave, their fact-finding mission to discover the Falcon's previous owners complete."}, {"tag": "p", "text": "The novel ends with the Solos getting the news from Coruscant that Grand Master Luke Skywalker is being arrested by Galactic Alliance Chief of State Natasi Daala for dereliction of duty during the Second Galactic Civil War. Apparently, Daala blames Luke for the late Jacen Solo's fall to the dark side of the Force three years earlier during that war. With that, the Solos decide to set course for Coruscant to help Luke as the Millennium Falcon goes into hyperspace; just another voyage for the legendary ship more than a century old in both age and actions."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The novel mistakenly places chapter five, taking place a month after the Battle of Coruscant, in 18 BBY, when, according to all other sources, that year does not come until several months after the events of Episode III."}, {"tag": "p", "text": "The scene where Seff Hellin is introduced, and where Allana senses him as her late father, is a precedent for the Force psychosis plot line that will dominate much of Fate of the Jedi."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}