{"url": "Millennium_Falsehood", "categories": ["Category:Legends articles", "Category:New Republic starships", "Category:YT-1300 light freighters"], "nodes": [{"tag": "h1", "text": "Millennium Falsehood"}, {"tag": "p", "text": "The Millennium Falsehood was a modified YT-1300 light freighter."}, {"tag": "p", "text": "As part of his campaign against Warlord Zsinj, General Han Solo authorized Wraith Squadron to create a fake Millennium Falcon to lure the Warlord into a trap, as the genuine Falcon was stored aboard Rebel Dream at the time."}, {"tag": "p", "text": "A crew of Corellians including Wraith pilot Myn Donos, Rogue Squadron pilot Corran Horn, and Wraith chief mechanic Cubber Daine along with Rogue Squadron quartermaster droid M-3PO took a shuttle to a scrapyard in the Corellian system where YT-1300s were cheapest and easiest to find."}, {"tag": "p", "text": "They traded a hyperdrive-equipped TIE/IN interceptor that Shalla Nelprin acquired from Razor's Kiss, and returned to Mon Remonda with a battered ship that Solo declared was the \"ugliest ship I think I've ever seen.\" Chewbacca worked on the Falsehood to make it cosmetically similar to the Falcon, by painting over rusted spots and painting false rust on clean hull plates to match the surface patterns. It didn't have the Falcon's speed, but it did have similar armament. It is also worth mentioning that the Falsehood was barely spaceworthy when it was acquired. It was rumored that it was acquired from a local junk dealer, which supports the fact that it probably came from a junkyard."}, {"tag": "p", "text": "On the Falsehood's first mission, Wedge Antilles and Chewbacca landed on Kidriff 5. Antilles forgot that he didn't speak Shyriiwook, and had to bring Wraith Squadron's droid quartermaster Squeaky on the trip to translate. The trip went according to plan, except for Gara Petothel's defection to Zsinj, though Rogue Tycho Celchu did describe the Millennium Falsehood as a \"flying bathtub.\""}, {"tag": "p", "text": "Though Petothel may have compromised the Falsehood scheme, Antilles elected to continue the plan. Most of the freighter's missions consisted of stealthy insertions followed by attention-grabbing departures. Zsinj believed the ship really was the Falcon, and it frustrated him."}, {"tag": "p", "text": "On an insertion into Comkin V, the Falsehood was fitted with hull plating to make it appear more like a YT-2400 to sensors. In addition, that plating concealed an A-wing and a large explosive device. Both of these hidden surprises were used to great effect during the ship's departure from the planet, as Zsinj deployed the Dreadnaught Reprisal to intercept the freighter. Gara Petothel was flying with Zsinj's fake 181st Imperial Fighter Wing, and trying desperately to avoid harming any New Republic forces, so she deliberately collided with the Falsehood."}, {"tag": "p", "text": "Neither side took major losses in the Comkin engagement, and Millennium Falsehood kept flying. Her next appearance was scheduled to be in the Vahaba system, but Zsinj brought his fleet into the system before the Falsehood launched."}, {"tag": "p", "text": "The Millennium Falsehood was not seen after the Battle of Vahaba, but she presumably remained in the possession of the New Republic. Han Solo planned to recommend that the ship be placed in a museum, mainly to stop the requests for him to donate the genuine Millennium Falcon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}