{"url": "Millinar", "categories": ["Category:Legends articles", "Category:Hapes Consortium planets", "Category:Mythology"], "nodes": [{"tag": "h1", "text": "Millinar"}, {"tag": "p", "text": "Millinar was an elusive planet believed to be only a myth by the galaxy at large. The myth of Millinar was often compared to those of the Lost City of the Jedi and the Valley of the Jedi. The \"mythic\" planet was actually located in the Interior Region of the Hapes Cluster, a region which itself had become almost legendary by the era of the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Millinar was located in a giant dust cloud, obscuring it from the rest of the galaxy. Its low axial tilt and good water/land surface ratio meant the planet's weather was always pleasant, and its low-lying land masses, beautiful springs, and underground streams added to an unspoiled natural beauty. The native trees possessed extensive root systems reaching down to the underground streams, and produced succulent fruits with unusual natural healing properties."}, {"tag": "p", "text": "The planet's focal point was a large, triangular monument built by an ancient Jedi Knight. Its surface was decorated with elaborate paintings that seemed to move in sunlight."}, {"tag": "p", "text": "The natives of the planet were a race of hermaphroditic, Force-sensitive aliens, rumored to be keepers of Force techniques long lost to the galaxy due to the Emperor's purges. A legend also told of an ancient, powerful weapon hidden on the world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Millinar was introduced in the Star Wars Gamemaster Handbook as an example of how a player might convert the legendary Avalon of Arthurian myth into a setting for Star Wars. Millinar was referenced in The Dark Forces Saga, thus confirming that it canonically exists, and it was later placed in the Hapes Consortium in The Essential Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}