{"url": "Milo_Graf", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Graf family", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Milo Graf"}, {"tag": "p", "text": "Milo Graf was a human male who was the son of Auric and Rhyssa Graf, two frontier explorers who charted the unknown regions of Wild Space. Approximately one year after the proclamation of the New Order, while the Graf family was surveying an uncharted swamp world, Milo's parents were taken captive by Captain Visler Korda and stormtroopers of the Galactic Empire. Desperate to rescue his parents, Milo, along with his older sister Lina, their \"monster droid\" CR-8R, and their pet Kowakian monkey-lizard Morq, underwent a journey across Wild Space to find them."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Around the year 27 BBY, the human male Milo Graf was born to Rhyssa and Auric Graf, cartographers who explored and charted Wild Space. Like his older sister, Lina, Milo was born aboard the Graf family's starship, the Whisper Bird, and his sister gave him the nickname \"Lo-Bro.\" Milo accompanied his parents on their expeditions, and he quickly gained an adventurous reputation. In 22 BBY, the Clone Wars began between the Galactic Republic and the Confederacy of Independent Systems, and although Milo lived far from the war's hardships, he saw the Republic as corrupt and believed that it was responsible for the billions of lives lost in the conflict. When the war ended in 19 BBY, the Republic transitioned into the Galactic Empire, and Milo was amazed, believing that peace was restored and that the galaxy was being reunited. When the Empire began spreading as far as Wild Space and the Unknown Regions, the Graf parents intended to sell their maps and data charts to the Empire, and Milo secretly dreamed of joining the Imperial Survey Corps."}, {"tag": "h3", "text": "The escape"}, {"tag": "p", "text": "Around 18 BBY, the Graf family traveled to an uncharted swamp planet. Once they landed, Auric told Milo and Lina to remain with the ship, saying that there was a storm approaching. However, Milo immediately left the camp to explore the swamps with the Grafs' pet Kowakian monkey-lizard, Morq. Taking a speeder bike and some of his father's surveying equipment, Milo began searching for fauna, and within a few hours he located an ash-rabbit. Milo wished to catch and study the creature, so he activated the homing beacon on his bike and sent an urgent holo-message to enlist his sister's help. Lina arrived soon after, joined by the family's \"monster droid\" CR-8R. In an attempt to be responsible, Lina told her brother to load his bike onto her landspeeder, but Milo saw the rabbit again and gave chase."}, {"tag": "p", "text": "Sneaking up on the animal, Milo raised a wrist-mounted net gun and took aim. However, his shot went wide when he heard Lina scream, and he turned to see his sister being snared by creepervines, a type of carnivorous plant. As the vines pulled Lina upward, she requested her fusioncutter, which had fallen from her belt. Milo retrieved the tool and attempted to throw it to his sister, although he was unable. Following Milo's unsuccessful try, Morq climbed the plant and gave the fusioncutter to Lina, who cut herself free. The adventure in the marshes had dirtied Milo and Lina's tunics, and they feared their mother would scold them. Milo hoped they could return to the camp and change clothes before that happened, but before they left, CR-8R received an encrypted message from Rhyssa. As the droid began decoding the data, Milo and his sister moved the marshweed-covered speeder bike onto the landspeeder, and not wanting to wait for CR-8R to process the message, the four returned to the camp."}, {"tag": "p", "text": "When they reached the camp, Lina noticed that there were no lights on. Milo surmised that the generators had gone out, but CR-8R thought that scenario unlikely. The siblings approached the domed tents and called for their parents, but there was no response. When they reached the main tent, the children saw that all of their belongings were gone, and Milo speculated that their parents had returned to the Whisper Bird, which was landed in a cave close by. CR-8R activated his flashlight and saw footprints, and Lina suggested that their parents had received a visit from Dil Pexton, the family agent. However, Milo dismissed his sister's idea after seeing the number and size of the footprints. Lina noticed her mother's emerald pendant in the mud, and Milo found a holorecorder buried nearby. Lina activated the device, and a holographic recording of their parents appeared, showing the two surrounded by stormtroopers of the Empire."}, {"tag": "p", "text": "Milo and Lina played the recording, learning that their parents had met with Visler Korda, a captain in the Imperial Navy. Rhyssa and Auric had provided Korda with the data he requested, but when Auric asked about payment, the captain demanded that the data be given willingly, saying that it would be taken by force otherwise. As the stormtroopers in the recording raised their blaster rifles, the holorecorder shut off, and CR-8R quickly restarted the device. When the recording resumed, the children saw that their father had been beaten and had a blaster pointed at him, and Rhyssa handed a datapad to Korda. When the children's mother told the captain to leave, he refused, saying that he was also there for the cartographers themselves at the command of Darth Vader. The stormtroopers bound the parents, and Korda instructed the soldiers to destroy all evidence of the encounter, including the Whisper Bird. Rhyssa pleaded, telling Korda about Milo and Lina. When the captain learned of the children, he ordered the stormtroopers to deal with them as well. The video ended soon after when a stormtrooper stepped on the holorecorder."}, {"tag": "p", "text": "When the recording ended, the siblings were stunned. Lina realized that the message CR-8R had received was sent by their mother's datapad, so they knew that not much time had passed. The two decided that their best option was to take the landspeeder to the Whisper Bird and try getting there before the stormtroopers. As Lina prepared the vehicle, Milo comforted Morq. When the speeder was ready, the four seated themselves in the craft and began racing toward the cave."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although he was not a particularly rebellious child, Graf had a habit of running off because of his natural curiosity. He had a keen interest in nature, and he liked to capture unknown alien creatures to study them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Milo Graf was created for Star Wars: Adventures in Wild Space, a series of junior novels written in turn by Cavan Scott and Tom Huddleston, illustrated by David M. Buisán, and published by Egmont UK Ltd for Star Wars canon. The first book, Adventures in Wild Space: The Escape, was written by Scott as a prelude to the series, and it was released on February 25, 2016 in conjunction with World Book Day. Prior to the book's release, Graf was included in an Adventures in Wild Space preview featured in Star Wars Insider 163. In 2017, Pablo Hidalgo of the Lucasfilm Story Group hinted at a connection between the Graf children and the Graf Archive mentioned in Star Wars: Galactic Atlas, also joking that the galactic standard calendar may have been started by the siblings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}