{"url": "Mima_II", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with gameplay alternatives", "Category:D'Aelgoth sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Mima II"}, {"tag": "p", "text": "Mima II, also referred to as Mima Two or simply Mima, was a tropical planet located in the Mid Rim's D'Aelgoth sector. The gravitational influence of Lar, the planet's star, caused the tectonic plates on Mima II to be constantly moving across its surface in various directions, leading to the active creation of new landforms, such as mountains and seas. The accompanying release of chemical elements vital to the development of life resulted in the planet being abundant with plant and animal species, including the sentient Bilars."}, {"tag": "p", "text": "Living in Mima II's lush jungles as well as in cities, the Bilars were herbivorous primates that had developed a unique ability to form group minds known as claqas. That ability, coupled with the abundance of basic necessities on Mima II, such as food, allowed the Bilars to rapidly establish a highly technological society on their homeworld. However, due to various other reasons, interstellar merchants avoided doing business with the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Geologic activity"}, {"tag": "p", "text": "Mima II, also known as Mima Two and simply as Mima, was a small terrestrial planet located in the Lar system, a part of the D'Aelgoth sector in the Western Reaches portion of the Mid Rim. Mima II occupied the second position in its system and orbited the orange star Lar at a relatively short distance. In turn, the planet was orbited by at least two moons. Mima II had a fast rotation of fifteen standard hours and a short year that only lasted 103 standard days."}, {"tag": "p", "text": "Due to the proximity of Mima II to Lar and the gravitational influence of the latter on the former, Mima II's tectonic plates were highly unstable and were drawn across the planet's surface and over its molten core, exhibiting a similarity to moons creating tidal activity on other planets. Depending on Mima II's position relative to its star, the tectonic plates were pulled in various directions, and such movement and collisions between the plates constantly created new landmasses, mountain ranges, volcanoes, and seas on the planet's surface."}, {"tag": "h3", "text": "A world rich in life"}, {"tag": "p", "text": "The high geological activity of Mima II released abundant amounts of carbon, hydrogen, oxygen, and other substances vital for the development of living organisms. The intense electromagnetic radiation emitted by Lar transformed these chemical elements into a variety of organic molecules, which, combined with the extremely warm climate of the tropical world, led to an abundance of plant and animal life on the planet."}, {"tag": "p", "text": "In regions of Mima II's oceans that were too deep for plants to root, carpets of buoyant yellow moss blanketed the water's surface. On land, clinging lianas and hanging vines grew on the steep slopes of the young mountains of the planet. In lower elevations, raging rivers alternated with great, verdant jungles of blue, green, and yellow vegetation and trees that reached hundreds of meters in height. The jungles were thick and murky, had dense brush, and constituted a biosphere that had dozens of distinct levels. Mima II's fauna included the riam, a species of carnivorous flying snake."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point in 3638 BBY, a groundquake on Mima II resulted in one of the planet's business districts being sent on a slow slide into a magma pool. In response, an individual affiliated with one of the sides in the ongoing struggle between the Galactic Republic and the reconstituted Sith Empire sent a companion to the planet in order to salvage anything valuable from the district before it plunged into magma. When the companion arrived on site, the district's slide had temporarily slowed down, and the individual carried out a thorough search of the businesses located therein."}, {"tag": "p", "text": "The sentientologist Obo Rin included Mima II and its native inhabitants, the Bilars, in the Catalog of Intelligent Life in the Galaxy. In that work, Rin described the sentient species that he considered to be the most important in the galaxy and of the most interest to the Galactic Empire."}, {"tag": "p", "text": "In 5 ABY, affluent businesspeople from the moons of Mima II were among the various gamblers present at the Holiday Towers Hotel and Casino in Cloud City, a floating metropolis located in the atmosphere of the Outer Rim Territories planet Bespin."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Mima II was the homeworld of the Bilars. A sentient species of herbivorous primates, Bilars were well-adapted for life in Mima II's jungles. The Imperial sentientologist Obo Rin described the Bilars as the \"kings\" of their homeworld's jungles due to their unique ability to form claqas, a type of hive mind shared by groups of Bilars that amplified their intelligence and senses."}, {"tag": "p", "text": "Pacifistic and carefree, Bilars had little experience with deprivation due to basic necessities, such as food, being abundantly present on their homeworld. The latter factor also led to the species developing in a short time a society of a sophisticated technological level with an emphasis on mass production."}, {"tag": "p", "text": "However, for various other reasons, such as Mima II having little to offer in the way of goods not available elsewhere in the galaxy, most interstellar merchants avoided doing business with Mima II. As a result, most Bilars were confined to their homeworld, as they could not afford transportation off-world. In addition, despite some of the larger claqas, such as Unni Yerudi, being able to find a way to leave Mima II, most of the Bilars that left the planet eventually returned due to the ease of life there as opposed to the rest of the galaxy."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "By 3638 BBY, Mima II was home to several business districts. In the aftermath of a local groundquake around that time, one of the districts of a city on Mima II was sent sliding toward a magma pool. A portion of Mima II's native Bilars lived in cities built in the central areas of the planet's tectonic plates, which were relatively safe from the world's violent geological activity. Large cities on Mima II featured parks with trees planted in them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mima II was first mentioned in Galaxy Guide 4: Alien Races, a 1989 sourcebook authored by Troy Denning for use with West End Games' Star Wars: The Roleplaying Game. \"Twinkle, Twinkle Little Star, How I Wonder Where We Are,\" a 1990 roleplaying game source article published in Voyages SF 13, placed the planet in the \"Imperial Core\" sector. Since that article was released outside of the Lucas Licensing process, its canonicity within the Star Wars Legends continuity was never confirmed. The 2009 reference book The Essential Atlas subsequently placed the Lar system, and therefore Mima II, in grid square L-17, relatively far from the galaxy's Core Worlds, and the StarWars.com Online Companion to the book further overrode the Voyages SF 13 placement by establishing that the system was situated in the D'Aelgoth sector."}, {"tag": "p", "text": "Zorba the Hutt's Revenge, a 1992 young-reader novel written by Paul and Hollace Davids, introduced the shortened form of the planet's name, \"Mima.\" The alternate spelling of the planet's name, \"Mima Two,\" was later introduced in Rise of the Hutt Cartel, a 2013 expansion for Star Wars: The Old Republic, a 2011 massively multiplayer online roleplaying game developed by BioWare."}, {"tag": "p", "text": "The 1998 Star Wars Encyclopedia claims that the tectonic activity on Mima II was caused by a nearby planet named Lar, which contradicts the first edition and the 1994 second edition of Galaxy Guide 4: Alien Races, both of which state that it was the star Lar that exerted its gravitational influence on Mima II. This article assumes that the Star Wars Encyclopedia is in error."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}