{"url": "Min_Erethen", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Engineers", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Min Erethen"}, {"tag": "p", "text": "Min Erethen was a female Human who was a highly skilled and successful engineer of droids and weapons. During her career, she worked for Arakyd Industries and designed many deadly pieces of technology, including disruptors and assassin droids—despite the fact that she personally disliked violence. Erethen worked for Arakyd on board the Bhishana Bhaga, a guardian corvette where Arakyd kept her safely away from the many groups who wanted to lure her away to work for them. When the Bhishana Bhaga experienced a malfunction and crash-landed on an uninhabited planet named Krykas V, Erethen was the only survivor—she lived because she was safe inside of her modified A4 Juggernaut named the Sanctum Sanctorum. When Arakyd learned of the crash they posted a large reward payable to anyone who brought back the starship's crew or computer records."}, {"tag": "p", "text": "While stranded on Krykas V, Erethen used her technical knowledge to construct devices to pilot her vehicle and negate the electromagnetic disturbances on the planet, which affected electronic devices. She modified droids she had been working on both to help her build a HoloNet transmitter and to protect her from assassins and the dangerous local wildlife. While she was still working on the transmitter, a group of individuals came to rescue survivors of the Bhishana Bhaga and convinced Erethen to trust them. However, a second group led by the bounty hunter brothers Irol and Nevo Faunor came to the planet with orders to kill Erethen if anyone reached her first. The first group prevailed over the Faunor brothers and took Min Erethen with them aboard their starship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Arakyd engineer"}, {"tag": "p", "text": "A female Human, Min Erethen was a highly skilled droid and weapons engineer who designed many items, including illegal disruptors and assassin droids. At some point she worked as a droid designer for Arakyd Industries, a large corporation that manufactured both droids and weapons. Erethen was extremely successful due to her skill, to the extent that many of Arakyd's competitors wanted her to work for them in order to increase their profits. Erethen's skills were also desired by freedom fighters, military organizations, pirates, and terrorists. To keep Erethen away from competitors and other groups that desired her skills, Arakyd kept Erethen safely aboard a guardian corvette, which was named Bhishana Bhaga and codenamed \"Bloodhawk\" in Arakyd transmissions. Erethen worked aboard the starship, which was effectively a mobile laboratory for her work as it traveled in the Mid Rim region of the galaxy between supply stops. Whenever she completed a project, Erethen transmitted her work via the HoloNet, as the Bhishana Bhaga traveled around to avoid the factions that wanted her services. She had a mobile safehouse and survival vehicle in the form of an A4 Juggernaut named the Sanctum Sanctorum."}, {"tag": "p", "text": "At some point during Min Erethen's time working for Araykd Industries on the Bhishana Bhaga, the corvette's hyperdrive malfunctioned and caused the starship to come out of hyperspace in an asteroid field. The starship was heavily damaged, which prompted its captain to order an emergency landing on the uninhabited Krykas V, the only planet within range. The Bhishana Bhaga's sensors were disabled when the starship entered the planet's electromagnetically disturbed atmosphere, which forced the crew to make a blind landing without a spaceport. The corvette crashed on the surface, but Min Erethen was safe inside of the Sanctum Sanctorum. The rest of the crew was killed. The starship was unflyable, but parts of it still functioned, including the distress beacon, although Erethen did not notice its functionality at the time. Meanwhile, Arakyd offered a large reward to anyone who successfully rescued the Bhishana Bhaga's crew and recovered the corvette's computer records, and attempt to recover either Erethen or her work."}, {"tag": "h3", "text": "Bloodhawk down"}, {"tag": "p", "text": "The crash of the Bhishana Bhaga left Erethen stranded on Krykas V, but her workshop survived, and she set about modifying her droids and equipment to function in the hostile environment of the planet. Erethen had to improvise in order to overcome the electromagnetic disturbances in Krykas V's atmosphere as well as the muddy landscape and water that were prevalent on the planet. From the workshop in the Sanctum Sanctorum and components she scavenged from the wrecked starship, Erethen built polarizing field generators that allowed electronics to function normally within roughly fifty meters of the Sanctum Sanctorum. She equipped two modified Mark IX Executioner gladiator droids with the field generators and used them to protect her from dangerous local wildlife and other hostiles. Since her staff was killed in the crash, Erethen built a droid brain to pilot the Sanctum Sanctorum, and modified six ASP-7 labor droids to serve as makeshift gunners for the assault vehicle's weapons. In order to build a HoloNet transmitter to send a distress signal, Erethen ordered her droids to clear the area around her vehicle so that she could construct a workshop that would allow her to build a transmitter."}, {"tag": "p", "text": "Although she did not realize it, Erethen did not need to build a transmitter: responding to the Arakyd reward posting, a small group of individuals came to the planet with the intent of rescuing any survivors of the wrecked Bhishana Bhaga. The group came into contact with the gladiator droids, but the newcomers were able to overcome the sentries. The group then accessed the droids' Graph 18 surface locators, which contained information on where the droids had been and which allowed the individuals to locate Erethen. When the engineer saw the approaching group, she was worried that they might be assassins trying to kill her. Nevertheless, the strangers convinced her that they had come to rescue her. Meanwhile, a competitor of Arakyd had sent a pair of bounty hunter brothers named Irol and Nevo Faunor to capture Erethen if no one else got there first, or to kill her if someone else had already arrived. The Faunor brothers arrived at the Sanctum Sanctorum with six hired men armed with blaster cannons and attacked the group helping Erethen. Eventually, the group defending Erethen was able to neutralize the threat from the bounty hunters. Erethen then left with the first group aboard their ship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Min Erethen was highly skilled as a droid and weapons designer and was capable of creating a wide array of designs, from assassin droids to disruptors. On Krykas V, Erethen displayed her skill by modifying her droid creations to function in the wetness and strong electromagnetic fields of the planet. She was also highly skilled in making other electronic devices, building and placing explosives, and disabling and repairing mechanical equipment. She was skilled in building armor and also was adept in engineering and physics. Arakyd Industries viewed her services as valuable enough to give her special protection from other competing groups. Arakyd's competitors knew that if they could convince Erethen to work for them, they would make increased profits due to her technical ingenuity. Despire her willingness to construct various deadly weapons, Erethen disliked violence and had never personally killed another creature, although she was trained in martial arts and in combat with blaster pistols. Erethen did not care if her work was used to destroy others and she was perfectly willing to work hard for whomever paid her. She was trained in the use of light armor for protection. At the time of her crash on Krykas V, Erethen was fluent and literate in Basic, understood binary, and was able to speak Huttese and Sullustese."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the time of the Bhishana Bhaga's crash on Krykas V, Min Erethen possessed a powerful heavy blaster pistol. While on the planet, she spent most of her time inside of the Sanctum Sanctorum, an A4 Juggernaut assault vehicle that had been heavily modified since it was built by Kuat Drive Yards centuries before. The vehicle was designed as a mobile office, safehouse, and survival vehicle, and it was armed with three heavy laser cannons and two medium blaster cannons. Despite originally being a military vehicle, the Sanctum Sanctorum was equipped with couches, a gallery, and holochess boards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Min Erethen first appeared in \"Bloodhawk Down\", an adventure for Wizards of the Coast's revised edition of the Star Wars Roleplaying Game, which was released on October 10, 2002 on Wizards.com. The adventure was written by Owen K.C. Stephens and made use of many elements of Arms & Equipment Guide, a Wizards sourcebook that was released shortly before. In Bloodhawk Down, Erethen played the role of the person that the player characters were hired to rescue. The era was left open for gamemasters to decide, but the inclusion of the LaserHone duelist vibrorapiers used by the Faunors means that the events on Krykas V took place in the Rise of the Empire era or later. The manner the player characters became involved in the adventure was also left up to the decision of the gamemaster. The provided ways for the players to begin the adventure were for the player characters to be hired by a company to bring back survivors of the crash, for the players to investigate the distress call, or for the players to be sent by an organization for whom they were working to recover Erethen. The Faunors and their hired guns could either be killed by the players, or if the brothers took enough of a beating; they would retreat and not return."}, {"tag": "p", "text": "For the first option, the adventure suggested the companies Arakyd Industries, Baktoid Armor Workshop, BlasTech Industries, Cybot Galactica, Drearian Defense Conglomerate, and Golan Arms. However, in any event, the option was available for the players to hire Erethen themselves if they had sufficient credits to pay her and safeguard her in a secure location. An additional result of the players' hiring Erethen was that there would still be organizations after Erethen. The fate of Erethen's Sanctum Sanctorum depended on whether the player characters had a ship large enough to take it away. If so, she allowed them to transport it for her, and if not she planted explosives on it to keep it out of the hands of others."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}