{"url": "Mina_Bonteri/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Galactic Republic senators", "Category:Humans", "Category:Onderonians", "Category:Separatist senators"], "nodes": [{"tag": "h1", "text": "Mina Bonteri"}, {"tag": "p", "text": "Mina Bonteri was a female Human senator who represented Onderon in the Galactic Senate of the Republic until she joined the Parliament of the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before the Clone Wars, Bonteri mentored Senator Padmé Amidala on Naboo. Bonteri also had a child, Lux Bonteri, with her husband."}, {"tag": "p", "text": "By the time of the war, Bonteri had joined the Confederacy of Independent Systems and formed part of the Separatist Parliament. She was an admirer of Count Dooku for standing up to the Republic, which she viewed as corrupt. Her husband was sent to Aargonar to set up a base. However, he was killed when the clone forces of the Galactic Republic attacked."}, {"tag": "p", "text": "Bonteri was later contacted by Amidala in an attempt to broker peace between the Republic and the Confederacy. She called for a vote to open peace talks with the Republic, which was passed by the Separatist Parliament, but her efforts were thwarted by a terrorist attack on Coruscant organized by Count Dooku and General Grievous."}, {"tag": "p", "text": "Bonteri died shortly thereafter, and while Dooku publicly attributed her death to a Republic attack, some Republic spies instead reported that it was Dooku's agents who had killed her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name and photo of Bonteri was featured in Star Wars Insider 121, released on October 26, 2010. She later appeared in the Star Wars: The Clone Wars television series episode \"Heroes on Both Sides\", where she was voiced by Kath Soucie, who also voices Republic Senator Mon Mothma."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}