{"url": "Mina_Dhori_Tolas", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic members", "Category:Females", "Category:Humans", "Category:Imperial Senators"], "nodes": [{"tag": "h1", "text": "Mina Dhori Tolas"}, {"tag": "p", "text": "Mina Dhori Tolas, originally known as just Mina Dhori, was a female Human who served as a senator in the Imperial Senate and later joined the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dhori was born on Korvaii, a small agricultural planet that was located in the Mid Rim. As a young woman, she became a senator and represented her planet in the Imperial Senate, on Coruscant. However, when Emperor Palpatine dissolved the Senate in 0 BBY, she returned to her homeworld. However, on arrival there, she found that most of the population, including her family, had been captured by the Galactic Empire and sent to work in so-called \"loyalty camps\". She evaded the Imperial troops and escaped the planet by hiding in the cargo hold of a ship that was bound for the Outer Rim. By following up on rumors she had heard while she was in the Senate, she eventually found a Rebel Alliance contact and joined the resistance movement."}, {"tag": "p", "text": "Dhori was eventually assigned to serve aboard the Alliance YT-1300 light freighter Lazy Katarn. In 3 ABY, the ship was sent to the planet Dalicron-4, where the crew were to try and find the force-sensitive child Caeleb. However, the child had been captured by the Whiphid Dark Jedi Tol Skaros. Dhori and the rest of the Katarn's crew were able to defeat Skaros and free Caeleb. Several months later, Caeleb was captured by Skaro's master, Thaum Rystra, so the crew of the Katarn were sent to try and save him again. After following up a lead on Nar Shaddaa, the tracked Rystra to the planet Pamorjal. However, the Katarn was destroyed in an engagement with the Pamorjal Freeman's League, so Dhori and the rest of the crew began to fly on the YT-2000 Celestial Dancer instead. They confronted Rystra in the Cavern of Light on a distant Outer Rim planet and were able to rescue Caeleb, although Rystra escaped."}, {"tag": "p", "text": "Dhori eventually married Garek Tolas, a former Imperial soldier who served with her aboard the Dancer The Alliance was reformed into the New Republic and Dhori and the rest of the Dancer's crew began serving the new government. In 7 ABY, they traveled to the Temple of Pain in the Tascollan Nebula, where they confronted and defeated Rystra and his master, the spirit of the Sith consort Valik Kodank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}