{"url": "Mind_Walkers", "categories": ["Category:Legends articles", "Category:Mind Walkers"], "nodes": [{"tag": "h1", "text": "Mind Walkers"}, {"tag": "p", "text": "The Mind Walkers, also known as Mind Drinkers, were a group of Force-sensitives who lived at Sinkhole Station, a space station in the Maw. There, they learned how to separate their minds from their bodies to enter a realm of the Force known as beyond shadows."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Mind Walkers were a group of Force-sensitives living at Sinkhole Station, a space station in the Maw. They learned how to separate their minds from their bodies in order to go to a realm of the Force called beyond shadows. The Mind Walkers did not originate from a single Force-tradition, but from many various traditions. Each tradition brought understanding; however, they all felt that their former sects did not understand the truth, as they came to believe that everything but the Force was an illusion. They first came to that belief following the destruction of Centerpoint Station. While traveling beyond shadows, however, it was impossible to keep track of time and the Mind Walkers were unable to take care of their bodies, so they often became very malnourished, using the Force to sustain themselves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mind Walkers lived on Sinkhole Station, a space station in the Maw very similar in appearance to Centerpoint Station. The Aing-Tii were aware of this group, and disapproved of them, calling them \"Mind Drinkers.\" After the Yuuzhan Vong War, Jacen Solo met with the Mind Walkers and traveled beyond shadows with them during his five year sojourn. In 43.5 ABY exiled Jedi Grand Master Luke Skywalker and his son Ben, who had embarked on a quest to retrace the steps Solo took during his travels in order to find out more about his fall to the dark side of the Force, traveled to Sinkhole Station to meet with the Mind Walkers."}, {"tag": "p", "text": "While with the Mind Walkers, the two Skywalkers traveled beyond shadows, where they were shown many places, including the Font of Power, the Pool of Knowledge, and the Lake of Apparitions, where they met with the deceased spirits of Jedi Anakin Solo, Mara Jade Skywalker, and Jacen Solo."}, {"tag": "h2", "text": "Known members"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In an allusion to The Odyssey, the Mind Walkers who Luke and Ben meet resemble the Lotus-eaters encountered by Odysseus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}