{"url": "Ars_Veruna/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Monarchs of Naboo", "Category:Nobility"], "nodes": [{"tag": "h1", "text": "Ars Veruna"}, {"tag": "p", "text": "Ars Veruna, formally styled as His Royal Highness, King Veruna of Naboo, was a male Human who was the last King of Naboo in the waning days of the Galactic Republic. He succeeded King Tapalo and was the immediate predecessor of Queen Amidala."}, {"tag": "p", "text": "A proponent of Naboo's greater integration with the rest of the galaxy, Veruna's political career was heavily-financed and guided by Hego Damask II, secretly the Dark Lord of the Sith Darth Plagueis. Veruna was dogged by accusations of corruption in the final year of his reign and ultimately clashed with Plagueis. Veruna formed an alliance with Gardulla the Hutt, the Bando Gora, and Black Sun in an effort to salvage his position and to assassinate Plagueis. However, the assassination attempt failed, and terrified of retribution, Veruna abdicated and fled into hiding. Tracked down by Plagueis, Veruna was murdered by him shortly afterwards."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The election of 65 BBY"}, {"tag": "p", "text": "Ars Veruna was a relation to the Earl of Vis and a member of House Veruna. He was the confidant of Bon Tapalo before Tapalo's ascension to the throne in 65 BBY. Tapalo's campaign supported opening up Naboo's economy to the greater galaxy, and Veruna contacted IBC kingpin Hego Damask—secretly the Muun Sith Lord Darth Plagueis—and Damask Holdings to discuss the possibility of an alliance to export Naboo's plasma reserves."}, {"tag": "p", "text": "Sometime later, Damask and other InterGalactic Banking Clan executives, came to Naboo to formalize their agreement. Damask Holdings ensured that Tapalo became the King of Naboo, with Veruna as governor of Theed. Outer Rim Construction and Assembly and the Trade Federation received contracts to export Naboo's plasma. Over time, however, the alliance came to be seen as exploitative and corrupt: isolationists like Senator Vidar Kim pointed out that the deal allowed the Trade Federation to sell the plasma on at up to twenty times the price it paid the Naboo for it."}, {"tag": "h3", "text": "Governor of Theed"}, {"tag": "p", "text": "In 52 BBY, Veruna attended the funeral of Senator Vidar Kim's family: they tragically had died in an airspeeder crash. After the funeral, he briefly spoke with Ambassador Palpatine—the clandestine Darth Sidious and apprentice to Plagueis—on how Naboo could deal with the Trade Federation. Many Naboo agreed with Kim's assessment that the agreement for exports was exploitative, but with their own arrangements with the Trade Federation, and not wishing to break with Hego Damask, neither Veruna nor Tapalo wished to antagonize it."}, {"tag": "p", "text": "Palpatine suggested that Senator Kim vote against the Trade Federation in a coming Galactic Senate vote to sit several Federation client systems in the Senate: Naboo would appear to have stood up to galactic conglomerates while the Trade Federation's contracts remained unchanged. Veruna agreed, and suggested that he would see Palpatine replace Kim as senator. In return, Palpatine affirmed Hego Damask's support for Veruna as future King of Naboo."}, {"tag": "h3", "text": "King of Naboo"}, {"tag": "p", "text": "Veruna indeed ascended to the throne as King in 46 BBY, largely thanks to a renegotiated contract with the Trade Federation for Naboo's plasma. However, many felt that Veruna had arranged for personal kickbacks from the contract. One of Veruna's first acts in power was to form a state-of-the art Naboo spacefighter corps, unequalled in its quality and technological brilliance by any other starfighter corps in the galaxy."}, {"tag": "p", "text": "At a demonstration of the new N-1 starfighters in 33 BBY with Senator Palpatine, Chief of Security Maris Magneta, and Prime Councilor Kun Lago, Veruna boasted to Palpatine that they would allow the planet to renegotiate its contracts with the Trade Federation from a position of strength. Veruna was increasingly dogged by accusations of corruption and he saw the renegotiation as a chance to regain his position. However, Palpatine warned Veruna that the Galactic Senate was on the point of offering the Trade Federation the right to unlimited armament on its ships in exchange for supporting the taxation of Free Trade Zones. Suggesting that a confrontation would be likely, Palpatine suggested voting against new taxation to stay on the right side of the Trade Federation, or approaching Hego Damask again to help broker a renegotiated deal."}, {"tag": "p", "text": "Veruna was disgusted by the suggestion, fearing that he would be forced from office if he was seen to take the side of the Trade Federation, and had come to utterly loathe Damask for negotiating the initial deals. Veruna bombastically declared to Palpatine that Pax Teem, the late Gran Senator, had done him and all of Damask's enemies a favor in 52 BBY by \"forcing him into an early retirement\", with his brazen attempt on the Muun's life, which had left Damask maimed."}, {"tag": "p", "text": "Unknown to Veruna, this was an attempt by Palpatine to goad him into a confrontation with the Trade Federation that would destabilise the Republic, as well as push him into making an assassination attempt on Damask, aimed at killing his Sith master. With the Naboo increasingly disgusted by Veruna's corruption and the exploitative contract with the Trade Federation, Palpatine began maneuvering to replace Veruna with the thirteen-year-old Padmé Naberrie."}, {"tag": "h3", "text": "Assassination attempt on Plagueis"}, {"tag": "p", "text": "Even as the Foreign Affairs scandal mounted and Padmé Naberrie became increasingly popular, Veruna remained determined not to lose the coming monarchical election. Summoning Palpatine to Naboo as he was en route to the Eriadu Trade Summit, Veruna greeted the senator at a debauched dinner party in Theed Royal Palace, held almost as a counter-event to Padmé's rally outside. Present were Veruna's newest allies: Alexi Garyn of Black Sun, the crime lord Gardulla the Hutt, and members of the Bando Gora terrorist group (not incidentally, all beings who also felt betrayed by Hego Damask). Somewhat intoxicated, Veruna accused Palpatine of having staged the Eriadu summit for the Trade Federation's benefit, and of trying to replace him with Padmé Naberrie. He revealed that, following his reelection, he would recall Palpatine as senator and replace him with Kun Lago. Veruna declared that Naboo would manage its own resources, with Gardulla and Black Sun supervising imports and exports, and the Bando Gora defending its interests in the spacelanes. He concluded by ominously promising that Palpatine would never see Hego Damask again."}, {"tag": "p", "text": "However, Veruna had proceeded exactly as Palpatine had planned: he and his cronies had summoned the courage to attempt to assassinate Damask with a nuclear attack on his Sojourn residence. Palpatine had even provided covert assistance to the plot: the proscribed nuclear device was secured by his Zabrak apprentice Darth Maul. Maul had infiltrated the notorious \"gambling prison\" of Cog Hive Seven in the Tharin sector and, after an extremely challenging series of gladiatorial bouts, had discovered the whereabouts of an ingenious illegal Chiss weapons manufacturer with Black Sun connections, Iram Radique. Maul had then absconded with the bomb and delivered it to Komari Vosa and the Bando Gora. However, Damask survived the bombardment, having been forewarned by Jabba Desilijic Tiure, who was aware of his rival Gardulla's association with the Bando Gora. Damask escaped Sojourn and was retrieved by Jabba's space yacht, Star Jewel."}, {"tag": "h3", "text": "Abdication"}, {"tag": "p", "text": "Having escaped assassination, Damask immediately contacted Veruna from the Star Jewel. Now in fear of his life, Veruna swiftly abdicated the throne and fled into hiding. For decades afterwards, the galaxy at large would believe that Veruna had resigned only due to the Foreign Affairs scandal. He was succeeded by the thirteen-year-old Padmé Naberrie."}, {"tag": "p", "text": "Veruna fled to a secluded ancient castle once owned by his relative, the Earl of Vis, in the Western Reaches of Naboo. Yet the critical thing Veruna failed to understand is that while one can run, one cannot hide from a Sith Lord. For it was indeed there, in the dead of night that Veruna was discovered by Hego Damask."}, {"tag": "h3", "text": "Murder"}, {"tag": "p", "text": "While Palpatine had suggested that they send Darth Maul to deal the final death blow to the treacherous king, Damask insisted that he would attend to the act personally. He was accompanied to Veruna's hideout by his personal droid assistant 11-4D, and silently broken into Veruna's bedroom, waking the old man from his sleep. Sitting by his side, and speaking to him in oddly comforting tones as if he were a loving patron or caring physician, Damask revealed his true identity as Darth Plagueis to the horrified Veruna. Plagueis then manipulated the limited amount of midi-chlorians in the former monarch's body. Veruna died a slow and painful death as Plagueis drove his life-force from his body by midi-chlorian manipulation of a kind that had never before been attempted. Plagueis last words to Veruna were a declaration that the dark side had anointed him to be his \"shepherd\", guiding him to death's door, across which threshold, Veruna alone must pass, for Plagueis would then take leave of him, forever."}, {"tag": "p", "text": "Beyond vengeance, Veruna's death also served as a means to exacerbate the already-catastrophic debacle that was the Eriadu Trade Summit, where all-but one of the Trade Federation Directorate had been assassinated in full public view before the conference had even begun. The new Queen Amidala led the call for taxation of the Free Trade Zones, which was of course echoed by her senator, Palpatine. As Darth Sidious, Palpatine claimed to Trade Federation Viceroy Nute Gunray that Veruna may have been able to stall the Senate, but implied that taxation was now inevitable. Sidious thus incensed the Neimoidians enough to attempt an blockade of Naboo in protest, exactly as he had planned when he began manipulating Veruna years before."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Captain Maris Magneta, who had been the head of Veruna's security force, stepped down following Veruna's death and was replaced by Quarsh Panaka. It was partly the mystery surrounding Veruna's death that led Panaka to create the idea of decoys for Queen Amidala, a measure of protection that she would continue to use well into her stint as Senator."}, {"tag": "p", "text": "Veruna's reign, although it coincided with the opening up of Naboo to the outside galaxy (and was marked by the construction of Kwilaan Starport in the city of Keren), was not fondly remembered by the people of Naboo. As a result, legislation that limited monarchs to two four-year terms was passed. Ironically, Veruna was succeeded by the popular Queen Amidala, who won popular support enough to serve past the two established terms, though she ultimately refused."}, {"tag": "p", "text": "One year after Veruna's death, in 32 BBY, the Zabrak Sith apprentice Darth Maul had learned from Magneta that Veruna was mysteriously killed by the Muun Hego Damask, who was known to be an ally to his master, Darth Sidious. This led Maul to correctly deduce that Damask was in fact a Sith Lord, and that Palpatine was disobeying the Sith Rule of Two, keeping Maul only as an assassin and not as a true apprentice."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Veruna was an outward-looking man, seeing integration with the wider galaxy as being the best way to enrich both Naboo and himself. He embraced modernity, often against public opposition, developing a state-of-the-art new starfighter corps for Naboo and opening negotiations with offworld businesses to export plasma. He was also quite arrogant, describing his opponents as \"regressives... (dreaming) of the Naboo of fifty years ago\". He regarded his successor, Padmé Naberrie, as \"a political upstart\", and referred to her as a \"daughter of mountain peasants\". His petty conceit was such that he ordered a flypast of N-1 starfighters over Theed just to disrupt one of her speeches. Following Hego Damask's injury and retirement from public life, he haughtily dismissed the Muun's influence, to his eventual, fatal cost. Veruna's pride meant that he could be manipulated: Palpatine flattered him into creating the starfighter corps, which in turn gave him the confidence to oppose the Trade Federation. When Palpatine advocated restraint, Veruna's pride led him to intensify his opposition to the Trade Federation and risk a destabilizing confrontation, exactly as Palpatine and Darth Plagueis had planned."}, {"tag": "p", "text": "Veruna's opponents, especially Cosinga Palpatine, considered him corrupt: he admitted to Palpatine that he did not wish to antagonise the Trade Federation, despite their exploitation of his planet, because he had forged his \"own arrangements\" with them. Despite opposition by the Naboo people to the exploitative contract with the Trade Federation, Veruna did not act to renegotiate the contract until he had forged connections elsewhere. Palpatine suspected that Veruna had taken kickbacks from the Nubian Design Collective for the creation of Naboo's new starfighter fleet. Even as Padmé Naberrie rallied against his corruption, he still hosted Gardulla the Hutt, the Bando Gora, and Black Sun at Theed Royal Palace."}, {"tag": "p", "text": "While Ars Veruna was a very ambitious man politically, and was prepared to consort with criminals and terrorists to achieve his goals, he also made it very clear that there were certain boundaries he would not cross. He was wary of the Sith and their legacy, to the extent that, shortly before being murdered by Darth Plagueis, he stated that no matter how desperate he may have been in his political career or personal ambitions, he would never have allied himself with Hego Damask (the public identity of Darth Plagueis) had he known beforehand that he was a Sith Lord."}, {"tag": "p", "text": "Veruna was a man of medium height, with blue eyes and long brown hair that faded to silver later in life. He wore a thick and lengthy beard. Like most Naboo he favored rich clothing, some of which bore brocade and Futhork calligraphy. Though to the end of his life he regarded him as a pawn, Palpatine remarked that the older Veruna \"still cut a fine, swashbuckling figure\"."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "King Veruna was first mentioned in the 1999 novel Star Wars Episode I Journal: Queen Amidala, written by Jude Watson. The novel implied that Veruna was sent to prison for corruption, with a line that he was \"farming rocks in the Naboo Wastelands.\" The 2012 novel Darth Plagueis by James Luceno revealed his first name of Ars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}