{"url": "Arsin_Crassus", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Bureaucrats of the Galactic Empire", "Category:Financial professionals", "Category:Individuals of unspecified species", "Category:Males", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Arsin Crassus"}, {"tag": "p", "text": "Arsin Crassus was one of the main money lenders within the Galactic Empire, who help facilitate the running of the Imperial economy. He performed this role for decades up to the Rebellion on Akiva. During his youth, he was employed by the Trade Federation. At the end of the Clone Wars, Crassus had a hand in luring the Separatist leadership to Mustafar where they were executed by Darth Vader. He then plundered their financial accounts and used them to help fund the newly risen Galactic Empire. Besides being a financier, Crassus was also involved in slavery. Following the Battle of Endor, Crassus took part in an Imperial emergency summit on the planet Akiva. He was killed along with Valco Pandion during the New Republic's assault on Imperial forces on Akiva."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imperial financier"}, {"tag": "p", "text": "Arsin Crassus was born during the last decades of the Galactic Republic. In his youth, he was employed by the Trade Federation, which later joined the Confederacy of Independent Systems. At the end of the Clone Wars, Crassus lured the Separatist leadership to the volcanic planet of Mustafar where they were decimated by Darth Vader. Crassus then channeled the former Confederacy's financial resources into helping prop up the new Galactic Empire. Crassus became an important financier during the Age of the Empire and helped run the Imperial economy. In addition, Crassus was also involved in the slave trade."}, {"tag": "h3", "text": "Summit on Akiva"}, {"tag": "p", "text": "Following the Battle of Endor, Arsin Crassus was among a select group of high-ranking Imperial officials who had been invited by Admiral Rae Sloane to attend a secret emergency summit on the planet Akiva. Crassus traveled to Akiva in his personal luxury yacht, the Golden Harp. Per Sloane's instructions, he landed at a landing pad outside Satrap Isstra Dirus' palace in the capital city Akiva. Upon landing, he was greeted by Satrap Isstra and exchanged jokes and laughter. Shortly later, he was joined by the Emperor's adviser Yupe Tashu, General Jylia Shale and the self-proclaimed Grand Moff Valco Pandion, who arrived in their shuttles."}, {"tag": "p", "text": "Unknown to Crassus and the others, they were being tracked by the Zabrak bounty hunter Jas Emari, who was now working for the New Republic; the government created by the Rebel Alliance. However, Admiral Sloane arrived in her Lambda-class shuttle and opened fire on Jas, causing her to fall off the tower she was hiding on. Crassus and his fellow delegates entered the dining hall of the Satrap's Palace where Isstra had provided a banquet of tentacled creatures, fragrant dumplings, and speckled balls. While the other Imperials touched the food, Crassus devoured his share. Crassus and his fellow Imperials express surprise when Admiral Sloane revealed she had captured the New Republic starfighter pilot Wedge Antilles above Akiva. He accepted Sloane's explanation that Wedge was acting alone and posed not threat to the upcoming Imperial summit, which Sloane called the Imperial Future Council."}, {"tag": "p", "text": "Later, the Imperial delegates received news that Rae's Imperial Star Destroyer Vigilance had shot down two rebel A-wing scout fighters. Panicked by the news, Crassus stood up and urged his fellow Imperials to end the meeting. He confessed that he was no warrior but was merely a merchant. Sloane ordered him to sit down while Pandion derided him as a coward. During the meeting, Crassus voted with Pandion to deploy the Imperial Navy's last remaining Super Star Destroyer Ravager to the Akiva system. However, the two were outvoted by Sloane, Shale and Tashu; who decided to hide their Star Destroyers in hyperspace instead."}, {"tag": "p", "text": "After dinner, Crassus and Shale argued about the merits of using the remaining Imperial coffers to bribe the galaxy. When Crassus suggested a truce with the New Republic, Shale responded that the Republic was only interested in destroying the Empire and hunting down and trying Imperial officials and military officers as war criminals. When Crassus began pounding his knuckles on the table, Sloane angrily told him to stop making a nuisance of himself. After Crassus began sulking, Pandion backed up Sloane and warned the financier that he would break his other hand if Crassus did not desist. When Tashu proposed that the remnants of the Empire retreat to the Unknown Regions to seek out the source of the dark side of the Force, Crassus mocked the suggestion that the Imperials should pack up their ships and run away like fearful little children."}, {"tag": "h3", "text": "Fleeing Akiva"}, {"tag": "p", "text": "On the morning of the Imperial Future Council, Crassus and his fellow delegates received news from Admiral Sloane that Imperial forces had destroyed a New Republic transport above Myrra. When Sloane insisted that they had nothing more to be concerned about, Crassus contended that the Rebel Alliance still posed a threat. Pandion then added that the rebels would send a fleet and proposed that the Empire send an Imperial fleet including the Super Star Destroyer Ravager to shore up the Imperial presence on Akiva. While Crassus agreed with Pandion's insistence on a military show of force, Sloane responded that the New Republic had a military advantage and pointed out that they had already lost their communications station on Akiva."}, {"tag": "p", "text": "The delegates then proceeded with their summit but made little progress due to the outbreak of a rebellion on Akiva. With a mob rampaging outside the Satrap's Palace and their shuttles destroyed by the New Republic pilot Norra Wexley, Crassus and Pandion demanded that Admiral Sloane deploy Imperial reinforcements to Akiva. However, Sloane overruled them and ordered that they leave on Crassus' ship Golden Harp. When Crassus protested, Sloane reminded him that he was not a \"true Imperial\" and added that he was nothing more than a moneylender and a banker. After Sloane fired a warning blast, Crassus reluctantly complied and ordered his pilot to summon the Golden Harp, which was a system away. The yacht arrived within an hour."}, {"tag": "p", "text": "After the Golden Harp arrived in Myrra, Crassus and the remaining Imperials traveled in the ship's passenger compartment. They were accompanied by several rebel prisoners including Norra Wexley, Sinjir Rath Velus, and Jas Emari. Crassus was tended by his two slaves who trimmed the nails of his feet and shaved the calluses from his toes. When the Golden Harp was hit by enemy fire, Crassus whined about the damage to his ship. He was present during an altercation between Pandion, Sinjir and Jas. Crassus protested when Pandion offered Jas 20,000 credits to execute Sinjir, who had been an Imperial loyalty officer who had deserted his post on Endor. Before the fight could escalate, the stricken Golden Harp crashed into the hangar bay of Sloane's Star Destroyer Vigilance. Crassus along with most of the stormtroopers were killed by the impact of the crash."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Arsin Crassus was a big, obese man with a black beard, plump feet, and calluses on his toes. He wore a glittering long robe which trailed behind him like a peacock. He often traveled with his own bodyguards: enslaved women who wore hardened-lacquer animal masks. He owned an extravagant space yacht called the Golden Harp which he used as a personal transport. Crassus was a glutton who was known to eat a lot of food in a single sitting. Crassus regarded himself as a merchant rather than a warrior. Thus, he was reluctant to see action unless his side had superior firepower and resources. Crassus was also uncouth and was known to bang his knuckles on the table when arguing. He was also immature and could be sulky when reprimanded by others."}, {"tag": "p", "text": "Crassus' Imperial colleagues particularly Admiral Sloane looked down on him with disdain, regarding him as little more than a moneylender and banker. He was also a consumer of spice which he smoked through a long obsidian pipe. During the retreat from Akiva, Crassus was initially unwilling to lend his fellow Imperials his yacht, the Golden Harp. Despite his protests, Crassus acceded to Sloane's demands when she fired her blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arsin Crassus first appeared as a minor antagonist in Chuck Wendig's 2015 novel Aftermath. While he was killed off in that story, the novel's 2016 sequel Aftermath: Life Debt mentioned that he had been taken prisoner by the New Republic and assassinated by the undercover Imperial agent Windom Traducier. This discrepancy has not yet been resolved by the Lucasfilm Story Group. Crassus was named after Marcus Licinius Crassus, a politician who is thought to have been the richest man in Roman history, and formed the so-called First Triumvirate with Julius Caesar and Pompey."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}