{"url": "Mine_Type_C", "categories": ["Category:Legends articles", "Category:Arakyd Industries products", "Category:Space mines"], "nodes": [{"tag": "h1", "text": "Mine Type C"}, {"tag": "p", "text": "The Mine Type C, or Mn/T3, was an uncrewed static defense weapon produced by the armaments manufacturer Arakyd Industries."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A stationary mine armed with an omni-directional laser cannon, the Mn/T3 was an inexpensive anti-intruder countermeasure. The laser cannon provided defense against starfighters, and the contact detonation system was effective against capital ships, especially when the Mn/T3 was deployed in a large minefield."}, {"tag": "p", "text": "The Mn/T3 was a far more formidable defensive weapon than either the Mn/T1 or the Mn/T2, because when its hull integrity was compromised by laser fire, it immediately launched a light countermeasure warhead at the attacking craft."}, {"tag": "p", "text": "The Type 3 was also smaller and slimmer than the other types of Arakyd mines, making it even more difficult to target."}, {"tag": "h2", "text": "Deployment"}, {"tag": "p", "text": "The Type 3 was more expensive than the others, due to its more complex systems and warhead payload."}, {"tag": "p", "text": "Thus, it was often deployed in smaller numbers in amongst a large spread of Type As or Type Bs. This was a strategic consideration, because, during a minesweeping mission a pilot might not notice the Type Cs among the swarms of other mines. While a single one of these warheads was unlikely to destroy a shielded craft such as an X-wing, if several of these mines were destroyed in quick succession by an unwary pilot, they might find themselves critically damaged by the volley of warheads released."}, {"tag": "p", "text": "By the time the Empire developed the TIE/D Defender, Type C Mines were fitted with advanced concussion missiles, which proved extremely perilous at close range, even for fast and shielded craft. Only Missile Boats could safely clear these minefields. From a far distance, they used one missile to destroy the mine itself, and a second missile to take out the newly launched warhead. As a last resort, Missile Boats could engage the SLAM acceleration system to outrun mine warheads that they could not intercept in time."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Type 3 Mines were deployed by the Rebel Alliance as part of the defensive screen for the MC40a light cruiser Lulsla. It did hold up the Imperial Assault Gunboat attack but not for long, as most Imperial pilots opted wisely to ignore the minefield itself, being able to launch heavy rockets at the Rebel cruiser from a safe distance. Maarek Stele, however, had to brave the minefield in order to capture the Rebel officers attempting to escape their doomed vessel."}, {"tag": "p", "text": "Ali Tarrak's TIE Defender factory was well defended by a minefield of Type C's, alongside her fighters, and the facilities own turbolasers and anti-warhead launcher. Maarek Stele in his Missile Boat was instrumental in eliminating all of these defenses so unshielded TIE/sa bombers could safely make their bombing runs against the facility itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}