{"url": "Mine_towns", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Galactic Empire cities", "Category:Mimban locations", "Category:Unidentified cities"], "nodes": [{"tag": "h1", "text": "Mine towns"}, {"tag": "p", "text": "The five mine towns contained the human population of Mimban. They were established and overseen by the Galactic Empire, and consisted primarily of miners operating the energy drill and other mine equipment gathering resources for the Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "When the Galactic Empire set up a mining operation on Circarpous V, also known as Mimban, they required housing for the many miners that would operate their energy drill and other equipment, as well as Stormtroopers and other Imperial officials to administer the Empire's interests. For this purpose the five mining towns were established. Since Imperial operations on Mimban were secret, the towns catered to no visitors beyond the occasional migrant from one of the other towns. Indeed, outsiders would find themselves subject to arrest."}, {"tag": "p", "text": "Law in the towns was lax. The Captain-Supervisor believed that it was necessary for miners to blow off steam every so often, and so a blind eye was turned toward brawls or roughhousing. Use of deadly weapons, however, or other more serious crimes brought swift arrest and punishment."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Long before the Galactic Empire came to Mimban an unknown race constructed gray-stone ruins and temples across the surface. This race may have been related to the Thrella, who made the Thrella wells, but the Empire believed whatever race constructed them is long extinct."}, {"tag": "p", "text": "By 2 ABY the Empire had discovered that Mimban contained materials valuable enough for energy mining. Energy mining was illegal on worlds with a native population, such as Mimban, and so the Empire decided to keep their operation a secret from the rest of the Circarpous system, particularly the inhabitants of Circarpous IV and Circarpous X. To facilitate this deception they constructed the five mining towns and the mining equipment, particularly the energy drill, to be shut down if any starships passed within several planetary radii of Mimban. Mimban's naturally thick atmosphere provided another layer of concealment, and the fallout from the energy drill would also short-circuit any starship entering Mimban's atmosphere."}, {"tag": "p", "text": "Although the Galactic Empire set up a small science outpost among the five towns, they were not particularly interested in the history of the planet or its inhabitants. The Coway stayed clear of the mining towns, and the Mimbanites were quickly subjugated. In 2 ABY Captain-Supervisor Grammel administered the five towns efficiently, and gained a reputation for cruelty that kept the miners in line."}, {"tag": "p", "text": "While en route to a conference between the Alliance to Restore the Republic and various Circarpous resistance groups, Princess Leia Organa suffered a malfunction to her Y-wing. She detected a landing beacon from the five towns and, incorrectly assuming it was a small automated station or scientific outpost, she and her droid companion C-3PO changed course to land on Mimban. Luke Skywalker and R2-D2, accompanying her in an X-wing, followed. Both were affected by the energy drill's electromagnetic discharge and crashed."}, {"tag": "p", "text": "While passing themselves off as miners, Luke Skywalker and Princess Leia Organa were approached by a force-sensitive woman named Halla, who sought their help in recovering the legendary Kaiburr crystal. Before they could assist her, however, they were arrested and brought to Imperial headquarters. Captain-Supervisor Grammel soon saw through their miner disguise, and threw them in jail. Grammel soon discovered their true identities, from his superiors, and was ordered to keep them imprisoned until Darth Vader could arrive to collect them. Princess Leia Organa and Luke Skywalker had befriended two Yuzzem captives, Hin and Kee, and with their help they were able to escape despite Grammel's best efforts. Halla stole a swamp crawler, and the Rebels successfully escaped the five mine towns with Grammel and Darth Vader following after."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The population of the five towns was mostly human, including miners, other workers, and servants. There were a few non-human workers like Hin and Kee. There was also a population of Mimbanites, a species native to Mimban. They had become degraded by Imperial oppression, and many were addicted to alcohol, debasing themselves to get a fix from the miners. The other known sentient natives of Mimban, the Coway, avoided the towns altogether."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The towns were built among ancient gray-stone ruins. One of these ruins was used to house the Imperial headquarters and prison, near one of the towns. From there the Captain-Supervisor could properly administer mining operations. The towns also included residencies, shops, and taverns that catered to the miners. A small scientific station had been established in the towns as well, to study the Mimban ruins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}