{"url": "Mining_Guild", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Commerce Guild corporations", "Category:Mining companies"], "nodes": [{"tag": "h1", "text": "Mining Guild"}, {"tag": "p", "text": "The Mining Guild was a network of miners operating in concert with the Galactic Empire, that harvested natural resources throughout the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "At the start of the Clone Wars, the Mining Guild dominated billions of young, nameless, metal-rich planets in the spiral arms of the galaxy."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "In 3 BBY, the Guild ran an Asteroid Belt Gas Refinery located on a small planetoid, where they extracted Clouzon-36 gas. However, that facility was discovered by the Spectres, a crew of anti-Empire freedom fighters, who stole its fuel for the rebellion and destroyed the complex. Despite the loss of that Clouzon-36 refinery, the Mining Guild remained powerful."}, {"tag": "p", "text": "The Mining Guild regularly patrolled the Sereeda Waypoint, a hyperspace waypoint located in their claims territory. In 2 BBY, the Spectres once again clashed with the Guild, this time in the Sereeda, as they had to momentarily come out of hyperspace there and recalculate their jump. The Guild deployed two TIEs and demanded the rebels pay the hyperspace toll, however the Spectres destroyed the fighters and jumped back into hyperspace."}, {"tag": "p", "text": "After being rejected by the Bounty Hunters' Guild and the Grand Hutt Council, General Davits Draven of the Alliance wrote to Senator Mon Mothma about being potential allies with the Mining Guild, claiming, that while the Mining Guild operated under the Empire, it was more of a convenient relationship, not an ideological one. At the time of the later, the Alliance was investigating Mining Guild operations on Ord Mantell, Raxus Prime, The Wheel, Vergesso, the Ring of Kafrene, Smuggler's Run, Takodana, and Nar Shaddaa."}, {"tag": "p", "text": "Cloud City, a tibanna gas mining operation in the atmosphere of the planet Bespin, was able to keep its activities small and avoid being part of the Empire or Mining Guild. This was pleasing to its customers, who did not want to gain attention."}, {"tag": "h3", "text": "Era of the Resistance"}, {"tag": "p", "text": "By the rise of the First Order and the creation of the Resistance, the Mining Guild was still active, and, according to the Resistance, was not what it once was. Vice Admiral Amilyn Holdo believed that this allowed the stronger possibility that the Mining Guild would accept a partnership with the Resistance."}, {"tag": "p", "text": "By the time following the Battle of Crait during the war between the First Order and Resistance, the guild had been mining the moon of Kyzring, which was rich with carnium, for years. The guild would take what it could use, and Poe Dameron recounted this information to fellow Resistance member Rey while on a training mission."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Thanks to its association with the Empire, the Guild was allowed to use a special variant of the Imperial TIE fighter modified with a yellow color scheme and 2 notches out of the wings. For more security purposes, the Mining Guild also used yellow Aurore-class freighters and X4 Gunships. On Lothal in 1 BBY,[source?] the Mining Guild utilized ore crawlers for the scouring of the terrain for raw materials, as well as Mining Guild excavation drillers for large scale operations. For security on the crawlers, yellow IG-RM droids with weak audio receptors were used."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}