{"url": "Ministry-class_orbital_shuttle", "categories": ["Category:Legends articles", "Category:Galactic Republic starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Ministry-class orbital shuttle"}, {"tag": "p", "text": "Ministry-class orbital shuttles were standard issue orbital shuttles produced by the Zentine Dynamics shipyards at Foerost and used by Galactic Republic after the Great Sith War and during the conflicts that followed it."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A typical orbital shuttle could travel through atmosphere and space, but not through hyperspace, as they lacked a hyperdrive unit. The ship's large side wings folded out at takeoff and were retracted for landing, much like those on the Lambda-class shuttle and Sentinel-class landing craft of four millennia later."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Several craft were present at Flashpoint Station among other Republic spacecraft captured by the Mandalorians. One particular shuttle was destroyed as part of Marn Hierogryph's plan to convince the Mandalorians that all Republic ships on the station were booby-trapped, using an explosive planted by Zayne Carrick (disguised as Demagol)."}, {"tag": "p", "text": "In 3960 BBY, the Jedi Exile used a Ministry-class orbital shuttle to get to the High Council Chamber in the Jedi Temple, where she stood trial before the Jedi High Council."}, {"tag": "p", "text": "When the Telosian Restoration Project got underway, these shuttles were used to transport project-related personnel between Telos's Restoration Zones and Citadel Station as well as civilians traveling from module to module within the vast station itself. Some older shuttles, presumably left after the infamous Bombing of Telos IV, were also hidden in abandoned underground military bases."}, {"tag": "p", "text": "During her forced stay on Telos in 3951 BBY, the Exile and her companions used two orbital shuttles (both shot down and crashed) to reach the location of her stolen ship, the Ebon Hawk, which turned out to be the Telosian Jedi Academy. Later, in the Battle of Telos IV, the Exile, Visas Marr, and a group of Mandalorians led by Canderous Ordo, using a similar shuttle, boarded Darth Nihilus's flagship, the Ravager."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}