{"url": "Mira_Bridger", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Bridger family", "Category:Females", "Category:Humans", "Category:Lothalites"], "nodes": [{"tag": "h1", "text": "Mira Bridger"}, {"tag": "p", "text": "Mira Bridger was a human female from the Outer Rim planet of Lothal who was an outspoken opponent of the rule of the Galactic Empire. She and her husband, Ephraim, broadcast underground revolutionary messages against the Empire, and these actions were supported by Lothal's governor, Ryder Azadi. Because of their broadcasts, the Bridgers and Azadi were arrested and imprisoned by the Empire. This left their son, Ezra, to fend for himself on Lothal for nearly a decade."}, {"tag": "p", "text": "While in prison, Mira and Ephraim eventually learned that Ezra had become part of a rebel cell that fought against the Empire on Lothal. They heard a message of rebellion that he broadcast to Lothal and nearby star systems, a broadcast that inspired them to fight for their freedom from Imperial activity. Mira and her husband led a prison revolt that led to dozens of prisoners escaping, but Mira and Ephraim were killed during the escape."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mira Bridger was married to Ephraim Bridger and the two had one son, Ezra, who was born on the day that the Galactic Empire rose to power. When the Empire took control of the Bridger's homeworld of Lothal, a planet in the Outer Rim Territories, Mira and Ephraim became outspoken opponents of its rule, and the earliest rebels in the system. In 14 BBY they began to broadcast underground messages that spoke out against the Empire, and these revolutionary tactics were supported by Lothal's governor, Ryder Azadi. These activities led the Empire to send stormtroopers after them, and the Bridgers, along with the governor, were arrested for treason. A close friend of the Bridgers, a Rodian named Tseebo, promised to watch over Ezra, but he became fearful of the Empire and failed to look out for the boy. This left Ezra, only seven years old, to live on his own for the better part of a decade."}, {"tag": "p", "text": "Several years later, while still in prison, Mira and Ephraim learned that Ezra was part of a rebel cell that fought against the Imperial Military on Lothal. He transmitted a message of rebellion to Lothal's citizens, urging them to stand up and fight for their freedom. This message traveled all across the galaxy, reaching and inspiring so many people, and finally made its way to the prison where the Bridgers were held. Mira and Ephraim, who for years had tried to help their fellow prisoners, knew that the voice was that of their son's because his words mirrored their own from so many years prior. Inspired by what Ezra said, Mira and Ephraim organized a prison break that led to dozens of prisoners, including Azadi, escaping to freedom. The Bridgers, however, were separated during the escape, and they refused to leave until everyone else had escaped. By the time their fellow prisoners were free, Mira and Ephraim had already been killed."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "For years, while his parents were in captivity, Ezra did not want to know what happened to them, as he believed he would not be able to survive on his own if he held out hope that Mira and Ephraim would one day return to him. He did finally start to learn answers after encountering Tseebo, who went to work for the Imperial Information Office and stole critical information in the hopes of making up for his failure to help Ezra. Ezra did not initially learn what Tseebo knew about the Bridgers' captivity, but the boy later learned about it from his Jedi teacher, Kanan Jarrus, and rebel captain Hera Syndulla. This revelation coincided with a vision of his parents that he received at the same time they were killed. The vision led him back to Lothal, which he and the rebels previously abandoned."}, {"tag": "p", "text": "It was on Lothal that Ezra found Azadi, who had also returned in the hopes of finding Ezra so he could tell the boy what happened to Mira and Ephraim. Azadi explained what happened during the prison revolt and Ezra was grateful to know the truth, but he was nonetheless heartbroken by the loss of his parents. Soon after learning of their fates, he had another vision where he saw Mira and Ephraim through the Force, telling him that they were proud of him and urging him to remain strong. Ezra did not understand, at first, how he could see his parents, but Jarrus told him that the Jedi taught how life did not end at death but merely transformed into something new in the Force. Mira and Ephraim would always be with him, even if he could not see them."}, {"tag": "p", "text": "In 0 BBY, during the Liberation of Lothal, Ezra was welcomed aboard the Chimaera to talk with Emperor Sheev Palpatine about an offer he wanted to make. Attempting to lure the young Padawan to his trap by enter into the remains of the Lothal Jedi Temple, where Bridger heard the voice of Mira, calling him and telling him that she was baking his favorites. However, Ezra realized that it was just a lie because he sensed his parents' death and turned down Palpatine's offer before calling the purrgil to remove Grand Admiral Thrawn's Imperial forces from Lothal."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mira Bridger was a human female with purple eyes and tan skin, and she wore a headpiece that covered her head. She was an outspoken opponent of the Empire's rule of Lothal, leading to her arrest and imprisonment with her husband. Even in prison, however, the Bridgers continued to stand up for other people, up until the point that they were killed in the prison revolt that they led so others could gain their freedom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mira Bridger was first heard, and pictured in a hologram, in \"Empire Day\" and \"Gathering Forces,\" episodes of the first season of the animated television series Star Wars Rebels. She is voiced by actress Kath Soucie. The character was first depicted in non-holographic form in the young reader novels Adventures in Wild Space: The Steal and Adventures in Wild Space: The Dark, which take place chronologically many years before the events of Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}