{"url": "Miraj_Scintel/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems individuals", "Category:Females", "Category:Queens of Zygerria", "Category:Slavers", "Category:Zygerrians"], "nodes": [{"tag": "h1", "text": "Miraj Scintel"}, {"tag": "p", "text": "Miraj Scintel was a female Zygerrian queen who was the ruler of the planet Zygerria during the time of the Clone Wars. In an attempt to reestablish Zygerria's prominence as a slave empire, Scintel made a bid to join the Confederacy of Independent Systems. She enslaved the Jedi Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Zygerrian, Miraj Scintel took the throne of Zygerria sometime before the start of the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. As the Confederacy gained momentum, Queen Scintel saw an opportunity to reestablish Zygerria's ancient slave empire and concocted a plot to gain allegiance with Separatist leader Count Dooku. Dispatching Commander Darts D'Nar to the Togruta colony world of Kiros, Scintel ordered him to capture the colonists and return them to Zygerria so they could be sold to Dooku at auction."}, {"tag": "p", "text": "Following the invasion of Kiros and the transfer of the slaves to a processing plant on Kadavo, a group of Jedi infiltrated Zygerria and Scintel's palace. Posing as a slaver named Lars Quell, Jedi Knight Anakin Skywalker proposed to sell his Padawan Ahsoka Tano, who was also disguised as a Togruta slave, to Scintel. The queen, intrigued by Skywalker's offer, accepted the slave and requested \"Quell\" remain at her side for a time. During their walk about the palace, a young slave girl attempted to assassinate the queen, only to be stopped by Skywalker. The Twi'lek girl, fearful of remaining a slave and being punished, leaped from the ramparts to her death. While Jedi Master Obi-Wan Kenobi and clone trooper Rex infiltrated the nearby slave pits, Jedi Skywalker continued to warm up to Scintel in hopes of discovering the locations of the missing Kiros slaves."}, {"tag": "p", "text": "Accompanying Scintel to the auction house, Skywalker witnessed the brutality of Scintel's empire when Master Kenobi, whose cover was blown earlier in the slave pits, was ordered to be beaten on the bidding floor. Scintel ordered Skywalker to show his loyalty to her through beating the Jedi and was shocked when Skywalker revealed his identity as a Jedi. As his comrades leaped to defend him from the throng of guards, Padawan Tano attacked Scintel; the queen had already had the Jedi girl's neck fitted with a shock collar and simply activated it to render her inert. With Tano unconscious and the Jedi subdued, Scintel ordered Skywalker to be taken back to her chambers in the palace and the others separated and imprisoned as slaves. Scintel waited for Skywalker to wake in her chambers, offering him an appointment as her personal bodyguard. While the Jedi resisted at first, using the Force to telekinetically strangle her, Scintel persuaded him by threatening to have his friends executed should she die. During their time together, Scintel began to drift closer to Skywalker, deducing that he was once a slave before he became a Jedi. Despite her efforts to convince the Jedi to see the galaxy as she saw it, Skywalker rebuffed all her flirtatious advances even when she offered to free his friends if he swore fealty to her."}, {"tag": "p", "text": "Scintel's affections for Skywalker did not go unnoticed; Prime Minister Atai Molec feared the queen had been weakened by the Jedi and contacted Count Dooku to rectify the problem. Upon Dooku's arrival, Scintel confiscated Skywalker's lightsaber and dismissed him from her court. Scintel received Dooku in her throne room and detailed her plot to enslave the Jedi as she did Kenobi and Skywalker, crushing the Order and then the Republic. Dooku deemed her plan too ambitious, made it plain he was only interested in eradicating the Jedi Order, not enslaving it, and—seeing through her thinly veiled emotions for Skywalker—demanded that he be disposed of. Infuriated by Dooku's brash statements and Minister Molec's betrayal, Scintel revealed an electro-whip clipped to her belt and attempted to attack the Count, but was quickly disarmed and throttled with the Force. As she struggled to breathe against the Count's hold, Skywalker burst into the chamber and, unconcerned by the Count's threat to kill her unless he surrendered, attacked Dooku with the electro-whip, but was quickly disarmed."}, {"tag": "p", "text": "No match against Dooku without a weapon, Skywalker was surrounded by palace guards but managed to abscond from the chamber with the queen before being felled. Fleeing the palace and boarding the ship he arrived in, the Tecora, Skywalker and his freed Padawan Tano prepared to take off in search of Kenobi and the Togruta colonists. The dying queen revealed the location of the slaves before succumbing to her injuries. With her last breath, she acknowledged that she had become a slave just like Skywalker himself."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Miraj Scintel was a typical Zygerrian: she strongly believed the natural order was for the strong to dominate the weak. She was extremely proud of her people's ways and relished her status as queen. Although she knew most others saw the Zygerrians traditions of slavery primitive, Scintel believed that slavery brought purpose to those with an innate desire to serve. Like most of her race, she was ruthless and had no qualms about using brutal and malicious methods to achieve her goals. She treated her personal slaves with cruelty and made a point of showing them their place; such was her treatment that one even committed suicide after a failed attempt to kill her."}, {"tag": "p", "text": "Due to her Zygerrian nature and royal status, Scintel was extremely arrogant, believing that any person could be brought to submission with the proper methods and tools. Thus she did not enjoy being given orders from anyone and was firm in making her own decisions. Ultimately, this trait proved to be her undoing, when she made Anakin Skywalker her slave and imprisoned his friends despite Count Dooku ordering her to kill them and warning her of the consequences, an order the queen angrily ignored, causing the Count to kill Scintel for her defiance. However, she was not an entirely cruel person, as she revealed the locations of Togruta slaves before she expired. Despite being Zygerrian, she was able to realize the folly of slavery when betrayed by Dooku and Atai Molec and acknowledged this to Anakin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Miraj Scintel was voiced by Rajia Baroudi in Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}