{"url": "Mirage_(starship)", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Starfighters"], "nodes": [{"tag": "h1", "text": "Mirage (starship)"}, {"tag": "p", "text": "Mirage was one of two starfighters attached to the Mistryl Shadow Guard team led by Manda D'ulin, and flown by the Mistryl warrior-woman named Cai and the astromech droid D4."}, {"tag": "p", "text": "It is not known what class of ship Mirage was, but it was apparently relatively large as fighter-class ships went. It could masquerade easily as a civilian transport, and although it could be flown and fought by just a pilot and an astromech, it was capable of accommodating two or three more crew/passengers, plus equipment including a variety of infiltration disguises, and even an old landspeeder."}, {"tag": "p", "text": "Nevertheless, cargo space aboard Mirage was somewhat limited, and this caused problems for the Mistryl in 0 BBY, when they were trying to transport a module from the Hammertong superlaser prototype off Tatooine, a shaft five meters long with a three-meter diameter. Realizing that they needed to hire a freighter, Shada D'ukal and Karoly D'ulin traveled to Mos Eisley, disguised as the Tonnika sisters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Hammertong: The Tale of the \"Tonnika Sisters\", it is implied that an entire team of six Shadow Guard warriors traveled aboard just two fighter-sized ships, Mirage and Skyclaw. If Skyclaw was the same two-seater SoroSuub Preybird later acquired for Mazzic by Shada, then Mirage must have regularly carried four people, plus an astromech and a speeder. It certainly seems to be taken for granted in the story that the ship could transport Shada and Karoly as well as Cai and her astromech."}, {"tag": "p", "text": "A reference to \"hatchway deflector shields\" may mean that the ship was accessed by full-height hatches rather than via an opening cockpit canopy, but this could also refer to the Strike Cruiser that the fighter was then parked alongside. Also uncertain is whether Mirage had an independent navicomputer; in Hammertong, Cai shows no concern about making a jump to lightspeed without her astromech aboard, but she may have expected to receive navigation calculations from the transport that she was then flying escort for."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}