{"url": "Miraluka/Legends", "categories": ["Category:Legends articles", "Category:Expansion Region species", "Category:Force-sensitive species", "Category:Human and Near-Human species", "Category:Miraluka"], "nodes": [{"tag": "h1", "text": "Miraluka"}, {"tag": "p", "text": "The Miraluka were a Near-Human, Force-sensitive species. Their language was Miralukese, although some, like Visas Marr and the Dark Jedi Jerec, preferred Basic."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Miraluka were a Near-Human species that differed from Humans in that they lacked eyes, only retaining vestigial eye sockets, and perceived the environment around them through Force sight instead of regular vision. This vision was so strong that if a Miraluka looked upon a Jedi or Sith, they could \"see\" Force radiating off them. The strength of a Miraluka's connection to the Force varied by individual."}, {"tag": "p", "text": "Miraluka, as Near-Humans, could interbreed with baseline humanity. Humans with Miraluka blood included Krynda and Lucien Draay. It was said that such mating would result in difficulties for the offspring."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Their adopted homeworld was Alpheridies, a planet the Miraluka migrated to when their original homeworld was rendered uninhabitable. Later on, a Miraluka colony world named Katarr was stripped of all life by Sith Lord Darth Nihilus in approximately 3952 BBY, during a Jedi convocation."}, {"tag": "p", "text": "In the many years after the Jedi Civil War, an uncountable number of Miraluka joined the Jedi order throughout the years and participated in most of their major battles. Scores of Miraluka commoners with little or no formal training also assisted the order in administrative or teaching positions."}, {"tag": "p", "text": "When the Empire arose from the ashes of the Old Republic, the Miraluka suffered tremendously. The Jedi Purge wiped out thousands of Miraluka, as a result they were inspired to join the Rebel Alliance. While a troubled few were pressed into service as pawns and spies for the Empire, these few either fell to the dark side or destroyed themselves."}, {"tag": "p", "text": "By the time of the New Jedi Order, the Miraluka had only begun to rejoin the galactic society. Because of the threat of Yuuzhan Vong forces, many had to travel incognito."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Miraluka were a thoughtful, cautious, and deliberative species. They had little interest in personal gain or glory. For social reasons, Miraluka hid their appearance by wearing a headband, a mask, or similar concealing headwear. In addition all Miraluka were very united by race. They called themselves \"brothers\" and were considered as members of a great family. As a Force-using species, Miraluka were often quite shocked if 'shown' life not connected to the Force. The Miraluka that lived on Katarr were strong enough that even they felt the Battle of Malachor V."}, {"tag": "p", "text": "Many Miraluka worshiped two gods, Ashla and Bogan, through the philosophy of the Greater Force. They did not believe in good or evil, but were taught to accept both life and death."}, {"tag": "p", "text": "Like the Kel Dor, the Miraluka had their own order of Force-sensitives, the Luka Sene."}, {"tag": "h2", "text": "Miraluka in the galaxy"}, {"tag": "p", "text": "Because of their connection to the Force, many Miraluka were drawn to the Jedi Order. Miraluka Jedi fought in the Great Sith War, and helped shape the Jedi Order for centuries to come. In the waning days of the Galactic Republic, there were not many Miraluka Jedi, but many Miraluka, unsuited to becoming full-fledged Jedi, served the Order as teachers and administrators. Miraluka Sith were seemingly rare, as the species' own outlooks on life and the Force were largely incompatible with Sith teachings. However, as with all who felt the Force, a fall to darkness was possible with the Miraluka just as with any other species."}, {"tag": "p", "text": "Amongst the notable Miraluka was Visas Marr, the only survivor of the Devastation of Katarr and the companion of Meetra Surik. Other Miraluka were Shoaneb Culu, a student of Vodo-Siosk Baas, and the Dark Jedi Jerec, a member of the Inquisitorius."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Miraluka are featured as a playable species that can select any of the four Jedi paths (Shadow, Sage, Guardian, or Sentinel) by default in Star Wars: The Old Republic. With the introduction of the legacy system, the species can also be unlocked for any other class in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}