{"url": "Mirchidi_NeMall", "categories": ["Category:Legends articles", "Category:Duros", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Mirchidi NeMall"}, {"tag": "p", "text": "Mirchidi NeMall was a Duros, who, shortly before the Battle of Yavin, bought the NeHimmep, a freighter which he named after the famed Duros explorer of the same name. NeMall never made a good living, but a fear of Imperial Customs put him off smuggling."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Initially a pilot of a Duros spaceline shuttle service, Mirchidi NeMall wanted to own his own ship and work on his own. As such, he saved all he could. Once his service contract was over, he decided to buy a ship."}, {"tag": "p", "text": "NeMall opted for a Starfeld ZH-25 Questor he would name NeHimmep after NeHimmep, a legendary Duros scout and trader. Although many people in NeMall's situation asked for money to underworld figures, NeMall opted for the Duros lending tradition and resorted to a Duros lending institution."}, {"tag": "p", "text": "For two years, NeMall managed to get a slight profit while never resorting to illegal jobs. However, c. 2 ABY, while he was transporting rinzefruit, the NeHimmep collided with an uncharted asteroid squall and all the cargo was lost. NeMall's insurance covered the repairs, but not the cargo expenses."}, {"tag": "p", "text": "Suddenly up to his neck, NeMall changed his policy and began working in well-paid but highly-dangerous runs, some of which might have even been legally questionable. He also began to accept no-question jobs, although he tried his best to avoid smuggling and still managed to get a clean record for the customs — which allowed him to go through frontiers mostly with ease."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like many Duros, NeMall was a hard-working, social person who liked scout jobs. He felt more comfortable in space and not under the gravity of a planet."}, {"tag": "p", "text": "A honest being, NeMall always did his best to avoid smuggling. Although he admitted that Imperial Customs were more strict with aliens than with Humans, he was not interested in joining the Alliance to Restore the Republic. Nonetheless, from 2 ABY onward, NeMall was flexible enough to accept no-question jobs from the Alliance."}, {"tag": "p", "text": "NeMall took the Duros lending tradition very seriously."}, {"tag": "p", "text": "Unlike many freighter owners and captains, NeMall refused to modify his ship beyond what was strictly needed for repairs."}, {"tag": "h2", "text": "Sources"}]}