{"url": "Mirli_Lok", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Clan Lok", "Category:Females", "Category:Hunters", "Category:Individuals of unspecified species", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Mirli Lok"}, {"tag": "p", "text": "Mirli Lok was a female Mandalorian warrior who lived during the Third Galactic War. A survivor from the near-devastating loss that Clan Lok suffered at the hands of the Eternal Empire during the Eternal Empire conquest, where Mandalore the Vindicated was killed in battle, Mirli and the other survivors of her Clan for a time followed the dozen clans that came to be under the leadership of the new Mand'alor, Mandalore the Avenger. Mirli grew dissatisfied with the Mandalore's leadership, and had become convinced that it was not in her's and that of her Clan's interests to follow her. When the Clans were planning the Raid on Darvannis, Mirli and her followers abandoned them and they came to the world of Onderon, and thus were marked as dar'manda by the rest of the Mandalorians."}, {"tag": "p", "text": "Mirli and her followers would form the Ash'ad, under an agreement with the current ruler of Onderon, King Regalun Petryph. As such, members of her followers could be seen in the Royal Hunting Lodge. But during the new galactic war, things would change drastically for them. During the Mission to Onderon, Mand'alor had discovered their location, sending her people in the city of Iziz. Mandalore would later task the Alliance Commander in hunting down the Ash'ad in the jungles of Onderon. The Outlander eventually found them, and in a attack on their camp, Mirli and her followers were killed, and their sets of Mandalorian armor were stripped from their bodies, sending a message to the clans that Mandalore the Avenger would not tolerate traitors or cowards daring to call themselves Mandalorian."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Mirli wore dark green and brown Mandalorian armor with bone plating, styling herself quite closely to the Mandalorian Crusaders. She wielded a beskad and often mixed built in weaponry in her armor such as carbonite freezing, retractable wrist blades, and other gadgets."}, {"tag": "h2", "text": "Appearances"}]}