{"url": "Arthon", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Arthon"}, {"tag": "p", "text": "Arthon was a terrestrial astronomical object that was inhabited by members of the sentient Ottegan species."}, {"tag": "p", "text": "The galactic explorer Lor San Tekka visited the Ottegans on Arthon at some point by 32 ABY but later disappeared into hiding. Sometime later, information provided to the Resistance pilot Poe Dameron by the Hutt crime lord Grakkus included a record of San Tekka's visits to both Arthon and the planet Hosra. Dameron passed on the information to the Resistance's General Leia Organa, who believed it to be true. Dameron later wrote about the discovery of San Tekka's visit to Arthon in his flight log."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Reintroduction into Star Wars canon"}, {"tag": "p", "text": "Arthon first appeared in the video game LEGO Star Wars: The Force Awakens, a non-canonical adaptation of the sequel trilogy film Star Wars: Episode VII The Force Awakens, developed by Traveller's Tales and released in June 2016. It was later mentioned in the comic Poe Dameron 6, written by Charles Soule and published by Marvel Comics on September 7, 2016."}, {"tag": "p", "text": "In the Star Wars Legends continuity, Arthon was a planet originally mentioned in \"Scouting an Adventure Path,\" a 2002 web supplement for Wizards of the Coast's Star Wars Roleplaying Game, written by Owen K.C. Stephens."}, {"tag": "h3", "text": "LEGO Star Wars: The Force Awakens"}, {"tag": "p", "text": "In LEGO Star Wars: The Force Awakens, Arthon is featured in the level \"Ottegan Assault,\" separate to the main levels that adapt the events of The Force Awakens. It is depicted as a terrestrial planet with a cloudy atmosphere, covered in landmasses and oceans. The planet is home to an elevated Ottegan enclave, located on the pinnacle of a large plant structure and inhabited by members of the Sacred Order of Ramulus."}, {"tag": "p", "text": "In the game, the Ottegans on Arthon assist the Resistance by mapping the location of the lost Jedi Master Luke Skywalker and giving the map to Lor San Tekka. The First Order, seeking to retrieve the map for itself, attacks the enclave while Resistance forces led by Admiral Gial Ackbar attempt to evacuate the Ottegans. In search of San Tekka, the First Order warrior Kylo Ren and Captain Phasma pursue and shoot down a Resistance transport holding the leader of the enclave. Leading a ground assault to locate and interrogate the leader, Ren fights through Resistance troopers and local Ottegans. He successfully captures and interrogates the leader, discovering that San Tekka is on the planet Jakku. As the forces of the First Order depart, the remnants of the enclave break apart behind them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}