{"url": "Misha_Vontoba", "categories": ["Category:Canon articles", "Category:Females", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Misha Vontoba"}, {"tag": "p", "text": "Misha Vontoba was a female individual who led a band of nomads on the planet Jakku. Around the time of the Hosnian Cataclysm, the nomads came across the wrecked New Republic corvette Starlight Wanderer, which had crashed during the Battle of Jakku many years earlier. The nomads accessed the corvette's computer and noted that something secret was hidden inside a vault somewhere in the ship, and they set about trying to find it."}, {"tag": "p", "text": "The Strus Clan, a band of thieves that were active on Jakku, heard news of the discovery and attacked the nomads at the wreck site. Vontoba sent a band of adventurers who were present among the nomads to confront the Clan; the adventurers were victorious and they drove the Clan away."}, {"tag": "p", "text": "Vontoba feared that the Strus Clan would return and convened a meeting of the nomads to decide on what to do next. The adventurers assisted Vontoba with searching the corvette for the hidden vault and during their hunt one of the nomads found a hidden hatch to the secret chamber. Inside, they discovered a datapad containing the co-ordinates for hundreds of secret Imperial military installations in the Unknown Regions, which had been stolen from the Star Destroyer Eradicator during the Battle of Jakku. The adventurers left Jakku to investigate the installations but promised Vontoba that they would return to help protect the nomads from the Strus Clan."}, {"tag": "p", "text": "The Strus Clan swore revenge on the nomads and to protect themselves, Vintoba and her people fortified the Star Wanderer wreck site and sought shelter there. The adventurers eventually returned to Jakku and Vontoba sent them to try and convince a band of mercenaries led by Brana Tsaro to come to the aid of the nomads. The adventurers were successful in their mission and Tsaro's mercenaries fought off the Strus Clan, leaving Vontoba and the nomads in peace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Note and references"}]}