{"url": "Misha_Vekkian", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Fallen Jedi", "Category:Females", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Inquisitors", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Misha Vekkian"}, {"tag": "p", "text": "Misha Vekkian was a Human female who trained as a Jedi Padawan during the waning years of the Galactic Republic. After the formation of the Galactic Empire, she was turned to the dark side by the Inquisitorius, a group of Dark Side Adepts who served as the Empire's Jedi hunters. After undergoing military training, Vekkian joined the Imperial Navy and attained the rank of lieutenant."}, {"tag": "p", "text": "When the Alderaanian Resistance, an anti-Imperial group based on Alderaan, sent a task force to wait near Coruscant to rendezvous with agents returning from a mission there, Vekkian was among the Imperial forces sent to destroy the group. She was part of a boarding party that landed on the Alderaanian command ship, the Resurgence, and took up a position in the ship's landing bay along with a squad of Imperial Navy troopers under her command. After witnessing Inquisitor Valin Draco leave the ship with the captured Jedi Master Denia, Vekkian and her squad attacked a group of Alderaanian Resistance fighters."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vekkian was a Force-sensitive female Human who was raised by the Jedi Order with no knowledge of her homeworld or her family, and by the time of the Clone Wars, she had become a Jedi Padawan. However, after the end of the conflict, she was discovered by the Inquisitorius, an order of Dark Side Adepts who served the newly-formed Galactic Empire, which was tasked with hunting down the surviving Jedi. The Inquisitorius turned her to the dark side and she agreed to serve the Empire. After undergoing military training, she was commissioned as an officer in the Imperial Navy. Vekkian attained the rank of lieutenant and commanded a squad of Imperial Navy troopers who, due to her harsh style, became some of the toughest and skilled men in the Imperial Navy."}, {"tag": "p", "text": "In circa 17 BBY, Imperial Admiral Gilder Varth infiltrated the Alderaanian Resistance, an anti-Imperial resistance group based on Alderaan. When a team of Resistance agents completed a mission on Coruscant, a Resistance task force was sent to wait for them at a rendezvous point near the planet. Varth betrayed the Resistance task force's location to the Empire and an Imperial task force under the command of Inquisitor Valin Draco was sent to eliminate the group. Vekkian and her squad accompanied him and they were part of a boarding party that landed aboard the Alderaanian command ship, the EF76 Nebulon-B escort frigate Resurgence."}, {"tag": "p", "text": "Draco captured Denia, a Jedi Master who had allied herself with the Resistance, and took her to the Resurgence's landing bay. Vekkian and her squad were present there while he and his prisoner left the ship in his shuttle, and afterward, they took up positions near the last Imperial shuttle left on the ship. Soon, a group of Alderaanian Resistance fighters, who had been carrying out assignments for Denia, arrived at the hangar, though too late to rescue her. Vekkian noticed their presence and ordered her squad to open fire on them. She then ignited her lightsaber and used battle meditation to prepare herself for combat. The naval troopers gave her covering fire, while she tried to attack the Resistance fighters. The battle was a victory for the Empire and the Resurgence was destroyed shortly afterward, while the surviving Alderaanian ships were forced to flee."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Misha Vekkian was a tall woman, with an athletic build; blonde, close-cropped hair; and blue eyes. Vekkian blamed the Jedi for her fall to the dark side, as she believed that if she had been left with her parents, then her Force sensitivity might never have been discovered. She was very cruel to the troops who served under her and she would kill any of them who did not succeed in their goals, which caused them to both fear and respect her. Her squad was apprehensive of her and this made them completely loyal; they believed that if they even considered taking her down, she would be able to read their minds and stop them. She was spiteful and never forgot any sleight that she perceived to be against her. She was also vindictive and knew no mercy. Although she carried a blaster pistol, she preferred to fight with her lightsaber instead."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Vekkian had learned how to use the ancient technique of battle meditation, preferring to employ it before entering combat. When in combat, her favored tactic was to deflect the blaster bolts fired at her by an enemy, while she got close enough to them to engage them in combat with her lightsaber. She also employed telekinesis to move and grip objects, in addition to channeling her rage, which she could use to augment her fighting skills."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Misha Vekkian made her first and only appearance in A Reckoning of Wraiths, the seventh scenario in the Dawn of Defiance campaign, written by Gary Astleford—a Wizards of the Coast online supplement to the Star Wars Roleplaying Game. In the supplement, the player characters fight Vekkian and her squad, so her ultimate fate depends upon their actions and it is possible for them to kill her. If they do so, then her squad retreats back to the remaining Imperial shuttle and leaves the Resurgence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}