{"url": "Miss_Mylla%27s_Saloon", "categories": ["Category:Legends articles", "Category:Bartyn's Landing locations", "Category:Businesses", "Category:Entertainment", "Category:Hotels"], "nodes": [{"tag": "h1", "text": "Miss Mylla's Saloon"}, {"tag": "p", "text": "Miss Mylla's Saloon was an entertainment house and inn in the city of Bartyn's Landing in Lamaredd. Owned and managed by the pretty and cunning Miss Mylla, it provided pleasure through several means and was the busiest locale in the Center Sphere District during the last decades of the Galactic Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Miss Mylla, an exotic female Falleen of mysterious origin, went to Lamaredd in a passenger ship at some point before 69 BBY. She arrived in the company of dozen of Falleen escorts and, for as long as anyone can remember, was escorted by the massive Chagrian known as \"Bantha\" Burloo."}, {"tag": "p", "text": "Miss Mylla fixed her gaze in the dull building that served as local inn and acquired it. In no time, she refurnished it and transformed the structure into \"Miss Mylla's Saloon\", a 24-hour business offering a variety of services. Customers could enjoy a good drink served by any of the beautiful, scantily-clad waitresses —her travel companions— or gamble in any of the tables, listening the music and talking. It was also an economic hotel. The waitresses also provided an undisclosed second service, euphemistically known as \"the work\", for reduced groups in the private rooms of the top floor. Burloo on his own provided the security with his mere, but constant, presence in the door; rarely he needed to take a ruffian out of the door."}, {"tag": "p", "text": "From the very first moment, the business thrived and Miss Mylla's Saloon became the busiest and most popular venture in the Center Sphere District — although Nyubuna Bulul's The Even Cut Sabacc Parlor and Casino just in front of the door provided a rival alternative in the form of only gambling. In little time, Miss Mylla had a need for more employees, whom she called \"her girls.\""}, {"tag": "p", "text": "The courtesans doubled as waitress, with some of them preferring one activity over the other. Knowing that inebriated, overexcited customers could tend to overlook certain limits, Miss Mylla made sure that patrons treated \"her girls\" with due respect, and provided each of the girls with a knife — not to mention Burloo's attentive eye."}, {"tag": "p", "text": "Miss Mylla also encouraged her employees to make themselves a life beyond that. Whenever any of them wanted to leave, Miss Mylla arranged things to give that person an offworld education for other field and, in at least one case, marrying the fortunate girl with a Falleen prince. Those former employees always considered Mylla to be their guardian."}, {"tag": "p", "text": "As of c. 29 BBY, several important citizens of the Landing were also regular patrons, including the Security Chief's Senior Second Grubber Vapps, the Security Chief Mix Liddell —who had some kind of personal romatic relationship with Miss Mylla— and Guther Bartyn, mayor of the town council, Administrator of the local mines, owner of Bartyn Gourmet Delicacies and a usual of the top floor."}, {"tag": "p", "text": "Around that time, one of the working girls had decided to leave this field of activity, with Miss Mylla approvingly accepting that the Human woman had never been made for that. Miss Mylla arranged her retirement, sending her in the form of a package to a legitimate business partner of Miss Mylla in the remote Cape Regret."}, {"tag": "p", "text": "In the times immediately after the public reappearance of the thought-extinct Menahuun species, two of Miss Mylla's girls disappeared along with their customer in the lowlands of Maw range. She admitted that it had happened before, but she was nevertheless worried."}, {"tag": "p", "text": "At the same time, the shipments of Corellian brandy for the Saloon were being seized by corrupt officers of the spaceport security for their personal use. Miss Mylla suspected what was happening —although she was blissfully unaware of the existence of an organize smuggling ring— but she refused to turn to Chief Lidell once again, as the case could put him in conflict with his own bosses."}, {"tag": "p", "text": "Due to a series of events, Lidell hired a group of outsiders as his new Seconds. He suggested them to live in Miss Mylla's Saloon, and offered to pay for the rooms — only."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Miss Mylla's Saloon was created by writer Cory J. Herndon and featured in the article Bartyn's Landing and in the role-playing adventure Reckonings, both of them published in the magazine Star Wars Gamer #7 (2001)."}, {"tag": "h3", "text": "Alternate ending"}, {"tag": "p", "text": "The article assumes that the player characters of Reckonings achieve the best possible ending but, should they fail, the adventure offers an alternative path that takes place during an open war between the Menahuun and the citizens of Bartyn's Landing. In that case, as the city becomes a war zone, Miss Mylla abandons Bartyn's Landing and her Saloon to attempt starting a new life in Little Mon Cal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}