{"url": "Missile/Legends", "categories": ["Category:Legends articles", "Category:We're Doomed!", "Category:Cleanup", "Category:Articles to be expanded", "Category:Articles needing additional sources", "Category:Missiles"], "nodes": [{"tag": "h1", "text": "Missile"}, {"tag": "p", "text": "A missile, also called an ordnance or (Incorrectly) a rocket, was a catch-all term for a type of self-propelled explosive projectile. Different types of missiles were loaded on and fired from various starships, such as capital ships and starfighters. Other types of missiles were utilized by ground vehicles. The most common type of missile employed by ground forces were ones capable of being launched by shoulder-fired missile launchers. A single soldier, or a pair of soldiers, were capable handling a missile launcher. Missiles were a often-used weapon when it comes to intense mass destruction, in wars. Missiles were not just for dumb-fire shooting, but also could be lock on to enemy targets. When fired they would home onto the target and track the target before reaching or impacting the target and exploding. Missiles could be used to launch special payloads, like nuclear bombs, which could destroy cities from space."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The typical missile was a ranged weapon that carried its own propellant fuel, enabling it to reach a target independent of the power source from which it was launched. Basic missiles dated from the earliest years of recorded warfare, developed from basic rockets. Most weapons of this type contained a guidance system, which allowed them to be locked onto a specific target, which the missile would then attempt to home in on. Size ranged from small \"chip\" missiles that could be fired from a man-portable device and were typically used against ground vehicles, to capital ship-grade warheads that could devastate enemy war vessels or planetary surfaces."}, {"tag": "p", "text": "Missiles normally had armor and sometimes a shield. They were generally cylinder shaped, so they could penetrate capital ship and starfighter shields."}, {"tag": "h3", "text": "Types of Missiles"}, {"tag": "h4", "text": "Carbonite missile"}, {"tag": "p", "text": "Carbonite missiles were devastating weapons often used by the Zann Consortium during the Galactic Civil War. The missile's warhead contained supercooled carbonite that, when detonated, could damage and slow enemy ground forces, leaving them open to attack. In some cases, they could completely destroy them. The Missile Attack Launcher, produced by Merr-Sonn Munitions, Inc., had the ability to fire Carbonite Missiles along with regular explosive missiles, though it took time to rotate between the various types of warheads."}, {"tag": "h4", "text": "Concussion missile"}, {"tag": "p", "text": "A concussion missile was a general short- to medium-range, anti-vehicle ordnance produced by many manufacturers from across the galaxy, one of the most notable being Dymek. They were vehicle mounted weapons, and could be found in most militaries' armory. The TIE Bomber was capable of loading up several magazines worth of concussion missiles into their launch bays to deploy onto a battlefield when needed. A larger and more expensive version of the weapon was the assault concussion missile. A capital ship-grade ordnance, often employed by massive warships like the Victory I-class Star Destroyer, were used for planetary bombardment and anti-capital ship duties. There were also some variants that possessed homing capabilities."}, {"tag": "h4", "text": "Cluster missile"}, {"tag": "p", "text": "A cluster missile was a subset of concussion missile that was low powered, yet was able to be fired off rapidly by various attack craft."}, {"tag": "h4", "text": "Cruise missile"}, {"tag": "p", "text": "Cruise missiles were high-powered missiles capable of homing in on a target. A pirate named Nym was known to have these on his personal starfighter."}, {"tag": "h4", "text": "Discord missile"}, {"tag": "p", "text": "Discord missiles delivered Buzz droids to their targets during the Clone Wars. They had a popular appearance during the Battle of Coruscant."}, {"tag": "h4", "text": "Hex missile"}, {"tag": "p", "text": "Hex missiles were powerful weapons of mass destruction capable of inflicting heavy amount of casualties to a targeted planet or city. They had a specially designed warhead that contained a payload of the chemical agent trihexalon. Trihexalon, also called dragon's breath, was a deadly biological weapon that was fatal to most humanoids. These weapons were first used in an attack on the capital city of Maramere, just before the outbreak of the Clone Wars."}, {"tag": "h4", "text": "Intruder missile"}, {"tag": "p", "text": "Intruder missiles were designed by Slayn & Korpil for the Rebel Alliance. The missile was designed to overload the shield generators on large ships, causing them to explode and damage the rest of the ship."}, {"tag": "h4", "text": "Nano missile"}, {"tag": "p", "text": "Nano missiles were miniature-scale missiles that were nearly indistinguishable from blaster bolts. They contained a built-in navigation system that allowed them to be sensor-guided to their target. The Guardian Mantis was known to be equipped with these missiles."}, {"tag": "h4", "text": "Advanced missile"}, {"tag": "p", "text": "Advanced missiles were a type of warhead equitable to some X-wings."}, {"tag": "h4", "text": "Diamond-Boron Missile"}, {"tag": "p", "text": "The Diamond boron missile was used during the Galactic Civil War to take out mass groups of fighters due to the potency of its warhead. The missile was used by the Broadside-class cruiser kdb-1 but were eventually replaced by Concussion missiles as a cheaper alternative."}, {"tag": "h4", "text": "Proton torpedo"}, {"tag": "p", "text": "The proton torpedo was a type of ordnance used throughout the galaxy. Its most notable use was during the Battle of Yavin, when Luke Skywalker destroyed the first Death Star by launching a pair of proton torpedoes into a thermal exhaust port. Luke was using an X-wing starfighter."}, {"tag": "h3", "text": "Rockets"}, {"tag": "p", "text": "A rocket was a type of missile. During Jaden Korr's campaign against the Disciples of Ragnos he often used rocket launchers or a PLX-2M portable missile launcher made by Merr-Sonn Munitions, Inc.. Rocket launchers were very similar to missile launchers, similar in shape and used for the same purpose."}, {"tag": "h2", "text": "Manufacturers"}, {"tag": "h3", "text": "Merr-Sonn Munitions"}, {"tag": "p", "text": "Merr-Sonn Munitions, Inc., was one of the three top weapons manufacturers in the galaxy during the time of the New Republic. Producing products from various weaponry. Also producing starships, vehicle, and artillery weaponry. The company had existed through many years and eras, helping factions of possibly both sides."}, {"tag": "h4", "text": "Products"}, {"tag": "h3", "text": "Golan Arms"}, {"tag": "h4", "text": "Products"}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mandalorian Wars"}, {"tag": "h4", "text": "Battle of Serroco"}, {"tag": "p", "text": "During the Battle of Serroco, circa 3963 BBY, the Mandalorian fleet launched over two dozen nuclear missiles towards the Republic Navy forces protecting the planet of Serroco. Instead of striking the Republic task force, the missiles circumvented the fleet and directly targeted Serroco's surface. One by one, the missiles struck at various points on the planet's surface and detonated, destroying entire cities and inflicting heavy casualties onto the Republic ground forces stationed on the planet."}, {"tag": "h3", "text": "Great Galactic War"}, {"tag": "h4", "text": "Battle of Balmorra"}, {"tag": "p", "text": "During the Great Galactic War, missiles were employed by various starfighters to carry out air-strikes against the many various factories that were scattered across Balmorra's surface. The constant bombings left the planet's surface permanently scarred."}, {"tag": "h3", "text": "Terrorist Group(s)/Attack(s)"}, {"tag": "p", "text": "In 27 BBY, a terrorist group tried to use a home-made missile to assassinate Passel Argente on the planet Bartokk. However, their plan was thwarted by Jorus C'baoth, who used the Force to stop the missile from reaching its target."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Battle of Muunilinst"}, {"tag": "p", "text": "Missiles were used during the Clone Wars, notably during the Battle of Muunilinst. Anakin Skywalker had the Clone trooper pilots under his command fire their missiles into empty space as he lured a number of Separatist ships that were pursuing him into the path of them."}, {"tag": "h4", "text": "Battle of Coruscant (Clone Wars)"}, {"tag": "p", "text": "During the Battle of Coruscant, Discord missiles were fired upon Obi-Wan Kenobi's and Anakin Skywalker's Jedi starfighters. Despite the homing systems, Anakin managed to evade the missiles fired at his starfighter. Obi-Wan, however, was hit. The missiles flew in-front of his ship and then exploded, releasing Buzz droids which then set about destroying his starfighter."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Battle of Hoth"}, {"tag": "p", "text": "During the Battle of Hoth, man portable missile tubes were used by both the Rebel Alliance and the Galactic Empire. These anti-armor missiles employed guidance systems which would pursue their assigned target with exceptional performance for any guided missile. These advanced onboard guidance systems allowed for shock and vanguard troopers to quickly acquire a target and fire the missile, allowing them to then move to a new position and reload."}, {"tag": "p", "text": "During the battle, the Rebel vanguard division would use an HH-15 projectile launcher made by Golan Arms. The Imperial forces carried MiniMag shoulder-launched proton torpedo launchers, manufactured by Krupx Munitions."}, {"tag": "h4", "text": "Battle of Endor"}, {"tag": "p", "text": "Missiles were used in 4 ABY, during the climatic battle over the forest moon of Endor after the fall of the planetary shield that protected the second Death Star. A group of Rebel snubfighters, along with the Millennium Falcon, entered the massive station's superstructure and approached the main reactor that powered the station. With two well timed volleys of proton torpedoes and concussion missiles from Wedge Antilles and Lando Calrissian, the main reactor was destroyed, causing a chain reaction that would destroy the entire station."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "h4", "text": "Mission to Adumar"}, {"tag": "p", "text": "An illegal company, Dammant Killers, produced missiles from a factory on Adumar. In 40 ABY, Jacen Solo and Ben Skywalker went on a mission to uncover the factory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}