{"url": "Missile_Boat", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Imperial starfighter classes", "Category:Missile Boats", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Missile Boat"}, {"tag": "p", "text": "The Missile Boat was an advanced Imperial starfighter designed by Admiral Thrawn and built by Cygnus Spaceworks. Designed as a countermeasure against the rogue Grand Admiral Demetrius Zaarin and his supply of TIE Defenders, the Missile Boat was a descendant of the Alpha-class Xg-1 Star Wing, also manufactured by Cygnus Spaceworks. The Missile Boat relied primarily on warheads for dogfighting and assaults, a notable difference from other Imperial starfighters, which relied more heavily on laser cannons. The Missile Boat also included an innovative propulsion feature known as the SubLight Acceleration Motor (SLAM)."}, {"tag": "p", "text": "Though they proved instrumental in the defeat of Zaarin's rogue faction and in executing Emperor Palpatine's plan to lead the Rebel Alliance to Endor, they were removed from Imperial Navy operations by the Emperor's own orders and were not seen in use after 4 ABY."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Missile Boat loosely resembled the general body style of its predecessor, the Alpha-class Xg-1 Star Wing. The Missile Boat was ten meters in length with a bulky profile in comparison to the Star Wing, yet both models shared a pronounced fuselage with dorsal stabilizer, flanked by the craft's primary warhead launchers. The Missile Boat's second set of warhead launchers extended from pylons attached to the dorsal surface of the primary launchers. This secondary set rested at an angle reflexive to the lateral wings."}, {"tag": "p", "text": "Extremely uncommon among Imperial starfighters, portions of the pilot's flight data displays were located on the cockpit exterior. The deflector shield configuration and beam weapon displays were attached to the port and starboard nose surfaces, outside the cockpit, just forward of the viewports. The fighter had room for a single pilot and could carry up to 100 kilograms of cargo and consumables for up to three days."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "The Missile Boat was armed with two high-capacity twin warhead launchers and a single nose-mounted laser cannon. The secondary pair of warhead launchers was exclusively assigned to carry a payload of concussion missiles, while the primary could be outfitted with an array of space-borne projectiles. Each individual launcher had a concussion missile capacity of twenty missiles, affording the Missile Boat a maximum load of eighty concussion missiles; the primary launchers could alternatively hold fifteen proton torpedoes, ten heavy rockets, or five heavy space bombs. This immense warhead capacity greatly overshadowed the TIE Bomber and Assault Gunboat magazines by more than sixty missiles. By the time of its deployment, the Missile Boat was afforded the use of advanced concussion missiles and advanced proton torpedoes. These projectiles fielded larger payloads and increased agility than their predecessors. Advanced concussion missiles offered Missile Boat pilots the ability to suppress more advanced starfighters such as Rebel A-Wings and rogue TIE Defenders."}, {"tag": "p", "text": "The abundance of missiles led to the development of unorthodox tactics. Missile Boat pilots, armed exclusively for anti-starfighter work, often used advanced missiles as dumb-fire rockets against capital ships and space stations, supplementing their accompanying Assault Gunboats or TIE Bombers. Unlike their TIE pilot brethren, Missile Boat pilots could easily afford the use of missiles to overwhelm space station anti-warhead defensive systems or defend targets from pursuing warheads."}, {"tag": "p", "text": "The most noteworthy weakness of the Missile Boat was its single laser cannon. Should the craft's warhead stores run empty, pilots were forced to dogfight with a single cannon. Dogfighting, in general, could be problematic due to the fact the that Missile Boat pilots had only a single cannon reserve from which energy could be transferred to deflector shields. However, this single laser cannon did fire faster and could charge to full capacity in just ninety seconds, a major improvement over other laser cannons found in Imperial fighters."}, {"tag": "p", "text": "Missile Boats were frequently equipped with a beam weapon system. The tractor beam was another tool the Missile Boat employed against TIE Defenders, robbing the Defender of its superior maneuverability and holding them on course while Missile Boat pilots attained missile locks. Alternatively, Missile Boats could be fitted with a jamming beam, a weapon that disrupted the fire-control systems of spacecraft, which allowed Missile Boats safer transit on bombing runs against capital ships."}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "The Missile Boat was equipped with dual ion engines and a hyperdrive. Hyperdrive capability permitted the Missile Boat to compete with other advanced fighters of the era and assume multiple mission roles by operating independently of bases and carriers. The class 6 motivator, however, was slower than that of hyperdrive-equipped members of the competing TIE series, like the TIE Advanced x1 and TIE Defender. The Missile Boat was faster and more maneuverable than the Assault Gunboat, and its engines were also equipped with the new SubLight Acceleration Motor(s). The SLAM was an overdrive system that drained laser cannon energy reserve to boost the craft's engines to 200 percent output. Comparable to the Alliance's A-wing, the Missile Boat boasted a respectable maximum cruising speed of 122 MGLT. A pilot competent in energy management could push the craft's speed beyond 250 MGLT using the SLAM system, up to a maximum of 426 MGLT with all power redirected to the engines. The Missile Boat could achieve acceleration of 21 MGLT/s and had a maximum atmospheric velocity of 1,150 km/h and a maneuverability rating of 91 DPF"}, {"tag": "h3", "text": "Shields and armor"}, {"tag": "p", "text": "While the defensive armor plating, rated at 19 RU, was less than that of many non-Imperial starfighters—comparable to that of all types of TIE fighters—the Missile Boat's deflector shields were heavily reinforced, rated at 120 SBD, even superior to those of the Alliance's B-wing starfighter."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Missile Boat was specifically designed to counter the menacing TIE Defender. As byproducts of the space superiority role, shield and hyperdrive systems permitted the Missile Boat to assume various other starfighter roles. Missile Boats were used on several occasions as reconnaissance scouts to inspect enemy craft in distant systems. Considering the immense payload and deflector shield systems, the Missile Boat was also well suited as a heavy bomber, frequently inserted into enemy territory to destroy enemy capital ships. While these heavy bomber roles typically came with the assistance of fighter escorts, Missile Boats could operate autonomously in light of their dedicated concussion missile launchers, most appropriate for destroying enemy fighters. The Missile Boat was also frequently deployed on heavy assault missions. A major drawback to this role was the Missile Boat's lack of ion cannons. Missile Boats would be reliant on Assault Gunboats or TIE Defenders to disable mission critical craft for capture, thus making the Missile Boats responsible for the livelihood of the disabling craft."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "As with most Imperial fighters, carrier craft provided simulators to train pilots in the use of the Missile Boat. Pilots would fly a time trial in a special training course to earn a certificate, then would move on to combat simulations. The training course was an enclosed tunnel system filled with obstacles and targets in which pilots would fly against the clock. While flying the course at top speed, the pilot would dodge the obstacles, as colliding with them would slow the vessel, and destroy any possible targets, as they would win bonus time for each target destroyed. After completing the time trials and earning a certificate, the pilot would enter a series of combat simulations, which were labeled as \"historical missions,\" indicating they were based on early uses of the Missile Boat. For completing all four scenarios, a pilot would be awarded a gold medallion."}, {"tag": "p", "text": "The first combat simulation for Missile Boat pilots was intended to introduce pilots to the main strengths of the craft, its dual warhead capacity and the SubLight Acceleration Motor system. The Missile Boat designated Mu 1 exited hyperspace thirteen kilometers from Rebel shuttle factory Organarms, armed with 20 heavy rockets and 40 advanced concussion missiles and equipped with a tractor beam. The factory was surrounded by a storage yard consisting of eight type-I containers labeled Xi and Pi and eight unshielded Lambda-class T-4a shuttles from CST-red and CST-blue group. The pilot's mission was to destroy the facility and all the shuttles and containers. Utility Tugs E 1 and E 2 would launch as the Missile Boat approached and attempt to tow the shuttles into the containers, removing them from the scenario and denying the pilot his objective. The primary objective was approximately ninety seconds away from the hyperspace exit point, giving the pilot enough time to fully charge all the energy systems. The pilot was instructed to use advanced concussion missiles to eliminate the facility's anti-warhead defenses, aided by using the SLAM system while launching the missiles, as the ship's speed was added to the missiles' own propulsion. The pilot would then switch to the secondary warhead load, and destroy the factory completely with heavy rockets. The facility would launch four Z-95 Headhunters for defense. To achieve perfect execution of the mission, the pilot would destroy all the tugs before they could remove the shuttles, then destroy the factory, the shuttles, and the containers. For a further challenge, the pilot could also destroy the relief convoy consisting of four BFF-1 bulk freighters in Atrivis Day group carrying raw materials, four freighters in Rimrunner group carrying coolant, three modular conveyors in Altar Moon group, carrying Tibanna gas and container transport Kempman carrying metanol, which arrived shortly after completing the primary objective. Imperial Strike-class cruiser Arjun would arrive at approximately the same time and launch combat utility vehicle Arjun Jr. to reload the Missile Boat's munitions. A particularly ambitious pilot would also destroy the relief freighters' escort group, consisting of A-wings, B-wings, X-wings, Y-wings, and the EF76 Nebulon-B escort frigate Dahome."}, {"tag": "p", "text": "The second simulation in the historical mission sequence taught Missile Boat pilots to use the SLAM system and concussion missiles to intercept enemy warheads. A secondary purpose of this mission was to introduce the pilot to combat against Imperial craft with the Missile Boat, one of the craft's original design objectives. Mu 1 entered the area near weapons factory SpecWar Fab armed with 30 advanced proton torpedoes and 40 advanced concussion missiles and equipped with a tractor beam. The Missile Boat was required to defend the facility against a staggered crescent wave attack formation of nine Delta-class DX-9 stormtrooper transports from Samol group. Allied container transport Silver Bull had to dock with VIP shuttle Aluma to transfer a scientist, and the shuttle and transport both had to be defended until completing their missions. The Samol group transports attacked the facility and the Silver Bull-Aluma rendezvous with inertial space bombs and heavy rockets, and the lone Missile Boat was expected to destroy all the enemy warheads by launching a single concussion missile at each. After all nine Samol transports were destroyed, waves of Rebel fighters would begin entering the area to continue the assault. Four Y-wings would exit hyperspace first, followed by four X-wings, then six B-wings, and finally a pair of A-wings broadcasting Rogue Squadron identifiers. After the Rebel fighters were all eliminated, a pair of Grand Admiral Zaarin's Gamma-class ATR-6 assault transports armed with heavy rockets and a pair of TIE Defenders armed with space bombs arrived to stage their own assault on the container transport. The factory was able to provide two TIE/LN starfighters for support if Mu 1 called for reinforcements, but the TIEs would ideally not be required, and a perfect simulation would take approximately sixteen minutes. The briefing officer informed Maarek Stele that the importance of this mission was so great that, had he failed it in actual combat, the original pilot would likely have faced execution."}, {"tag": "p", "text": "The third Missile Boat combat simulation was the first one in which the pilot operated with a wingman in a second Missile Boat. The objective of this mission was to allow the pilot to learn how to operate in a team to eliminate an enemy minefield. Missile Boats designated Tau 1 and Tau 2 exited hyperspace near Rebel type B ion cannon minefield M2, which had ensnared Assassin-class modified corvettes Dagger 1, which was transporting torpedoes, and Dagger 2, which was transporting TIE series starfighter parts. Both Missile Boats were equipped with 40 advanced concussion missiles and 10 space bombs but were not equipped with beam weapon systems. The simulated wingman was operated with the highest level AI the simulation could provide. The Missile Boats set out to destroy the mines with lasers or missiles, and Mu 2 had orders to immediately attack any target Mu 1 designated. The Missile Boat's sole laser was the weapon of choice, as the mines had the ability to shoot down concussion missiles if they detected a weapon lock, but missiles fired without guidance could be successfully used as well. An expert pilot would be able to clear the minefield surrounding the first corvette in under fifty seconds. After a minute in the simulation, the Missile Boats would be joined by stormtrooper transport Omega to provide weapon reloads. Approximately the same time, when an ace pilot would be about to finish off the mines surrounding the second corvette, the Rebel MC40a light cruiser Planka would arrive to claim the ships their minefield had caught. The Rebel cruiser launched a group of five Y-wings, then four B-wings, all targeting the corvettes with proton torpedoes. Tau 1 was directed to temporarily abandon the mine-clearing operation to intercept the Rebel fighters. In response, the Rebel cruiser launched a pair of Z-95 Headhunters and then two A-wings against the Missile Boats themselves. After the Imperial ships eliminated the Y-wing and B-wing strike force, four X-wings went after the Imperial corvettes. Tau 2 would continue clearing mines, and after the mines were all removed, assault transport Omega would arrive to repair the corvettes. If this occurred while the Rebel fighters were still present, Tau 1 and 2 would defend the Imperial transports. After the Rebel fighters were all destroyed, the two Missile Boats attacked the Rebel cruiser. As the hull of the Calamari cruiser was pummeled by Imperial weapons, the officers of the ship fled in the two Lambda-class shuttles of Lacoda group, which, in an ideal mission, the Imperial pilots would also destroy. An optimal scenario would be completed at about nine minutes and thirty seconds from the Missile Boats' arrival, with the departure of the Dagger group. The simulator pilot then had the option of dogfighting Rebel fighters that arrived after the battle for bonus points."}, {"tag": "p", "text": "The final simulated Missile Boat combat mission allowed the pilot to experience the role the Missile Boat was explicitly created for, dogfighting TIE Defenders. Missile Boats Tau 1 and Tau 2 were each armed with 30 advanced proton torpedoes, 30 advanced concussion missiles, and a tractor beam. Stormtrooper transport Omega was standing by to reload the Missile Boats if needed. The Missile Boats exited hyperspace heading for a small staging area with four inactive TIE Defenders from Baker group and four from Charly group. Within the perimeter formed by Baker and Charly were four containers each from Duce group, containing TIE Defender parts, and Domm group, containing TIE Defender parts and crew quarters. Inspecting Duce and Domm would score bonus points and destroying them was a secondary objective, but the Tau pilots were instructed to hold off on their destruction until after completing the primary goals, as their loss would trigger the arrival of enemy reinforcements. The area was patrolled by four TIE Defenders from Rover group, and container transport Thor was nearby, offloading Delta-class JV-7 escort shuttles from Thoret group containing pilots for the inactive TIE Defenders. If the pilot manning the simulator was tactically smart, he would immediately eliminate Thor and the three shuttles it launched to score bonus points and keep the inactive TIE Defenders out of the game. To fulfill the primary mission objective, Tau 1 and 2 would then eliminate all the TIE Defenders which were in the area when they entered. After all eight TIE Defenders were destroyed, modified corvette Holdon and two CR90 corvettes from Xtram group would enter the area. Destroying them would also score bonus points, and would ideally have been done before destroying Domm and Duce groups. After the destruction of the central containers, the enemy Strike Cruiser Yllama would enter the area and immediately launch eight R-41 Starchasers and two Z-95 Headhunters. They would be followed by the arrival from hyperspace of eight TIE/ad starfighters. If the simulator pilot was sufficiently skilled, he would eliminate all enemy fighters for maximum points."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Cygnus Spaceworks developed the Missile Boat during the Galactic Civil War as a dominantly projectile-weapon-based platform to counter the most advanced starfighters of the day. The advent of the Missile Boat was the result of a chain of events put into motion by the technologically-driven Grand Admiral Demetrius Zaarin, a highly respected officer in the Imperial Navy. Like many other noteworthy Imperial officers, Zaarin sought to increase his power; unlike most of those officers, he chose to stage a coup against Emperor Palpatine, pitting himself against Admiral Thrawn and the rest of the Imperial Navy. While planning the Rebel Alliance's ultimate defeat at the Battle of Endor, the Emperor ordered Thrawn to pursue and destroy Zaarin and his advanced TIE starfighters. Zaarin's defection posed a great danger to the Empire, as he possessed superior Imperial starfighters like the TIE Avenger and TIE Defender. Knowing this, Thrawn collaborated with Cygnus Spaceworks to design a new starfighter to counter the threat of Zaarin's treachery; the Missile Boat was the offspring of this collaboration."}, {"tag": "p", "text": "In 3.5 ABY, the Missile Boat made its debut during Thrawn's campaign to police various factions who mysteriously came into possession of TIE Defenders. The Missile Boat's first combat mission, flown by Imperial ace Maarek Stele, was to lead an assault on the Nami Strike-class cruiser Nuance, which was carrying an arms merchant who planned to sell TIE Defenders to the Rebel Alliance. Following this sortie, a lone Missile Boat was responsible for the destruction of three Carrack-class cruisers on a mission to wrest captured TIE Defenders from Thrawn's grasp. The Missile Boat accomplished this mission with only a squadron of TIE Fighters as cover. With the Rebel strike force destroyed, another solo Missile Boat was utilized to destroy a TIE Defender factory controlled by the Nami pirate Ali Tarrak."}, {"tag": "p", "text": "Upon completion of a campaign to rid secondary forces of their TIE Defender possessions, Thrawn utilized the Missile Boat on a direct campaign against the rogue Zaarin. The Missile Boat was used extensively to raid Zaarin's supply convoys and defend loyal Imperial forces against attacks by Zaarin's rogue forces. During this campaign, Missile Boats were frequently employed as bait for the technologically greedy Zaarin. Missile Boats were responsible for protecting convoys from Zaarin's raiders—on one occasion, protecting a convoy carrying actual Missile Boats and on another, a decoy convoy meant to entrap Zaarin. Moreover, Missile Boat pilots were specifically instructed not to permit the capture of the new Missile Boat; the Missile Boat would not even be deployed, they were told, if not for the dire circumstances facing the Empire. In addition, during this campaign, Missile Boats were instrumental in the protection of the cloaking shield project aboard the CR90 corvette Vorknkx. Research personnel were quite shocked by the arrival of only a single fighter but stated that there were rumors about its prowess."}, {"tag": "p", "text": "The Missile Boat designated Mu 1, along with two scout craft, faced off against Nebulon-B2 frigate Z-Borus and its complement of TIE Bombers and Interceptors. As the battle progressed, Zaarin brought more of his TIE Avengers to bear down on the research facility. Failing at their initial attempt to capture the facility, Zaarin's forces followed up the previous sortie with a larger onslaught of three Carrack-class cruisers and assault transports, all the while aided by traitorous TIE Defenders. A lone Missile Boat, backed by escort transports, repelled this intense attack, while the Muurian transport Shadow docked with the Vorknkx to enable its hyperdrive. Despite all efforts by Missile Boat pilots, the Empire was forced to evacuate the research platforms V1 and V2, but the Vorknkx was safeguarded and escaped to hyperspace."}, {"tag": "p", "text": "During Thrawn's campaign against Zaarin, Darth Vader also employed Missile Boats in his campaign leading up to the Battle of Endor, involving the Bothan spies. Missile Boats were responsible for destroying a Bothan Dreadnaught-class cruiser attempting to transfer information to the Rebellion, performing raids and reconnaissance on the Rebel buildup, and wearing down the Alliance starship reserves prior to the battle. While Mon Mothma was not referring to the Missile Boat when she spoke of the Bothan sacrifice, Bothan blood was spilled at the hands of Missile Boat pilots."}, {"tag": "p", "text": "The Missile Boat played a key role defending the Emperor himself, perhaps the most prominent of its accomplishments. Immediately following Darth Vader's preliminary arrangements for the impending battle at Endor, Emperor Palpatine boarded his private passenger liner Excalibur, en route to Endor. During its voyage, it came under attack by more of Zaarin's traitor forces. Maarek Stele and his Missile Boat, escorted by TIE Avengers, repelled an attack composed of the Victory-class Star Destroyer Zeplin, the Nebulon-B frigate Kimik, and a number of Assassin-class corvettes. With the Missile Boat having thwarted the bulk of the attack force, the Excalibur escaped into hyperspace."}, {"tag": "p", "text": "After Darth Vader's strategic campaign against the Bothans, Admiral Zaarin became privy to the Emperor's plot to destroy the Rebels. While Zaarin too detested the Rebellion, his henchman, Namuura Din, sought to defect to it. Missile Boats played a role in the capture of Namuura Din and his flagship, the Victory-class Star Destroyer Zeplin; moreover, Missile Boats were responsible for the inspection of a Rebel craft carrying a stolen Missile Boat, dubbed Sealion, and information concerning the operational status of the second Death Star. Upon this discovery, the Empire was faced with the perilous task of retrieving this classified information. Missile Boats led an assault on the Rebel cruiser Link, which was carrying the stolen Missile Boat; although Imperial forces captured the Rebel cruiser, the captured craft escaped, but was quickly located on the Rebel XQ4 Platform Enin'sd. In what would prove to be their last sortie, Missile Boats facilitated the capture of the Rebel platform and the stolen Missile Boat. An inspection of the Sealion confirmed that the Rebels had insufficient time to reverse engineer the Missile Boat and expose its secrets. Despite this fact, the Emperor deemed the loss of the Missile Boat too great a threat to his elaborate plans to crush the Rebel Alliance due to Zaarin's usage of the vehicles as well as many of the Missile Boat manufacturing plants having been destroyed by bombings issued by Zaarin himself, killing thousands of innocents in the process; thus it was ordered that all Missile Boats would be put into protected storage until the Rebel \"problem\" was solved. The Emperor's recall order was never rescinded after his death at Endor. Following the death of the attempted usurper, Imperial Missile Boats were never again seen in combat."}, {"tag": "p", "text": "As an experimental craft, the Missile Boat never achieved fruition as a result of the Emperor's recall. Training facilities had begun training elite pilots to form a new Missile Boat unit, from which some anticipated impressive results; this was subsequently halted by the Emperor's command. Maarek Stele, however, was among the small number of pilots who were known to have piloted the Missile Boat. One of the few innovations of the Missile Boat program that would see later use was, ironically, deployed by the New Republic rather than the fragmentary remnants of the Empire. The SLAM overdrive system was used by Koensayr Manufacturing on the BTL-S8 K-wing bomber— many of which were carried on the Viscount-class Star Defenders that the New Republic sent against the Imperial Remnant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Missile Boat was first introduced in the 1994 video game Star Wars: TIE Fighter as part of the Defender of the Empire campaign set, intended as a counter to the TIE Defender which was introduced earlier on. The Missile Boat serves as part of the escalation of tactics between loyal and traitorous Imperial forces, in which the player character, Maarek Stele, is forced to fight those he had earlier served with."}, {"tag": "p", "text": "The appearance of the Missile Boat differs significantly from Star Wars: TIE Fighter to Star Wars: X-Wing Alliance. In its original appearance in the earlier game, the Missile Boat appeared sleeker and more aggressively contoured. Yet in the later display, the Missile Boat bears a stronger resemblance to the Lambda-class shuttle. The version of TIE Fighter for Windows 95, as included with X-Wing Collector Series and X-Wing Trilogy, seems to be the first appearance of a major change to the body style, carried on to X-Wing Alliance in its later release. The reason for this inconsistency remains unknown, and both body styles have been officially rendered independently of a video game."}, {"tag": "p", "text": "Some of the fighter's statistics also varied between the two games. In the original MS-DOS release of TIE Fighter, the Missile Boat's length is given as fifteen meters. This was amended to ten meters in the later Windows 95 release. Both versions of TIE Fighter give the Missile Boat a top speed of 125 MGLT and a hull rating of 20 RU. These were changed to 122 MGLT and 19 RU in X-Wing Alliance. This article uses the figures given in the most recent sources."}, {"tag": "p", "text": "Although this craft was initially left out of the multiplayer-oriented game Star Wars: X-Wing vs. TIE Fighter for the sake of balance, the game data files still have an entry for the craft library which reads, \"This is the King Hell God Emperor Starfighter of Death and you can't fly it yet!\" The Missile Boat was finally included in X-Wing Alliance, but was not in any story missions despite the timeframe coinciding with TIE Fighter. The fighter was only available in multiplayer, and the SLAM overdrive was not implemented. In all its appearances, the Missile Boat is considered by some fans to be a quintessential example of \"missile spam.\""}, {"tag": "p", "text": "Conforming to the standard Imperial doctrine of naming starfighter flight groups by the Greek alphabet, the Missile Boat also shared the designations \"Tau\" and \"Mu\" with the Assault Gunboat, which had some of the same letters in its callsign (i.e. Tau 1, Mu 1)."}, {"tag": "p", "text": "Fan-created references often refer to the Missile Boat as the \"XM-1 Nova Wing,\" but a thorough search of official, unmodified source materials reveals no such nomenclature."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}