{"url": "Missing_in_Action", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Missing in Action"}, {"tag": "p", "text": "\"Missing in Action\" is the twelfth episode of the Star Wars: The Clone Wars television series' fifth season, the hundredth episode overall of the series. It aired on January 5, 2013."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"In a nearly vacant town, R2-D2 and his team find a clone commando suffering from amnesia.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "D-Squad has arrived in the seedy town of Pons Ora. Colonel Gascon and WAC-47 enter a diner for some refreshment while the astromechs perform reconnaissance around town to look for hostiles. But upon announcing themselves, Gascon and WAC are rudely shooed out by the diner's cook, Borkus. WAC takes Gascon to the side of the diner where a swarm of bugs are scurrying towards the garbage. Though disgusted at the thought of eating leftovers, Gascon sees no alternative. But before he can take a bite, a human dishwasher named Gregor steps out of the diner to throw out the garbage, accidentally hitting Gascon. Apologizing for his mistake, Gregor offers to give him some food on the side. However, Gascon stares at Gregor and identifies him as a clone trooper. Gregor apparently has no idea what a clone is and is forced to return to work. Gascon and WAC then rendezvous with the astromechs, who confirm the presence of Separatists on Abafar."}, {"tag": "p", "text": "After his shift is done, Gregor asks Borkus what a clone is. The Sullustan vaguely says clones fight in a galactic war and tells Gregor to forget about it, reminding him that it was he who found him. Though Gregor still appreciates his help, he asks how he arrived on Abafar. Borkus avoids the question, and tells Gregor to go home, and never mention the word \"clone\" again."}, {"tag": "p", "text": "Meanwhile, D-Squad finds a heavily guarded landing field with a Rho-class transport shuttle. Though Gascon insists they discreetly make their way to the shuttle, the droids point out that the Separatists may be on the lookout for them after their adventure on the dreadnaught. As a head-on attack would be suicide, Gascon decides to enlist Gregor's help."}, {"tag": "p", "text": "D-Squad locates Gregor's apartment and get his attention by having R2 project a hologram of Captain Rex. They explain to him his true origins as a clone, meant to fight for the Republic. Gregor is hesitant to believe them, saying he's lucky that Borkus is paying off his rent. Gascon corrects that he's Borkus' slave. As Gregor has amnesia, Gascon has R2 ID Gregor off his identification code on his wrist, revealing Gregor to be a clone commando. He had been presumed missing in action in the Battle of Sarrish, one of the Republic's most devastating military defeats. Recalling vague memories of the battle, Gregor agrees to assist D-Squad. They then go searching for his equipment, unaware that Borkus is watching them. They go to Borkus' diner, only for the Sullustan to come to them, revealing he has Gregor's gear. Gregor demands to know why he withheld the truth from him. Borkus said he didn't care and reminds Gregor owes him a life debt. The clone retorts that he made him a slave and demands his gear. Borkus gets the drop on Gregor but the droids tie him up. As D-Squad prepares to leave, Borkus pleads Gregor not to leave but he refuses. Borkus then reveals that the Separatists plan on blowing up a Republic cruiser in orbit with the rhydonium fuel they mined. He says that they'll never escape and will be begging him for a job."}, {"tag": "p", "text": "D-Squad returns to the landing zone, confirming that Borkus was telling the truth. D-Squad unanimously agree to save the cruiser. Gregor provides cover fire for Gascon and the droids as they make their way to the shuttle. However, the battle droids spot D-Squad and open fire on them. A stray shot hits a Rhydonium canister, knocking down BZ and Gascon inside him. The Colonel tells WAC to leave him, an order that the pit droid quickly complies with. However, Gregor comes back for him and stays behind to cover their escape. Though Gascon and R2 insists they can save him, Gregor promises he will return home. As the Separatists surround him, Gregor shoots nearby canisters, causing massive explosions. As their shuttle departs Abafar, Gascon promises that Gregor's sacrifice will not be forgotten and they will watch for his return."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"Missing in Action\" was originally reported by Star Wars Insider 137 as the eleventh episode of Season Five, but the reported order was revised following the magazine's publication."}, {"tag": "p", "text": "The opening logo for the episode, traditionally yellow, was rendered blue to salute R2-D2. The other three episodes of this arc, \"Secret Weapons\", \"A Sunny Day in the Void\", and \"Point of No Return\", also feature this blue opening logo. However, it is not the first time the logo changes color. In Season 4's last two episodes (\"Brothers\" and \"Revenge\"), the logo was painted red, on the reason of the return of Darth Maul."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}