{"url": "Mission_1:_Political_Escort", "categories": ["Category:Real-world articles", "Category:X-Wing Miniatures Game missions"], "nodes": [{"tag": "h1", "text": "Mission 1: Political Escort"}, {"tag": "p", "text": "Mission 1: Political Escort is the first starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the X-Wing: Core Set."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "En route from Dantooine, a Rebel senator's fleet was ambushed by the Empire and nearly wiped out. The senator himself escaped in a shuttle, but a stray blast knocked out his ship's hyperdrive and sensors. Utterly reliant on his escort, the Rebel Senator can do little more than go straight forward and hope he reaches the outskirts of a friendly system soon. Unfortunately, the Imperial fleet has already dispatched fighters to round up the survivors. Now, the Rebel escort must protect the Senator until he can reach safety, but the Imperials won't make it easy for them…"}, {"tag": "h2", "text": "Mission Setup"}, {"tag": "p", "text": "Rebel: Red Squadron Pilot."}, {"tag": "p", "text": "Imperial: 2 Academy Pilots."}, {"tag": "p", "text": "The Rebel player places the senator's shuttle token within Range 1 of his edge of the play area. The shuttle must be placed in the exact center of his edge, with its artwork pointing directly toward the Imperial player's edge of the play area. Then he places his ship(s) within Range 2 of his edge of the play area."}, {"tag": "p", "text": "Then the Imperial player places his ships within Range 2 of his edge of the play area."}, {"tag": "h2", "text": "Mission Tokens"}, {"tag": "p", "text": "Senator's Shuttle Token"}, {"tag": "p", "text": "Tracking Tokens (used to represent the Shuttle's Shields)"}, {"tag": "h2", "text": "Mission Objectives"}, {"tag": "p", "text": "The senator's shuttle must flee off the Imperial side of the combat area for a Rebel victory. The Imperials are victorious if the senator's shuttle is destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}