{"url": "Mission_11:_Interdiction", "categories": ["Category:Real-world articles", "Category:X-Wing Miniatures Game missions"], "nodes": [{"tag": "h1", "text": "Mission 11: Interdiction"}, {"tag": "p", "text": "Mission 11: Interdiction is the eleventh starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the VT-49 Decimator Expansion Pack."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Imperial Commander stood stock-still upon the bridge of the VT-49 Decimator, hands clasped tightly behind her back, watching through the viewports as two TIE/ln fighters moved to intercept a pair of Rebel ships. \"Perhaps you can explain something to me, lieutenant,\" she said, her icy voice breaking the silence. \"Why aren't our batteries firing?\""}, {"tag": "p", "text": "\"Our fighters are engaging the enemy, Commander. We have no clear shot.\""}, {"tag": "p", "text": "\"I have heard you praise the accuracy of our gunnery teams on numerous occasions. I hope it was more than idle boasting. Commence firing!\""}, {"tag": "h2", "text": "Mission Setup"}, {"tag": "p", "text": "Rebel: 100 squad points; the Rebel player must field exactly four small ships."}, {"tag": "p", "text": "Imperial: Rear Admiral Chiraneau with Ruthlessness, Ysanne Isard, Ion Torpedoes, Dauntless; and 2 Academy Pilots. Alternatively, instead of Rear Admiral Chiraneau and his upgrades, the Imperial player may spend up to 60 squad points on a VT-49 Decimator with equipped upgrade cards."}, {"tag": "p", "text": "The Imperial player places all six of the asteroids in the play area. Asteroids cannot be placed within Range 1 of any other asteroid."}, {"tag": "p", "text": "Then the Imperial player chooses two of the Rebel player's ships. The Rebel player places those ships within Range 1 of the Rebel edge (The side opposite the Rebel edge is the neutral edge, the other two sides are Imperial edges)."}, {"tag": "p", "text": "Then the Imperial player places his ship(s) within Range 1 of either of the two Imperial edges."}, {"tag": "p", "text": "Note: The remaining two Rebel ships are not placed until the end of Round Three."}, {"tag": "h2", "text": "Mission Objectives"}, {"tag": "p", "text": "The Rebels achieve a victory if they eliminate all Imperial ships. The Empire is successful if they eliminate all four Rebel ships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}