{"url": "Mission_9:_Jump_to_Subspace", "categories": ["Category:Real-world articles", "Category:X-Wing Miniatures Game missions"], "nodes": [{"tag": "h1", "text": "Mission 9: Jump to Subspace"}, {"tag": "p", "text": "Mission 9: Jump to Subspace is the ninth starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the Rebel Aces Expansion Pack."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "A Rebel operative holds a high-ranking Moff captive in an escape pod. The Rebels send a rescue squad of A-wings and B-wings, the Imperials intercept the rescue attempt."}, {"tag": "h2", "text": "Mission Setup"}, {"tag": "p", "text": "Rebel: 100 squad points; at least one A-Wing and one B-wing; at least one of those must be a Unique Pilot"}, {"tag": "p", "text": "Imperial: 75 Squad points, no large ships."}, {"tag": "p", "text": "The Imperial player places one of the six asteroid tokens into the asteroid setup area (not within Range 3 of the Imperial edge and the neutral edges of the play area, not within Range 1 of the Rebel edge of the play area). Then, the Rebel player chooses one of the remaining asteroid tokens and places it into the setup area. The players continue to alternate until all six tokens have been places. Asteroids cannot be placed within Range 1 of any other asteroid. The Rebel player then places the escape pod token within Range 2 of the Imperial edge and equidistant from the 2 neutral edges."}, {"tag": "p", "text": "Then, starting with the Rebel player, each player takes a turn placing one of his ships in one of two deployment areas for his faction (Rebels within Range 2 of his edge left-corner and within Range 2 of the Imperial Edge and range 1 of his right neutral edge, Imperials with in Range 2 of the right Rebel corner and with Range 2 of the Imperial Edge and range 1 of his right neutral edge). At least 25 points worth of ships must be deployed in each deployment zone."}, {"tag": "p", "text": "The Imperial player has initiative."}, {"tag": "h2", "text": "Mission Objectives"}, {"tag": "p", "text": "Rebels win when the escape pod flees off the Rebel edge."}, {"tag": "p", "text": "The Empire wins by destroying all rebel ships."}, {"tag": "h2", "text": "Bibliography"}]}