{"url": "Mission_8:_Rendezvous", "categories": ["Category:Real-world articles", "Category:X-Wing Miniatures Game missions"], "nodes": [{"tag": "h1", "text": "Mission 8: Rendezvous"}, {"tag": "p", "text": "Mission 8: Rendezvous is the eighth starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the Rebel Transport Expansion Pack."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "After escaping from the Hoth system, three straggling transports rendezvous at the predetermined coordinates and plan a course of action. Despite their best efforts, Imperial forces tracked one GR-75's sensor trail to the rendezvous point. As the Imperial trap springs, the Rebels scatter, hoping that the majority of the gathered forces manage to survive."}, {"tag": "h2", "text": "Mission Setup"}, {"tag": "p", "text": "Rebel: 3 GR-75s (each with Combat Retrofit), 200 squad points. On each GR-75, reduce the combined cost of the Upgrade cards equipped to that ship by 10 (to a minimum of 0)."}, {"tag": "p", "text": "Imperial: 250 Squad points"}, {"tag": "p", "text": "The play area is 4' x 3'. The long edges are the player's edges."}, {"tag": "p", "text": "The Rebel player places his GR-75 ships in the play area. Each GR-75 must touch the Rebel edge and cannot be at Range 1-2 of a neutral edge."}, {"tag": "p", "text": "Then the Imperial player places four hyperspace tokens along his edge. He must place each hyperspace token beyond Range 3 of each another hyperspace token."}, {"tag": "p", "text": "Then the Imperial player divides his ships into four groups. he must distribute his ships as evenly as possible among the groups (ignoring squad point cost). Then he places each group in the play area at Range 1 of a different hyperspace token."}, {"tag": "p", "text": "Then the Rebel player places his remaining ships within Range 1-3 of the Rebel edge."}, {"tag": "p", "text": "Then the Imperial player removes one of the hyperspace tokens from the play area. For each remaining hyperspace token, he assigns the matching group token to a different GR-75."}, {"tag": "p", "text": "The Rebel Player has initiative."}, {"tag": "h2", "text": "Mission Objectives"}, {"tag": "p", "text": "Rebels win when two GR-75s flee the play area; each must flee with a portion of one section still in the play area at Range 1 of the hyperspace token matching its group token."}, {"tag": "p", "text": "The Empire wins by destroying two GR-75 ships."}, {"tag": "h2", "text": "Bibliography"}]}