{"url": "Mission_6:_Undeniable_Assets", "categories": ["Category:Real-world articles", "Category:X-Wing Miniatures Game missions"], "nodes": [{"tag": "h1", "text": "Mission 6: Undeniable Assets"}, {"tag": "p", "text": "Mission 6: Undeniable Assets is the sixth starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the Lambda-class Shuttle Expansion Pack"}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "Imperial Intelligence deployed a team of undercover agents on a convoy contracted to Xizor Transport Systems, hoping to uncover the Alliance's infrastructure. Rebel sympathizers in the convoy discovered the plot and disabled the convoy before it could return to Imperial space. The Empire's forces must cover the agents as they escape; any agents forced to flee without escort will surely fall into Rebel hands."}, {"tag": "h2", "text": "Mission Setup"}, {"tag": "p", "text": "Rebel: 100 Squad Points"}, {"tag": "p", "text": "Imperial: 120 Squad Points"}, {"tag": "p", "text": "The Rebel player places one disabled ship token into the play area. Then he places two more disabled ships tokens into the play area, each at Range 3 of the first disables ship and not at Range 1 of each other. Disabled ships cannot be placed within Range 1 of any edge of the play area. Then he places four passengers (tracking tokens) on each disabled ship."}, {"tag": "p", "text": "Then the Rebel player places his ships anywhere within Range 1-2 of the upper-left and/or lower-right corners of the play area."}, {"tag": "p", "text": "Then the Imperial player places his ships anywhere within Range 1-3 of the lower-left corner of the play area and/or within Range 1 of the upper-right corner of the play area."}, {"tag": "h2", "text": "Mission Objectives"}, {"tag": "p", "text": "Rebels attain victory by capturing six passengers or destroying all Imperial ships (excluding disabled ships)."}, {"tag": "p", "text": "The Empire wins by securing five passengers."}, {"tag": "h2", "text": "Bibliography"}]}