{"url": "Mission_4:_Den_of_Thieves", "categories": ["Category:Real-world articles", "Category:X-Wing Miniatures Game missions"], "nodes": [{"tag": "h1", "text": "Mission 4: Den of Thieves"}, {"tag": "p", "text": "Mission 4: Den of Thieves is the fourth starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the Millennium Falcon Expansion Pack."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Because of their fundamental role in the Imperial Navy, Sienar engineers are vital to the Empire's hold on the galaxy. Their most ceaseless toil is responsible for the most recent starship prototype, currently in transit to rendezvous with the Imperial Fleet. Alliance Intelligence discovered it only days ago and offered a substantial reward for the prototype's capture. Rebel-aligned smugglers are prepared to ambush the vulnerable shipment, and the modest Imperial escort must safely deliver its precious cargo."}, {"tag": "h2", "text": "Mission Setup"}, {"tag": "p", "text": "Rebel: 100 Squad Points"}, {"tag": "p", "text": "Imperial: 100 Squad Points"}, {"tag": "p", "text": "The Imperial player places his ships with Range 1-3 of the Imperial Edge of the play area and not within Range 1 of the neutral edges of the play area. Then the Imperial player chooses two of his ships and assigns 1 escort token to each (insert the tokens into the tower of each ship's base)."}, {"tag": "p", "text": "Then the Imperial player places three container tokens within Range 1-3 of the Imperial edge of the play area. A container token cannot be placed within Range 1 of the neutral edges of the play area, and it must be at Range 3 or farther away from each other container token. The container tokens must be oriented to face directly toward the Rebel edge of the play area."}, {"tag": "p", "text": "Then the Rebel player places his ships within Range 1 of the Rebel Edge or the neutral edges of the play area. A Rebel ship cannot be placed within Range 1-2 of a container token. Then the Rebel player assigns the smuggler token to one of his ships, inserting the token into the tower of that ship's base."}, {"tag": "h2", "text": "Mission Objectives"}, {"tag": "p", "text": "The Rebels achieve a victory if their ships collect two containers. The Empire is successful if two containers flee off the Rebel edge of the play area. The Imperials may win even if all Imperial ships are destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}