{"url": "Mission_from_Mount_Yoda", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Jedi Prince"], "nodes": [{"tag": "h1", "text": "Mission from Mount Yoda"}, {"tag": "p", "text": "Mission from Mount Yoda (1993) is the fourth book of the Jedi Prince series by Paul and Hollace Davids. It is set in the New Republic era and written for an audience of young readers."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "'A DYING PLANET.'"}, {"tag": "p", "text": "A DESPERATE MISSION."}, {"tag": "p", "text": "'AND A PROPHECY OF DOOM FOR THE REBEL ALLIANCE.'"}, {"tag": "p", "text": "The battle against the evil Empire rages on as heroic men, women, and aliens of the Rebel Alliance continue their struggle to end the era of darkness. But now a mysterious visitor comes to the Rebel fortress located atop Mount Yoda, bringing ominous news."}, {"tag": "p", "text": "Kadann, Supreme Prophet of the Dark Side, plots to capture and destroy the carbonized body of Trioculus and take control of the Empire. Meanwhile, the Rebel Alliance races to save the archaeologists of the dying planet Duro, only to discover an incredible mystery in the underground tunnels, a secret that depends on a perilous… Mission from Mount Yoda."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "With Trioculus imprisoned in carbonite, the Prophets of the Dark Side meet in Kadann's Chamber of Dark Visions to hear his new prophecy on the leadership of the Empire. Kadann spoke in quatrains, prophesying that Trioculus would never again get the blessing to be leader, the new leader is on Duro and finally about the last days of the Rebel Alliance. As the Moffs concoct a plan to retrieve Trioculus' body (and the Prophets one to destroy it), Luke, Leia and Han fly to Dagobah. The rebels began to colonize Dagobah by building a school, which Ken is to attend, and a fortress that served as the Defense Research and Planetary Assistance Center, DRAPAC. DRAPAC was based on Mount Yoda, and was the subject of Kadann's prophecy"}, {"tag": "p", "text": "While there, a Duro, Dustini, brings news that Duro is under attack by Imperial stormtroopers stealing artifacts. Though he managed to save some, one was a golden crown that was booby trapped and stabbed Dustini, seemingly fulfilling the prophecy. As the Rebels send a mission to Duro to stop the Empire, the Prophets destroy the block of carbonite, failing to discover it was fake and Trioculus was still alive. In a secret cavern on Duro, Luke, Han and Ken finally encounter Triclops, the true son of Emperor Palpatine. Though the Imperials attacked trying to abduct Triclops, with his help the rebels escaped and brought Triclops back to DRAPAC, with him promising to bring down his father's Empire."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}