{"url": "Mission_on_Alzoc_III_(Empire_Reborn)", "categories": ["Category:Legends articles", "Category:Battles in the Sujimis sector", "Category:Battles of the Empire Reborn campaign", "Category:Duels", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Mission on Alzoc III  (Empire Reborn)"}, {"tag": "p", "text": "After hearing a rumor of an Imperial installation on Alzoc III, Mon Mothma sent Kyle Katarn and Jan Ors on a mission to confirm the Imperial presence. She ordered the two to access the base by posing as cargo haulers. Jan, piloting the Raven's Claw, flew over a landing pad and dropped Kyle off in a supply crate, and flew into one of the hangars. She began planting an unknown device. Kyle hacked his way through the landing pad and into a windowed room on the top floor, where he killed an officer and used a security key to access the shield room."}, {"tag": "p", "text": "Jan was discovered by a squad of stormtroopers in one of the hangars, and was taken hostage at blasterpoint. She urged Kyle to move faster. He first had to power down the generator in the shield room to deactivate any force fields cutting her off from Kyle. As he reached the top floor, another force field was blocking access to the hangar area. He deactivated this one by mind tricking the officer in the security booth into granting access, before killing him."}, {"tag": "p", "text": "The final barrier blocking off the Raven's Claw's hangar was a security door guarded by a Reborn. After a brief lightsaber duel resulting in the Reborn's death, another Reborn leaped down from the catwalk. After that one's death, a squad of stormtroopers emerged from the security door, and were all killed."}, {"tag": "p", "text": "Kyle entered the hangar to find an officer holding a blaster to Jan's back. But, he was distracted by Kyle for a moment, and Jan used this moment to subdue him. They narrowly flew out of the hangar before an army of reinforcements arrived."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This mission was originally the Star Wars: Jedi Knight II: Jedi Outcast game demo for both console and PC, and was later included in the final game as a bonus level for only the console like Xbox and Gamecube. The sound files used in this level, including scripted dialogue are all lifted from various points in the full game. On the lower difficulty settings, only one Reborn appears at the end of the level."}, {"tag": "p", "text": "It has not been canonically determined whether the demo occurs before, during or after the full game (both state 8 years after Endor in their opening crawl); however, since Katarn has his lightsaber during the demo, it has here been placed after the full game wherein he regains his lightsaber. However the player has limited force powers in this level, though this may have because of it being a demo."}, {"tag": "p", "text": "Though this bonus mission is a demo, as stated above, Kyle Katarn would at this point be a Jedi Master, chronologically speaking."}, {"tag": "p", "text": "If a Reborn kills the player, he'll sometimes proclaim that \"Master Desann will be pleased.\" As the level is meant to take place after the full game, this is either a dialogue error or the two Reborn are unaware that Desann is dead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}