{"url": "Mission_on_Lothal", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Battles of the Galactic Civil War", "Category:Missions of the Ghost", "Category:Missions to Lothal"], "nodes": [{"tag": "h1", "text": "Mission on Lothal"}, {"tag": "p", "text": "In 3 BBY, the Spectres undertook a mission on Lothal to raid an Imperial depot on the planet Lothal in an attempt to hijack three Sphyrna-class Hammerhead corvettes. These corvettes were delivered to Lothal by Princess Leia Organa of Alderaan, under the guise of a mercy mission, for use by the rebellion. The rebels fought against an Imperial garrison under the command of Lieutenant Yogar Lyste, who believed Organa to be a loyal Imperial and was unable to prevent the ships from being stolen. With the help of Leia and the former Lothalian Governor Ryder Azadi, the rebels were able to steal the three corvettes, which bolstered Phoenix Cell."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Phoenix Cell sustained losses during their escape from Imperial forces on Garel. Having heard of their losses, Alderaanian Senator Bail Organa, who was a secret supporter of the rebellion, sent his adopted daughter Princess Leia Organa to deliver reinforcements to the Phoenix rebels. These reinforcements consisted of three Sphyrna-class Hammerhead corvettes the Lightmaker, the Amity's Arrow and the Duchess Senna, later named P1, P2, and P3. Since the Alderaanians were unable to directly deliver the ships to the rebels without their disloyalty to the Empire being exposed, Leia Organa had arranged for the ships to be delivered to Lothal, an Imperial world under the guise of delivering relief supplies. There, the rebels would \"steal\" the ships so that the Alderaanians could not be accused of supporting the rebellion."}, {"tag": "p", "text": "Princess Leia traveled to Lothal under the pretext of delivering relief supplies to the inhabitants of Lothal, which had been subject to a lockdown as a result of the rebel insurgency there. Upon arriving above Lothal, they were directed by Lieutenant Yogar Lyste to land at an Imperial depot near the town of Jalath. After landing, Leia was greeted by two members of the Spectres: the former Jedi Padawan Kanan Jarrus and his apprentice Ezra Bridger; who were disguised as a stormtrooper and an Imperial cadet respectively. Kanan and Ezra had received instructions from Hera Syndulla to rendezvous with Leia in order to \"steal\" the starships."}, {"tag": "p", "text": "Leia's plans encountered a stonewall when Lieutenant Lyste fastened gravity locks to the corvettes in order to deter thefts. Lyste was aware that Alderaanian ships had a habit of being stolen on Imperial worlds, but could not find any evidence linking Leia to the rebellion. As a further deterrent, Lyste assigned two AT-AT walkers to guard the ships and ordered his stormtroopers to search the vessels for contraband. Lacking a transport to do her \"relief work,\" Leia borrowed Lyste's Sentinel-class landing craft and departed with Kanan and Ezra. While flying over Lothal's plains, they received a distress transmission from Chopper."}, {"tag": "p", "text": "Traveling to Ryder Azadi's hideout, they found that stormtroopers had arrested the former Governor and Chopper. The Imperials had orders to execute Azadi. Kanan, still disguised as a stormtrooper, and Leia attempted to reason with them but to no avail. Their conversation was interrupted by the arrival of the Spectres' ship, the Ghost. While Hera piloted the VCX-100 light freighter, Sabine Wren and Garazeb Orrelios attacked the stormtroopers and picked up Kanan, Ezra, Leia, and Ryder. During the attack, Lyste's landing craft was destroyed when Chopper fired the Phantom's guns at the shuttle. To hide Leia's rebel links, Ryder pretended to abduct her, while Zeb pretended to take Kanan and Ezra, still in Imperial disguise, prisoner when they attempted to \"rescue\" the princess."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "After escaping the Imperials, the crew of the Ghost discussed their plans to commandeer the Hammerhead corvettes. While Azadi was reluctant to commit himself fully to the rebellion, he agreed to helped them deactivate the gravity locks in exchange for getting safe passage off Lothal. As part of the plan, Leia, along with Kanan and Ezra (still wearing their Imperial military uniforms), would travel to the Imperial depot in the Phantom. Sabine, Chopper and Azadi would be hiding aboard the shuttle. While Leia and company distracted Lieutenant Lyste and his men, the other rebels would disembark, deactivate the gravity locks, and free the impounded ships. Meanwhile, Hera and Zeb would harry the Imperial walkers with the Ghost."}, {"tag": "p", "text": "While Leia spoke with Lieutenant Lyste, Ryder, along with Sabine and Chopper, disabled the gravity lock on the Hammerhead corvette P1. After disabling the locks, Sabine took the ship's helm. Upon realizing that intruders were stealing the corvette, Lyste ordered his men to stop the rebels. One of the AT-AT walkers attempted to shoot down the corvette. Meanwhile, Ryder and Chopper went to disable the gravity lock restraining the second Hammerhead corvette, P2, but were spotted by Imperial stormtroopers. Sabine, in P1, fired upon the Imperials. Kanan and Ezra knocked out Lyste and two of his stormtroopers."}, {"tag": "p", "text": "During the fighting, an AT-AT that had been briefly stunned by the Ghost's proton torpedoes got back to its feet, so Kanan used his lightsaber to sever the walker's two right legs, causing it to topple to the ground. After disabling the second gravity lock, Ryder instructed Kanan to depart on P2. Ryder then attempted to board the third Hammerhead corvette named P3, but was cornered by two stormtroopers. Ezra then used his Force powers to seize their blasters, and Leia grabbed one of the blasters and shot the troopers. In response to the attacks, several Imperial Troop Transports arrived. Despite Leia's protests, the leader of the arriving stormtroopers ordered the remaining AT-AT walker to take out the remaining Hammerhead corvettes."}, {"tag": "p", "text": "On the third Hammerhead corvette, Ryder attempted to force the ship to fly despite the gravity lock and engaged the thrusters, toppling the second AT-AT with the force generated from them. Having accomplished his mission, Chopper departed aboard the Phantom. Before departing, Leia and Ezra bid farewell to each other and promised to meet again. To maintain the ruse that she was still a \"loyal\" Imperial citizen, Leia ordered Ezra to stun her. Shortly later, Leia was recovered by Lyste and his stormtroopers. Feigning anger at the Imperials for losing her ships, Leia threatened to report their incompetence to the Imperial Senate. However, Lyste managed to placate Leia by offering to pay for her missing ships. The Imperial officer then realized that his own ship had also disappeared; the Sentinel-class landing craft had been destroyed by the crew of the Ghost during the alleged \"kidnapping\" of Leia and the disguised Kanan and Ezra."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The raid on the Imperial depot at Jalath was a success for Phoenix Squadron, as it helped them recoup the losses they had sustained on Garel earlier. Lieutenant Lyste was summoned to a meeting with ranking officers, where he was reprimanded for the theft. Meanwhile in space, Ryder, now realizing that what Ezra's parents started had become even larger then he thought, agreed to help the rebel cause for both them and their son's sake. Despite this small victory, the rebellion was still heavily outmatched and outgunned by the Galactic Empire, which still controlled much of the galaxy. P2 eventually fell during the Battle of Atollon and P1 and P3 joined the larger rebellion. One of the two was the Lightmaker which sacrificed itself in the Battle of Scarif to destroy two Star Destroyers and penetrate the Shield Gate."}, {"tag": "p", "text": "Sometime after the mission, Organa made a complaint to Moff Stattata of the Lothal sector. Following the complaint compensation was paid by the Empire to the Royal House of Alderaan for reimbursement for the \"stolen\" ships and cargo. The total value of the claim was 2,242,500 credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Raid on the Lothal Depot served as the climax for the Star Wars Rebels episode \"A Princess on Lothal,\" which first premiered on Disney XD on January 20, 2016. It featured the Original trilogy character Princess Leia (voiced by Julie Dolan) as a guest character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}