{"url": "Mission_to_Alistan_Nor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Non-canon articles", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Alistan Nor"}, {"tag": "p", "text": "In 4 ABY, Rowan Freemaker, R0-GR and Quarrie went on a mission to the abandoned Force Builders' city of Alistan Nor on a remote jungle planet. During the trip, Rowan found the inspiration and strength to build the Arrowhead, a starship that was believed to be able to turn the tide of the Galactic Civil War. Rowan and his companions were pursued by the Imperial hunter droid M-OC."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After experiencing a Force vision of a powerful starship called the Arrowhead, Rowan Freemaker struggled with explaining the description of the ship to the Mon Calamari starship builder Quarrie, who worked for the Rebel Alliance. Rowan believed that the Arrowhead could change the tide of the Galactic Civil War. At the urging of Quarrie, Rowan decided to travel to the city of Alistan Nor in order to learn craftsmanship and style. Alistan Nor had been the home of the Force Builders, an offshoot of the Jedi, who specialized in architecture and building starships."}, {"tag": "p", "text": "While Rowan was unable to convince his older siblings Kordi and Zander Freemaker to travel with him on the StarScavenger, he managed to convince Quarrie and the B1-series battle droid Roger to accompany him. Despite his limited piloting skills, Rowan managed to take the StarScavenger to the planet Alistan Nor, which was surrounded by three rings. While traveling through an asteroid field, he was detected by the Imperial probe droid XJ9-GM02, who reported his presence to the Imperial hunter droid M-OC, who traveled to the city of Alistan Nor on the Tracker I. M-OC had been tracking Rowan since the earlier skirmish on Tibalt."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Exploring Alistan Nor"}, {"tag": "p", "text": "After landing the StarScavenger, Rowan, Quarrie, and Roger navigated their way through the ruins of Alistan Nor, which had long been reclaimed by the jungle. Shortly later, they were pursued by a pack of gundarks. Quarrie and Roger managed to find a tunnel while Rowan used lightsaber to hold back the gundarks and the Force to imprison them behind stone columns. Rowan then followed the others into the tunnel which led to the interior of the Tower of Alistan Nor, the main structure in the city."}, {"tag": "p", "text": "Rowan and his fellow travelers climbed the steps and reach the summit of the tower. While looking at the jungle-covered ruins of Alistan Nor, Rowan saw a vision of the city in its golden days. He also experienced another Force vision of the Arrowhead and found the inspiration to build the ship. Shortly later, Roger heard the buzz of engines approaching. This ship turned out to be M-OC's Tracker I"}, {"tag": "h3", "text": "Duel with M-OC"}, {"tag": "p", "text": "M-OC blasted Rowan, Roger, and Quarrie with the Tracker I's cannons. The three rebels narrowly avoided being crushed by a falling pillar. M-OC continued blasting them and they fell off the ramparts. Rowan however used the Force to grab onto a vine. He also used the Force to suspend Roger and Quarrie in mid-air. The rocket booster–equipped M-OC then exited his ship and attacked Rowan with his new Double-bladed spinning lightsaber and blasters. Rowan managed to use the Force to direct Roger and Quarrie towards a lower-hanging vine."}, {"tag": "p", "text": "As the fighting continued, M-OC fired on the ancient tower and Rowan was forced to dodge from vine to vine. At one point, M-OC was hit by the fallen balcony but was quickly able to rebuild himself. Before M-OC could rejoin the fight, he was attacked by a pack of gundarks. This provided a window for Rowan, Roger, and Quarrie to escape offworld on the StarScavenger before the indestructible droid could continue the pursuit."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After returning to the MC80A Home One Type Heavy Star Cruiser Home One, Rowan apologized to Zander and Kordi for taking the StarScavenger on a joyride. The three sibling quickly reconciled and Quarrie told Zander and Kordi that Rowan was one of the last Force Builders. Having made sense of Rowan's vision, Quarrie explained that they needed several starship parts including embersteel blades, a fusion conduit, suspension housing, an energy matrix activator, and a bantha-sized kyber crystal. As a result, the Freemakers embarked on a quest to find the parts to build the Arrowhead."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Alistan Nor serves as the main conflict of the LEGO Star Wars: The Freemaker Adventures Season Two episode \"The Tower of Alistan Nor,\" which premiered on July 31, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}