{"url": "Mission_to_Ashas_Ree", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Events during the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Mission to Ashas Ree"}, {"tag": "p", "text": "In 34 ABY, during the First Order/Resistance War, residents of the Colossus refueling station undertook a resupply mission to the trading outpost on the planet Ashas Ree. There, Team Colossus members Kazuda Xiono, Eila and Kel encountered Mika Grey, a traveller who was attempting to acquire a Sith relic from a buried temple near the abandoned outpost in order to keep it out of the hands of First Order Raiders who were searching for it."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the New Republic era, the First Order occupied the Colossus, a mobile refueling platform on the planet Castilon. Following the Hosnian Cataclysm, the Team Colossus expelled the First Order garrison and took the station into deep space. In response, First Order forces under Commander Pyre and First Order Security Bureau Agent Tierny launched a hunt for the station, seeking to use it for the First Order's war effort."}, {"tag": "p", "text": "After acquiring fuel from Flix's family on the planet Drahgor III, Captain Imanuel Doza dispatched his daughter Torra and fellow Ace Squadron pilots Kazuda Xiono and Freya Fenris on a mission to gather supplies on the forested planet of Ashas Ree, which had a small trading outpost. The trio were accompanied by their astromech droids R23-X9, CB-23, and T3-K10 respectively. Despite CB-23's objections, Xiono allowed the Teharan orphans Kel and Eila to accompany the resupply mission so that the children could experience fresh air, sunlight, and nature."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Temple of the dark side"}, {"tag": "p", "text": "The Colossus expedition found the trading outpost abandoned. Earlier, an archaeologist named Mika Grey had excavated an ancient Sith temple buried beneath a Temple of the Force. The local inhabitants had fled due to their fear of the ancient Sith and the dark side. Grey sought a triangular Sith relic in order to prevent the First Order, who were seeking ancient Jedi and Sith relics, from gaining access to them. However, she became trapped in a chamber beneath the altar due to the temple's intricate fail-safe traps."}, {"tag": "p", "text": "While Torra and Freya were gathering supplies, Kel, Eila, Xiono and CB-23 visited the Temple of the Force. Hearing cries from the Sith Temple, the four entered the ancient structure. Kel and Eila were separated from Kaz and CB-23 by a trap door. While attempting to find the children, Kaz and CB-23 entered the chamber with an altar containing the Sith relic. Disoriented by an electric shock device, Xiono accidentally triggered a trapdoor and found himself trapped with Grey, who was suspicious of the newcomer and initially thought he was a First Order spy."}, {"tag": "p", "text": "After Grey related her predicament to Xiono, he offered to help her but instead triggered a giant grinder beneath their chamber. Meanwhile, CB-23 managed to find Kel and Eila. Together, the three went to the chamber with the altar, where they heard Xiono and Grey's screams. Following the lady's instructions, Eila and Kel with the help of CB-23 managed to find two star symbols, which disabled the giant grinder and opened the trap door. CB-23 then used a grappling hook to pull Xiono to safety while Grey climbed out of the chamber."}, {"tag": "h3", "text": "First Order entanglements"}, {"tag": "p", "text": "While leaving the chamber, Xiono accidentally activated a doomsday device which caused the Sith temple to collapse, with rocks tumbling from the ceiling. He, Kel, Eila, CB-23, and Grey barely escaped the crumbling temple and reached the surface. Exiting the Temple of the Force, they discovered that a group of First Order Raiders led by Agent Raith had captured Torra, Fenris, and their droids. Grey had previously eluded these specialized stormtroopers, who were tasked with gathering relics for their Supreme Leader, on Vargos 9."}, {"tag": "p", "text": "After the First Order destroyed Grey's ship, the group split up and attempted to rescue Torra and Fenris. However, Xiono, Kel, Eila and CB-23 were captured by the Raiders, who brought them to Raith. Before Raith could interrogate the captives about the Sith temple, Grey appeared on top of the temple and taunted the raiders. Raith offered to spare the children in return for her surrendering the relic. However, Grey was not intimidated and instead activated the relic before hurling it at the Raiders. She then told Kaz and the others to run."}, {"tag": "p", "text": "The Colossus party managed to flee into the temple before the Sith relic unleashed an explosive wave of energy that incinerated Raith and his troops, leaving charred corpses behind. While Grey was upset that the relic had been destroyed, she consoled herself that she had denied the relic to the First Order. The group then returned to Xiono's Star Commuter 2000 shuttle, where R23-X9 and T3-K10 were waiting."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As a result of the mission to Ashas Ree, Ace Squadron managed to acquire more supplies for the Colossus, which was low on supplies due to the First Order/Resistance War. In addition, Mika Grey managed to deny the Supreme Leader access to a powerful Sith relic."}, {"tag": "p", "text": "Since Grey's ship had been destroyed, Kaz and Eila managed to convince the elderly archaeologist to join the Colossus, with the latter reassuring her that it was a \"wonderful place\". The Force-sensitive Eila found a new mentor in the form of Mika Grey, who was familiar with the Force, Jedi, and Sith. Xiono's adventure on Ashas Ree also forced him to reappraise his skepticism and disbelief in the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Ashas Ree first appeared in the Star Wars Resistance Season Two episode \"The Relic Raiders\", which first premiered on Disney XD on November 18, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}