{"url": "Mission_to_Ansion", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Battles in the Churnis sector", "Category:Jedi missions", "Category:Missions of the Separatist Crisis"], "nodes": [{"tag": "h1", "text": "Mission to Ansion"}, {"tag": "p", "text": "The Mission to Ansion occurred in 22 BBY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "While the Separatist Crisis was growing, the Commerce Guild and the CIS were both trying to add planets to their cause. During this period, Ansion became a target. This was due to the fact that Ansion was the linchpin of a complicated series of treaties and alliances, such as the Keitumite Mutual Military Treaty and the Malarian Alliance, that bound together other planets of greater importance. Ansion's secession from the Galactic Republic was set, therefore, to cause a chain reaction of exponential consequence that threatened to rip from the Republic a plethora of worlds in forty or more alliance-entwined star systems."}, {"tag": "p", "text": "The machinations for Ansion's secession were headed by Shu Mai, Presidente of the Commerce Guild, under the watchful guidance of the Sith Lord Darth Tyranus, and in league with the Ansionian Senator Mousul. The Hutt Soergg Vosadii Bezhin was the unsavory trio's hired contact on the planet. They planned to use Ansion's generations-old border dispute that existed between its urban government, the Unity of Community, and the nomadic Alwari tribes to convince a majority of city-states to unite in a collective will that would allow Ansion to leave the Republic."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Arrival on Ansion"}, {"tag": "p", "text": "Two teams of Jedi—consisting of Masters Luminara Unduli and Obi-Wan Kenobi and their Padawans Barriss Offee and Anakin Skywalker—were sent by the Jedi Order to convince Ansion to stay within the Republic. But from the very first day, they encountered problems. Soergg the Hutt instructed his majordomo Ogomoor, an Ansionian male, to do anything and everything necessary to thwart the Jedi mission. Two days before Obi-Wan and Anakin were scheduled to arrive on Ansion, Luminara and Barriss were attacked by local mercenaries hired by Ogomoor. Although they quickly defeated the first wave of the assault, the second began pushing them back. However, it was at this point that Kenobi and Skywalker arrived, having made good time en route to Ansion. The Jedi quickly defeated the remaining mercenaries, before moving on to meet with the Unity of Community's Unity Council."}, {"tag": "h3", "text": "Plan for unity"}, {"tag": "p", "text": "At that meeting, the Jedi Order's diplomatic ambassadors committed themselves to convince the Alwari tribal leadership to share half or more of their land with the industrialized cities, and thereby reach an accord to remain within the Republic. But before they could leave Ansion's capital city of Cuipernam to begin their search for the Alwari on the Ansion plains, Barriss Offee was kidnapped by Kyakhta and Bulgan, two of Soergg's enforcers. This pair of unfortunate Alwari outcasts (from the Tasbir clan) let the Jedi go, however, after the gifted Padawan healed them of their mental infirmities and deactivated the explosive devices that Soergg had implanted in their necks to ensure their compliance. After returning Barriss to the Jedi, Kyakhta and Bulgan agreed to guide the offworlders in their search for the ruling Borokii overclan."}, {"tag": "h3", "text": "Search for the Borokii"}, {"tag": "p", "text": "Having acquired six purebred suubatars, the Jedi, along with their Alwari guides, left Cuipernam and began their search. After surviving a brief river-encounter with native gairks, they met the wary Yiwa clan. Its leader Mazong decreed that before they would help them, however, the Jedi had to prove their worth—prove that they had souls, unlike those of the \"great but soulless Senate.\""}, {"tag": "p", "text": "To do this, the Jedi were asked to perform at a ceremonial feast held that evening. At the feast, each Jedi gave a heart-felt performance. Barriss went first, giving an astonishing acrobatics display of movement and light (using her lightsaber), which greatly impressed the Alwari, as well as Skywalker. Anakin next sang a moving, melancholic Tatooine ballad taught to him as a child by his mother. After Kenobi enraptured his listeners with a great hero's tale, Unduli, in a mesmerizing display of the Force, manipulated native particles of sand that swirled around her in another fascinating dance of light. The Yiwa were so impressed with the performances that they agreed to give to the Jedi's Alwari guides the coordinates that would enable them to find the Borokii faster."}, {"tag": "p", "text": "Shortly after leaving the Yiwa, the Jedi and their companions encountered a massive swarm of native kyren. These were small but blindly lethal avians that traveled in packs of up to two hundred million. The Jedi party and their suubatar mounts took cover behind some jijite columns until the swarm passed. Shortly after this, they encountered several chawix, carnivorous-poisonous plants that used the wind for travel, in order to chance upon their hapless prey."}, {"tag": "h3", "text": "A new companion"}, {"tag": "p", "text": "As the Jedi continued their search for the Borokii, Padawan Barriss Offee noticed one day a small creature stealing supplies from them. She followed the little Gwurran into some nearby hillside tunnels, where she encountered its tribe. The many pygmy-sized Gwurran began throwing rocks at her, but stopped after the Padawan mounted a sustained deflection of them with her lightsaber. Upon learning that the intrepid Tooqui had only taken the supplies in order to feed his tribe, Barriss promised the childlike Gwurran a party of sorts, in which the Jedi might teach them a little about not only their wider world, but also the galaxy. It was immediately after Offee's reunion with her comrades (who indeed humored the Gwurran and attempted to satisfy their insatiable curiosity) that the bold Tooqui said he would like to join the Jedi in their quest. A brief discussion followed in which it was decided that they would permit the bombastic little warrior to join them on their mission."}, {"tag": "h3", "text": "Encounter with the Qulun"}, {"tag": "p", "text": "Soon thereafter, the group noticed a roving caravan on the horizon, which Kyakhta and Bulgan identified as the Qulun, a non-traditional trading clan. A patrol of Qulun riders came out to greet them, and after learning of their ongoing search for the Borokii, the clan's chief trader, Baiuntu, invited the group to their camp to dine with them and sample their wares. As they conversed together within one of the clan's portable, self-erecting trade rooms, however, Baiuntu had the strangers drugged, then locked up (with the exception of Tooqui, who was able to flee the camp and his pursuers, escaping down a kholot hole). The obese clan trader later admitted to his captives (before his untimely demise by a pack of fierce shanhs) that his deception was inspired by the Soergg-issued promise of a reward to those that prevented the Jedi from returning to Cuipernam until after the Ansionian secession vote was taken."}, {"tag": "h3", "text": "Uniting tribe and city"}, {"tag": "p", "text": "Despite the taxing delay and setback of the Jedi company's capture, the brave Tooqui (by way of a lorqual stampede) returned to rescue them all, and soon, following a brief skirmish, they traveled north and caught up with the valley-encamped ruling Borokii overclan. To the clan's tribal leaders they were able to at last—with the help of a tuft of fur from an albino surepp—present their proposal. The Borokii elders agreed to it, but only on the grounds that the Jedi settle a conflict that existed between the Borokii and their longtime rival, the Januul, another overclan. The Jedi agreed to \"deal\" with the Januul, and ultimately managed to settle the conflict diplomatically. They returned to Cuipernam, but were again delayed by Soergg, who had hired mercenary thugs and snipers to dispatch them. Rescued from the Hutt's minions by the Bayaar-led Alwari honor guard (made up of elite warriors from both the Situng Borokii and Hovsgol Januul subclans), the Jedi managed to make it to the municipal-hall gathering of the planet's Unity Council, which was in the process of voting on the matter of secession. Because the Jedi had effectively settled the border dispute by managing to achieve the sought-after accord with the Alwari overclans, the duly impressed Unity voted to stay within the Republic."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Ansion remained a member of the Galactic Republic, and the planet's Alwari ruling councils united under the Council of Alwari Elders. Also, the Separatists' plan of issuing demands to the Republic was delayed (they had planned to issue demands to the Republic the moment Ansion declared secession), though Count Dooku looked upon the Ansion failure as only a minor setback; the Sith Lord advised Shu Mai that their ultimate success was inevitable and that, for the moment at least, the Separatists would bide their time."}, {"tag": "p", "text": "Almost immediately upon their return to Coruscant after the mission to Ansion, Obi-Wan Kenobi and Anakin Skywalker were re-assigned to protect Senator Amidala of Naboo, upon whose life yet another attempt had been orchestrated by the re-emergent Sith overlord."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}