{"url": "Mission_to_Anukara", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles with conjectural titles", "Category:Mission stubs", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Anukara"}, {"tag": "p", "text": "A mission was undertaken by Seyn Marana and Sadori Vushan of the Dreamers to bomb an Imperial munitions factory on Anukara. The mission was planned to coincide with the grand opening of the factory, attended by Moff Rys Deksha, General Ivel Toshan and hundreds of teenage Imperial students. Seyn and Sadori posed as students with forged identification documents and attended the tour, where they were to destroy the factory."}, {"tag": "p", "text": "The Dreamers identified the event from a list that Lux Bonteri, as the Dreamers' \"Mentor\", had obtained from his stepdaughter. Upon learning that the event would be attended by hundreds of civilian students, Staven, Sadori, and certain other Dreamers members saw the students as a legitimate target as they would strengthen the Empire one day. Bonteri, however, strongly objected to harming civilians, particularly children. He was overridden, and the mission was planned to kill the children as well as Imperial officials in attendance."}, {"tag": "p", "text": "Inferno Squad's commanding officer ISB Admiral Garrick Versio had told the Squad that they may have to harm Imperial personnel including civilians in order to successfully infiltrate the Dreamers.  Seyn, however, bonded with Anice, and her conscience would not allow her and Sadori to kill the children."}, {"tag": "p", "text": "Near the end of the tour, Sadori and Seyn were to set up a bomb to destroy the factory, and set the timer to five minutes. Seyn, however, set the timer to 20 minutes, giving the students enough time to escape with their lives while still destroying the factory. When the students, including Sadori and Seyn, were leaving, Sadori noticed that something was wrong; as the bomb had not gone off. Sadori sacrificed himself to fulfill their mission, detonating a suicide bomb in the factory. Seyn pled with him not to, even kissing the young man who had fallen in love with her, but he died to fulfill the mission."}, {"tag": "p", "text": "Seyn later reflected that she was not sure which was worse—that Sadori had died, or that he had done so trying to ensure that four hundred students had died with him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}