{"url": "Mission_to_Aut-O%27s_flagship", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Aut-O's flagship"}, {"tag": "p", "text": "A mission to Aut-O's flagship was carried out during the Clone Wars by the Galactic Republic D-Squad to steal an encryption module located on the Separatist dreadnought's C-Deck from the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After a transmission of General Grievous was intercepted but was unable to be decoded, and a battle occured over an unidentified planet, the Galactic Republic Military planned to send the special forces unit D-Squad, consisting of five droids led by Colonel Meebur Gascon, to a Separatist dreadnought believed to be holding an encryption module necessary to decipher Grievous' message. To aid their mission, the Republic droids were upgraded with various gadgets, and the team was assigned a Maxillipede shuttle for transport."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Upon reaching the target Separatist fleet through hyperspace, D-Squad's pilot, the DUM-series pit droid WAC-47, set the shuttle on a collision course with the Separatist dreadnought. However, their ship was pulled into the dreadnought's main hangar by a tractor beam, where it was searched by B1-series battle droids; Gascon hid inside the astromech droid M5-BZ, who had been hollowed out to create a mobile command center for the diminutive colonel."}, {"tag": "p", "text": "While the members of D-Squad were being taken to interrogation by two battle droids, the astromech R2-D2 electrocuted one battle droid. Another astromech, QT-KT, and WAC-47 similarly deactivated the other."}, {"tag": "p", "text": "Gascon ordered WAC-47 to pretend to lead the other droids to a repair job as D-Squad headed for C-Deck, where the encryption module was thought to be stored. U9-C4 caused a temporary power shortage in the vault by using his laser cutter to destroy a console; however, because he forgot to lock down, he was flung across the corridor due to the force of the laser. This energy fluctuation caught the attention of the commanding ST-series military strategic analysis and tactics droid Aut-O."}, {"tag": "p", "text": "At a door leading to the encryption module's vault, WAC-47 imitated as a subordinate of General Grievous sent to test the comm-vault's security, distracting two B2-series super battle droids to allow the rest of D-Squad to pass by unnoticed. He then locked the two bemused super battle droids in a room."}, {"tag": "p", "text": "Colonel Gascon controlled M5-BZ to attempt to open the last door leading to the vault, but the droid was electrocuted by the trapped door, leaving the officer without a command vehicle. Gascon, confiding that he did not have any ideas for breaching the vault, mentioned that he was a military analyst; WAC-47 suggested that Gascon was a mere map-reader, eliciting giggles from the astromech droids. Despite the discord, Gascon and WAC-47 agreed to respect each other to finish the mission."}, {"tag": "p", "text": "Aut-O decided to investigate the source of trouble after another disturbance was identified - D-Squad had entered the vault, where QT-KT used her magnet to attract and collect all the swarm mines in the chamber, rendering them harmless. As R2-D2 activated his rocket boosters to fly to the encryption module suspended high up on a central column and take it, Aut-O and his battle droids entered the vault, and attempted to take custody of D-Squad. On Gascon's command, R2-D2 deactivated the gravity in the comm-vault as he blasted off. The floating battle droids opened fire, but U9-C4 destroyed several of them with his laser cutter and QT-KT dispatched the rest by launching the swarm mines at them. The super tactical droid grabbed R2-D2 in the act of grasping the device, and Gascon jumped on his head to divert him. Ultimately, WAC-47 turned the gravity back on; although Aut-O landed next to Gascon and proceeded to seize the small officer, R2-D2 detached himself from the center column and landed on Aut-O's head, decapitating him."}, {"tag": "p", "text": "As more battle droids rushed to C-Deck, D-Squad, along with the incapacitated M5-BZ, returned discretely to their shuttle. Gascon said that the droids had gained his appreciation, and their shuttle escaped into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although D-Squad successfully stole the encryption module and fled the Separatist fleet, en route back to Republic space the team encountered a comet storm near the planet Abafar. The shuttle was crippled by the storm and D-Squad crash-landed on the surface of the planet. Whilst trying to find a way to leave Abafar, D-Squad uncovered a Separatist plot to destroy a Republic space station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}