{"url": "Mission_to_Bakura_(Disciples_of_Ragnos_crisis)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Bakura", "Category:Battles of the Disciples of Ragnos campaign"], "nodes": [{"tag": "h1", "text": "Mission to Bakura  (Disciples of Ragnos crisis)"}, {"tag": "p", "text": "The Mission to Bakura took place in an old power station in 14 ABY, during the Disciples of Ragnos crisis. It was one of Jaden Korr's first missions since he started training at the Jedi Academy."}, {"tag": "h2", "text": "Mission"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Bakura was a former Imperial controlled world that allied with the Rebel Alliance in 4 ABY against the Ssi-ruuk invasion. While not joining the Alliance at that time, its actions were disliked by some in the Imperial hierarchy. When it joined the New Republic later on, a group in the Imperial Remnant decided to punish them for their treachery."}, {"tag": "p", "text": "A team of stormtroopers and saboteurs led by some Imperial officers were dispatched to the planet. Their target was a Bakuran power station high up in the mountains. Built over a dormant volcano, destroying the power station would unleash the volcano on a nearby heavily populated city. The saboteurs set up powerful explosive devices to obliterate the power station."}, {"tag": "p", "text": "After the station was captured, the Bakuran authorities sent a team to investigate, which did not report in or return. The officials then contacted the New Jedi Order for aid. Jedi Master Kyle Katarn and his apprentice, Jaden Korr, were sent to help."}, {"tag": "h3", "text": "The mission"}, {"tag": "p", "text": "Korr arrived first in the Far Wanderer, but after waiting for some time for his master to arrive, decided to act on his own. It was revealed later on that Katarn never made it to Bakura. Entering the facility, he passed a number of dead bodies, presumably the original Bakuran team that did not return, and some blaster/explosion marks from the assumed assault. Tapping into the internal security system, Korr discovered five bombs placed around the facility awaiting detonation. Each bomb would have to be individually disarmed."}, {"tag": "p", "text": "This was achieved by fighting his way progressively through the facility, eliminating all Imperial terrorists as he went. Various parts of the facility had been damaged, presumably in the initial takeover, which required careful negotiation by Korr. Finally, having encountered autoturrets, E-Webs, and an astromech droid, he successfully completed his mission, gaining significant experience in applying his Force training."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "While the Imperial terrorists were unsuccessful in their mission, Bakura withdrew from the New Republic some years later. However, the successful intervention by the Jedi in averting disaster likely fostered goodwill between the Bakurans and the New Jedi Order. Perhaps this contributed to the willingness of the Bakurans to support Luke Skywalker during the Corellian Insurrection of 18 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Note and references"}]}