{"url": "Mission_to_Benglor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Events during the Clone Wars", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Benglor"}, {"tag": "p", "text": "During the early stages of the Clone Wars in 22 BBY, Jedi General Anakin Skywalker led a mission to investigate Confederacy of Independent Systems activity on the planet Benglor. Skywalker and his clone troopers of the 501st Legion discovered traces of Separatist battle droids, but were attacked by a hostile creature, who killed the trooper Bellow. Skywalker ordered Clone Captain CT-7567 \"Rex\" to escort the troopers to safety, but Rex returned to assist Skywalker, helping to defeat the creature."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Sometime after on the planet Benglor, Anakin Skywalker, Captain Rex and members of the 501st Legion undertook a mission to the planet. While walker through the forest everyone was complaining about the very hot temperatures of the day. Hardcase found some goo hoping it would be a clue to help understand what the Confederacy of Independent Systems was doing on the planet. Bellow then located the head of a B1-series battle droid as more soldiers also found more battle droid parts. Bellow found more goo but unbeknownst to him a large quadruped was behind him. Anakin ignited his lightsaber and warned Bellow but it was too late, the creature picked up Bellow and ate him."}, {"tag": "p", "text": "Anakin ordered everyone to fall back but Hardcase charged at the creature but was swiftly tossed aside. Anakin ordered Rex to take his men to safety and he would rescue Hardcase. As the quadruped went in for the killing blow, Anakin stopped the creature in its tracks with The Force and allowed Hardcase to escape. After Hardcase escaped, Anakin squared off against the quadruped but was knocked into a tree. Anakin threw his lightsaber at a tree and cut the tree down onto the creature. Anakin casually walked away but the creature got back up and launched itself at Anakin. But before it could reach Anakin it was shot down by Rex and the fellow clone troopers. Rex gave Anakin the idea of aiming for throwing his lightsaber at the leg of the creature which pacified it. Rex and Anakin walked away and Anakin told him that they were more than just clones to him."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Sometime after the mission, a siege took place on the planet Hisseen between the Galactic Republic and the Confederacy of Independent Systems. Clone troopers were defending a village from an assault from the Separatist Droid Army. Jedi Generals Anakin Skywalker, Obi-Wan Kenobi and Plo Koon came to help the clone troopers and repel that attack. The Jedi left to go locate Count Dooku and Asajj Ventress but sent a transmission in need of backup."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}