{"url": "Mission_to_Cairn_Installation", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles in the Cademimu sector", "Category:Battles of the Empire Reborn campaign", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Mission to Cairn Installation"}, {"tag": "p", "text": "The Mission to Cairn Installation was carried out by the New Jedi Order against the Empire Reborn."}, {"tag": "h2", "text": "Mission"}, {"tag": "h3", "text": "Build-up"}, {"tag": "p", "text": "After defeating Tavion Axmis on Bespin and interrogating her, Kyle Katarn learned that the Cairn Installation was the dock of Fyyar's ship, Doomgiver, and that Jan Ors could be found onboard. Boarding an automated ore hauler, Katarn hyperspaced from Bespin and was eventually able to sneak into the facility's main convoy hangar bay 1."}, {"tag": "h3", "text": "Mission"}, {"tag": "p", "text": "Once inside, Katarn silently watched as the vessel he had sneaked in on begin to unload slabs of Cortosis. After it had finished, Katarn made his way through a corridor, but when he opened a door leading to another hangar, he was confronted by a stormtrooper. Luckily, Luke Skywalker, who was also looking for Desann, leaped out from his hiding place and slew the trooper. He informed Katarn that he had led a small task force of Jedi to the Valley of the Jedi, and Rogue Squadron had chased away the Remnant vessels, but they did not know how many of Desann's Reborn had been made before they got there. When Katarn informed him of the smuggling of cortosis from Nar Shaddaa, Skywalker was deeply concerned and informed Katarn of cortosis's lightsaber-deflecting properties. After fighting back to back against a squad of Reborn, Katarn and Skywalker split up to search for Desann, and the Doomgiver."}, {"tag": "p", "text": "Katarn's journey through the base was perilous, as he frequently encountered bottomless pits and numerous squads of Reborn and stormtroopers. After disabling the drop ship factory, Katarn was forced to head into the deadly reactor shafts of the facility. Even those who worked in these reactors died there, as Katarn stumbled upon the corpse of an unwary Imperial worker."}, {"tag": "p", "text": "Emerging unscathed from the reactor, Katarn was able to defeat a Shadowtrooper at the same time, while avoiding detection by security patrols in the Doomgiver's docking bay. Eventually, he was able to board the Doomgiver, moments before it began its journey to Yavin 4. From the command bridge, Katarn watched as Desann and Skywalker fought a fierce duel. The fight ended when Skywalker appeared to be crushed beneath rubble, and Desann fled onto the Doomgiver as it launched. However, Skywalker managed to evade the rubble and watches the Doomgiver launch."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Star Wars: Jedi Knight II: Jedi Outcast game, when Katarn is about to enter the hangar in Cairn Bay, some stormtroopers can be heard discussing the events at Kejim. One says that a Jedi (Kyle Katarn) killed nearly everyone there. Since Katarn was not yet reconnected with the Force or in possession of a lightsaber at that point, this is most likely an in-game rumor in motion amongst the stormtroopers or just a continuity error."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}