{"url": "Mission_to_Caluula", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Tion Hegemony", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Mission to Caluula"}, {"tag": "p", "text": "In 29 ABY, Galactic Alliance Intelligence organized a mission to Caluula to destroy its war-coordinating yammosk, placed there by the occupying Yuuzhan Vong. Galactic Alliance High Command expected the Yuuzhan Vong to strike at the Galactic Alliance's temporary capital of Mon Calamari, and anticipated that Caluula would be a staging point for the invaders."}, {"tag": "p", "text": "Caluula's governor had surrendered the world peacefully under the condition that several select scientists could visit to observe the natural phenomenon known as the Nocturne of the Winged-Stars, and as such, Han Solo, Leia Organa Solo, Kyp Durron, Judder Page, and the Bothan Intelligence officer Wraw posed as the support team of the Ho'Din scientist Meloque. Unbeknownst to any of them save for Wraw, Caluula's governor had in fact surrendered the world so that the Galactic Alliance could test out Alpha Red, an airborne pathogen designed to target the Yuuzhan Vong and all of their living weapons. Wraw was assigned to the task force to report on the pathogen's first field test. Solo suspected that the operation was in some way compromised, and enlisted the smuggler Booster Terrik to join them in-system with his personal Star Destroyer, the Errant Venture."}, {"tag": "p", "text": "On the planet's surface, Team Meloque hooked up with Ferfer of the Ryn Network and Sasso of the Caluula Resistance. Over two days, they encountered many sickly and exhausted Yuuzhan Vong warriors and biots. After being overcome by a group of Yuuzhan Vong Slayers, they were taken to the minshal building housing the yammosk, where the Yuuzhan Vong Commander Malik Carr came before them before he and all of his brethren died from the effects of Alpha Red."}, {"tag": "p", "text": "As Team Meloque struggled to make sense of the situation, Lando Calrissian, Talon Karrde, and Shada D'ukal entered the room, all friends of the Solos who had joined Booster Terrik for the operation. They greeted the team and reported seeing dying Yuuzhan Vong at the spaceport and on the city's streets. Durron realized what had happened, having been one of few privy to the knowledge of Alpha Red, and Wraw nonchalantly explained the true nature of the mission to those gathered. He hoped for the Slayers who had departed the planet to bring the pathogen to Yuuzhan Vong-occupied Coruscant and end the ongoing war, but his companions recalled dead insects they had seen and realized that Alpha Red in fact affected more than just the Yuuzhan Vong. Karrde commed fellow smuggler Crev Bombaasa aboard the Errant Venture and discovered, to the team's horror, that one Yuuzhan Vong coralskipper had made it to hyperspace."}, {"tag": "h2", "text": "Appearances"}]}