{"url": "Mission_to_Calamari", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Events of the Trioculus affair"], "nodes": [{"tag": "h1", "text": "Mission to Calamari"}, {"tag": "p", "text": "The Mission to Calamari was a mission undertaken by Admiral Ackbar and Luke Skywalker in the Calamari oceans to stop the Whaladon hunting."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "During the Galactic Civil War, an unscrupulous Whaladon hunter named Dunwell maintained a massive Whaladon Processing Center on the ocean floor of the planet Calamari."}, {"tag": "p", "text": "In 5 ABY, the Central Committee of Grand Moffs proclaimed Supreme Slavelord Trioculus as the successor of Emperor Palpatine. To quiet any remaining doubts about him, Trioculus determined to find the Glove of Darth Vader and win the support of Supreme Prophet Kadann."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Captain Dunwell, discovered several pieces of the Death Star II's debris in the Valley of the Giant Oysters on Calamari, one of which had revealed the outline of a glove when scanned. Trioculus and Hissa immediately set out for Calamari, where they were greeted by Dunwell at his Whaladon Processing Center. In his Whaladon-hunting submarine, Dunwell took Trioculus and Hissa to the site of the wreckage. Secretly followed by Luke Skywalker and Admiral Ackbar in a Calamarian minisub, Trioculus retrieved the glove. When Skywalker and Ackbar's minisub was accidentally captured by one of Dunwell's Whaladon-capturing devices, Luke infiltrated the vessel in an effort to save several captured Whaladons, including the venerable white Whaladon known as Leviathor before they could be delivered to the processing center. They managed to open the cargo hold allowing all of the captured animals back into the sea. Leviathor herded the other Whaladons back to the Seascape Mountains. R2-D2 activated the ship's self-destruct system and the heroes evacuated the submarine before it detonated. Captain Dunwell died in the explosion and Trioculus and Hissa narrowly escaped."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "To show his gratitude, the intelligent mammal performed a special concert at a Whaladon Song celebration in the Domed City of Aquarius."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}