{"url": "Mission_to_Cato_Neimoidia/Legends", "categories": ["Category:Legends articles", "Category:Battles of Cato Neimoidia", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Cato Neimoidia"}, {"tag": "p", "text": "A mission to Cato Neimoidia took place in late 22 BBY during the Clone Wars. Galactic Republic Senators Padmé Amidala and Rush Clovis, along with Jedi Knight Anakin Skywalker, departed to the purse world of Cato Neimoidia to meet with Lott Dod."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Soon after the Jedi Order rescued the stolen Force-sensitive children from Darth Sidious, the activities of Senator Rush Clovis came to their attention. During the Clone Wars, he was the senator of the planet Scipio and an influential member of the Banking delegation. Masters Yoda and Mace Windu of the Jedi Order suspected him of bargaining with the Confederacy of Independent Systems. The Galactic Republic and the Jedi Order were deciding to send someone to spy on Clovis."}, {"tag": "p", "text": "It was decided that Padmé Amidala would be the best candidate to spy on the senator, based on her past relations with Clovis. Padmé Amidala and Rush had entered the Senate in the same year and in the same committee. Senator Amidala and Senator Clovis had also, at one time, been in a relationship with each other, but Padmé eventually broke it off because she wished to keep things professional. When first offered to spy on Clovis, she refused. Anakin also felt that Padmé should not go through with it, but came around when he learned how vital it was to the Republic and the Jedi Order. Padmé insisted on not doing it. After Jedi Knight Anakin Skywalker talked with her, she accepted the offer with satisfaction. It was arranged that Anakin would act as her body guard to make sure nothing bad happened. Soon after, the group left from Coruscant and traveled to Cato Neimoidia."}, {"tag": "h2", "text": "The Mission"}, {"tag": "p", "text": "As Senator Lott Dod of the Trade Federation and Senator Rush Clovis of the Banking Clan delegation prepared to meet on the former's homeworld, Cato Neimoidia, for discussion on their investments in the foundry, the Jedi High Council—which suspected Clovis of involvement in a Separatist conspiracy—recruited Senator Padmé Amidala to spy on the Banking Clan Senator. Amidala, who had previously had a personal relationship with Clovis, agreed to the mission and, accompanied by her secret husband, Jedi Knight Anakin Skywalker, went with the Banking Clan Senator by his invitation to Cato Neimoidia."}, {"tag": "p", "text": "As soon as they arrived on Cato Neimoidia, they were greeted by Neimoidian Senator Lott Dod. Padmé was shown to her quarters while Dod and Clovis discuss \"business\", which involves discussing the amount of credits needed to build the new droid foundry, with Poggle the Lesser; Clovis refuses to lend any more credits to them. Padmé attempts to spy on them while on a \"walk\" but they shut down the holographic blueprints. As Clovis led Padmé away, Dod and Poggle realized that she was Clovis' weakness and planned on poisoning her to force him to cooperate."}, {"tag": "p", "text": "While Anakin and Artoo waited outside for Padmé's signal, she got into an elegant dress for dinner with the other Senators. Dod tricked her into sharing his drink after smearing the rim with poison. Once dinner finished, Clovis took Padmé on a tour of the palace, both unaware of the symptoms of the poison, including thirst and head throbbing. While Clovis went to fetch a drink, Padmé attempted to access the palace's files, but was barred by the computer's demand for a passcode; she soon figured out that it was her name. Upon enteringthe correct code, it showed her the diagram from Dooku's new droid foundry. She then signaled Anakin, who sneaked into her quarters. As soon as she took the disc plans, she hid them from Clovis. But when he asked to hold her hand, she spontaneously embraces him to hide the disc. She then noticed Anakin in the shadows, his face bursting with anger and jealousy, but she calmed him down by showing the disc. She discreetly gave it to him. But as he slipped away, Padmé passed out."}, {"tag": "p", "text": "He reported this to Dod but was informed that Padmé was a spy. He refused to believe it but was convinced upon finding the disc missing. He angrily confronted her for betraying him, but Anakin then entered, demanding that he step away from her. Clovis realizes that he loves Padmé enough to save her and offered to get the antidote in exchange for the disc. However, as they carried Padmé back to the ship, they ran into Dod and his aides. Clovis attempted to bluff his way out of this, but Dod refused to let them leave, so Clovis pulled out a blaster. Dod was forced to give the antidote, as the three ran away. However, Anakin purposely left Clovis on the planet, who was forced to \"talk\" with Dod, as he injects Padmé with the antidote."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Returning to the galactic capital of Coruscant, Skywalker and Amidala reported their findings to the Jedi Council. Clone Captain CT-7567, nicknamed \"Rex,\" was dispatched with a contingent of the Grand Army of the Republic's 501st Legion to perform a reconnaissance of Geonosis. Upon arrival in orbit of the world, Captain Rex and his men were unable to established contact with the clone troopers on the planet's surface but discovered the droid foundries there. Rex transmitted his scans to the Jedi Temple with the recommendation that a full-scale invasion would be required to take Geonosis. Receiving the report, the Jedi Council decided to send High Jedi Generals Obi-Wan Kenobi and Ki-Adi-Mundi with Jedi General Luminara Unduli to lead the attack on the droid foundries, while Generals Plo Koon and Skywalker were assigned to reinforce the planet Dorin, which had been attacked by a Separatist fleet led by Confederate General Grievous in an effort to keep the Jedi occupied from raiding Geonosis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}