{"url": "Mission_to_Carnelion_IV", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Events during the Republic Era", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Carnelion IV"}, {"tag": "p", "text": "A mission to Carnelion IV was undertaken by Jedi Knight Obi-Wan Kenobi and his Padawan learner, Anakin Skywalker, three years after the Invasion of Naboo. The two were dispatched to investigate a distress signal that emanated from the planet Carnelion IV."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Several generations before the Naboo Crisis, a civil war broke out among the human inhabitants of the planet Carnelion IV. The planet's surface was poisoned by the Celadon Sea, forcing the survivors to retreat to the mountains. Since Carnelion IV had no resources that the Galactic Republic was interested in, the Galactic Senate felt no obligation to intervene or assist the population. Left to their own devices, the inhabitants of Carnelion IV splintered into two warring factions: the Open and Closed."}, {"tag": "p", "text": "What little technology the Open and Closed had was salvaged from the planet's surface. The two factions built airships to fight each other. An elderly woman named Sera, who admired the Jedi Order, dedicated her life to collecting remnants of \"the world that was\". From her fortress museum on the ruined surface, Sera would send kites carrying art in the hopes of influencing the young."}, {"tag": "p", "text": "Believing that the adult Open and Closed members could not be saved, Sera decided to seek the Jedi's help in destroying them. She managed to reactivate a faulty transmitter and used it to send a coded transmission seeking help from the Jedi Order. This transmission was picked up by Jedi Master Yoda, who dispatched Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker to investigate. At the time, Skywalker had grown disillusioned with his Jedi training and was considering leaving the Order."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "A rough landing"}, {"tag": "p", "text": "Jedi Knight Kenobi and Padawan Skywalker traveled to Carnelion IV in a T-6 shuttle, which sustained considerable damage while navigating through the dense debris field above Carnelion IV. Though their ship crashed, the two Jedi managed to escape in ejection seats. While they initially believed that Carnelion IV was unpopulated, the two soon witnessed an air battle between Open and Closed airships."}, {"tag": "p", "text": "Noticing a crashing airship, Kenobi and Skywalker used the Force to pull the airship close to their cliff, allowing two survivors to jump to safety. These survivors turned out to be the Open leader Mother Pran and Kolara. While Kolara was friendly, Mother Pran was hostile towards the two Jedi newcomers, not knowing who the Jedi were. Shortly later, a Closed airship strafed them. Kenobi used his lightsaber to pierce the airship's airbag, causing the airship to explode."}, {"tag": "h3", "text": "Finding local guides"}, {"tag": "p", "text": "Anakin managed to rescue one of the Closed survivors who turned out to be Grecker, a bitter enemy of Mother Pran. Anakin tried to break up the fight by using his lightsaber to slash through their blasters. They then tried to stab each other but Kenobi used the Force to restrain their blades. Kenobi managed to convince the two belligerents to accompany him and Skywalker on their quest to find the source of the distress signal. Unwilling to freeze on the mountain-top or cross the Celadon Sea without weapons, Grecker decided to come with the Jedi. Kolara convinced Mother Pran to heed the Jedi."}, {"tag": "p", "text": "Skywalker convinced the Open and Closed to put aside their differences to repair a damaged Closed gondola by refitting it with an Open airbag. While repairing the ship, they were attacked by several winged corpse-leeches. Kenobi managed to use the Force to calm them down but Skywalker, who struggled with patience, slaughtered those around him. Having completed their repairs, the Jedi traveled with their local guides on the airship into the Celadon Sea."}, {"tag": "h3", "text": "A perilous flight"}, {"tag": "p", "text": "The Jedi and their local hosts flew their airship over the Celadon Sea, which was covered with several ruined cities covered in toxic gas. During their flight, their airship came across a kite carrying a circular art disc. However, Grecker threw it to the ground. Later, Kolara showed Skywalker a beautiful circular disc, which she had acquired. While Kenobi befriended Grecker, Kolara also befriended Anakin, who was around her age. Anakin impressed Mother Pran and Kolara with his ability to repair a remote, which Pran waned to use to give the Open an advantage over their Closed foes."}, {"tag": "p", "text": "Later, the airship was attacked by several Fishers. mutated humans who attached ropes to the airship. While Kenobi and Grecker fought off the Fishers, Kolara distracted Skywalker by throwing out his lightsaber, allowing Pran to knock him unconscious with a wrench. Pran and Kolara then escaped with Skywalker on a glider. Before leaving, Mother Pran attempted to kill Kenobi and Grecker by blowing up their airship's gasbag, causing the gondola to crash onto the surface below."}, {"tag": "h3", "text": "Finding the Scavenger"}, {"tag": "p", "text": "Despite Pran's efforts, Kenobi and Grecker survived the crash. Kenobi managed to use the Force to convince the Fishers to leave them alone. Since Mother Pran had taken Anakin to one of the Open's mountainside fortresses, Kenobi decided to continue the mission to find the coordinates of the distress signal. He had confidence in the Padawan's abilities to find him since Skywalker knew the coordinates of the distress signal. Donning gas masks, they traveled through the ruined city."}, {"tag": "p", "text": "Kenobi and Grecker traced their signal to a ruined building. Kenobi began to be suspicious of Grecker's motives for helping him. This suspicion was proven when Grecker fired a flare gun when the pair were attacked by several Carnelian dragons. A masked woman ushered Grecker inside the building. She wanted to hold the door open for Kenobi but Grecker demanded that she close the door. Rejecting his demands, the masked stranger wounded Grecker, leaving him for dead. When a shocked Kenobi questioned his rescuer, she claimed that Grecker would have abandoned him to the beasts."}, {"tag": "p", "text": "The masked woman identified herself as Sera and confirmed that she was the one who had contacted the Jedi Order and showed Kenobi her fortress museum, which consisted of objects from the \"world that was\" which had been salvaged from the \"Dead lands\" outside. She confirmed that she had sent the kites with treasures in the hope of influencing the young. However, Sera believed that the adult Open and Closed were irredeemable since they were too set in their ways. She revealed that her true plan was to bring the Jedi to Carnelion IV in order to destroy the Open and the Closed in order to rebuild her planet's civilization. Sera told Kenobi that both the Open and the Closed wanted to kill her since she reminded them of the past they had lost."}, {"tag": "h3", "text": "Lair of the Open"}, {"tag": "p", "text": "Meanwhile, Mother Pran and Kolara brought a gagged Skywalker back to their Fortress-Home of the Open, describing him as a Skygift. Using the remote that Skywalker had repaired, Mother Pran reactivated a Mech. She was confident that the Open would not be able to destroy their Closed foes."}, {"tag": "p", "text": "Later, Mother Pran coerced Anakin into revealing the location of the distress signal, claiming that Grecker was plotting against Kenobi. Anakin sensed that was a lie but told them that the distress signal was located another half day's travel past where the Fishers had attacked them. Skywalker wanted to accompany them to save his master. However, Mother Pran wanted to kill the Scavenger and kept Anakin behind, telling him that he was valuable to their plans. Before departing with the Open forces, Pran tasked Kolara and the other youths with guarding Skywalker."}, {"tag": "p", "text": "After the Open adults have left, Kolara and the other youth come to believe that the Scavenger, who sent them beautiful art, was the source of the distress signal. They realized that the adults were going to hunt down and kill the Scavenger, who sends them beautiful art on kites. Anakin, who was listening, told them that the \"Scavenger\" showed them how things were like in the past and how they could be different. After learning that the other youths shared Kolara's interest in art, Skywalker enlisted their hep in reaching the Scavenger."}, {"tag": "h3", "text": "Showdown at Sera's redoubt"}, {"tag": "p", "text": "While Sera was regaling Kenobi with legends of the Jedi, a large force of Closed warriors and airships lay siege to her fortress museum. Sera demanded that Kenobi kill them but Kenobi responded that the Jedi spared everyone. Kenobi confronted the leader of the Closed force and asserted his protection over Sera. When the Closed leader demanded to know where was Grecker, ther warrior resurfaced and urged his comrades to kill Kenobi and burn the palace to the ground. Kenobi deflected their blaster bolts with his lightsaber while trying to reason with them."}, {"tag": "p", "text": "Just then, Mother Pran and her force of Mechs and airships entered the battle. Kenobi tried to reason with Grecker by telling him that Sera was trying to save his world. Grecker dismissed Kenobi as a fool before being hit by a laser cannon. Kenobi survived but found himself facing Mother Pran's mech. He demanded to know where Skywalker was but she fired upon him. However, he was rescued by Anakin, who had arrived on a flying machine. Anakin was accompanied by the Open youth, who also had flying machines."}, {"tag": "p", "text": "Returning to the fortress museum, Sera blamed Kenobi for ruining her plans to rebuild a new order with the young people of her planet. Sera hoped that the Open youth would stay with her while the adults killed each other. However, Kolara and her peers decided to join their brethren in the battle despite Sera's protests. Anakin managed to repair transmitter which allowed Kenobi to contact the Republic for help. A Judicial Forces fleet consisting of Consular-class cruisers arrived and forced the Open and Closed to cease fighting."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Kenobi and Skywalker's mission to Carnelion IV re-established contact between the Republic and the inhabitants of Carnelion IV. Jedi, Judicial Forces, and droids tended to the wounded. Following the battle, Kenobi told Skywalker that he had told the Republic that the planet's atmosphere had high concentrations of tibanna gas, a valuable resource. While the Republic conducted an exploration survey, they forced a ceasefire. Kenobi hoped that the Republic's intervention would end the conflict between the Open and the Closed."}, {"tag": "p", "text": "As a result of their adventures on Carnelion IV, Anakin learned that the Jedi Order commanded considerable respect and authority within the Republic. Skywalker decided to put his doubts aside and continue his training under Kenobi. The two would continue serving the Jedi Order and the Republic during the Separatist Crisis and the Clone Wars. Though Anakin fell to the dark side and joined the Sith and Galactic Empire, he returned to the light side with the help of his son Luke Skywalker and helped to restore balance to the Force. Kenobi survived the Great Jedi Purge long enough to take the younger Skywalker on his first steps into the Jedi way before his death at the hands of his former apprentice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Carnelion IV was the subject of the 2016 Marvel comic book Star Wars: Obi-Wan and Anakin, written by Charles Soule, illustrated by Marco Checchetto, and colored by Andres Mossa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}