{"url": "Artifact_network", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Communications networks"], "nodes": [{"tag": "h1", "text": "Artifact network"}, {"tag": "p", "text": "During the Imperial Era, a clandestine network was operated for the purchase and sale of rare artifacts. The artifacts listed on the network included items from the High Republic Era. After the smuggler Remy placed a Nihil Path engine on the network, it was purchased by Beol De'Rruyet, founder of De'Rruyet Industries, who subsequently attempted to replicate the device and its abilities."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The network was a clandestine operation, composed of individuals buying and selling rare and priceless artifacts. Accessible via terminal, the network displayed numerous artifact listings that consisted of an image of the item and a body of text, with an option to bid next to each listing. The network was extensive—the rogue archaeologist Doctor Chelli Aphra described it as the largest she had ever seen—with some of the items for sale on it having originated in the time of the High Republic Era."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Galactic Empire, the network was operated in secret. After the smuggler Remy discovered a Nihil Path engine in a starship wreck on the planet Dol'har Hyde, he placed it up for sale on the network, where it was found by Beol De'Rruyet, founder of De'Rruyet Industries, who accessed the network from his office within De'Rruyet Center on the planet Midarr. De'Rruyet purchased the Path engine from Remy on the planet Corellia, returning to Midarr, where he attempted to reproduce the device and his abilities."}, {"tag": "p", "text": "Though his replica was incomplete, De'Rruyet intended to unveil the Path engine at an expo, which led his rival, Domina Tagge of the Tagge Corporation, to recruit Doctor Chelli Aphra to look into his claims and prevent his company from releasing the technology. Aphra infiltrated De'Rruyet Center with the smuggler Sana Starros, and the two investigated De'Rruyet's office. Having seen messages about the Path engine, Aphra discovered the network from which De'Rruyet had found it. Intrigued by the network, Aphra considered using it to get rich by finding out the identities of the buyers and stealing from them. The two were interrupted by De'Rruyet, who walked into his office to find them at his desk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though the network was not given a formal name, it was first mentioned in the comic Doctor Aphra 8, written by Alyssa Wong and published by Marvel Comics on March 24, 2021. It subsequently appeared in the following issue, also written by Wong, penciled by Minkyu Jung, and published on April 21, 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}