{"url": "Mission_to_Corellia_(Rogue_Squadron)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions of the Galactic Civil War", "Category:Missions to Corellia", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Mission to Corellia  (Rogue Squadron)"}, {"tag": "p", "text": "The Mission to Corellia was undertaken by Rogue Squadron in 4 ABY to evacuate members of the Fel family threatened by the defection of Imperial hero Soontir Fel to the New Republic, and to rescue the young Fyric Fel, kidnapped before their arrival by Ilir Post."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following his capture in the Battle of Brentaal IV, Baron Soontir Fel agreed to defect to the New Republic under the condition that they aid him in his search for his now-fugitive wife, Syal Antilles Fel. To that end, Captain Wedge Antilles of Rogue Squadron, brother of Antilles Fel, selected pilots Plourr Illo, Wes Janson, and Derek Klivian for a clandestine mission to make contact with the Fel family on Corellia under the pretext of leave."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "After landing in Coronet City, the Rogues traveled by landspeeder to the Fel estate, where they discovered that Fyric Fel, Soontir Fel's two-year-old nephew had been kidnapped that morning. Using Wedge's name as a codeword, they established their presence to Todr Fel, Fyric's father, and avoided being taken into CorSec custody by Imperial liaison Agent Kirtan Loor due to the interference of Officers Corran Horn and Iella Wessiri."}, {"tag": "p", "text": "Back at their freighter, the pilots discussed Soontir Fel's loyalties before the arrival of Ajai Fel, Fyric's mother, who revealed that her son's kidnappers hoped to exchange him for Syal Antilles Fel's whereabouts. Fel gave the group the kidnapper's meeting place and a holograph in the boy's likeness, which, unbeknownst to the Rogues, contained a tracking device as part of a ploy by the Fel family to use the pilots to draw out the kidnappers. Upon meeting Ilir Post, Fyric's kidnapper who bore a grudge against Soontir Fel for turning him over to CorSec, Plourr Illo attempted to negotiate for the child's safe return. However, recognizing her as the Princess of Eiattu 6, Post captured her and her allies with the intention of ransoming Illo to her people, before being interrupted by the arrival of Officers Horn and Wessiri. Post escaped in the chase that followed, while the Rogues explained Soontir Fel's defection to the CorSec officers, and enlisted their support for a rescue attempt on Fyric Fel and Post's location."}, {"tag": "p", "text": "The combined force moved in towards the building in which Fel was being held, dispatching the guards before being stopped by Post, holding the child at blasterpoint over a balcony. Before the group could react, Todr Fel, having followed the tracked holograph to their location, shot Illir Post, gambling with his son's life as Fyric fell from Post's arms towards the ground. Diving to his rescue, Illo caught the child before he was harmed. With his son safe, Todr Fel revealed his gambit and agreed to leave with his wife and child under the protection of the New Republic."}, {"tag": "p", "text": "As the Rogues' freighter departed with the Fels on board, their escape was cut off by a group of Imperial-aligned pirates flying TYE-wing uglies. The outdated freighter struggled to evade the snubfighters until Officer Horn once again came to the Rogues' rescue, taking out three of the pirate fighters in his CorSec X-wing and lining up the fourth to be shot down by Plourr Illo. Now free to go, the group thanked Horn for his assistance, and contemplated the CorSec pilot's suitability to be a Rogue himself."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Two years later, in 6 ABY, Corran Horn would join the New Republic and the reformed Rogue Squadron, under now-Commander Wedge Antilles, who would go on to marry Horn's ex-partner Iella Wessiri."}, {"tag": "p", "text": "Eventually, Syal Antilles Fel would be reunited with her husband, first alongside her brother in the New Republic, and later, with Grand Admiral Thrawn's Empire of the Hand in the Unknown Regions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}