{"url": "Mission_to_Cularin", "categories": ["Category:Legends articles", "Category:Battles in the Thaere sector", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Cularin"}, {"tag": "p", "text": "The Mission to Cularin was a mission that took place during the Clone Wars."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The mission occurred when the Galactic Republic sent Gamma Squad, a squad of clone commandos, to infiltrate a droid factory on the planet Cularin, and place all the droids produced by the installation under covert Republic control."}, {"tag": "p", "text": "Gamma Squad arrived at the factory and destroyed the droid guards and automated defenses surrounding the facility's command center. However, Gamma Three was severely injured, so was placed on the squad's transport. The rest of the squad then tried to blast through a blast door with explosive charges, then make their way into the facility's inner bunker. However, the charges weren't powerful enough to destroy the door, so Gamma Five suggested that they locate the hardwire leading to the door, then manually slice into it. Gamma Two and Gamma Five began to cut through the corridor's metal walls in search of the wire, while the other commandos covered them."}, {"tag": "p", "text": "Five minutes later, Two and Five still hadn't got the door open. Wall panels in nearby corridors to the left and right suddenly slid open, and droids began to pour out, opening fire on the commandos. The clones returned fire, but more and more droids continued to emerge. However, Gamma One dealt with the threat, by throwing a magnetic pulse grenade at the droids, bringing them all offline."}, {"tag": "p", "text": "Soon afterward, the clones finally got the doors open, then destroyed all of the droids inside the bunker. Gamma Five swapped a command card in the bunker's main controls and cross-wired the communications system, sending out a coded override to all of the droids ever produced in the facility, which placed them under covert Republic control. Gamma One then ordered the rest of the squad to return to their ship, while he placed a timed explosive on the facility's power generator. He then activated the timer and ran back to the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While Closed Circuits infers that the mission took place on the moon Uffel, the entry for Gamma Squad in The Complete Star Wars Encyclopedia states that it took place on Cularin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}