{"url": "Mission_to_Courkrus", "categories": ["Category:Legends articles", "Category:Battles of the Invid crisis"], "nodes": [{"tag": "h1", "text": "Mission to Courkrus"}, {"tag": "p", "text": "The Mission to Courkrus was the first mission intiated by Corran Horn as a Jedi. In 11 ABY, he intended to terrify the Imperial pirates, the Invids who were on Courkrus to drive them off the planet."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In order to track down his wife kidnapped by former Moff Leonia Tavira, Jedi Knight Corran Horn infiltrated one of Tavira's pirate squadrons on Courkrus, the Khuiumin Survivors. As Jenos Idanian, he took part in several missions with the pirates."}, {"tag": "p", "text": "While Corran Horn was touring Vlarnya, he began to get a better sense of the other pirate gangs operating there; he intended to disrupt Tavira's operations by driving the pirates off the world. After a week of planning his campaign to terrorize the pirates, he began building his own lightsaber. Using the notes Rostek Horn had given him, he used scavenged parts to build it in only two days."}, {"tag": "p", "text": "At the same time, Jenos Idanian began posing as affably but constantly drunk, getting people to largely treat him as harmless."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Corran Horn began his reign of terror one night as he spoke with Jacob Nive in The Crash. After Nive had had a bit to drink, Horn began projecting to him a mental illusion of the dead Imperial Captain Jacob Nive coming up to their table and warning Nive that \"Doom is coming to Courkrus.\" The rumor of the ghostly visitation soon spread through Vlarnya, causing widespread worry."}, {"tag": "p", "text": "Not long thereafter, Horn put on a set of green Jedi robes and went prowling through the streets. He found two members of the LazerLords pirate gang attempting to rape a woman and fought them off. In extremely short order, word had spread across Vlarnya that a lightsaber-equipped Jedi was on the loose. The next several nights he performed similar feats, incapacitating small groups of pirates. One night, he warned some Fastblasters that he would kill the next member of that gang he saw. Three days later, the Fastblast left Courkrus. Another night, he struck at the Blackstar Pirates, who spent their time in a secret stronghold in the back of the Mynock Hole cantina. Entering the rear area, he found a spice den, brothel, bar, and gambling house in operation. He lit his lightsaber, stalked through the facility, damaging the bar and jubilee wheel, and warned the pirates that doom was coming before leaving."}, {"tag": "p", "text": "However the pirates had caught on to the fact that he had not yet killed any and were feeling bolder again. Shala, the Hutt leader of one of the gangs, fortified his warehouse base and began having his minions terrorize the local population, challenging the mysterious Jedi. Horn entered the warehouse den and faced Shala on his dais, who revealed that he held the trigger to a set of laser-flechette mines surrounding Horn. Horn tried to cut the trigger apart with the longer blade of his dual-phase lightsaber, but the blade failed. Shala dropped the dead-man trigger in surprise, however, setting off the series of mines. Horn channeled the Force to protect him, absorbing the massive input of laser energy and flame. He burnt off the last of his absorbed energy in a massive illusion of the column of flame becoming a Jedi with a lightsaber of fire which he projected for all Vlarnya to see."}, {"tag": "p", "text": "At the same time, some groups of Vlarnya's citizens had risen and attacked small groups of pirates. The next night, Horn drove off the last of Shala's group and let the populace loot the storehouse they had been using a headquarters. The Fastblasters and Shala's gang were completely gone, and the LazerLords, Blackstar Pirates, and Red Nova pirates had suffered from extreme desertion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When Tavira was aware of the situation, she went to Courkrus and found Horn, still posing as Jenos Idanian. She told him that she believed Luke Skywalker was the \"ghost Jedi\". She demanded that he take charge of the situation and rally the others against the Jedi. Horn immediately began making the rounds of the other groups, boosting morale, issuing security orders, and relaying the fact that Tavira was promising a successful trap for the Jedi. But while he was planning to fake his own death at the hands of the Jedi, he was attacked by five Jensaarai Tavira had dispatched to apprehend him."}, {"tag": "h2", "text": "Appearances"}]}