{"url": "Mission_to_Dathomir_(Cal_Kestis)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles of Dathomir", "Category:Duels", "Category:Jedi missions", "Category:Missions of the Stinger Mantis"], "nodes": [{"tag": "h1", "text": "Mission to Dathomir  (Cal Kestis)"}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During his travels researching the Zeffo species, Jedi Master Eno Cordova and his trusted droid companion BD-1 visited Dathomir to explore the Zeffo Sage Kujet's eponymous tomb.  When Cordova attempted to unlock the tomb's secrets, he was repelled by the evil pall that hung in the air, and abandoned his search. BD-1 recorded this interaction, among other explorations he conducted with Cordova."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "First visit to Dathomir"}, {"tag": "p", "text": "After landing on Dathomir, Kestis and BD-1 faced off against a Nightsister named Merrin who demanded they leave the planet immediately. When they refused, she commanded the Nightbrothers to attack them. Shortly after escaping that threat, Kestis came upon a human Wanderer, who claimed to be studying Zeffo ruins. The Wanderer warned Kestis to stay away from the ruins or be corrupted by the power within the Tomb."}, {"tag": "p", "text": "At the time, Kestis and BD-1 could venture no closer to the Tomb of Kujet, so they traveled to Kashyyyk to locate Cordova's old friend Tarfful. On Kashyyyk, Kestis would aid the Kashyyyk resistance and eventually locate Tarrful before returning to Dathomir."}, {"tag": "h3", "text": "Second visit to Dathomir"}, {"tag": "p", "text": "After returning to Dathomir, Cal and BD-1 traveled towards the Tomb of Kujet, nearly reaching it when they were ambushed by Nightbrothers. The ambush caused the Padawan and droid to descend into the dangerous and deep Dathomirian swamps, where they fought off Nightbrothers and Nightsister Zombies sent by Merrin. Kestis and BD-1 found climbing claws on a Nightbrother corpse in a dark cave. Before Kestis could grab the claws, they were attacked by a monstrous chirodactyl called the Gorgara. Cal managed to ward off the Gorgara long enough to secure the claws and add them to his equipment, allowing he and BD to climb a cliffside. Once atop that cliff, the Gorgara attacked again, and the Jedi and droid battled the Gorgara while riding it through the air until it crashed and died."}, {"tag": "p", "text": "Once they had defeated the Gorgara, Kestis and BD-1 were finally able to reach Kujet's tomb. Once there, Kestis experienced a flashback to his master Jaro Tapal's sacrifice of his life aboard the Albedo Brave when their clone troopers betrayed the two Jedi at the onset of the Great Jedi Purge. Jaro's spirit attacked Cal, destroying the lightsaber Tapal gave him. Kestis felt demoralized and dejected and fled back to the Mantis. On the way, however, he ran into the Wanderer from before, who revealed himself to be the former Jedi Master Taron Malicos. Malicos had succumbed to the Dark side of the Force within the Tomb of Kujet, and tried to turn Cal to the Dark Side. Merrin, however, interrupted Malicos and unleashed a horde of undead Nightsisters to destroy Malicos and Kestis."}, {"tag": "p", "text": "Kestis narrowly escaped this encounter, and Cere Junda advised him to build his own lightsaber. Lightsabers required kyber crystals to power the blade, so the Mantis crew journeyed to Ilum to find a crystal for Cal."}, {"tag": "h3", "text": "Third visit to Dathomir"}, {"tag": "p", "text": "After constructing his new lightsaber on Ilum, Kestis returned to Dathomir to face the specter of his master. Cal realized the only way to defeat Tapal's shade was to come to terms with his past and move on. He knelt before Tapal's apparition, refusing to strike it down, which caused the specter to vanish."}, {"tag": "p", "text": "Kestis and BD-1 entered the Tomb of Kujet, where they encountered Merrin once again. This time, Merrin was willing to talk to them instead of trying to kill them immediately. Kestis denounced and disavowed Malicos as a fallen Jedi. Merrin still did not trust Cal, so he allowed her to hold his lightsaber as a show of trust, and explained that owning a lightsaber doesn't make one a Jedi. Kestis told Merrin of the Jedi Order's role as keepers of the peace before they were betrayed and hunted to extinction. In turn, Merrin told Kestis of the massacre of the Nightsisters at the hands of General Grievous during the Clone Wars, and that she might be the only survivor. Kestis and Merrin bonded over being the last of their kinds, and Kestis told Merrin that Malicos was wrong to use her pain and loss to manipulate her."}, {"tag": "p", "text": "In the depths of the Tomb, Kestis encountered Taron Malicos. The Dark Jedi tried to turn Cal to the Dark side once again, but Cal refused. Then, Malicos attacked Cal. Merrin witnessed Malicos betraying Kestis, which spurned her to come to Kestis' aid in the fight. With the aid of the Nightsister's magick, the duo gained the upper hand in the fight. Together, Kestis and Merrin defeated Malicos, and Merrin buried him alive."}, {"tag": "p", "text": "After defeating the fallen Jedi master, Cal told Merrin that he came to Dathomir for an astrium, and Merrin agreed to help him acquire it. Merrin desired knowledge of the galaxy and a future for her people, so she joined the Mantis crew and their quest. Cal and Merrin found the astrium they came for, and the crew prepared to return to Bogano to collect Eno Cordova's holocron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Dathomir first appeared in the 2019 video game Star Wars Jedi: Fallen Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}