{"url": "Mission_to_Desolation_Station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Atrivis sector", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Desolation Station"}, {"tag": "p", "text": "The mission to Desolation Station was conducted by the Alliance to Restore the Republic as part of Operation Skyhook. Desolation Station was responsible for the creation and transportation of components for the under-construction Death Star. The mission concluded with Desolation Station's destruction."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War, as the Death Star was nearing completion, General Kota went to Dantooine to recruit a veteran Clone Trooper from the Clone Wars, X2, into the Rebel Alliance."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "X2 was dispatched into an asteroid field to infiltrate Desolation Station, a facility where components for the Death Star were assembled for the Empire before being transported to the Death Star construction site itself. As a transport had already left Desolation Station with the final superlaser component and en-route to the Death Star construction site, Kota advised that the shield corridor protecting the transport be taken offline first, as there wasn't a way for X2 to get aboard the vessel with the shield corridor still active. Kota suggested that X2 be cautious, as the controls were most likely going to be well defended by the Empire due to his knowledge on how the Empire operates."}, {"tag": "p", "text": "After clearing the hangar of Stormtroopers, Kota stated that he was receiving reports that the Empire was holding Wookiee prisoners on board Desolation Station, which led X2 to neutralize the security detail around the prison and freed the Wookiee captives. He then managed to reach the shield generator room and after clearing the personnel, and he was able to shut down the shield corridor. Unfortunately, this also rose an alert on board the station and reinforcements were dispatched to aid X2 while he went over to the TIE Fighter Combat Hangar to steal one of the TIEs."}, {"tag": "p", "text": "After successfully stealing one of the TIE fighters, X2 had to fight off TIEs to get to the transport. After clearing several of the TIEs, X2 noticed some X-wings, and told them not to shoot, as he was an ally. The Rebel wingmen laughed it off and told him that they were sent by Kota to hold off the TIEs while X2 went to take over the transport and stop it from delivering the tri-beam superlaser component. However, before he could board the transport, he had to take out its defenses. After doing so, he took out several Stormtroopers to reach the weapon room. He then used the Tributary superlaser to destroy Desolation Station."}, {"tag": "p", "text": "Kota congratulated X2 for the success of the operation, as it would give the Rebel Alliance a serious edge over the Empire's production time, and speculated that the Rebel Alliance might have use for \"a scrapper like [X2].\" He then told X2 to return to base so that the Alliance might formally initiate X2 into the Rebellion."}, {"tag": "p", "text": "Meanwhile, X1 met up with the surviving commanding officer, and told him that he had just been briefed on the unfortunate events at Desolation Station. The commanding officer was certain that X1 was upset, to which X1 replied that he was not. The Captain was about to tell him who he places the blame for the failure on, but was executed by a blaster shot before he could get the chance to reveal who it was."}, {"tag": "h2", "text": "Appearances"}]}