{"url": "Mission_to_Drahgor_III", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Events during the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Mission to Drahgor III"}, {"tag": "p", "text": "During the war between the First Order and the Resistance, members of the Team Colossus went on a mission to Flix's homeworld of Drahgor III  to obtain fuel for the Colossus from members of Flix's family."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Gozzo Flix grew up on the stormy world of Drahgor III. Flix's flock owned a fuel refinery, which delved deep into the earth to extract fuel. While his cousins including Flanx were content with their lives as miners, Flix regarded his family as backward and aspired to be a cantina singer. Flix departed on poor terms with his family but found little success as a cantina singer."}, {"tag": "p", "text": "Flix later became the co-owner of the Office of Acquisitions, which he ran with his Chadra-Fan partner Orka. The Office of Acquisitions was located on the Colossus platform on the planet Castilon and sold ship parts and weapons. After the First Order occupied the Colossus, the Resistance spy Kazuda Xiono and the former New Republic starfighter pilot Jarek Yeager led an uprising and took the Colossus into space."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "A stormy homecoming"}, {"tag": "p", "text": "After the Colossus was sabotaged by the Nikto engineer Nenavakasa Nalor and narrowly escaped the First Orde. the space station was short on fuel. Captain Imanuel Doza dispatched Flix, Orka, Xiono, CB-23, and his daughter Torra Doza on a mission to obtain fuel from Flix's family on Drahgor III. After braving the planet's turbulent atmosphere, the four managed to land their Star Commuter 2000 shuttle at the refueling platform."}, {"tag": "p", "text": "Flix received a cold reception from his cousins, particularly Flax who mockingly asked him about his cantina singing career. Flix asked for fuel, believing he was entitled to them. However, his cousins refused to give the fuel away for free. After one of the fuel refinery's drills was knocked offline, Xiono managed to convince Flanx to provide them with fuel in return for helping to repair the drill. Flanx agreed and took the offworlders down a lift into the depths of Drahgor III. While Flix believed that his cousins' deep-core drilling was provoking the Karnex dragons, Flanx regarded the dragons as a myth."}, {"tag": "h3", "text": "A perilous descent"}, {"tag": "p", "text": "While traveling down the mine shaft to reach the drill, the lift malfunctioned when a lose piece of debris dislodged by a Karnex dragon cause the lift to descend uncontrollably. Only a falling tool box stalled the damaged lift. Despite Flix's warning, Flanx still refused to believe that there were dragons. Torra advised them to get onto the tracks. Kaz attempted to use his lever to stop the lift from descending but the breaks broke. Torra and Orka, who had managed to climb onto the elevator shaft, were separated from the others."}, {"tag": "p", "text": "Kaz, CB-23, Flix, and Flanx managed to escape from the out of control cabin before it crashed at the bottom of the mine. At the advice of Kaz, Torra and Orka climbed up the shaft in order to reach the shuttle. This proved to be an exhausting climb and Orka contemplated giving up. However, Torra managed to convince him to continue by appealing to his love for Flix."}, {"tag": "p", "text": "Meanwhile, Kaz landed on one side of the platform and was separated from Flix, Flanx, and CB-23. While navigating through the other side of the ridge to reach his companions, Kaz encountered a Karnex dragon, which smelled him but was unable to see him due to its poor eyesight. Kaz later reached his friends and Flanx at the drill and told them about his encounter with the dragon. Flanx insisted that dragons were a myth and insisted on repairing the drill."}, {"tag": "h3", "text": "Den of the dragons"}, {"tag": "p", "text": "The group were soon attacked by the Karnex dragon which Kaz had encountered. Despite some resistance, Flanx was grabbed by the Karnex dragon, which carried him into the hole that the drill had unearthed. Kaz, Flix, and CB-23 followed the dragon through a tunnel into its den. Kaz also contacted Torra and Orka, who were near the top, and requested a pick-up Following a struggle, Kaz managed to free Flanx from the creature's mouth by shooting at it."}, {"tag": "p", "text": "Following an arduous climb, Torra and Orka reached the top of the drilling platform where they were greeted by the other Gozzo, who wanted to know what was going on with Flix and Flanx. Orka impressed the Gozo by speaking up for Flix and saying that he was entitled to fuel as a family member. The two then flew the shuttle into the depths of the mines to aid their friends and Flax."}, {"tag": "p", "text": "Meanwhile, Kaz, Flix, Flanx, and CB-23 managed to escape the cave only to be cornered by several Karnex dragons. Flix came up with an idea to disorientate the dragons with bright blast lights. However, one of the dragons knocked out a light. Fortunately for them, Torra and Orka arrived on their shuttle and managed to drive the dragons back into the cave. Realizing the error of his ways, Flanx than used the drill to seal the cave."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As a result of the Mission to Drahgor III, Kaz, Torra, Flix, Orka, and CB-23 obtained two large canisters of fuel for the Colossus from Flix's flock. Flix also reconciled with his cousin Flanx, who gave the fuel to Flix and his comrades. Realizing that the Karnex dragons were real and that the mining operations were encroaching on their natural habitat, Flax halted further deep-core drilling. Flix then departed with his comrades to the Colossus, continuing their voyage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Drahgor III first appeared in the Star Wars Resistance Season Two episode \"From Beneath,\" which premiered on Disney XD on November 3, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}