{"url": "Mission_to_Dromund_Kaas_(New_Republic)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dromund Kaas", "Category:Battles of Operation Shadow Hand"], "nodes": [{"tag": "h1", "text": "Mission to Dromund Kaas  (New Republic)"}, {"tag": "p", "text": "In 10 ABY, Mara Jade undertook a mission to search for Kyle Katarn following his disappearance on the Sith world of Dromund Kaas, location of the Prophets of the Dark Side and ancient capital of the Sith Empire."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following the Battle of Altyr V, Jedi apprentice and New Republic commander Kyle Katarn went missing while investigating the ancient Sith ruins of the planet Dromund Kaas. Following her successful recapture of a stolen Jedi holocron, fellow Jedi Mara Jade volunteered to search for Katarn on Dromund Kaas. In reality Kyle had succumbed to the influences of the Dark Force Temple on the Sith world and had fallen to the dark side of the Force."}, {"tag": "h2", "text": "The mission in the Temple"}, {"tag": "p", "text": "Landing in a jungle clearing close to the Dark Force Temple, and finding all weapons except for her lightsaber rendered unusable, Mara made her way to the Dark Force Temple. First she used the Force to move past the Watchers, fighting her way through deadly local wildlife, before coming across a force-manifested doppelganger of herself. After defeating the Sith apparition, Mara was able to reach temple itself, where she was forced to fend against the mutated Noghri, lightsaber-wielding Sith Jedi Statues, and Vornskrs that guarded the ruins."}, {"tag": "p", "text": "Eventually, she came across Kyle Katarn deep in the heart of the Temple, fully immersed in the Dark side, who rejected her offer of rescue and attacked her with Dark force energy and retreated deep into the catacombs. Pursuing Kyle, and encountering many trials and enemies, including reanimated Sith undead warriors, Mara descended into the ruins and confronted Kyle in the heart of the temple. Rather than engage him in a duel, she deactivated her lightsaber and left herself at Kyle's mercy. Unable to strike down his friend, Kyle found he could not continue down the Dark path and returned to the Light side of the Force, leaving Dromund Kaas with Mara."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Folowing these events, Katarn realized he could not continue his apprenticeship alone. He eventually accepted Luke Skywalker's tutelage and joined the New Jedi Order. Skywalker decided to keep Dromund Kaas's location a secret to avoid its dark power to corrupt other Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}