{"url": "Mission_to_Doza_Tower", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Battles of Castilon", "Category:Missions of the Cold War"], "nodes": [{"tag": "h1", "text": "Mission to Doza Tower"}, {"tag": "p", "text": "In 34 ABY, Resistance spy Kazuda Xiono and First Order officer Major Elrik Vonreg simultaneously undertook missions to Doza Tower on the Colossus refueling station located on the planet Castilon. Vonreg, accompanied by a squad of stormtroopers, was under orders to coerce Captain Imanuel Doza, commanding officer of the Colossus, into accepting First Order protection. Xiono, meanwhile, sought to investigate whether Doza was working for the First Order."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 34 ABY, newly recruited Resistance member Kazuda Xiono was sent to the Colossus platform on Castilon on a mission to identify a First Order spy the Resistance suspected to be operating there. On the station, he joined Team Fireball, run by former Rebel pilot Jarek Yeager, as a mechanic and racer as a cover. He was accompanied by Commander Poe Dameron's astromech droid BB-8."}, {"tag": "p", "text": "Not long after Xiono's arrival, a pirate gang secretly working for the First Order attacked the Colossus, as part of a plan concocted by Commander Pyre and Major Elrik Vonreg to try and coerce the station's owner, Captain Imanuel Doza, into accepting First Order protection. Xiono covertly helped drive off the attack by broadcasting feedback over the pirates' communications channel."}, {"tag": "p", "text": "Doza relied on fuel from various sources, including the First Order, to keep the Colossus running. As a result, after the attack, he had the station mostly powered down while he awaited a fuel shipment. This prompted Xiono and his coworkers, Tam Ryvora and Neeku Vozo, to suspend work on the Fireball and go to Aunt Z's Tavern for refreshments. There, Xiono learned that proprietor Aunt Z believed that Doza already worked for the First Order, due to both the power outage and mysterious starships that visited in the dead of night. As a result, Xiono resolved to get into Doza Tower and find out what was going on. He learned from Ryvora that people who were not residents of the tower had to be invited in by an Ace, such as her former friend Hype Fazon."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Arrival of the First Order"}, {"tag": "p", "text": "That same night, Major Vonreg was accompanying a freighter of fuel to the Colossus, as he intended to speak to Captain Doza. Xiono slipped out of the tavern with BB-8 on the lie that the droid required recharging in order to look from the vantage point of the market, and was initially skeptical that the freighter belonged to the First Order. Vozo and Ryvora shortly discovered him there, and after seeing the freighter's Ace Squadron escort fly away, Ryvora believed that Xiono had wanted to study the Aces so he could gain an advantage in racing. Xiono went along with her speculation. After witnessing Vonreg and four stormtroopers disembark, Ryvora and Xiono both wondered what the First Order wanted."}, {"tag": "p", "text": "The literal-minded Vozo, hearing Xiono express a wish that he could just ask the First Order what they were doing, decided to just go and ask them, forcing a concerned Xiono, Ryvora and BB-8 to chase after him. They failed to reach him in time to prevent him from speaking to a stormtrooper, but Vozo was brushed aside with a comment that he was not authorized to be in the area. As Vonreg and his troopers headed for the tower, Xiono confiscated Vozo's comlink and walked off with Ryvora and BB-8."}, {"tag": "p", "text": "Xiono was still determined to get inside Doza Tower, and told BB-8 that he wished Ryvora would ask Fazon to invite them in. Ryvora overheard his comment and began to explain why it wasn't possible, as well as her former friendship with Fazon. While Ryvora was listing off ways that she thought Fazon was terrible, the Rodian pilot happened to walk by and see her and Xiono. Having seen Ryvora earlier in Aunt Z's, Fazon approached them and invited them to the Aces' Lounge, which Xiono quickly accepted."}, {"tag": "h3", "text": "Doza Tower"}, {"tag": "p", "text": "Shortly after arriving at the lounge, Xiono saw Vonreg and his stormtroopers going through a door, and asked Fazon about their presence there. Fazon responded that he wasn't comfortable about it. He had earlier told Xiono that he refused to fly supply missions involving the First Order. Ryvora and Fazon got into an argument about the antiquated Fireball, which Xiono used as an opportunity to sneak off to do some spying. When Ryvora decided to leave, she discovered that Xiono was missing and was forced to do so on her own."}, {"tag": "p", "text": "Xiono followed Vonreg and company to the door they had entered, but was unable to get through it until a serving droid approached. As he was still carrying his and Vozo's comlinks, Xiono hid one on the droid's tray before it entered the room, Doza's office, and turned on the other one to eavesdrop. Inside the office, Vonreg told Doza that without the First Order's assistance, the Colossus was vulnerable to pirate attacks, and that as pirates were becoming increasingly well-armed, the Aces wouldn't be able to hold them off forever. Doza was not convinced of the offer, and noting the obvious coercion, remarked that he could report this to the New Republic. Vonreg countered that the First Order could tell the Republic about Doza's illegal dealings with criminal organizations. The meeting concluded without Doza agreeing to the First Order's terms, but with him accepting the shipment of fuel."}, {"tag": "h3", "text": "Discovery"}, {"tag": "p", "text": "Xiono hid behind the doorframe as Vonreg and his troopers exited, but his presence was soon betrayed when his two active comlinks began broadcasting feedback when they were brought too close to each other. He was forced to flee as Vonreg ordered his troopers to capture the spy. Xiono eventually, after nearly being cornered, slipped through an open door as a droid, 4D-M1N, exited demanding to know what the commotion was, only to find himself in Torra Doza's bedroom. Torra was surprised to see him, and assumed Xiono had come because he was attracted to her, which hadn't even occurred to him. She was more concerned that her father would \"kill\" Xiono if he found him there, and as the stormtroopers banged on her door, got Xiono out of the room onto the narrow ledge below her window before closing it."}, {"tag": "p", "text": "When the stormtroopers entered Torra's room despite the protests of the droid and looked out, they saw nothing, as Torra attempted to tell them that Xiono had gone a different direction. As Xiono made his precarious way along the ledge, he was spotted by the patrons of Aunt Z's, including Vozo and Ryvora. Aunt Z began taking bets about whether or not Xiono would fall. Xiono made it across one gap between ledges, and nearly fell, before continuing onwards. When he came to a larger gap, he paused to build his nerve, only to be discovered by the stormtroopers, who began firing at him from a balcony. From there, Xiono managed to make a reasonably quick descent down several ledges to a level with doors inside, while avoiding the stormtroopers' shots. BB-8 had tracked him down, while still in Doza Tower, and opened a door for him to get in. All this played out to the patrons of Aunt Z's, who cheered him along."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Major Vonreg confronted Captain Doza about the spy on the Colossus, which he denied any knowledge of. Torra claimed that Xiono was merely a friend who had gotten lost on his way out of the tower, and Doza agreed with this, telling Vonreg that he was confident none of the Colossus' citizens were responsible, as he claimed to know everything that happened on the station. After Vonreg's departure, however, a suspicious Doza recovered security-camera footage of Xiono from the incident, wondering who he was."}, {"tag": "p", "text": "Back at Yeager's repairs, Xiono claimed to Ryvora and Vozo, without technically lying, that the stormtroopers had been chasing him because he had accidentally wound up in a restricted area. He also claimed that he had been soured on the idea of the Aces Lounge, which pleased Ryvora, and returned Vozo's comlink. Shortly after this, full power was restored due to the fuel shipment."}, {"tag": "p", "text": "Doza's suspicions of Xiono, when he discovered Xiono was searching for two missing children the First Order had placed a bounty on, led him to send 4D-M1N to escort him, Vozo and BB-8 to his office. When Xiono made it clear he had no idea who had placed the bounty, and that he was looking for the children because he needed the credits and it was the right thing, Doza didn't believe him. However, Xiono remained unaware of Doza's suspicions toward him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}