{"url": "Mission_to_Empress_Teta", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Battles in the Koros sector", "Category:Battles of the Krath Holy Crusade", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Empress Teta"}, {"tag": "p", "text": "The Mission to Empress Teta was a Jedi operation conducted in the year 3997 BBY, several months after the Battle of Deneba. Following the death of Jedi Master Arca Jeth at that battle, Ulic Qel-Droma chose to go ahead with his proposed plan to infiltrate the Krath and bring them down from within. After several months without receiving any word from the undercover Ulic, Nomi Sunrider, Cay Qel-Droma, and Tott Doneeta organized themselves into a strike force and set out from Ossus for the undercover Jedi's last reported location—Empress Teta, the capital of the Krath regime. The three Jedi were eventually able to locate the undercover Qel-Droma, and what followed was a short, but violent, clash between Ulic Qel-Droma and Satal Keto, who had discovered the spy in the Krath's midst. Following the end of the duel, which witnessed the death of Keto, Ulic attacked his friends who wished him to return with them to Ossus. Believing that he could still destroy the Krath, and ultimately the Sith, from within, Ulic Qel-Droma continued to walk down the dark path that was laid out before him."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Battle of Deneba had been a violent affair that had left its mark on many Jedi, not the least of whom was the Jedi Knight Ulic Qel-Droma. The death of his former Master, Arca Jeth, on Mount Meru had deeply wounded Qel-Droma, and he vowed that he would go ahead with his plan to infiltrate the Krath and destroy them, and their Sith magic, from within. However, there were several Jedi, including Masters Odan-Urr and Ood Bnar, that believed Qel-Droma walked a dangerous path. Nonetheless, they believed that if the young Jedi was to fall, it was to be the will of the Force. Knowing that they could not forcibly keep Qel-Droma from departing for his self-assigned missions, the Masters and other Knights said their goodbyes to him as Qel-Droma departed the library world of Ossus."}, {"tag": "p", "text": "However, Nomi Sunrider and others became worried after several months had passed with no word reaching the Jedi or the Republic regarding the status of Ulic Qel-Droma's infiltration. Believing that Qel-Droma might have allowed himself to turn to the dark side in order to destroy the Krath, the Jedi determined it was necessary that Qel-Droma be contacted, and extracted if need be, as soon as possible. Volunteering for the mission, Jedi Knights Nomi Sunrider, Cay Qel-Droma, and Tott Doneeta devised a plan through which Sunrider would make contact with their target on the Krath capital of Empress Teta. With their plan approved by the Jedi Masters, the three Jedi immediately boarded the Nebulon Ranger and set out for the Empress Teta system."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Unknown to the other Jedi, Ulic Qel-Droma had been unable to send any form of communication back to Ossus, or the Republic, due to several reasons outside of his control. Qel-Droma knew that he had to be careful during his mission, lest his true intentions be discovered. Although he had been able to convince Aleema Keto of his \"conversion,\" her cousin Satal chose to be careful of the supposed fallen Jedi claiming to be a Krath sympathizer. Believing that he was correct in his assumptions about Qel-Droma, Satal gave into his suspicions and ordered that Qel-Droma be taken prisoner beneath the Iron Citadel. As a Krath detainee, he was the subject of various torture techniques, and was even injected with Sith poisons. It was these poisons that would cloud, and eventually corrupt, Qel-Droma's mind and lead him down the path to the dark side. Despite all that he was subjected to, Qel-Droma was able to survive the torture, and was even able to convince Keto that he was sincere in his devotion to the Krath. Now believing that Qel-Droma was in fact a Krath sympathizer, Satal and Aleema chose to take advantage of Qel-Droma's military expertise and promote him to warlord of all Krath military forces."}, {"tag": "p", "text": "Meanwhile, Nomi Sunrider and her Jedi strike team had managed to travel to Cinnagar and to successfully deposit Sunrider near the Iron Citadel. Realizing that the only way she would be able to see Qel-Droma face-to-face was to expose her identity as a Jedi Knight, Sunrider made her way to the Krath palace. Upon arriving, Sunrider ignited her lightsaber and was immediately confronted by a number of Krath soldiers. Knowing that fighting the soldiers would not help her cause, Sunrider allowed herself to be taken into custody, hoping that she would be brought before Qel-Droma and the other Krath leaders. Seeing the prisoner brought before him, Qel-Droma realized that he was faced with a difficult decision—save the woman whom he loved, and thus ruin his cover, or play the part that the Krath expected him to, and treat Sunrider as he would any other prisoner."}, {"tag": "p", "text": "Deciding that the importance of the success of his mission outweighed even his love for Nomi Sunrider, Qel-Droma advised his fellow Krath that he would personally execute the captured Jedi the following morning—though in reality he wanted to try and arrange for her escape. Not believing what she had heard, and not realizing that Qel-Droma believed he was playing a part, Sunrider was led off in chains to the Iron Citadel's dungeons. Wanting Sunrider to be aware of his plans, Qel-Droma attempted to contact her in her prison cell by programming a Krath droid with a hidden recording. The message explained his plans to stay undercover for a while longer, hoping to prevent any future attacks against the Jedi like what occurred at Deneba. The droid, however, was intercepted by Satal and Qel-Droma's hidden message was discovered. Realizing that he had been right from the beginning regarding Qel-Droma, Satal determined to have both Sunrider and Qel-Droma executed."}, {"tag": "p", "text": "Unaware of Qel-Droma's actual plan, Sunrider was able to use her battle meditation against the soldiers guarding her, causing them to fight and kill one another. Free to escape, Sunrider managed to make her way out of the palace and commed for aid from Cay Qel-Droma and Tott Doneeta, who were orbiting the planet in the Nebulon Ranger. When the two Jedi arrived to recover Sunrider, the strike team agreed that they must try to extract the undercover Qel-Droma as well. However, their mission came to an abrupt halt when Satal Keto intercepted the team. Just prior to this, Aleema had advised Ulic that it had been Satal's idea to attack the Jedi assembly on Mount Meru. Furious at this revelation, Ulic allowed his emotions to cloud his judgment, and he rushed to confront Satal—only to discover the Krath leader confronting Sunrider and the rest of the strike team. Making his presence known, Ulic advised Sunrider, Cay, and Doneeta that it had been Satal who had orchestrated the Krath offensive that had claimed Master Jeth's life. Releasing a scream, Ulic gave in to his anger and fought Satal in a vicious and fast-paced duel. Through his knowledge of the Force, Ulic was able to quickly overwhelm Satal's defenses, and the Krath leader was struck down, killed in the thrall of Ulic's anger. Finally realizing just how close Ulic was to falling to the dark side, Sunrider, Cay, and Doneeta attempted to convince the rogue Jedi to return with Ossus with them. Ulic, however, used his anger to unleash a wave of dark side energy at his friends, throwing them back towards their ship. Refusing to believe that Ulic was lost, the Jedi strike team boarded the Nebulon Ranger and made their way off Empress Teta."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Stunned by what they had witnessed back on Empress Teta, Sunrider and the other Jedi of the strike team devised a new plan and presented it to the Jedi Masters, aimed at extracting Ulic Qel-Droma from the Krath fortress on Cinnagar. The final phase of their plan called for Qel-Droma to be captured by force, but only if absolutely necessary. The Masters, however, cautioned against forcefully capturing Qel-Droma and bringing him back to Ossus. They argued that the decision to return and turn his back on the dark side must be made solely by Qel-Droma himself. Otherwise, they believed, the struggling Jedi would not learn from his mistakes, and that in itself could have even more dire repercussions. Heeding the wisdom of the Masters, Sunrider and the others modified their plan to accommodate this line of thinking. Under the guidance of Sunrider and other veteran Jedi, a task force was organized, which included the Beast Riders of Onderon, and set off for Cinnagar to again confront the growing darkness that was threatening to engulf Ulic Qel-Droma."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to Empress Teta first appeared in the issue Dark Lords of the Sith 4: Death of a Dark Jedi of the Tales of the Jedi series of comics. The mission was conceived and written by authors Tom Veitch and Kevin J. Anderson, and was drawn by artist Chris Gossett. Veitch and Anderson used this mission to further illustrate the fall of Ulic Qel-Droma to the dark side of the Force."}, {"tag": "p", "text": "Following the publication of the Dark Lords of the Sith story-arc, the Mission to Empress Teta was featured in the Tales of the Jedi: Dark Lords of the Sith audio drama, which was brought to life through the voice acting of various cast members, including John Cygan (Ulic Qel-Droma), Glynnis Talken (Nomi Sunrider), and Jack Noseworthy (Cay Qel-Droma)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}