{"url": "Mission_to_Eadu", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Mission stubs", "Category:Battles in the Outer Rim", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Eadu"}, {"tag": "p", "text": "The mission to Eadu was a mission undertaken by the Alliance to Restore the Republic during Operation Fracture to the planet Eadu to assassinate Galen Erso. Originally, the plan was for Captain Cassian Andor and Jyn Erso, aided by former Imperial droid K-2SO to capture Galen. Unbeknownst to Jyn, Andor had received orders from General Davits Draven, head of Alliance Intelligence, to assassinate Galen on the spot, fearing Galen knew too much about the situation."}, {"tag": "p", "text": "Although things were going along the original plan at first, after the U-wing LMTR-20, the ship the group was using at that point crashed because of the rainstorm and the harsh conditions of Eadu, a worried Draven launched Blue Squadron that had been kept ready as a backup plan. However, Draven had failed to realize that the group, although unable to communicate, could be in the strike zone."}, {"tag": "p", "text": "Meanwhile, Andor had taken defected Imperial transport pilot Bodhi Rook on a supposed \"look around\" to complete his mission undisturbed by Jyn, who he believed would try to stop him from killing her father. However, Jyn deduced Andor's true intentions due to K-2SO off-handedly noting he brought a weapon with him in the sniper configuration and Chirrut Îmwe sensing the dark side influencing his actions, she went after him and was soon followed by Îmwe and Baze Malbus."}, {"tag": "p", "text": "Just as Andor arrived at a vantage point with a view of the landing pad, the director of the project, Orson Callan Krennic, accompanied by a unit of death troopers, arrived at the planet to investigate a possible leak within the facility's science staff. He then ordered for the scientists to be brought out and ordered for the mole responsible for leaking the Death Star plans to Rook, threatening to execute the entire staff if the one responsible failed to comply. Galen ultimately admitted he had been responsible, although Krennic nonetheless decided to have the science staff, save for Galen, murdered anyway, and then revealed the events of the Destruction of Jedha City, bragging about how he had been responsible."}, {"tag": "p", "text": "Before Andor could fire at Galen, he noticed Jyn on the landing platform, and a signal from K-2SO, who had contacted the Alliance, alerting him that the Alliance had sent a squadron. Andor replied that Jyn was in the strike zone was there, and to call off the attack, but it was too late: the squadron, consisting of X-wings and Y-wings had already entered the planet. Although the base dispatched its fighter screen to defend the base, it ultimately was unable to stop the Rebels from launching a salvo at the main base that resulted in its destruction, as well as Galen being mortally wounded from the resulting bombing, dying just as Jyn made it up to the landing platform. Krennic ultimately evacuated from the base just as the attack had been commenced."}, {"tag": "p", "text": "Captain Feroph, via a TIE/rp Reaper attack lander, managed to evacuate from the base as the Rebel forces attacked. Due to her inability to ensure the security of the site, Captain Magna Tolvan was assigned to a punishment duty on Yavin 4 shortly after the Battle of Yavin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}