{"url": "Mission_to_Fekunda_Outpost", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Mission stubs", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Fekunda Outpost"}, {"tag": "p", "text": "During the reign of the Galactic Empire, Hera Syndulla undertook a mission to Fekunda Outpost."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Early rebellion against the Galactic Empire, the Spectres' Captain Hera Syndulla was contacted by Burl, a worker at the Fekunda Outpost. The two of them then arranged a meeting to discuss using the outpost on the rebels' supply line instead of the Empire's. For two weeks, Commander Zhou, his officers, and stormtrooper squad worked Burl and his fellow workers to death."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Upon Syndulla's arrival, the Ghost came under attack by several TIE fighters. Syndulla and Chopper were able to destroy the TIEs by going through a canyon. Syndulla and Chopper landed the Ghost near the outpost. Syndulla watched as Zhou's lieutenant were working Burl and the other workers. Syndulla then sabotaged the conveyor belt which made the Imperial leave. Syndulla met up with Burl and his fellow workers."}, {"tag": "p", "text": "During this time, Zhou was only able to get two complete shipments instead of fifteen. He knew that both his father and the Empire would order them to abandon the outpost if they could show them that it would be good for the Empire's ration reserves. While Burl wanted to rally everyone to rise up against the Empire, Syndulla suggested for them to appear incompetent and that the Empire would leave because of this. Burl told the lieutenant that the Nogull were eating the Phareen and that it would take three days to harvest it."}, {"tag": "p", "text": "She also suggested that Lemnos sabotage the conveyor and the generator to make the outpost look like more trouble than it was worth. Au B'ree also lied by telling the Lieutenant that the Phareen had been spoiled and had to be destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}