{"url": "Mission_to_Felucia_(Offee_and_Zonder)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with unencyclopedic tone", "Category:Battles of Felucia", "Category:Jedi missions", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Felucia  (Offee and Zonder)"}, {"tag": "p", "text": "This mission to the planet of Felucia took place near the end of the Clone Wars."}, {"tag": "h2", "text": "Enter the Commerce Guild leadership"}, {"tag": "p", "text": "Aboard her starship, Gossam President of the Commerce Guild Shu Mai was informed that they will land on Felucia—home to her personal holdings—in a few moments. Mai told the pilot to have her administratrix meet them on the executive landing platform. After landing, the administratrix came running forward, remarking that she had returned ahead of schedule. Mai replied by stating that her return was not a pleasure trip and asked if everything was under way. The administrator replied that they had initiated iterative asset transfer protocol and restricted all non-financial communication per her order."}, {"tag": "p", "text": "She then inquired of Mai's meeting with Confederacy of Independent Systems. Shu Mai explained that her meeting was more like a sentence: Darth Sidious had ordered the entire Separatist Council under Grievous's personal protection for the remainder of the war. Mai remarked that Grievous is prepared to conquer an Outer Rim world to host the Council: he will contact her with rendezvous-coordinates soon. Entering a speeder, Mai's administratrix pointed out that Grievous has dealt many blows to the Republic, remarking that the Separatist leaders are safest under his care."}, {"tag": "p", "text": "But the President of the Commerce Guild replied that Grievous lived to fight: if he wanted to hide, than matters for the Confederacy were dire. Shu Mai explained that Grievous claimed the fall of the Gossam homeworld was all part of Confederacy leader Count Dooku's plan, but to her it felt like the Commerce Guild was expendable. The administratrix mentions that with the Commerce Guild's riches, they will certainly receive aid from the Confederacy, but Shu Mai replied that one way or the other, Felucia will fall and she swears that no one will take the profits she earned from the war."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Meanwhile, from the nearby executive landing platform, Jedi Knights Barriss Offee and the Selonian Padawan Zonder, disguised as relief workers, were observing the speeder. Offee remarked that the Commerce Guild President had finally returned to her holdings and that they must alert the Jedi Council at once. She told Zonder to find a secure location for transmission. Zonder replied that off-world communications were restricted, pointing out that the signal will be detected, but Barriss Offee remarked that it does not matter."}, {"tag": "p", "text": "Moments later, as Offee was trying to make contact with the Jedi Council on Coruscant it became apparent that their cover was blown; several B1-Series battle droids were closing in. Offee pointed out that as they were undercover, they would not carry their lightsabers. Moments later, the battle droids moved in on them. Zonder managed to disable them all however. Fleeing, the Jedi headed for the closest transmission facility, which happened to be the executive landing platform."}, {"tag": "p", "text": "When several Hunter-Seeker droids rolled in, Jedi Master Barriss Offee told Zonder that they would split up and meet at the landing platform. The Selonian began to destroy the Hunter-Seekers and threw one of them into the air. Burning, it came down to where two young Gossam were playing. Without thinking, Barriss Offee used the Force to rescue them, resulting in several B1 battle droids noticing her. Closing in on her, they raised their blasters and ordered her to surrender. Zonder then jumped and destroyed two of the battle droids. His master stopped him, with the remark that there will be another time. And with that, the two Jedi surrendered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Make note that this battle takes place in 19 BBY and that in 20 BBY Padawan, Barriss Offee was arrested on Coruscant after blaming Anakin Skywalker's Padawan, Ahsoka Tano, for killing the criminal Letta Turmond."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}