{"url": "Mission_to_Fest_(Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles in the Atrivis sector", "Category:Battles of the Dark Trooper Project", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Fest  (Galactic Civil War)"}, {"tag": "p", "text": "During his investigation on the Dark troopers, then-mercenary Kyle Katarn visited a Weapons Research Facility on Fest in order to collect more clues on their production."}, {"tag": "p", "text": "After Katarn captured Moff Rebus, he proved reluctant in his interrogation but mentioned something about 'test results on the planet Fest'. Defected Imperial agent Crix Madine confirmed the existence of a facility on the planet doing metallurgical research. Jan Ors, who led Katarn's campaign, decided that analyzing the samples would help the alliance to trace the origins of the project."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 0 ABY, the Alliance to Restore the Republic became aware of an Imperial weapons project known as the Dark Trooper Project. As part of the effort to derail the project, Alliance operative Kyle Katarn was dispatched to the Anoat sector where he captured Moff Rebus, the designer of the prototype weapons to be used in the Imperial project. Under interrogation, Rebus revealed testing had occurred on the planet Fest. Located in the Atrivis sector of the Outer Rim Territories, Fest was home to an Imperial Weapons Research Facility; its existence was confirmed for the Rebels by General Crix Madine, an Imperial with Rebel sympathizers. The Alliance decided that any data from the testing facility would be of use in defeating the Dark Troopers."}, {"tag": "p", "text": "Rebel operative Jan Ors briefed Kyle Katarn on the mission, although she gave him a large degree of leeway in exactly how to conduct it. The Weapons Facility on Fest was built deep under large rock outcroppings with a strongly defended entrance guarded against frontal assault."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Entering the Weapons Facility"}, {"tag": "p", "text": "Katarn was flown to the planet Fest by Ors in the starship, the Moldy Crow and dropped on a narrow ledge overlooking a ravine. Following the ledge, Katarn emerged into a large clearing occupied by several stormtroopers led by an Imperial Navy officer. Eliminating the Imperial force, Katarn followed an upward path that climbed through the cliffs eventually emerging above a large courtyard which contained a large multi-story building and a sizable door set into the cliff face. Katarn dropped down to the courtyard, engaging a unit of stormtroopers on parade, and, avoiding the main entrance, climbed a staircase built into the cliff face. After investigating a small tower at the top of the staircase, Katarn found a hole that enabled him to drop behind the door."}, {"tag": "p", "text": "Inside this facility, Katarn neutralized several Imperial staff before activating controls that opened the entrance to main Weapons Facility."}, {"tag": "h3", "text": "Investigating the Facility"}, {"tag": "p", "text": "Among the forces Katarn encountered, there was an Imperial Officer who held a code card. With it, Kyle was able to reach the classified section of the facility where phrik alloys were tested. By controlling a complexly controlled rotating bridge, he managed to gain access to a cylindrical platform where a case with an alloy was."}, {"tag": "p", "text": "Kyle was unable to take the same route back to his ship. He traversed the dangerous testing room and reached the proper front entrance of the facility. Gaining access to the gate controls, he returned to the rocky landscape and finally to his ship"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There is an Easter egg in this mission: The player can find a secret room with a secret door, holding a chained Ewok."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}