{"url": "Mission_to_Fex", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Deep Core"], "nodes": [{"tag": "h1", "text": "Mission to Fex"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Luke Skywalker went on a mission to the moon Fex with Nakari Kelen and R2-D2 in order to find the lost collection crew of the Kelen Biolabs and their ship, the Harvester, and bring back any interests on the moon to Pasher. The crew found one survivor aboard the Harvester and successfully returned with the ship, bringing along dead Fexian skullborer samples. They were paid handsomely from Fayet Kelen to upgrade the Desert Jewel in preparation for their mission on Denon."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When Luke Skywalker engaged Imperial TIE/ln space superiority starfighters and rescued a Kupohan starship in the Llanic system, it was later known that a member of the Kuphoan spynet was in that ship carrying a vital information for the Rebel Alliance. Apparently, there was a Givin woman named Drusil Bephorin, a cryptographic genius who can slice nearly everything. The Empire was trying to convince her to apply her skills to slice through the Alliance's codes, while keeping her imprisoned on the planet Denon. Bephorin smuggled out a message through a Kupohan contact to the Alliance, ensuring that she will assist them if they help her and her family get to Omereth. After receiving the message, Admiral Gial Ackbar and Princess Leia Organa agreed to send Skywalker in a mission to liberate the Givin."}, {"tag": "p", "text": "While the Millennium Falcon was not available for the mission, a fast ship that Skywalker could pilot was the Desert Jewel, however, the ship was virtually unarmed. Furthermore, because the Alliance wasn't on condition to pay credits for the Jewel's weaponry, Skywalker had to gain resources to upgrade by his own. Having a conversation with Nakari Kelen, daughter of Fayet Kelen, who owned the Desert Jewel, Skywalker came up with an idea to help her father and get permission to upgrade the ship, as well as the credits. Nakari told Skywalker that her father lost contact with the collection crew he sent to an unexplored moon called Fex located in the Deep Core. She said, if they bring news of the crew's whereabouts, they would be able to get the help they need from her father. Admiral Ackbar joined the conversation and gave Skywalker a secondary objective to scout the moon and judge if the place would make an ideal base for the Alliance, since it was an unknown world to the public."}, {"tag": "p", "text": "Accompanied by R2-D2 and Nakari Kelen, Skywalker visited Pasher, the planet that Kelen Biolabs was located on. On the planet, Fayet Kelen gladly welcomed them and promised he'll compensate after they accomplish their mission to Fex. He ordered his staff to prepare two suits of the new Fexian armor prototypes along with a case of stun sticks, and transferred the coordinates with some additional data of the moon to R2-D2. After receiving three black cargo cases containing the equipment, the crew departed Pasher and set course to the Core Worlds to calculate the safest hyperspace route before navigating the Deep Core."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "As the crew jumped into hyperspace, a pre-recorded holographic image of Fayet Kelen started briefing of the mission they were assigned. A footage recorded by the scouting crew on the moon played, and revealed that mysterious creatures native to the moon killed the crew by sucking onto their brains. The Fexian skullborers, as named by Fayet Kelen, had teeth that were strong enough to penetrate an heavy armor and possessed a unique camouflaging ability which make them nearly invisible when attacking their prey. This ability was temporarily neutralized when they were stunned however, thus making the Fexian armor and stun sticks reasonable for Skywalker and Kelen. Their primary objective was to confirm if the rest of the collection crew was dead or alive, and report on the condition of their ship, the Harvester. As the record winked out, Kelen suggested Skywalker that the Alliance shouldn't try to establish a base on the moon, which Skywalker fully agreed."}, {"tag": "p", "text": "Before making a final jump to Deep Core, the crew spent hours practicing the equipment. They realized that due to the bulky armor, the wearer could barely stand up but takes reduced impact of stun sticks, which would be helpful when the skullborers stuck onto their helmets. After entering Sha Qarot system Kelen sent a signal to activate the Harvester's beacon, and spotted the ship resting on Fex. They landed their ship nearby and scanned for life-forms. Scan revealed several life-forms inside the freighter but not enough to make up the entire crew. Skywalker and Kelen's attempt to raise them via comm failed, so they had no choice but to investigate in person."}, {"tag": "p", "text": "The two wore their armor, prepped with stun sticks and blasters, entered the Harvester via ventral airlock. First, they investigated the port side cargo bay with stun sticks ready in case of a surprise attack, finding nothing but a pallet of crates for food supplies. As the two headed towards the aft they found five Fexian skullborers lying unconscious, contained inside the bottom row of ten closet near the aft hatch, seem likely to be dead, while the top containers' thick polymer glass had been cut through in narrow arcs with uneven edges, implying that there were other five skullborers loose in the ship. As Skywalker wondered why only the top five escaped and the bottom ones didn't, Kelen assumed that one of the skullborers on the top figured out how to bore through the glass and the others saw what it did and copied it. Skywalker worried that whether the creatures followed a single leader or acted independently, it meant that they had a level of intelligence he'd rather not face."}, {"tag": "p", "text": "Moving on, the two used a console pad for a shipwide announcement to contact any surviving crew members. No response came, making them to open the aft hatch which leads to the rest of the ship. The first sign of the collection crew they found was a dead Cerean lying facedown with two holes on his head, wearing a standard Kelen Biolabs uniform. Kelen discovered a second corpse in a rudimentary machine shop incorporated in the engineering area, someone who was once a scientist she knew. As both entered the lounge in the living quarters, they got their first view of the carnage. Three bodies, a Sullustan male, human female, and a Zabrak male were scattered around the lounge, with each having marks of a skullborer attack. Skywalker opened a door the Zabrak's body was blocking to head to the medical bay, and suddenly felt something landing on his helmet, which meant he was ambushed by skullborers."}, {"tag": "p", "text": "Wielding stun sticks on each hand, Skywalker managed to hit one of the creatures that soon fell off his body. But while trying to get a look on the fainted creature, Skywalker lost his balance and staggered backwards, tripping down to the floor due to his unwieldy armor. Then, two additional skullborers landed on his visor and the bottom one started to drill through his helmet while the other one on top of its back served as a shield, preventing the stun stick from knocking his partner out of consciousness. Realizing that the stun sticks couldn't suppress the creatures anymore, Skywalker reached out for his blaster instead and pulled the trigger without bothering to check its setting. The laser blast killed the last attacker, ending the sudden skirmish. Although their mission was to investigate the moon and bring back any interests alive if possible, Nakari even killed the stunned ones in revenge for her dead friends."}, {"tag": "p", "text": "As Kelen gave Skywalker a hand up, another skullborer appeared out of nowhere and injured her left hand. After quickly firing at the sudden attacker, they realized the skullborers were able to learn by their experience in the fact that the skullborer attacked the weapon hand, implying that they were at least semi-sentient. Skywalker patched Kelen up with a bacta patch, and letted the automated medical system in the medical bay continue. Skywalker resumed his investigation aboard the ship alone, having time to wonder if skullborers get smarter depending on what they ate, presuming that the brain of a Cerean improved their strategy. Skywalker eventually found the sixth and final crew member of the Harvester at the living quarters' third hatch on the left. The member was a human male, and although his look was most likely dead, his skull was still intact. As Skywalker leaned closer, he found out the man was still breathing. He threw the man over his left shoulder and hurried to the medical bay."}, {"tag": "p", "text": "After taking him to Kelen, Skywalker cleared the ship and started up the Harvester's engines and ran preflight. Then he dragged all the victims into the holding area, and double checked the ship with a life-form scanner he fetched when he returned briefly to the Desert Jewel. The scanner indicated clear and Skywalker linked the Harvester to the Jewel's navigation computer and successfully set course to Pasher."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When Nakari and Skywalker arrived on Pasher, Fayet Kelen was waiting for them along with his employees. Nakari gave her father a quick summary of events, and Fayet requested Skywalker to delete all the data that he provided to R2, since he wanted his interests were protected from other beings. Skywalker did what he had been told, however, Nakari winked at him, indicating that she had her own backup of the Fexian coordinates stored somewhere that might come in handy for the Rebel Alliance. Fayet thanked Skywalker for returning his ship and crew, and promised Nakari to be careful before acting further research on the moon. After spending one night at Pasher's finest hotel at Fayet's expense, Skywalker rejoined with Nakari and planned their next move; with the funds that Fayet provided, they decided to repaint the Desert Jewel to throw off Imperial alert, and outfit the ship with weapons on Rodia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Fex appears in Heir to the Jedi, a canon adult novel written by Kevin Hearne and published on March 3, 2015. It was one of the main events introduced in the novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}