{"url": "Mission_to_Gala", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles in the Nuiri sector", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Gala"}, {"tag": "p", "text": "The Mission to Gala was an assignment dealt by the Jedi High Council on behalf of a request from the Monarch of Gala."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The beautiful and wealthy world once ruled by the Beju-Tallah dynasty, Galla was fairly close to Phindar, a mining world controlled by the Syndicat. The Galacians native to the planet were divided into three adversarial tribes: the city people, the sea people, and the hill people. After the death of King Cana, Queen Veda realized that the monarchy was growing weaker, and that the people wanted a democratic election. She relented, and planned to hold an election in 44 BBY."}, {"tag": "p", "text": "Because of the change in government, and the potential risk of saboteurs, Queen Veda requested mediation from the Jedi High Council. The Council swiftly dispatched two Jedi who were in the system at the time."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "When Qui-Gon Jinn and Obi-Wan Kenobi arrived, they quickly met with the Queen and began to look for saboteurs. There were three candidates. Deca Brun received widespread support, due his promises of reform and prosperity. Prince Beju, son of Queen Veda, also ran for governor. He believed that he had a right to rule, as the rightful heir to the throne, and opposed the election. The final candidate was Wila Prammi, a former underminister."}, {"tag": "p", "text": "Shortly before the election, Kenobi discovered that Deca Brun received large campaign contributions from Offworld Mining Corporation. In return, Offworld was to receive extensive mining rights, which would have caused extensive environmental damage. Meanwhile, Beju learned that he was not the true heir to the Galacian throne; Elan, the leader of the hill people, was actually his older half-sister. Unknown to the Jedi, Prince Beju had sided with the Syndicat, who offered to help Beju take over Gala in exchange for power. Beju planned on thwarting his planet's elections by cutting off the bacta supply and reinstate it when the people started suffering, which would make the Prince look like a hero and make the other two candidates for the elections look inferior. However, his plan backfired when Obi-Wan Kenobi and Qui-Gon Jinn exposed the plot. Kenobi disguised himself as the Prince due to their apparent similar looks–both being adolescent boys of similar height. Obi-Wan acted like the arrogant Prince to help the ploy, and was able to get information that confirmed Beju's betrayal. Beju was then tested by the Mark of the Crown, which would determine if he was the rightful heir. The results turned out negative, as Beju knew, showing that Elan was in fact the true heir. Beju withdrew from the election, and supported Prammi instead. He also informed the electorate about Deca Brun's unscrupulous deal. Lonnag Giba, Head of the Council of Ministers was also attempting to take the thrown. The converted Beju helped to thwart the plot, and the Jedi arrested Giba."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After Giba's arrest, Beju honorably dropped out of the election, supporting Prammi instead. Thus, Wila Prammi won by an overwhelming margin, becoming the first governor of Gala."}, {"tag": "p", "text": "The Jedi were thanked, and left on a new and dangerous mission: the Mission to Melida/Daan, a mission that would test Obi-Wan Kenobi's commitment to the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}