{"url": "Mission_to_Glee_Anselm/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Glee Anselm", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Glee Anselm"}, {"tag": "p", "text": "The Sith Master Darth Sidious assigned the bounty hunter Cad Bane the mission to capture four force-sensitive children documented in the holocron. Bane's first choice was the Nautolan child Zinn Toa, who lived on the Nautolan homeworld Glee Anselm."}, {"tag": "p", "text": "The Jedi Council decided to not send a Jedi peacekeeper to defend Toa, as they concluded that Bane's work on Anselm was impossible to prevent. Despite Bane's success, the child was later reclaimed on the volcanic mining world Mustafar."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the successful raid on the Galactic Senate performed by Cad Bane, considered to be the most efficient bounty hunter in the galaxy, Darth Sidious, Dark Lord of the Sith, began to rely on Bane for his own personal use, tasking Bane with stealing a holocron in the Jedi Temple and the capture of Bolla Ropal and the Kyber memory crystal, a list of every single Force-sensitive child in the galaxy, on Devaron. Following the bounty hunter's success with combining the crystal and holocron, Bane killed the clone trooper Denal and used Denal's armor as a disguise to flee from the scene."}, {"tag": "p", "text": "Upon arrival at the Galactic Republic Star Destroyer Resolute, Bane's disguise was compromised and he made his escape in a V-19 Torrent starfighter. Bane was rewarded with the advanced starfighter, the Xanadu Blood, for his actions, and Darth Sidious gave him a new mission: capture four of the Force-sensitive infants on the list and deliver them to the remote planet of Mustafar, where Sidious planned to use them as test subjects in his experiments for the alteration of Force-sensitives to build his own personal corps of spies."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Using the Xanadu Blood, the heavily-modified and well-equipped Rogue-class starfighter that had been gifted to him by Sidious, Bane traveled to the water world of Glee Anselm, where he successfully captured the young Nautolan Zinn Toa."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Cad Bane was able to escape Toa, the first out of the four children he needed to complete his mission, and brought Toa to the Sith's secret stronghold on Mustafar. His next target was Wee Dunn, the Rodian child of Mahtee Dunn. A collaborative effort between Mace Windu, Yoda, Obi-Wan Kenobi, and Anakin Skywalker traced Bane's actions through the force, and concluded that he had already succeeded he mission on Anselm, and there was no need to send a Jedi there to protect the child. Kenobi was sent to Rodia while Skywalker and his Padawan, Ahsoka Tano, were sent to Naboo to protect another child, Roo-Roo Page."}, {"tag": "p", "text": "Sidious's installation on Mustafar was eventually uncovered, and Skywalker and his Padawan Tano traveled to Mustafar to rescue Dunn and Toa. Since the Jedi were unsure of the full extent of what the children were subjected to on Mustafar, the Jedi Council chose not to return the children to their parents and instead to raise the children in the Jedi Temple for the time being."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nautolan homeworld of Glee Anselm was included in early drafts of \"Children of the Force.\" The scene originally called for the Jedi to return Toa to his home following his rescue on Mustafar. However, director Dave Filoni cut the scene from the final script, clarifying that the Jedi did not return the children to their respective families, and instead brought the children back to the Jedi Temple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}