{"url": "Mission_to_Hallion", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Sith Worlds", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Mission to Hallion"}, {"tag": "p", "text": "In 3954 BBY a mission was undertaken by the Sith Lord Scourge and Dark Councilor Darth Nyriss' advisor Sechel to discover who purchased the droid that almost killed her during the second attempt on her life. After arriving on the planet Hallion they infiltrated the Uxiol Droid Manufacturing plant and Scourge had to fight several patrol drones and one assault droid while Sechel was slicing into the factories network. After copying the files Sechel sliced into the power grid and shut the plant down. The power outage destabilized the plants vats that used Trivium generator reactor cores. The pair escaped the plant shortly before the trivium generator's exploded destroying the plant."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3954 BBY several assassination attempts were made on Dark Councilor Darth Nyriss' life, the most recent attempt involved a serving droid armed with a disruptor beam that mistakenly killed her chef and wiped it's own memory core immediately after. After the attempt her advisor Sechel was able to slice into the droid's memory and discovered it was created at a privately-owned plant on the planet Hallion. She then hired two mercenaries to follow up this lead, but before they could the Sith Emperor intervened forcing Nyriss to ask for the Sith Lord Scourge's help. Shortly after Scourge's arrival on Dromund Kaas Nyriss sent her advisor to escort him to her stronghold and to order the mercenaries to kill him. After a brief skirmish Scourge killed the male and before the female could identify her employer she was killed by Nyriss' security chief Murtog and five guards."}, {"tag": "p", "text": "Nyriss later reveals to Scourge that she hired the mercenaries who attacked them and the reason she had Sechel order them to kill him. After the revelation she orders Scourge to protect her advisor during his mission on Hallion."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "After arriving on the Hallion the pair studied the building and through his night goggles Scourge noted a security fence that wasn't in Sechel's blueprints of the plant and one patrol drone. Scourge leapt over the fence and proceeded to severely damage the drone. After finally destroying the droid he proceeded to cut the power to the fence and open the gate allowing Sechel inside. The pair then infiltrated the manufacturing plant crossing the main production floor, lined with four enormous melting vats, as they made their way to records office. When the code Sechel was provided failed Scourge used his lightsaber to destroy the access panel."}, {"tag": "p", "text": "His action set off the alarm system alerting the plants security force to the intrusion. Scourge ordered Sechel to slice into the mainframe and find the necessary files while he would face the plants security. Shortly after two patrol drones emerged Scourge charged the drones, rolled underneath and unleashed a series of vicious lightsaber cuts ending the encounter. No sooner that he dispatched the drones another pair entered the room. Scourge threw his lightsaber to dispatch the first droid and used the Force to slam the second against the floor destroying it. Five more patrol drones and one assault droid entered the room, the assault droid charged Scourge while firing forcing the Sith to take cover behind a nearby conveyor belt."}, {"tag": "p", "text": "He then climbed the nearest catwalk to avoid the assault droids range of fire. The patrol drones charged Scourge who ran to the nearest melting vat. Two of the drones attempted to cut off Scourge's escape only to be thrown into each other and to drop into one of the melting vats. The three remaining droids avoided the vats and cut off Scourge's escape, he ran back toward the assault droid and jumped directly on top of the droid. He used his lightsaber to slice through the droids armor plating, but before he could damage any of the internal circuitry he was thrown clear of the machine."}, {"tag": "p", "text": "After he regained his balance he attacked the droid again from it's blind side and finally managed to damage the droid, causing the droid to lash out and kick Scourge square in the chest, breaking one of his ribs. Scourge then crawled under the droid using it as a shield to protect himself from the incoming fire of the surviving patrol drones, as he stabbed the unarmored underside of the droid finally finishing it off. Before he could saver his victory another swarm of drones and two more assault droids entered the room. He readied himself for more combat just as Sechel cut the power to the plant. Scourge re-equipped his night goggles and commed Sechel asking about his status and why the power went out."}, {"tag": "p", "text": "Sechel replied that he had copied the necessary files and then sliced into the power grid to shut the plant down. He then notified the Sith Lord that the power outage destabilized the Trivium generator reactor cores that the melting vats used. The pair escaped the plant shortly before the trivium generator's exploded destroying the plant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "A week later Nyriss revealed to Scourge that the droid that attacked her was purchased by separatists from the world of Bosthirda—who were trying to free their homeworld from the Emperor and the Dark Council—and sent Scourge, Sechel, and her security chief Murtog to raid the separatists' compound."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission first appeared in Drew Karpyshyn's novel The Old Republic: Revan which was released on November 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}