{"url": "Mission_to_Halcyon", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Colonies", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Halcyon"}, {"tag": "p", "text": "Around a decade before the Clone Wars, a group of Judicials and Jedi were sent by the Galactic Republic on a mission to rescue a group of hostages being held by usurpers on the planet Halcyon. The usurpers disabled the Republic forces' communications after they landed, resulting in one team of Judicials becoming lost for several days, but ultimately the Jedi were able to rescue all of the hostages and the lost squad was reunited with the Republic forces thanks to the Judicial cadet Wilhuff Tarkin."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A decade before the Clone Wars, a group of technologically savvy would-be usurpers on the planet Halcyon became discontent with the world's membership in the Galactic Republic. Wanting their world to be able to manage its own affairs, they kidnapped several members of Halcyon's planetary leadership and held them in a remote fortress where they prepared for assault. The Republic attempted to negotiate with the usurpers for their hostages, but all talks failed and the Galactic Senate eventually authorised members of the Jedi Order to travel to Halcyon in order to negotiate, using force if necessary. Eighty members of the Republic's Judicial Department were selected to accompany them, including raw trainees such as Wilhuff Tarkin."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "On the journey to Halcyon, the Republic forces traveled on board two cruisers, where the Jedi spent their time practicing with their lightsabers, which Tarkin keenly watched. Upon arriving on Halcyon the Judicial Forces were split into four teams by the Jedi, who selected one group to accompany them while the other three were positioned to prevent the usurpers escape through a set of low mountains on the far side of their fortress. As soon as the Judicials deployed, the usurpers disabled Halcyon's global positioning satellites and blocked all surface to air communications, cutting off the teams from contacting their cruisers, the Jedi or each other."}, {"tag": "p", "text": "The commander of the team including Tarkin, which was one of the groups positioned to prevent escape, chose to advance through bogs and forests toward the usurper's location using regional maps on his datapad after communications were disabled. For three days the team tried to make their way to the fortress, but hampered by poor weather conditions, mudslides and sudden tree falls, they ended up doubling back on themselves several times. On the fourth day rations ran out and the team's moral severely dropped, with teamwork being greatly reduced. While the team moved parallel to a wide, swift-flowing river for several hours, Tarkin studied the water flow and allowed the team to pass a shallow region they could have crossed. He then waited for the team to begin arguing how deep the river was before wading into the middle to show its depth. Following the display of intelligence the team's commander kept Tarkin by his side and eventually surrendered point to him, allowing the recruit to lead the lost Judicials."}, {"tag": "p", "text": "Now in charge, Tarkin used Halcyon's suns and moons to navigate to a more open region of woodland, on the way educating his comrades in hunting and outdoor survival techniques. After three further days of traveling Tarkin estimated that they were five kilometers out from their destination, and succeeded control back to the commander so he could lead the final leg of the mission. The team arrived shortly after the Jedi had finished rescuing the hostages, none of whom were killed. Their arrival astonished the Jedi, who had given up hope of seeing the Judicial team alive after search parties had been unable to find them."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the end of the mission, the cadets in Tarkin's team were at first unwilling to reveal what had happened while they were missing, but word of Tarkin's heroics and leadership eventually spread and he was given the credit he was due. After returning to the Judicial Academy, Tarkin found himself increasingly popular due to the incident, with a clique of other cadets forming around him. As Tarkin took part in more missions like the one on Halcyon he formed a reputation of being a strong leader, but eventually left the Judicial Department for galactic politics after a schism formed within the organisation concerning opinions of the Republic and its laws."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Halcyon was first described in the novel Tarkin, which was written by James Luceno and released in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}