{"url": "Mission_to_Had_Abbadon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Deep Core", "Category:Battles of the Second Imperial Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Had Abbadon"}, {"tag": "p", "text": "The Mission to Had Abbadon was a skirmish that took place on the planet Had Abbadon, a mythical planet located in the Deep Core."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As part of their plot to assassinate Darth Krayt, Galactic Emperor and Dark Lord of the Sith, the strikeforce composed by Cade Skywalker, Jedi Knight Shado Vao, former Shadow Celeste Morne and Imperial Knights Antares Draco, Ganner Krieg, and Azlyn Rae, with the support of Jariah Syn and Deliah Blue, attacked an Imperial garrison located on Had Abbadon. Their purpose was to draw Emperor Krayt away from Coruscant in order to eliminate him. At this time, a Devaronian Sith Lord named Darth Reave sensed the presence of Jedi on the planet."}, {"tag": "p", "text": "While Masters Draco and Krieg attacked the garrison aboard two Predator-class fighters, Morne, Skywalker and Rae faced numbers of Reave's stormtroopers. In order to turn the battle for their side, Morne, under the influence of Karness Muur, used the Muur Talisman to turn all nearby stormtroopers and Imperial officers into rakghouls. The monsters turned against their former commander, causing him to escape. Morne used the Force to prevent Cade and Rae from stopping Reave, giving him a chance to return to his Master."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Bleeding profusely from his bites and wounds, Reave reported to Darth Krayt of his failure. He did make Krayt aware that it was Skywalker who battled him in the Deep Core and that another unfamiliar Jedi was present—one who used the dark side to create monsters out of Reave's stormtroopers. Before he could complete his report, Reave himself began to transform into one of the very creatures he encountered on Had Abbadon. When the change was complete, the Devaronian Sith was no more; instead he was mindless Sithspawn, and he charged forward to attack Darth Krayt. He never reached his target, as he was intercepted by Krayt's Hand, Darth Stryfe, who proceeded to behead the creature. Lord Krayt then ordered his scientist, Darth Maladi, to examine the corpse, and she immediately discovered that he had been transformed into a product of ancient Sith alchemy, a rakghoul, after having been infected with the creature's plague."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}