{"url": "Mission_to_Hoth_(Jaden_Korr)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Disciples of Ragnos campaign", "Category:Battles of Hoth"], "nodes": [{"tag": "h1", "text": "Mission to Hoth  (Jaden Korr)"}, {"tag": "p", "text": "The mission to Hoth was carried out by Jaden Korr in 14 ABY during the Disciples of Ragnos crisis."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The Disciples of Ragnos, a Sith cult, has stolen information from Luke Skywalker's records about locations where he felt a strong connection to the Force. Skywalker sent members of the New Jedi Order to investigate these places and find out what the cult was up to."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Jaden Korr, then a Jedi Initiate at the Jedi Academy, was sent to Hoth to investigate the area where Skywalker once encountered the ghost of Obi-Wan Kenobi for Force nexus energy."}, {"tag": "p", "text": "Once reaching the location with his Far Wanderer, Korr could not sense any Force energy and considered whether Skywalker was wrong about his intuitions. Just then, he detected a flashing beacon and decided to investigate. It turned out that the beacons formed a path through the snowy canyons, where Korr encountered many snowtroopers and probe droids, even an All Terrain Scout Transport, thus confirming the Imperial Remnant and the Disciples of Ragnos's interest in the area, and also a few wampas."}, {"tag": "p", "text": "Eventually, Korr came to the ruins of Echo Base. However, the main entrance was locked, and Korr had to find other means of entering. He got into Echo Base through an underground tunnel, connecting the base with a wrecked AT-AT, which was heavily guarded by Imperial forces."}, {"tag": "p", "text": "In the base, Korr overheard a cultist communicating to a person named Alora about Dagobah. Making his way through the corridors, Korr entered a large room, where he encountered Alora, a Dark Jedi and Tavion's apprentice. She challenged Korr to a duel. Korr emerged victorious, as Alora fled through a hole in the ceiling."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Having completed the mission, Korr returned to the Jedi Academy, where he was considered to have passed the Jedi Initiate Trials and was promoted to the rank of Apprentice. The results of the mission were documented in the datacard Tauntaun Feathers A1."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hoth: Under the Ice presents this mission as carried out by both Jaden Korr and Kyle Katarn, while in Star Wars: Jedi Knight: Jedi Academy it is a solo mission for Korr."}, {"tag": "p", "text": "This is the only level of the game where the player does not wear the clothing selected at the beginning of the game (as the outfits would be impractical in the extreme cold)."}, {"tag": "p", "text": "It is possible to find the main entrance of Echo Base, but it is locked. The ruins of what appears to be Echo Base's shield generator are also findable, though they appear far smaller than in other games."}, {"tag": "p", "text": "Through the use of Force speed it is possible to save a Tauntaun from the Wampa near the end of the level and use it in the duel with Alora. However, due to the difficulty involved, this is most likely non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}