{"url": "Mission_to_Hoth_(Kyber_Saber)", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Search for the Kyber Saber"], "nodes": [{"tag": "h1", "text": "Mission to Hoth  (Kyber Saber)"}, {"tag": "p", "text": "In 3 ABY, the Freemakers undertook a mission to Hoth to find the final Kyber Saber crystal. They were pursued by the Sith Naare and the Hutt crime lord Graballa. Despite finding the crystal, the Freemakers were stranded when their ship StarScavenger sunk into an ice lake. After taking shelter at Echo Base, the Freemakers used a rebuilt AT-AT and a snowspeeder to fight Naare and Graballa's forces. Naare used her Force powers to summon an avalanche. The Freemakers managed to escape with the seventh crystal after Rowan gave Naare an ice shard."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Battle of Hoth, the force-sensitive Rowan Freemaker embarked on a quest to recover the pieces of the Kyber Saber crystal at the urging of Naare, who agreed to train him as a Jedi. Rowan and his family soon learned that Naare was actually a Sith agent in the service of Emperor Palpatine. With the help of the Hutt crime lord Graballa, Naare stole the fourth, fifth, and sixth Kyber Saber crystals from the Freemakers. In desperation, Rowan traveled to the planet Zoh to seek the help of Jek-14, the Maker of Zoh, who agreed to complete his training. After the Freemakers had escaped N-3RO and the mutinous droids on Zoh, they dared Naare and Graballa to race them to the icy world of Hoth, where the seventh Kyber Saber crystal lay."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Race for the crystal"}, {"tag": "p", "text": "Exiting hyperspace, the Freemakers flew their starship StarScavenger into a snowstorm above Hoth. In an attempt to lose their pursuers, Zander Freemaker flew the ship through the snowstorm. While Graballa's crew were blinded, Naare and Rowan were able to see through the storm through the Force. Using the Force, Rowan guided his siblings to safety and the StarScavenger narrowly avoided colliding with a mountain. However, Naare, Graballa, and Dengar's ships were not so luck and crashed into the mountain. Naare and Graballa's forces survived the crash but they were forced to dig Graballa's flagship Rancor's Fist out of the snow. Naare was also unable to sense Rowan's presence; forcing her and her allies to bid their time in the snowy wastes."}, {"tag": "p", "text": "Meanwhile, the Freemakers landed their ship on top of an icy lake. While Roger stayed behind to guard the StarScavenger, Rowan and his older siblings Zander and Kordi Freemaker ventured into a cave system. They eventually found the seventh Kyber Saber crystal in the middle of a room full of crystals. Rowan was able to identify the crystal through the Force. However, the crystal was a keystone to a natural booby trap system which caused a cave-in. Rowan used his lightsaber to dig his family out of the trap and reach the surface. On the way, the Freemakers were startled by a baby wampa. However, they quickly befriended it. Naare also sensed their fear through the Force."}, {"tag": "p", "text": "Upon returning to the StarScavenger, the Freemakers learnt that Roger had accidentally overheated the ship's engines. This caused the ship to sink into the lake. Roger barely escaped and his logic processor was frozen. Stranded, the Freemakers and Roger sought shelter at the former rebel base Echo Base. There, they encountered the disgraced Ensign Durpin and Sub-Ensign Plumestriker, who argued about reporting the intruders to the Empire. When Durpin tried to drive the Freemakers away with his blaster, the baby wampa attacked. Plumestriker fired at the baby wampa but this enraged the mother, which chased the two Imperials. However, Plumestriker had managed to send a distress signal over the com. The Freemakers prepared for a siege."}, {"tag": "h3", "text": "Skirmish outside Echo Base"}, {"tag": "p", "text": "Using his Force powers, Rowan rebuilt a derelict AT-AT walker and a snowspeeder. Kordi and Roger's walker shot Graballa's Rancor's Fist out of the sky, causing it to crash on the lake. This freed the submerged StarScavenger from its icy prison. Zander and Roger then used the tow cable to rip the canopy of Dengar's starfighter, causing it to crash. Naare then entered the fray with the Eclipse Fighter and shot Rowan and Zander's snowspeeder out of the sky. Kordi retaliated by using her walker to shoot down Naare's fighter. In response, Naare used her Force powers to summon an avalanche which toppled the Freemakers' walker. Before she could confront them, Naare was run over by Durpin, Plumestriker, and the pursuing wampas."}, {"tag": "p", "text": "The Freemakers fled into a cave and Naare contacted them via hologram. She issued an ultimatum to Rowan, offering to leave him and his family alone if he surrendered the seventh Kyber Saber crystal. After some debate, Rowan decided to surrender the crystal to Naare. While a triumphant Naare gloated as she reforged the Kyber Saber, Rowan fled with his family offworld on the StarScavenger. Naare soon discovered that Rowan had submitted an ice crystal, which prevented the ancient lightsaber from reforming. Naare and Graballa could only froth in rage."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In space, the Freemakers celebrated their escape. While Kordi and Zander debated over whether to travel to Kamino or Tatooine, Rowan resolved that he would not endanger his older brother and sister. He and Roger departed with the seventh Kyber Saber crystal aboard the Mini Scavenger and headed into hyperspace. Before departing, Rowan told his siblings that the Force had chosen him to protect the Kyber Saber crystals and that it was up to him to protect the galaxy and his family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to Hoth serves as the main plot of the LEGO Star Wars: The Freemaker Adventures Season One episode \"Showdown on Hoth\", which premiered on August 15, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}