{"url": "Mission_to_Jabba%27s_Palace_(Clone_Wars)/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Cleanup", "Category:Duels", "Category:Missions of the Clone Wars", "Category:Missions to Tatooine"], "nodes": [{"tag": "h1", "text": "Mission to Jabba's Palace  (Clone Wars)"}, {"tag": "p", "text": "A mission occurred in 22 BBY when Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, sought to return Rotta the Huttlet to his father, crime lord Jabba Desilijic Tiure, in his palace on the planet Tatooine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 22 BBY during the Clone Wars, the galaxy-wide conflict between the Galactic Republic and Confederacy of Independent Systems, both the Republic and the Confederacy sought access to hyperspace lanes through Hutt-controlled space, and therein sought to gain Hutt crime lord Jabba Desilijic Tiure's favor, leader of the Hutt clans."}, {"tag": "p", "text": "However, the Confederacy devised a plan to capture Jabba's son, Rotta, and frame the Republic and the Jedi Order for the crime. Confederacy Head of State and Sith Lord Count Dooku also formed an alliance with Hutt crime lord Ziro Desilijic Tiure, Jabba's own uncle, as Ziro sought to take Jabba's place as leader of the Hutt clans. The Jedi would be framed for the supposed killing of Rotta, and Jabba would take action against the Jedi and be arrested by the Republic, allowing Ziro to assume his position."}, {"tag": "p", "text": "Confederacy-affiliated Dark Acolyte Asajj Ventress captured the Huttlet in her ship, and Jabba enlisted the help of the Republic and the Jedi. While Jedi Master Obi-Wan Kenobi entered negotiations with Jabba in his palace on the crime lord's home planet of Tatooine, Jedi Knight Anakin Skywalker and his recently-apprenticed Padawan, Ahsoka Tano, managed to rescue Rotta on Teth. After they stole an old freighter, Skywalker and Tano approached Tatooine."}, {"tag": "p", "text": "Dooku had already arrived on Tatooine, and had entered negotiations with Jabba. The Sith Lord succeeded in deceiving the Hutt crime lord, and Jabba believed that the Jedi had killed his son—and that Skywalker was also heading to Tatooine to kill the crime lord himself and the rest of the Hutt clans. Dooku stated that he would deal with Skywalker personally, and sent several MagnaGuard battle droids to pilot Rogue-class starfighters, and await Skywalker's arrival and shoot the Jedi down. Dooku also dispatched three MagnaGuards to wait outside of Jabba's Palace to halt any attempts that Skywalker might make to return Rotta to his father."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Dogfight over Tatooine"}, {"tag": "p", "text": "Upon arriving in the Tatooine system out of hyperspace, Skywalker and Tano were in the process of making repairs to their freighter, as it was in rather poor condition. Skywalker ordered astromech droid R2-D2 to divert power to the front shields instead of the rear. Suddenly, the MagnaGuard-piloted fighters appeared, ironically attacking from the now-unprotected rear. Skywalker and Tano managed to destroy the fighters, but were shot down over the planet. As they headed toward Jabba's palace, Skywalker sensed the presence of the dark side on the planet. Electing to split up, Skywalker went to confront and distract whomever he had sensed, while Tano continued toward the palace with Rotta."}, {"tag": "h3", "text": "Intervention and Deception"}, {"tag": "p", "text": "As night fell over the desert, Count Dooku intercepted Skywalker. As Dooku dismounted his speeder bike, Skywalker ignited his lightsaber. Dooku quickly demanded Rotta's surrender before unleashing a barrage of Force lightning at Skywalker. Skywalker absorbed the attack with his lightsaber. Seeing the futility of his assault, Dooku stopped the barrage. Pulling off his hood and brandishing his lightsaber, Dooku quickly saluted Skywalker before the two charged each other."}, {"tag": "p", "text": "As the combatants met, Dooku opened the battle with a rapid overhand, Skywalker parrying before countering. Dodging, Dooku quickly lunged forwards, though Skywalker batted aside the attack. Anakin remained defensive until he dodged a slash at his neck, at which point he seized the offense. However, Dooku easily evaded and held off Anakin's wild attacks, and unleashed another overhand, forcing his opponent into a bladelock. In the momentary lull, Dooku tauntingly complemented Anakin, stating that his training had come a long way. Angered, Anakin broke the lock and hacked at Dooku's waist. As their bout resumed, Dooku momentarily shifted to a one-handed hold of his blade. After a series of power-struggles, the two disengaged. Using the second pause, Dooku again taunted, this time about the feelings of pain and loss he felt from Anakin."}, {"tag": "p", "text": "Dooku's taunts confused and enraged Anakin, who in a fit of anger, unleashed a massive Force push. Dooku was momentarily thrown off balance and driven back by the sudden blast. Crouching for a moment to protect himself from the flurry of sand kicked up by Skywalker's push, Dooku flourished his blade and countered with his own push. With Skywalker knocked off his feet and disarmed by Dooku's counter-attack, the Count seized the moment and leapt at the Jedi, blade raised for the kill. However, Skywalker managed to summon his weapon back to his hand in time to block Dooku's attack. However, as Skywalker pushed Dooku's blade aside and regained his feet, the Count managed to slash the Jedi across the back, cutting Skywalker's backpack in half and supposedly killing Rotta."}, {"tag": "p", "text": "However, Anakin revealed that the backpack was full of rocks, and that Rotta himself was with Ahsoka Tano, safely at Jabba's palace by now. Dooku was not surprised, stating that he expected such a deception and that his \"web was strong enough to catch your insignificant little Padawan\". As Skywalker retorted that Ahsoka was more skillful than Dooku believed, a seemingly enraged Dooku countered that Anakin was simply deceiving himself."}, {"tag": "p", "text": "With that, Dooku charged, and the two continued their battle. However, after another long and vicious bout of swordplay, Dooku blasted Anakin aside with a Force push. Stating that he had a message from Skywalker's Padawan, Dooku produced a hologram of the IG-100 MagnaGuards Dooku had left in wait at the palace attacking Ahsoka. An enraged Anakin attacked Dooku, managing to kick him in the face, knocking him down the dune side."}, {"tag": "p", "text": "As Anakin looked down at the seemingly defeated Dooku, the Count stated that after his droids killed Rotta, Ahsoka would be delivered to Jabba for \"punishment for the Huttlet's murder\". As Dooku taunted that he couldn't imagine Jabba being merciful, Anakin left to save Ahsoka, departing on Dooku's own speeder."}, {"tag": "p", "text": "As Anakin vanished into the distance, Dooku mounted the dune and observed his departure, engaging in a fit of laughter."}, {"tag": "h3", "text": "Entrapment and Escape"}, {"tag": "p", "text": "As night fell, Ahsoka approached the cliffs leading up to Jabba's Palace. As she followed the roadway up to the palace, she suddenly sensed danger. Quickly brandishing her lightsaber, she found herself faced by three IG-100 MagnaGuards, who sprang up from concealment under the sand. As she engaged them, they managed to drive her back and knock her down one of the cliffs, an event witnessed by Anakin Skywalker via hologram during his duel with Dooku out on the Dune Sea."}, {"tag": "p", "text": "As the MagnaGuards pursued her, R2-D2 brandished his charge arm and attacked one of the droids. However, his bravery was short-lived, as the MagnaGuard absorbed R2's attack with its electrostaff and quickly disabled the astrometric with a strike from the weapon, knocking the unfortunate droid further down the cliff. With R2-D2 out of the battle, the MagnaGuard quickly rejoined its brothers. As the droids bracketed her, Ahsoka managed to hold her own against them. However, they began to drive her further back, and while leaping to evade an attack, Tano lost her footing, falling to the bottom of the cliff. As she landed in a dell at the foot of the cliff, Rotta coughed up some sand, leading Ahsoka to dryly remark that she thought he liked to play in the sand."}, {"tag": "p", "text": "As the MagnaGuards skidded down the cliff into the dell, Ahsoka quickly concealed herself on an overlooking ledge. As the droids reached the foot of the cliff and began looking for her, Tano quickly leapt from concealment and cleaved one of the droids in two with a powerful overhand as she landed. Turning to face the droids, she suddenly heard the sound of a speeder bike, and looked up to see Anakin Skywalker riding past on the roadway above."}, {"tag": "p", "text": "Skywalker, knowing that his Padawan was in peril, had broken off from his duel with Dooku while the Count was momentarily disabled and departed to help Tano, using Dooku's own speeder. As she blocked an attack, Ahsoka began calling out to her master, but was left frustrated when Skywalker failed to hear her. Angrily complaining that Anakin never listened, Ahsoka regained her focus and turned back to the MagnaGuards. Backed into a corner, Tano stated that the 'stick-tinnies' would be going back to Dooku in pieces."}, {"tag": "p", "text": "Charging one of the MagnaGuards, Ahsoka knocked it to ground and took its electrostaff, ramming it through the second droid's chest. She quickly bisected the impaled MagnaGuard as the other regained its feet, taking up its fallen brother's weapon and attacked Ahsoka. Tano fell backward as she dodged its attack, landing in a crab-walk position to protect Rotta. As the MagnaGuard resumed its attack, Ahsoka regained her feet. Blocking the attacks, she suddenly skirted around and behind the MagnaGuard, quickly slicing it in two."}, {"tag": "p", "text": "As Ahsoka fell to her knees, exhausted, she remarked that being a Padawan was harder than she thought."}, {"tag": "h3", "text": "Near Disaster"}, {"tag": "p", "text": "While Ahsoka fought the MagnaGuards, Skywalker was met at the palace entrance by a group of guards led by Jabba's interpreter droid. Demanding Ahsoka's location from them, Skywalker was led inside, after being asked to surrender his weapon. Taken before Jabba, Skywalker learned that Ahsoka wasn't present. Taking Skywalker's questions about her to be a flimsy attempt at deception, Jabba ordered Skywalker executed. Skywalker reclaimed his lightsaber and held it to Jabba's throat."}, {"tag": "p", "text": "Before things got even more out of hand, Tano, having defeated her foes, arrived in the throne room and returned Jabba's son to him. However, Jabba continued to believe that the Jedi had plotted against him, and ordered both Padawan and Master to be killed immediately."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "A timely communication from Republic Senator Padmé Amidala revealed Jabba's own uncle, Ziro, to be the culprit behind the kidnapping along with Count Dooku. Jabba, now acknowledging the Jedi had honestly rescued his son, granted the Republic military safe passage through Hutt space. Skywalker and his Padawan-learner were then retrieved by Jedi Masters Yoda and Obi-Wan Kenobi."}, {"tag": "p", "text": "As Dooku departed Tatooine, he apologized to Darth Sidious for his failure. Sidious, however, was unconcerned, stating that this momentary loss would work in their favor in the long run, damaging the Jedi's reputation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to the Clone Wars film commentary track, much of the duel between Skywalker and Dooku was based on unused animatics and footage from their final confrontation in Revenge of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}