{"url": "Mission_to_Kamino_(Clone_Wars)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions of the Clone Wars", "Category:Missions to Kamino"], "nodes": [{"tag": "h1", "text": "Mission to Kamino  (Clone Wars)"}, {"tag": "p", "text": "The Mission to Kamino was an unofficial operation, ordered by Kal Skirata and carried out by Null ARC lieutenant Mereel to locate the missing Kaminoan Chief scientist Ko Sai."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "Ko Sai had been in charge of controlling the speeding up of the aging of Clone troopers and she had defected to the Separatists during the First Battle of Kamino, taking all her data on this subject with her. Kal Skirata wanted this data, so that he could give the clones a normal lifespan and he believed that there might be some information on it in the computer mainframe in Tipoca City on Kamino."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Skirata and Mereel landed in Tipoca City using a false transponder code to hide their true identities and Mereel went and entered the city and headed to the administrative core at the center of it, disguised as a standard clone trooper."}, {"tag": "p", "text": "He went to a computer terminal there and input a legitimate data request, but also sent with it a second hidden layer, to access the root of the entire system undetected. He did this using Republic Treasury Audit Division encryption and de-erasure keys, which he had obtained from Besany Wennen during the Mission to Coruscant and were the most advanced available. He looked for encrypted files that were sent between Coruscant and Kamino; and any data that Ko Sai had stolen or deleted. He wanted to download as much as he could, as he might not get a chance to return to Kamino. However, the mainframe contained 10 petabytes of data, which would take minutes to download, compared to 30 seconds for a regular trooper using the computer to maintain their armor systems."}, {"tag": "p", "text": "A male Kaminoan approached Mereel to inquire why he was taking so long. Mereel claimed that his HUD had slow data response times and the Kaminoan told him to go to Procurement and have them run diagnostics on it. Mereel head off in the general direction of Procurement, but the moment the Kaminoan was out of site, he went to be extracted by Skirata."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The mission, in a sense, was a failure, as Mereel was unable to find Ko Sai but was able to locate information on the scientist's whereabouts. However, he did succeed in downloading secret communications between Prime Minister Lama Su and Chancellor Palpatine, that revealed that cloning facilities had been covertly established on Coruscant and that the Republic was not planning on ordering any future batches of clones from Kamino."}, {"tag": "h2", "text": "Appearances"}]}