{"url": "Mission_to_Kejim", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Battles in the Sertar sector", "Category:Battles of the Empire Reborn campaign", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Kejim"}, {"tag": "p", "text": "During the Galactic Civil War, Kyle Katarn and Jan Ors went on a mission to the planet Kejim at the behest of the New Republic."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "New Republic sources had detected a suspicious transmission containing keywords such as \"Reborn\" and \"Valley of the Jedi\" from a supposedly abandoned Imperial base on Kejim. The transmission was believed to be for Galak Fyyar, a scientist working with the Imperial Remnant."}, {"tag": "p", "text": "Mon Mothma, Chief of State of the New Republic, sent the mercenaries Kyle Katarn and Jan Ors on a covert mission to investigate the base."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "After landing, Katarn and Ors cleared out Imperial forces guarding the area outside the base. Katarn then activated a laser turret and used it to blast the sealed entrance open. Upon successfully infiltrating the base, Ors remained in the control room to search the computer database for useful information. In the meantime, Katarn explored all three sections of the base and wiped out all the Imperial forces he encountered. At one point, when he called Ors over to another section to help him crack a code, she was attacked and pinned down by Imperial forces until he returned in the nick of time to save her. Katarn found three different Imperial codes and used them to unlock another door leading further into the base."}, {"tag": "p", "text": "While Ors prepared the Raven's Claw for takeoff, Katarn continued to explore the base and destroy all Imperial forces he came across. Katarn eventually discovered that the base was being used by the Empire Reborn as a laboratory dedicated to testing Artusian crystals—Force-sensitive objects. By the time the two mercenaries left the planet, they had dealt significant damage to the Imperial Remnant operation on Kejim."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon returning to Coruscant, Katarn and Ors reported their findings to Mon Mothma, who continued to engage their services to trace the source of the crystals on Artus Prime. In the meantime, a security camera on Kejim had captured an image of Katarn, which was forwarded to Galak Fyyar. Fyyar, in turn, reported the incident on Kejim to Desann, who remarked that the \"setback\" they had faced could be the key to solving their problems."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission appears in the 2002 video game Star Wars: Jedi Knight II: Jedi Outcast. If a player overhears one of the conversations between the stormtroopers on Artus Prime, a stormtroopers mention that he arrived from Kejim, and is being transferred to Cairn Installation. The final appearance of the \"traveling stormtrooper\" is at Cairn Installation, where he mentions to a comrade that he came from Artus Prime."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}