{"url": "Mission_to_Kegan", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles in the Calaron sector", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Kegan"}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Kegan's surface consisted of mainly rugged countryside, as well as plateaus. It was used mostly for food and animal cultivation. There was only one city on Kegan, which was divided into circles for each area of work. The Circles were large domed structures connected to each other by unpaved roads and located in a ring around the Gathering Circle, where meetings were held. Kegan did not have a currency, but relied on a barter system."}, {"tag": "p", "text": "From 74 BBY to 44 BBY, Kegan isolated itself in accordance with the visions of V-Tan and O-Vieve, who foresaw the coming of the Galactic Empire. In their zeal to protect their homeworld from the Empire, these Benevolent Guides created a new government system made to protect the people from this threat. However, measures intended for good taken by the government caused just as much suffering as it was intended to avoid. New systems were put in place on Kegan such as universal surveillance which caused the government to become repressive. All the citizens of Kegan had a vote in government issues, however V-Tan and O-Vieve decided what they should vote on, creating only the illusion of democracy."}, {"tag": "p", "text": "Under the rule of the Benevolent Guides, all Keganite children were forced to add a \"V-\" (for males) or \"O-\" (for females) before their names. Also, the Keganite children were sent away to be raised in schools. Here they were taught and instructed to the point of brainwashing to be extremely xenophobic, through lessons that misrepresented the galaxy as much more dangerous and malignant than it actually was."}, {"tag": "p", "text": "O-Lana was born in 45 BBY to V-Nen and O-Melie on the oppressive and isolated world of Kegan. Her parents realized very early that their child was special, and despite Kegan's taboo against contacting the Republic, they requested that the Jedi Council test their child. Understanding the fragile diplomatic situation on Kegan, the Council dispatched four Jedi: Masters Adi Gallia and Qui-Gon Jinn and their respective Padawans, Siri Tachi and Obi-Wan Kenobi."}, {"tag": "p", "text": "However, the Benevolent Guides that ruled the planet saw a grave future should the Jedi take the child. They had visions of white-armored soldiers raining destruction down upon their planet, and they decided to avert this crisis before it could become a reality. They spirited O-Lana away to the Relearning Circle, a prison-like compound to which certain youths were banished and fed anti-Republic propaganda. Luckily, the two Jedi Padawans Tachi and Kenobi found their way into the Relearning Circle. They saved O-Lana with the help of Jinn and Gallia and in the process shut down the Circle and overthrew the Guides. The foursome then took O-Lana away from her parents to be trained as a Jedi Knight."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "The rule of the Guides was ended in 43 BBY by Qui-Gon Jinn, Obi-Wan Kenobi, Adi Gallia, and Siri Tachi. They exposed the cruelty brought about by the Guides' rules of isolation, including the suffering caused by diseases which the galactic community had learned the cure for during Kegan's self-imposed quarantine. When Siri, V-Davi, and Obi-Wan escaped the Re-Learning Circle, the anti-isolationist movement used it to cause a public uproar that disposed of Benevolent Guides and to send a envoy to the Republic."}, {"tag": "h2", "text": "Appearances"}]}