{"url": "Mission_to_Kashyyyk_(Thrawn_campaign)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Kashyyyk", "Category:Battles of the Thrawn campaign"], "nodes": [{"tag": "h1", "text": "Mission to Kashyyyk  (Thrawn campaign)"}, {"tag": "p", "text": "The mission to Kashyyyk referred to a failed attempt in 9 ABY by the Noghri Commando Team 22 to capture Princess Leia Organa Solo on the Wookiee planet of Kashyyyk. Under orders from Grand Admiral Thrawn, the Noghri infiltrated Kashyyyk, where she was in hiding and protected by numerous Wookiees, and tried to abduct Organa during the night. She was alerted to their presence by the Force, however, and the Noghri unit was killed except for Khabarakh, who was captured. Khabarakh later agreed to take Organa to the Noghri home planet of Honoghr."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "During his campaign against the New Republic in 9 ABY, Grand Admiral Thrawn was seeking the assistance of the Dark Jedi clone Joruus C'baoth, who in return for his help demanded that the Force-sensitive Princess Leia Organa Solo be captured and brought to him. Organa was pregnant with twins at the time, and C'Baoth sought to turn all of three of them into his disciples. Thrawn agreed, and order the Noghri Commando Team 22 to the Wookiee home planet of Kashyyyk to capture Organa. She had gone into hiding there under the protection of numerous Wookiees, but their numbers had thinned after several days of inactivity."}, {"tag": "h2", "text": "Attack"}, {"tag": "p", "text": "The Commando Team 22, which included the Noghri warrior Khabarakh, mounted a covert attack during the night and attempted to capture Organa. They first set fire to a nearby house as a diversion, then approached the Rwookrrorro home of the Wookiee warrior Salporin, where Organa was staying. Using stunners rather than the more conventional and noisier blasters, three Noghri attacked Salporin and other Wookiees stationed outside the home, while a fourth attempted to kidnap Organa. The mission, however, proved to be a failure. Through the Force, Organa detected the threat and was awakened just as the Noghri attempted to restrain her. Organa fought off her attackers with her lightsaber, which allowed enough time for her Wookiee protectors to respond. Khabarakh briefly restrained Organa, but released her when he sensed she was the Mal'ary'ush, daughter and heir to the Noghri's former master, Darth Vader, to whom they were fiercely loyal. The stunners used by the Noghri proved too weak to harm the Wookiees, and the entire commando team was wiped out except for Khabarakh. Chewbacca, Organa's Wookiee bodyguard and friend, captured Khabarakh and was about to kill him, but Organa stopped him at the last minute, so a surprised Chewbacca knocked the Noghri unconscious instead. The attack claimed the life of Salporin, while Chewbacca and another Wookiee protector, Ralrracheen, suffered only minor injuries."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Organa, who had hoped to learn more about the Noghri with the hopes of further diplomacy with the species, questioned Khabarakh immediately after the failed assault. During questioning, Khabarakh confirmed she was indeed the Mal'ary'ush. Organa convinced Khabarakh to bring her to the Noghri home planet of Honoghr, where she successfully revealed the Empire was keeping them enslaved and convinced them to become allies of the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}