{"url": "Mission_to_Kijimi", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles in the Bryx sector", "Category:Duels", "Category:Missions of the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Mission to Kijimi"}, {"tag": "p", "text": "In 35 ABY, the Resistance members Rey, Finn, and Poe Dameron undertook a mission to Kijimi to hack C-3PO's memory in order to obtain the location of the Emperor's wayfinder. During the mission, the Resistance team also learned that Chewbacca was alive, having previously believed that he had been killed on Pasaana, and mounted a rescue of Chewbacca on the Steadfast, the Star Destroyer of Supreme Leader Kylo Ren, when it arrived above the planet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After escaping Pasaana and losing Chewie, the Falcon, and the dagger, Poe decided it was best to go to Kijimi, where he had an old ally who could help decipher the Sith code from C-3PO memory bank. Agreeing to head to Kijimi, he and his allies fired up the Bestoon Legacy and headed to the planet, unaware that they were being followed by the Knights of Ren. On the way, the Resistance members discovered a droid named D-O."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Finding Babu Frik"}, {"tag": "p", "text": "Arriving at the snow planet of Kijimi, Poe went to see if there were any First Order patrol officers. Seeing that the whole village was under First Order control, the crew tried to avoid running into any stromtroopers. Just as they were clear, a gun was pointed to Poe's head. A unknown woman told him that he was stupid to come back. Poe identified her as Zorii Bliss, an old acquaintance of his when he was a Spice runner. Poe tried to talk his way out of the situation, but Zorii still held a grudge against him. As Rey tried to reason with her, Zorii tried to attack them, but Rey overpowered her spice runner crew with her staff and lightsaber. This convinced Zorii to help them and lead them to Babu Frik."}, {"tag": "p", "text": "Babu explained that he could bypass the programming, but in doing so C-3PO's memory would be completely wiped. Deciding it was for the best, C-3PO allowed Babu Frik to bypass the programming, which told that the Sith wayfinder was on a moon in the Endor system, which Finn noted to be where the last war ended. All of a sudden, they heard a noise from the Steadfast, which had arrived above the planet. As Poe and Zorii went up to the deck, Rey sensed that Chewbacca was alive."}, {"tag": "p", "text": "Deciding to mount a rescue, Rey, Finn and Poe departed for the Steadfast, but not before Zorii gave Poe a First Order Captain's Medallion. Using the device to land aboard the Star Destroyer, the team split up in three groups: Rey going to retrieve the Sith dagger, and Finn and Poe going to rescue Chewie, while C-3PO, BB-8, and D-0 stayed with the ship."}, {"tag": "h3", "text": "A fateful duel"}, {"tag": "p", "text": "As Rey made her way to Kylo Ren's quarters, she encountered the mask that once belonged to the Sith Lord Darth Vader. Seeing the dagger along with Chewbacca's bowcaster and bandolier, she went over to retrieve them."}, {"tag": "p", "text": "Just then, Kylo Ren, who had arrived on the surface of Kijimi, experienced another Force-bond with Rey, telling her that Darth Sidious wanted her dead, and that he knew what happened to her parents. Rey drew her lightsaber and attacked Ren, and the two engaged in a lightsaber duel across the two locations. As Ren told Rey to remember her parents, Rey saw that they had hidden her on Jakku to be safe and were killed by Ochi. As the duel continued, the two simultaneously struck the pedestal that held Vader's burnt helmet, which fell to the ground in front of Ren. Discovering that she was in his quarters, Ren told a stormtrooper to lock down the ship."}, {"tag": "p", "text": "Meanwhile, Finn and Poe were able to rescue Chewie and tried to blast their way out, but were captured. Allegiant General Enric Pryde ordered General Armitage Hux to execute them. Once alone with three stormtroopers, Hux requested one trooper to let him execute the Resistance members himself. Receiving a blaster, Hux turned to shoot the troopers and revealed himself to be the Resistance spy. As he guided the group to the Millennium Falcon, Hux asked Finn to shoot him in the shoulder to avoid suspicion; however, Finn shot him in the leg and asked him why he was helping them. Hux responded that he didn't care if they won, rather that he needed Kylo Ren to lose."}, {"tag": "p", "text": "As Rey confronted Ren in the hangar bay, she asked him why Sidious wanted to kill her. Ren replied by saying she had his power, revealing to her that her father was the son of the Emperor, just as Ren's mother was the daughter of Vader. Ren also said that he and Rey were a dyad in the force, and together they could defeat Sidious and take the throne of the Sith for themselves. As Ren told her to make a decision, Rey said that she already did as the Falcon arrived. Rey jumped out of the hangar bay towards Finn on the Falcon's ramp, and the Resistance made their escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "En route to Kef Bir, Rey was distraught by the revelation of her heritage. As Finn arrived to comfort her, Rey told him she was going to find Sidious and destroy him. Meanwhile, Sidious reached Ren through the Force and told him that he sensed that Rey was still alive. Warning him that if he failed, he would turn his fleet against him, Sidious ordered Ren to make sure that Rey died. Aboard the bridge, an injured Hux reported to Pryde about the rescue. Seeing through Hux's lie, the Allegiant General executed Hux right on the spot before alerting to Ren that their traitor had been found."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}