{"url": "Mission_to_Kessel_Station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Kessel Station"}, {"tag": "p", "text": "The Azzameen family carried out a mission to Kessel Station just prior to the Battle of Endor."}, {"tag": "p", "text": "Following the Battle of Hoth, the Azzameen family business, Twin Suns Transport Services, gave aid to the Rebel Alliance in the form of Bacta shipments. During delivery of one shipment, family patriarch Tomaas Azzameen and his eldest son Galin Azzameen were believed killed by Imperial forces. Following reclamation of their previously Imperialized home base, Tomaas's brother Antan Azzameen claimed that his brother and nephew were actually imprisoned, not killed. He led his surviving niece and nephews to Kessel Station, allegedly to free their father and brother."}, {"tag": "p", "text": "The raid was actually a ruse to deliver the surviving Azzameens into the hands of Imperial authorities. Antan Azzameen fled the system, while the remaining Azzameens were left to fight their way out of the trap. Due to the gravitational influence of the nearby Maw cluster, the Azzameen siblings had difficulty plotting a hyperspace course, and seemed likely to be captured until family friend Dunari appeared and provided an escape course. The group then made its way out of Imperial territory and back to the Alliance Fleet with a minimum of fuss."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War, in the period between the pivotal battles of Hoth and Endor, the Twin Suns Transport Services company owned by the Azzameen family covertly lent its aid to the Rebellion. While delivering a shipment of bacta to the Rebel XQ2 Platform Hospital, family patriarch Tomaas Azzameen and his eldest son Galin were believed killed in a raid by forces of the Empire. In response to their treason against the Empire, all Azzameen family assets were seized and warrants were issued against all members of the family."}, {"tag": "p", "text": "The family's youngest child, Ace Azzameen, joined the Alliance Fleet following this tragedy, while his remaining family—older sister Aeron Azzameen, older brother Emon Azzameen, and uncle Antan Azzameen—continued to operate in a freelance capacity against both the Empire and their rival family, the Viraxo. In his capacity as a Rebel starfighter pilot, Ace Azzameen was tasked with scouting the base of operations for a group of mercenaries who were attempting to sour relations between the Bothans and Sullustans. Assisted by his sister Aeron, Ace Azzameen discovered that his family's primary place of business and residence, Azzameen Station, had fallen into the hands of these mercenaries. As a reprisal against the inhabitants of the newly renamed \"Falcon's Nest,\" the Alliance waged a successful battle to retake the station."}, {"tag": "p", "text": "Following this battle, Antan Azzameen called a meeting of the Azzameen family at their reclaimed home. He admitted that he had been contracted by the Empire to use the mercenaries that formerly occupied the station to damage the Rebellion. The elder Azzameen claimed to his niece and nephews that he only did so in order to secure the safety of his brother Tomaas and eldest nephew Emon, and that the Rebels had jeopardized his plan by successfully thwarting the mercenaries. He told the assembled Azzameen family members that their father and brother were being held at the heavily armed platform of Kessel Station, orbiting the prison planet Kessel. According to Antan, the only remaining way for the Azzameen family to free their imprisoned relatives was to travel to the Kessel system and take them by force."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The Azzameen family departed from Azzameen Station in their usual starships: Emon in his Firespray-class attack craft, Andrasta, Antan commanding the Action IV transport Big Score, and Ace and the family's trusted droid MK-09 piloting the YT-2000 light freighter Otana with Aeron as their passenger. Antan Azzameen claimed that he had connections that would allow the family to safely enter the Kessel system and dock with Kessel Station. After entering the system without interference from any authorities, the Azzameens would first have to slice into the records of the control station to learn which of the Kessel Station Holding Cells held their imprisoned family members. The Otana flew to Kessel Station and docked, then Aeron commenced slicing the records. She was concerned when she was unable to find any Azzameens listed among the prison records, but Antan implored her to keep looking."}, {"tag": "p", "text": "As Aeron continued her search, the Imperial-I class Star Destroyer Devastator entered the Kessel system. The Devastator signaled a demand for the Azzameen transports to surrender to the Empire. Antan signaled a response to the Devastator indicating that he had fulfilled the terms of his bargain with the Empire by delivering his other family members into their hands. The Azzameen siblings were incensed to learn that their uncle had betrayed them to save himself, and their father and brother had indeed died at the Rebel platform."}, {"tag": "p", "text": "As the Devastator launched dozens of TIE Series starfighters, a mix of basic models and interceptors, Antan Azzameen fled the scene. The Azzameen siblings scrambled to escape the Imperials, but MK-09's hyperspace calculations were complicated by the gravitational anomalies of the Maw cluster adjacent to the Kessel system. The siblings held off the Imperial starfighters for a while, but it appeared to be a hopeless situation. Then, to the great surprise of the Azzameen siblings, family friend Dunari appeared to assist in his Muurian transport, Deadman's Hand. As a former smuggler who made the Kessel Run with their father Tomaas, Dunari knew how to lead the Azzameen siblings out of the system and away from the Empire's wrath."}, {"tag": "p", "text": "Although Emon was willing to continue the engagement, Ace was eager to escape. Deferring to his younger brother's better judgment, Emon followed the Otana and Deadman's Hand away from Kessel Station. Their hyperspace course first took them to a point near Asteroid Mining Unit XP-MU 3376 and Processing Plant AL-82673 in the Kessel system's asteroid field, which were guarded by Outpost AS-27, a hangar concealed in an asteroid. As they flew past the asteroids to the next jump point, the Azzameens and Dunari dodged laser batteries and even a flight of TIE advanced starfighters. The fleeing transports were able to evade the Devastator's attempted pursuit, and returned to the relative safety of the Rebel fleet and the cruiser Liberty."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following their escape, Dunari swore to the Azzameens that the treacherous Antan would receive his comeuppance. However, Ace Azzameen and MK-09 had little time for vengeance in the days immediately following their mission to Kessel. The Rebel Alliance mounted an attack against the second Death Star at Endor, and both Ace Azzameen and MK-09 joined the assault as part of the crew of the Millennium Falcon. The pair survived the battle, and MK-09 eventually made a record of their exploits, which made no mention of further actions against Antan Azzameen."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Kessel Station appears only in the personal computer game Star Wars: X-Wing Alliance, which was developed for LucasArts by Totally Games and released on February 28, 1999. There are no bonus objectives or other gameplay-based alternatives in this mission, the only objectives are to dock with Kessel Station, then to flee the situation intact. The official strategy guide calls it a \"walk in the park.\" The Kessel mission itself was not given a proper name by the source in which it appears, though the game level which includes both the mission and some of its preceding events is called \"Family Reunion\" by the game and its corresponding official strategy guide."}, {"tag": "p", "text": "This mission, as with most missions in X-Wing Alliance, is not specifically dated by the game or secondary sources. Its timing can only be estimated by preceding and succeeding events that have been given specific dates, but it can be pinpointed to the second half of 3 ABY. The series of missions preceding the Azzameen mission to Kessel Station, \"Battle 4: 'The Bothan Connection,'\" depicts the events leading to the raid on the Suprosa to acquire the Death Star II plans. This is a tie-in to the Shadows of the Empire meta-series, which is dated to \"3.5 ABY\" by The New Essential Chronology. The missions immediately following the mission to Kessel, \"Battle 7: 'The Battle of Endor,'\" are specifically dated to the beginning of 4 ABY by The Essential Atlas. Therefore, this mission can be dated to \"c. 3.5–4 ABY\""}, {"tag": "p", "text": "Although sources such as Vader: The Ultimate Guide identify the Devastator as an Imperial-I class Star Destroyer, X-wing Alliance and the Prima Games strategy guide depict it as an Imperial-II class Star Destroyer. This article assumes the preponderance of other sources are correct and the game is in error."}, {"tag": "p", "text": "X-Wing Alliance was included in the continuity now known as \"Legends\" along with most other Star Wars materials produced before April 25, 2014. As it was the final game in the X-Wing series and as LucasArts is now closed, the fates of Antan Azzameen and his family will likely remain unknown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}