{"url": "Mission_to_Level_1325", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Events during the Clone Wars", "Category:Missions to Coruscant"], "nodes": [{"tag": "h1", "text": "Mission to Level 1325"}, {"tag": "p", "text": "Jedi General Anakin Skywalker and Clone Captain Rex undertook a mission to Coruscant's Level 1325 during the Clone Wars to find rogue ARC trooper Fives, who was on the run after being framed for an attempted attack on Supreme Chancellor Sheev Palpatine. After trapping his superiors in a ray shield, Fives attempted to tell them what he knew of the inhibitor chips secretly implanted in the clones, the chips' true purpose, and Palpatine's involvement. However, Fives' mental state had deteriorated due to a drug he had secretly been injected with, causing him to seem insane and making Skywalker and Rex disbelieve what he had to say. Fives was killed shortly thereafter by Clone Commander Fox of the Coruscant Guard, responding to a report from a probe droid, when the agitated ARC trooper attempted to go for one of Rex's blaster pistols. With his death, the Supreme Chancellor blamed Fives' behavior on an alleged parasite from Ringo Vinda, successfully concealing the hidden purpose of the so-called \"inhibitor\" chips from the Jedi Order."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Ringo Vinda, CT-5385—a clone trooper also known by his nickname \"Tup\"—unexpectedly shot and killed Jedi General Tiplar. The attack was due to a premature execution of Order 66, caused by a failure in Tup's behavioral modification biochip, which had been incorporated into all the clones to make them follow the order. Tup was brought back to Kamino as the Republic authorities and Jedi investigated the matter. The Kaminoans, aware of the control chips and Order 66 but believing it to be a contingency against rogue Jedi, attempted to cover up their existence on the request of Tyranus, who claimed that this was per the wishes of the late Jedi Master Sifo-Dyas, who had commissioned the clone army. However, the ARC trooper CT-5555 \"Fives,\" Tup's best friend in the 501st Legion, was determined to find out the cause of the attack and save Tup's life, and thus discovered and removed the malfunctioning chip. Although Tup died shortly after his chip was removed, Fives still intended to find out what was going on, and eventually went rogue in Tipoca City with medical droid AZI-3, having his own chip removed and discovering that all the clones had them."}, {"tag": "p", "text": "Fives persuaded Jedi Master Shaak Ti, who oversaw clone training on Kamino, to let him plead his case about the chips to the Supreme Chancellor in person, although Kaminoan doctor Nala Se claimed that the chips were merely intended to inhibit the clones' aggression and any insanity inherited from their genetic source, Jango Fett. As their shuttle approached the Republic's capital planet of Coruscant, Nala Se covertly drugged Fives with a compound intended to increase his aggression and paranoia. Upon arrival at the Grand Republic Medical Facility, Fives and Shaak Ti were met by Speaker Mas Amedda and troopers of the Coruscant Guard, before being escorted inside to see Chancellor Palpatine."}, {"tag": "p", "text": "However, Palpatine was secretly the Sith Lord Darth Sidious, and the architect of the entire conspiracy surrounding the control chips. After requesting Shaak Ti leave as Fives might be more comfortable explaining himself without her there, leaving only himself and his loyal shock troopers, Palpatine told Fives the truth about what the control chips were intended for and that he was behind it before ordering the shock troopers to kill him. Fives counterattacked in his own defense and attempted to kill the Chancellor just as Ti burst in, alerted by the sounds of fighting and Palpatine screaming in apparent fear. The Togruta Jedi Force-threw Fives away from Palpatine, and Fives escaped with her in pursuit. Although Shaak Ti shouted for Fives to stop as she was willing to listen to him, the combination of Palpatine's revelations and Nala Se's drug meant he didn't listen, managing to flee through a closing blast door ahead of the Jedi General."}, {"tag": "p", "text": "Fives was subsequently the target of a manhunt, as he had apparently attacked the Chancellor for no reason. Although the Jedi were not officially asked to help, the Jedi Council decided to send Jedi Knight Anakin Skywalker, Fives' commanding officer, to look covertly as Skywalker had volunteered, along with his subordinate Clone Captain Rex. Fives managed to make his way to the clone bar 79's, swiping a hat from a drunk clone officer outside to hide his \"5\" tattoo, the primary distinguishing mark being used to identify him in the manhunt. Inside, he saw his friends and fellow 501st Legion members Kix and Jesse, learning that the unit had returned to Coruscant. When Kix went into the refresher, Fives followed him and, using the opportunity for privacy, told Kix that he had been framed and that he knew vital information. He gave Kix the coordinates for a location where he wanted to meet with Skywalker and Rex before departing. Although Fives managed to avoid the attention of the Coruscant Guard troopers who had arrived to question 79's patrons about whether they'd seen him, a probe droid spotted him as he left on a speeder bike and followed him."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Fives traveled to an abandoned warehouse in Level 1325 of the Coruscant Underworld. There, becoming increasingly paranoid due to the drug administered by Nala Se, he set up a ray shield. After receiving the coordinates from Kix, Skywalker and Rex headed for Level 1325 in an LAAT/le patrol gunship. When the probe droid positively identified Fives after seeing his tattoo, it notified Clone Commander Fox of the Coruscant Guard, who set out for the warehouse with a squad of his shock troopers after informing the Supreme Chancellor of the discovery."}, {"tag": "p", "text": "When Skywalker and Rex arrived at the warehouse, they landed outside and walked in. When they were a ways inside, Fives addressed them from a hidden location, asking them to put their weapons down before they came any closer, as he couldn't afford to take any precautions. Skywalker and Rex were hesitant about leaving their weapons, but, wanting to help Fives, Rex eventually agreed to leave his blaster pistols on a crate before the two continued forward. Fives then approached his superiors, before activating the ray shield and pleading with them to listen to him. Skywalker demanded to be released from the shield as he couldn't help Fives otherwise, but Fives refused."}, {"tag": "p", "text": "Fives attempted to explain what he had discovered about the control chips and Palpatine's involvement in the conspiracy—a conspiracy to make the clones do anything, even kill the Jedi—but was hampered by his earlier drugging by Nala Se making him increasingly inarticulate, as well as Skywalker's refusal to believe Palpatine, who he trusted, was capable of doing any such thing. Meanwhile, Commander Fox and the Coruscant Guard arrived outside and entered the warehouse. They eventually surrounded the area where Fives, Skywalker and Rex were, at which point Fox confronted the rogue ARC trooper. Fives, in a state of paranoia, went for Rex's pistols and was shot by Fox. When the ray shield was shot out by the Coruscant Guard, Rex went to the dying Fives, who stated he had only wanted to do his duty and was relieved that his nightmares were over. Many of the shock troopers removed their helmets and stood around Fives' body."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Fives and Tup both dead, Palpatine attributed the cause of the entire situation to parasites the two had supposedly picked up on the Ringo Vinda space station, announcing that a vaccine would be distributed among the Grand Army of the Republic to prevent any further incidents. Fives was further discredited by making it seem that his removal of his \"inhibitor\" chip had made him a danger to himself and others. With the two clones' removed control chips winding up in the hands of Count Dooku, leader of the Confederacy of Independent Systems and Palpatine's Sith apprentice — known to the Kaminoans as \"Tyranus\" — all evidence of the Jedi's intended demise was kept from them: the Jedi were now aware of the chips' existence, but believed the cover story about their purpose to inhibit aggression. The Jedi High Council eventually learned of Dooku's involvement in the creation of the clone army, but kept it secret, never making the connection between the Sith interference and the inhibitor chips."}, {"tag": "p", "text": "The cover-up did not alleviate everyone's suspicions, however. At some point after the Battle of Anaxes, Kix decided to do his own investigation of the circumstances of Fives and Tup's deaths, eventually managing to discover more about Order 66 than Fives ever had but also drawing the attention of the Sith. He was captured on Coruscant by Separatist forces on the orders of Count Dooku, but an attempt to transport him to Serenno for interrogation failed when the ship his cryo-cycle stasis pod was being transported on, the Obrexta III, went off-course after being attacked by Republic forces, eventually crashing on the remote planet Ponemah, where the wreck would not be discovered for decades."}, {"tag": "p", "text": "Rex, for his part, remained mostly skeptical of Fives' claims about the purpose of the \"inhibitor\" chips, but could not completely dismiss the theory. Unsure as to whether to believe it or not, he nonetheless filed a confidential grievance report out of loyalty to his friend in which he reported the possibility that the chips might have a hidden purpose, although he was aware the report was likely to fall on deaf ears. Fives' death continued to affect Rex for some time, as he took the time to reminisce about it, as well as the losses of fellow Domino Squad members Hevy and Echo, during the Battle of Anaxes."}, {"tag": "p", "text": "At the end of the Clone Wars, Rex, recently promoted to Commander, was onboard the Venator-class Star Destroyer Tribunal with Ahsoka Tano, Skywalker's former Padawan, having captured the renegade Sith Lord Maul during the Siege of Mandalore. Tano and Rex were going to deliver their prisoner to the Jedi Council on Coruscant. Onboard one of the Star Destroyer's bridges, Tano had a Force vision of Skywalker's fall to the dark side, which Palpatine had orchestrated, but only knew that something terrible had happened to him and immediately ran to inform Rex. Having just received the Order 66 command from Darth Sidious, Rex realized that Fives had been right and managed to resist his control chip long enough to tell Tano to \"find Fives\" before firing on her. After she escaped the initial attack, Tano discovered information about Fives and Rex's grievance report with the assistance of three astromech droids, allowing her to ambush Rex and remove the chip, bringing him back to his right mind. This action saved both of their lives, with Tano and Rex managing to escape the Star Destroyer before it crashed due to damage inflicted by Maul, before they both went into hiding in the Outer Rim."}, {"tag": "p", "text": "In the early Imperial Era, Rex tracked down the Bad Batch, a group of renegade clone commandos who had been immune to their control chips, and persuaded the squad to get their chips removed due to the danger they posed. Echo, one of the squad's members, had been best friends with Fives prior to being presumed dead during the Battle of Lola Sayu. While on Bracca to perform the surgeries, Rex told Echo that Fives had tried to warn him about the chips, but that he had not understood his warning back then. Echo agreed that it was still hard even afterwards to believe what the chips were capable of."}, {"tag": "p", "text": "Rex eventually wound up living on the planet Seelos with fellow clones Wolffe and Gregor, who had also had their control chips removed. He was reunited with Tano when she sent the Spectres to recruit him into the rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Level 1325 first appeared in the Star Wars: The Clone Wars season 6 episode \"Orders.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}