{"url": "Mission_to_Kynachi", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Kynachi"}, {"tag": "p", "text": "This mission was undertaken to Kynachi by a Republic squad to investigate a lead concerning the origins of the recently destroyed Separatist warship Malevolence. When a squad led by Captain Lock was sent to the moon that the malevolence crashed on, CT-8863 noticed a circuit board that he did not recognize. After bringing it to Coruscant, it was discovered that it was engineered by KynachTech Industries. Jedi Master Ring-Sol Ambase led the squad, along with eight other clones and two clone pilots, to Kynachi in a freighter. Unbeknown by the squad or the Jedi Master, Ambase's padawan, Nuru Kungurama, had stowed away aboard the freighter, fearing that his master would not return if he did not help him. When the ship reached Kynachi's orbit, they were immediately attacked by the Trade Federation blockade of the planet. The clones headed for the escape pods, but Knuckles found Nuru on his way out, and took him with him. As the two of them got in a pod with Chatterbox, Breaker was forced to manually release a second pod that carried Ambase, Sharp, and four other troopers, since someone had sabotaged the pod's controls. A badly wounded Captain Lock found Breaker, and then sacrificed himself by manually launching the pod himself so that Breaker could leave with the other men in the pod, despite Breakers protests. The freighter was then blown up, along with Captain Lock and the Two pilots. The two pods crashed in separate places upon reaching the planet's surface. Nuru's pod was attacked by a squad of vulture droids, but they retreated when they realized it was too slippery to land because it was raining.The clones became suspicious of Nuru, whom they believed might have sabotaged the pods, but Breaker tests Nuru, who proved he was indeed Ambase's padawan. Meanwhile, Sharp, Trueblood, Close-Shave, Dyre, and No-Nines woke up after being knocked unconscious by the pod's crash. Ambase had not come to consciousness yet.The clones put Ambase on a makeshift stretcher, and attempted to scale the walls of the ravine that concealed the escape pod. In the midst of this, arthropods that looked like ovoid stones began to attack the clones and the unconscious Jedi. No-Nines was the first to reach the top of the cliff, and provided cover fore for the clones as they climbed. Eventually, No-Nines threw a grenade that took out most of the creatures, but also attracted the attention of some nearby vulture droids. The troops tried their best to protect hteir general, but were out of cover when the vultures opened fire. Meanwhile, Breaker, Nuru, Knuckles, and Chatterbox disguised themselves with fertilizer bags, and snuck into the city that houses the KynachTech Facility.They ran into pilot Lalo Gunn, and got aboard her ship, the Hasty Harpy, which she converted into a Diner. Gunn revealed that the Trade Federation had secretly occupied the world ten years earlier, and that she had been stranded on Kynachi three years earlier. She said that no one on Kynachi knew anything about the war, since the holonet news was blocked. Suddenly, a squad of commando droids attacked the ship, and destroyed Lalo's navigation droid, Teejay. After Nuru and the clones disposed of the commandoes in a fierce fight, Knuckles and Chatterbox captured Cad Bane, who pretended the commandoes were after him. He also said that he had been hired by a client who had supplied him with codes to get through the blockade to break someone out of prison, and that he had seen a still unconscious Ambase and four clones being escorted to the prison. Nuru then came up with a plan for Breaker to put Teejay's brain into one of the commando droid's bodies. After doing this, breaker tested the droid out. Knuckles renamed Teejay Cleaver, because of the way he wielded his shock-stick. Nuru, Lalo, Cad Bane, Chatterbox, and Knuckles then pretended to be Cleaver's prisoners, and were then ushered in through the delivery entrance. They were then trapped by Skakoan Overseer Umbrag, who had been expecting the Jedi and Clones. He surrounded them with droids, and ordered for their weapons to be taken. It was then that Nuru realized that Breaker was missing. He then Jumped onto the platform Umbrag was on and activated his lightsaber. Using the threat of his lightsaber, he told Umbrag to order his droids to stand down, and began interrogating hims as to how he knew they were coming. He was interrupted by an explosion. The entrance crumbled and the room erupted into a fire fight. In the midst of the chaos, Umbrag escaped to his office, and Cad Bane managed to slip away. When the fight was over, Cleaver revealed that breaker was \"Blowing things up\". Nuru then ushered the team to find the prison. Meanwhile, Breaker had blown up two gas tanks at the delivery entrance with his grenades. He then hid behind a white plastoid gravsled and used a multitool to disable the Trade Federation's frequency jammer that had prevented him from calling for help. After that, Breaker used his comlink to indirectly contact the Jedi temple for help. Around this time, Umbrag received orders from Count Dooku to Destroy the factory and withdraw his fleet, since Dooku could not send reinforcements in time to stop the incoming republic assault ships. Umbrag hesitantly agreed, and was sad to leave the factory that he had managed for ten years. Nuru, Lalo, Cleaver, Chatterbox, and Knuckles managed to reach the detention level and free all the prisoners before Umbrag activated the self destruct mode from his Metalorn Yacht. Breaker made contact with them and assured them he had called for reinforcements. Nuru got all the prisoners out, including Trueblood, No-Nines, Close-Shave, and Sharp. It had turned out that Dyre had been killed by the Vultures, and that Master Ambase had been taken elsewhere. Nuru realized that his master was not in the complex, and left with everyone else as the factory burned to the ground. The remaining droids had shut down since the control ship had left. Knuckles and Cleaver managed to pull Breaker from a flaming pile of rubble that had fallen on him. Bane then showed up again, claiming his quarry was not in the cell block. He said that he did find Ambase's lightsaber, though, and gave it to Nuru, gaining his trust. He then said he did not find any other trace of Nuru's master, and said he hopes Nuru will find his master. Nuru then helped to bring Breaker back to the hasty harpy for medical attention. Meanwhile, Bane was flying past the republic fleet, with Unconscious Master Ambase in his ship in the plastoid gravsled. He then contacted Darth Sidious, who asked if he had Ambase. Bane replied yes, after which the sith ordered him to bring Ambase to the Fifth moon of Bogden. On Kynachi, Yoda debriefed Nuru via hologram in the hasty harpy. Palpatine then joined the discussion, and thanked Nuru and Breakout Squad. He assigned the squad a new mission to meet at a Chiss space station for a diplomatic mission. Sharp then joined the squad, and he, Cleaver, Chatterbox, Knuckles, Breaker, Lalo Gunn, and Nuru Kungurama all flew into the Unknown Regions bound for Csilla for their mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}