{"url": "Mission_to_Malachor", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles in the Chorlian sector", "Category:Duels", "Category:Jedi missions", "Category:Missions of the Great Jedi Purge"], "nodes": [{"tag": "h1", "text": "Mission to Malachor"}, {"tag": "p", "text": "The Mission to Malachor was a mission undertaken during the Galactic Civil War between the Galactic Empire and the rebellion by Kanan Jarrus, Ezra Bridger, Ahsoka Tano, and the astromech droid Chopper to the planet Malachor to seek knowledge that would help them defeat the Sith and their Inquisitors. During the course of their mission, the rebels came into conflict with the Inquisitors but were aided by an unlikely ally: the former Sith Maul. Joining forces, Maul and the rebels worked together to obtain a Sith holocron and to plant it in the Malachor Sith Temple's obelisk."}, {"tag": "p", "text": "However, Maul then turned on his allies and blinded Kanan. The rebels' problems were further complicated by the arrival of the Sith Lord Darth Vader, who had come to take the secrets of the temple for the Emperor. Together, Kanan and Ezra managed to remove the holocron from the temple's obelisk, which triggered an implosion that damaged much of the temple. While the two Jedi managed to escape on the Phantom with Chopper, Ahsoka stayed behind to hold back Vader. While Ahsoka was believed to have died, she and Vader had in fact survived the implosion."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Shortly after the Battle of Fortress Vader, Darth Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he saw himself and his former Padawan, the Togruta Ahsoka Tano, meeting each other in a temple and dueling with their lightsabers as the words of \"it was foretold that you would be here,\" \"I am no Jedi\" and \"you will die\" resounded in his mind."}, {"tag": "p", "text": "Before the mission occurred, the Jedi rebels Kanan Jarrus and Ezra Bridger had been hunted by the Seventh Sister and the Fifth Brother; making it nearly impossible for them to help Phoenix Cell to establish a base. Looking for answers, Jarrus and Bridger sought guidance from Tano. She advised they travel to the Jedi Temple on Lothal to speak with Master Yoda. While Yoda counseled Ezra against fighting the Galactic Empire, Bridger was determined to continue helping the Rebellion. Yoda then advised Bridger to find Malachor, which, upon clarification with Tano, Bridger realized was a planet. Millennia earlier, the planet had been the site of a great battle between the Jedi and the Sith which had ended in both sides being destroyed."}, {"tag": "p", "text": "After helping the Phoenix Squadron to establish Chopper Base on the planet Atollon, Jarrus, Bridger, Tano, and Chopper traveled on the Phantom to Malachor. Despite Rex's offer to assist them, Tano insisted that this mission was for them alone. She affirmed that the planet contained \"forbidden knowledge\" that would help them to defeat the Sith and their Inquisitors."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Getting separated"}, {"tag": "p", "text": "As the Phantom descended into Malachor's atmosphere, Chopper picked up an unidentified second ship. The Jedi and Tano quickly realized that they were not alone on Malachor. This second visitor turned out to be an Inquisitor known as the Eighth Brother, who was pursuing a \"shadow\" which later turned out to be the former Sith apprentice Maul. While Chopper tracked the second ship, the Jedi and Tano inspected a ring of monoliths that were inscribed in an unfamiliar \"ancient tongue.\""}, {"tag": "p", "text": "After Ezra accidentally touched one of the monoliths, the ground beneath the three collapsed. The Jedi and Tano quickly found themselves in an underground tunnel and sighted a large pyramidal Sith temple ahead. While passing through an ancient battlefield littered with ossified bodies and lightsabers, they were ambushed by the Eighth Brother. During the ensuing skirmish, the Inquisitor used his double-bladed spinning lightsaber to fire at Ezra, causing the ground beneath him to collapse, separating him from Ahsoka and his master."}, {"tag": "p", "text": "While Ahsoka and Kanan pursued the Eighth Brother, Ezra tried to find his way out of the tunnel. Shortly thereafter, he encountered Maul who introduced himself as \"Old Master.\" While Bridger was initially distrustful of the stranger and rightfully suspected that he was a Sith, Maul managed to convince him by telling him that he was also seeking the same knowledge, in order to avenge the crimes that the Sith had perpetrated against his late mother and brother. Ezra was able to sympathize with Maul's plight due to his own grievances against the Empire for taking away his home and parents."}, {"tag": "p", "text": "Together, the two Force-wielders managed to make their way through the Sith temple. After a challenging trial involving the use of Force, Ezra and Maul managed to obtain the Sith holocron. Meanwhile, Kanan and Ahsoka managed to captured the Eighth Brother with the help of Chopper, who used the Inquisitor's own TIE Advanced v1 starfighter against him. Together, Kanan and Ahsoka led their captive to the Sith temple, but were soon ambushed by the Eighth Brother's comrades: the Fifth Brother and the Seventh Sister. They soon engaged the Inquisitors in a lightsaber duel."}, {"tag": "h3", "text": "A temporary alliance"}, {"tag": "p", "text": "At this point, Maul and Ezra stumbled upon the two opposing parties. Using his lightsaber, Maul helped Kanan and Ahsoka to drive the Inquisitors away. While Kanan and Ahsoka distrusted Maul due to his past record, Ezra argued that Maul could be trusted and recounted how they had worked together to obtain the Sith holocron. Following a tense meeting, Maul managed to convince Kanan and Ahsoka to work together by pointing out that the Inquisitors would have alerted Darth Vader to their presence. Maul then convinced his allies into helping him carry out his plan to plant the holocron in the temple's obelisk; claiming that it would give them the knowledge to destroy the Sith."}, {"tag": "p", "text": "With Maul intending to destroy the Sith, the Jedi and Ahsoka agreed to assist him on his mission. While Ezra was convinced by Maul, Kanan still harbored his suspicions of the former Sith. As the four travelers climbed the obelisk, Kanan took the opportunity to pull Ezra aside and warn him that Maul could not be trusted. Ezra in turn accused Kanan of holding him back and responded that Maul knew his potential. On the way up, the two Jedi were ambushed by the Eighth Brother, who knocked back Kanan and attempted to steal the Sith holocron. Before the Inquisitor could harm Ezra, Maul arrived at an opportune moment and drove off the Inquisitor."}, {"tag": "p", "text": "With the Inquisitors after them, Maul convinced the Jedi and Tano to split up. Despite Kanan's objections, Ezra decided to accompany Maul to the top of the obelisk. During the journey, Maul took the opportunity to sow discord between the Padawan and his master. Shortly after, they were attacked by the Seventh Sister and her ID9 seeker droids. Fighting together, the Jedi and former Sith managed to dispatch the seeker droids and overpower the Inquisitor. While Maul held the Seventh Sister suspended in mid-air, he encouraged Ezra to kill her. When Ezra refused, Maul killed the Inquisitor himself and chided the boy for his hesitation."}, {"tag": "p", "text": "With the defeat of the Seventh Sister, Maul and Ezra proceeded to Karan and Ahsoka’s location to aid them in their fight against the two remaining Inquisitors. However, before they could join the fight, Maul stopped as he could sense Darth Vader approaching the temple. Sensing Vader’s imminent arrival, Maul hastily told Ezra to continue alone to the top of the obelisk while he went to the aid of Kanan and Ahsoka. Arriving at the scene, Maul joined the assault on the Fifth and Eighth Brother. Ahsoka managed to slash the Fifth Brother's lightsaber, causing him to drop it and allowing Maul to kill the Inquisitor with a slash through the torso. Meanwhile, Kanan managed to damage the Eighth Brother's lightsaber. The surviving Brother then attempted to flee using his spinning lightsaber to fly, but the weapon malfunctioned and the Inquisitor plummeted to his death below. Having eliminated the Inquisitors, Maul then turned on his allies."}, {"tag": "h3", "text": "Showdown with Darth Vader"}, {"tag": "p", "text": "When Kanan demanded to know where Ezra was, Maul took the opportunity to blind the Jedi Knight with his lightsaber. Before Maul could finish off Kanan, Ahsoka attacked him with her white lightsabers. During the duel, Maul revealed that the temple was actually a powerful battle-station capable of destroying all life and that he planned to use it to exact his revenge on all his enemies. Despite being blinded, Kanan managed to muster enough energy to don a Jedi Temple Guard's helmet and rejoined the battle. Seeing him, Tano proceeds to taunt Maul, telling him that he would have to defeat Kanan before he could challenge her. After telling Tano to find Ezra, Kanan managed to throw Maul off the edge of the temple. He then contacted Chopper and told the astromech droid to bring the Phantom to pick them up."}, {"tag": "p", "text": "Meanwhile, Ezra managed to plant the holocron in the temple's obelisk. He was immediately greeted by a female entity known as \"Presence,\" who revealed the temple's true function. When Ezra expressed revulsion, Presence told the young Jedi that she would instead share the power with someone else more worthy. At that moment, Darth Vader himself arrived on his TIE Advanced x1 starfighter. The Sith Lord then attacked Bridger and quickly bested him in combat; destroying Ezra Bridger's lightsaber in the process."}, {"tag": "p", "text": "Before Vader could finish off Ezra, Ahsoka arrived and confronted the man who had once been her Jedi mentor. Following a hostile reunion, Tano vowed to avenge Anakin Skywalker by killing Vader, who claimed to have \"destroyed\" him. While Ahsoka and Vader dueled, Kanan and Chopper arrived on the Phantom. Working together, Ezra and Kanan managed to remove the Sith holocron from the temple's obelisk, causing the battlestation to abort its firing mechanism. Unfortunately, this action de-stabilized the battlestation's power systems, and the temple began to collapse."}, {"tag": "p", "text": "Meanwhile Vader had, after a short duel, managed to force-push Ahsoka off of a precipice. Turning his attention back to retrieving the holocron, he quickly returned to the temple obelisk. As the temple continued to collapse, Ezra and Kanan attempted to make their way back to the Phantom. However, Vader caught up with them before they could board the ship, and began pulling both the holocron and the two Jedi towards him with the Force. Fortunately for the two Jedi, Ahsoka had recovered from her fall and ambushed Vader. Her attack caught Vader off guard, and she managed to slice away a significant portion of his mask. This damage also affected Vader's voice modifier, and the revealed portion of his face, combined with the distorted but recognizable voice of Anakin Skywalker, confirmed for Ahsoka that Vader was in fact her former master. Unable to leave the man who had once been Anakin, Ahsoka chose to stay behind with Vader. Despite a brief moment of hesitation, Vader reaffirmed his position and attacked her once more. Meanwhile, the Jedi and Chopper managed to escape and headed back to Atollon. The Sith temple imploded behind them and Tano became lost to the shadows and rubble of the Sith temple."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The two distraught Jedi and Chopper returned to Chopper Base where they informed the other Spectres and Rex about the loss of Ahsoka. Kanan was compelled to cope with his new blinded state. Meanwhile, Ezra's encounter with Maul on Malachor and the apparent loss of Ahsoka triggered the young Jedi's interest in the dark side of the Force. While in his room, Bridger took the opportunity to open the Sith holocron; a feat that could only be accomplished by someone who had tapped into the dark side. Meanwhile, Maul was able to escape Malachor and would eventually encounter the rebels again. Unknown to the Spectres and Rex, Darth Vader and Ahsoka had in fact survived the destruction of the Sith temple: a wounded and exhausted Vader exited the ruins of the temple, believing his former apprentice had been killed, when Ahsoka was in fact saved by a future Ezra, who pulled her into a \"World Between Worlds\" with him before Vader could deliver the finishing blow. After an attack from Darth Sidious, Ahsoka became separated from Ezra and escaped back to Malachor, where she would descend into the ruins of the Sith Temple."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to Malachor first appeared in \"Twilight of the Apprentice,\" a one-hour season finale that combined the 19th and 20th episodes of the second season of the Disney XD television series Star Wars Rebels. This mission marked the debut of two new characters: the Eighth Brother (who was voiced by Robbie Daymond) and Presence (who was voiced by Nika Futterman; who also served as Asajj Ventress' voice actor in The Clone Wars TV series). In addition, guest actors Sam Witwer and Matt Lanter reprised their roles as Darth Maul and Anakin Skywalker respectively."}, {"tag": "p", "text": "Dave Filoni, the supervising director of both Star Wars: The Clone Wars and Star Wars Rebels, had thought about the final confrontation between Darth Vader and Ahsoka Tano ever since he created Ahsoka for The Clone Wars. Over the years, Filoni illustrated the conflict between Tano and Vader with different endings until he proposed a sword fight between them to Lucasfilm Story Group's Kiri Hart, who approved his decision. However, one of the earlier planned endings, according to Filoni during Celebration Europe 2016, had Vader killing Ahsoka but not before she slashes his helmet and sees Anakin Skywalker's scarred visage before expiring."}, {"tag": "p", "text": "While developing the episode, before engaging on a duel with Ahsoka, Vader was supposed to engage Maul in a duel, which would have ended with Maul's death at Vader's hands, given that Maul's appearance in Rebels was intended to be a one-shot. However, the idea became unwieldy as there were too many storylines and there wasn't enough emotional material between Maul and Vader, resulting in Maul being spared until the season three episode \"Twin Suns.\""}, {"tag": "p", "text": "The Star Wars Book erroneously states that the mission took place in 4 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}