{"url": "Mission_to_Lord_Grathan%27s_estate", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dromund Kaas", "Category:Events during the Cold War (Galactic Republic–Sith Empire)", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Mission to Lord Grathan's estate"}, {"tag": "p", "text": "In 3643 BBY, at Dromund Kaas, Sith Lord Zash assigned her apprentice\nto acquire the remaining weapon that would help them against Zash's nemesis, Darth Skotia, an anti-cyborg weapon called the Cyber neutralizer. The Apprentice entered the facility eventually acquiring the Cyber neutralizer and executing Dorotsech, the weapon's maker."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Long before the Apprentice had arrived on Dromund Kaas, Lord Zash had ordered the scientist Dorotsech to develop a weapon that would help her against the cyborg superior, Darth Skotia. When the Apprentice arrived to Dromund Kaas in 3643 BBY and after he retrieving one of the needed pieces to defeat Skotia, the Trandoshan relic, Zash assigned him to retrieve the remaining piece which was the Cyber neutralizer, develop by Dorotsech, who was now imprisoned in the rogue Sith Lord Grathan's estate. When traveling to the estate building, the Apprentice was warned by Imperial officers that Lord Grathan had orchestrated a full rebellion against the Sith Emperor and his forces were now surrounded by the Imperial Army loyal to the Emperor."}, {"tag": "h2", "text": "Entering the estate"}, {"tag": "p", "text": "On entering the estate, the Apprentice slew the sentry guards and infiltrated Grathan's headquarters. He then left a pathway of corpses behind as he made his way through Grathan's forces to reach Dorotsech. Dorotsech gave him the weapon's location and asked the Apprentice for protection as Zash had promised him. The Apprentice however killed Dorotsech not willing to leave any witnesses to the weapon's existence. Now with the weapon in his possession, he returned to Zash knowing he was ready to face Skotia."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The weapon was eventually used by the Apprentice against Skotia, weakening him enough for the Apprentice to engage on a lightsaber duel with the more powerful Dark Lord, defeating and killing him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Lord Grathan's estate appears in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. The mission represents the events of the Sith Inquisitor class story mission \"Dismantling the Machine\", where the player is sent by Lord Zash, to retrieve an anti-cyborg weapon that would help them defeat Darth Skotia."}, {"tag": "h2", "text": "Appearances"}]}