{"url": "Mission_to_Lotho_Minor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Mission stubs", "Category:Battles in the Outer Rim", "Category:Events during the Clone Wars", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Lotho Minor"}, {"tag": "p", "text": "During the Clone Wars, the Nightbrother Savage Opress went on a mission to Lotho Minor to locate his brother and former Sith Lord Maul. He eventually found his brother and brought him back to Dathomir."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After being tasked to find Maul by Mother Talzin, Opress traveled in search of clues to his brother's whereabouts, using the Talisman of Finding given to him by Talzin to guide him. After an altercation at a diner on the planet Stobar, he found a clue when the talisman began to glow near a stack of shipping containers. Opress then boarded a nearby ship and ordered the captain to take him to the planet where they had came from."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Meeting Morley"}, {"tag": "p", "text": "After Opress landed the ship, he wandered out into the junkyards that covered the planet and howled in rage as the magic talisman stopped glowing. He was soon approached by the Anacondan Morley, who began to pester him about what he was doing on the planet. Opress angrily told him to stay away from him and even grabbed Morley by the throat and throwing him away when Morley asked if he was tracking someone and offered to be his guide. However, as Morley continued to follow him, he revealed that he knew where the other living things on the planet were, and Opress commanded him to show him the way."}, {"tag": "p", "text": "Morley led Opress through the junkyards, dodging refuse incinerator droids until they were surrounded by Junkers. Opress slaughtered a large number of them as they attacked him, causing the survivors to flee. Morley continued to pester the Nightbrother about who he was searching for, and Opress reluctantly admitted he was looking for his brother. As Morley told him about the legend of the horned man, acid rain began to fall, and the pair found shelter in a nearby cave. Opress looked around and saw multiple dead Junkers, and as the talisman began to glow again, he realized that he had found his brother's domain."}, {"tag": "h3", "text": "Remnants of the Sith uncovered"}, {"tag": "p", "text": "However, as Opress looked around the small alcove, he realized that there was nobody there. When the talisman stopped glowing again, he angrily shouted that Mother Talzin had betrayed him and that his brother must be dead. At that moment, Morley betrayed Opress, sending him clattering down a long distance and laughing that he would be getting the leftovers after his master was done with him. Opress got to his feet and began to search the tunnels, calling out to his brother as he saw movement. After a short time, he was attacked by a spider-like creature, which Opress realized was his brother as the talisman glowed again, revealing his brother's face. He chased after him into a cavern where his brother, the former Sith Lord once known as Darth Maul was fully revealed, a deranged shell of his former self, with an eight-legged contraption of scrap parts acting as his legs."}, {"tag": "p", "text": "Opress tried to talk to Maul, but the former Sith could do nothing but incoherently ramble bits of the Sith code. Morley slunk down into the cavern, anticipating Opress was already dead, but Opress killed him for his betrayal, choking him to death and throwing his corpse onto a small fire burning in the center of the space. Opress tried to coax more information from his brother on what had happened to him, and this time, Maul began to rant about the Jedi and how they had taken everything from him, grabbing his brother and telling him that he wanted revenge."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Opress would bring his brother back to the ship and return to Dathomir, where Mother Talzin would use her Nightsister magick to restore Maul's mind and body, fashioning him a pair of new metal legs. Reborn, Maul and Savage would embark on their mission to score revenge on Jedi Master Obi-Wan Kenobi, who had taken everything from Maul so many years ago."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}