{"url": "Mission_to_Mawan", "categories": ["Category:Legends articles", "Category:Battles in the Core Worlds", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Mawan"}, {"tag": "p", "text": "In 25 BBY, four members of the Jedi Order embarked on a mission to the planet of Mawan, to put down an insurgency of lawless criminals and to establish a provisional government committee. Conditions there had reached an impasse: the planet had suffered a disastrous civil war a decade earlier, which the natives referred to as the Great Purge, and the Galactic Senate could no longer ignore this Core world. Its degeneracy was producing ripples that negatively affected the greater galaxy."}, {"tag": "p", "text": "The once-beautiful world had been utterly decimated by its internal conflict: its government and capital-city infrastructure had vanished, its citizenry had become a jobless and homeless underground mass, its space lanes went unmonitored, while famine and the influx of criminal elements had now made it an \"open\" and lawless planet."}, {"tag": "p", "text": "The Senatorial transport carried Jedi Master Yaddle, Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker to Mawan. Grand Master Yoda would travel there later in his Republic cruiser. Master Yaddle, who spent most of the journey to the planet in meditation, was to serve as the warrior-diplomat Mawan so desperately needed to convince the criminal factions that it was in their best interest to vacate the planet immediately."}, {"tag": "p", "text": "In the Jedi effort to restore peace to the planet, the crime lord Striker, who by mission's end was revealed to be Granta Omega, was able to capture Skywalker (once again). But this time, Omega had no qualms about killing the meddlesome Padawan, or his Jedi Masters, along with all of Mawan, by unleashing a bioweapon. While Anakin was prepared to deal with the bomb himself, Yaddle assured him that he must instead pursue his special destiny as the Chosen One. Yaddle thus protected Skywalker by intercepting the bioweapon herself and using the Force to defuse it, but she sacrificed her own life in the process."}, {"tag": "p", "text": "Despite this, the mission was a success for the Jedi, even though Omega fled. But in his escape, this elusive nemesis of the Jedi Order finally revealed to Kenobi his true identity: he was the son of Xanatos and grandson of Crion. While Kenobi was utterly astonished by this news, he realized that it all made sense now: Omega had obviously inherited not only his father's fortune from Offworld Mining Corporation, but also his father's intense hatred of the Jedi."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Prelude to a Jedi's death"}, {"tag": "p", "text": "Since their mission to Andara, the Master-Padawan team of Kenobi and Skywalker had suffered a mild civil war of their own: it was an emotional-spiritual conflict that had set a debilitating distance between the two, damaging the delicate ties of interpersonal communication and their overall relationship. The memory of how, by his unthinking actions, he'd so deeply hurt his Master felt to Anakin like \"a knife in his heart,\" and it haunted him. He missed Obi-Wan's dedication to him in helping him to be the best Jedi he could be, but now, ever since Anakin had violated that essential core of trust between them, and he'd received a reprimand from the Jedi High Council, the duo seemed to have lost their rhythm, which, until it was no longer there, Anakin had not realized had developed to the degree that it had. His Master seemed, more than anything, cautious towards him. And he couldn't even remember the last time he and Obi-Wan had teased or joked with one another. There were shadows between them now. For Obi-Wan's part, he wanted to give his 16-year-old Padawan room and time to reflect, as his own Master Qui-Gon Jinn had given him, to come to terms with his own feelings and achieve a deeper connection to his core. His apprentice needed to understand that a little distance between them did not mean their relationship's core was threatened. But Kenobi resolved nevertheless to use the mission to Mawan to work out some of their differences."}, {"tag": "p", "text": "Since the Andaran mission, young Skywalker, moreover, had experienced another Force vision. It had come to him just after having surfaced from a cool afternoon swim in the indoor lake at the Jedi Temple, near the Room of a Thousand Fountains. He was sitting underneath the waterfall, enjoying the spray of its mist, when the peaceful scene of rushing water suddenly gave way to a furious rush of air, so severe in its intensity that it hurt his ears, and the unfolding vision's surging images, like pulses of light, overwhelmed him: he saw himself commanding a massive fleet; he witnessed a slave-revolt of hundreds shouting his name; he beheld his mother Shmi in Mos Espa embracing him and heard the sound of her binding cuffs drop to the ground at the touch of his hand upon them. But with one last crescendic explosion of light and sound, he knew he'd somehow lost her forever, and everyone he'd ever loved. The dream ending, he heard the echo of strange words: The One Below remains below."}, {"tag": "p", "text": "It was the third time Anakin had experienced this particular vision, which had manifested itself in different forms and intensities. He was left troubled and wearied by the vision, for this time it had seemed to him so real, unfurling in its most intense incarnation yet, its most insistent manifestation. And while he immediately confided the dream to his Master, neither Jedi was clear about its meaning. When they consulted Grand Master Yoda, the ancient Jedi sage gave the meaning of the One Below as being a Koban title, referring to the centuries-long imprisonment by Advozsec warlords of Yaddle, the revered Jedi Master who was of the same species as Yoda. That she was about to leave on a very troubling mission to the planet Mawan was no coincidence: Yoda felt that Anakin's dream was a warning and the answer to the Council's debate about which Jedi team to send with her to address the grave situation that existed there. The visionary Padawan was disappointed at his dream's interpretation, for he had hoped that the time had come at last when he might \"step out of his dreams\" and return to Tatooine to free the slaves, but most importantly, his own mother. As the diplomatic Jedi team embarked to Mawan, Anakin Skywalker, normally excited at the prospect of new missions, could only feel a dread that he could not understand."}, {"tag": "h3", "text": "Arrival on Mawan"}, {"tag": "p", "text": "Arriving in Mawan's formerly thriving capital city of Naatan—an important stop on the Hydian Way, the Core's primary trade route—Obi-Wan Kenobi, who had visited the world before, was dismayed at how much the cosmopolitan center had decayed. The desolation of lives and property was everywhere evident. Except for the criminal gangs—led by three primary crimelords: Striker, Decca the Hutt, and Feeana Tala—all had \"gone underground\" to live in the infrastructure tunnels, according to Euraana Fall, the city native who came to greet the Jedi and to serve as their liaison with the planet's diverse factions. What had made the city so beautiful before the Great Purge was that all goods had been transported below the city, then airlifted to the surface, with all computer centers and control links remaining below as well, leaving a beautifully landscaped city of parks, cafés, restaurants, schools—full of laughter, music and rich conversation. What remained now was a garish mishmash of rebuilt architecture over the city's half-destroyed buildings, with criminal-element inhabitants selling and making their fortunes from weapons, spice, and illegal medicines being sold to untold numbers of the galaxy's unfortunates."}, {"tag": "p", "text": "Landing in a large courtyard in a little-used area of the city, the group made their way to an old abandoned meeting and concert hall, which seemed amazingly untouched by war, where they would set up the Senate Provisional Committee's center of operations. Here they were introduced by Euraana to their tunnel-worker representative contacts, who served as the go-betweens for the crimelords above and the citizens below—Swanny Mull and Rorq, a pair of short, stocky, pale-complected Mawans. The tunnel workers had set up temporary crimelord-run markets, from which the underground dwellers (living throughout 20 sub-levels across Naatan's breadth) were forced to buy their food and goods. The tunnel workers were paid for their services by both factions, and both parties had come to depend on the tunnel workers, whom they called \"subrats,\" to bring them provisions and keep their generators operational. The citizens further depended on them secretly as scouts, to help protect them from crimelord raids. Because they were enjoying their new-found power, however, the majority of tunnel workers weren't giving the citizens their full support, as they didn't want them to regain control over the city, which would only force them down the food-chain again."}, {"tag": "p", "text": "As for the crimelords themselves, of the three, Striker was the most powerful and dangerous. It was he who first managed to seize from Decca the capital city's power grid and a large cache of weapons, while the Hutt was able to hold on to Naatan's main tunnels and transports. Feeana Tala, though not as powerful as the others, controlled most of the goods and services sold to the majority of citizens beneath the capital. Not seen by many, Striker had directed from afar his personal operators on Mawan through the years, and he'd only dropped in on the planet from time to time. But now his presence was felt constantly. With the Jedi now in their ranks, it was the citizens' duty now to work with Yaddle to retake the city and its power grid, while Kenobi and Skywalker would focus on persuading the crimelords to leave the planet, and so avoid repercussions from the Senate of sending galactic security forces to enforce its will."}, {"tag": "h3", "text": "Strange alliances"}, {"tag": "p", "text": "Soon Swanny and Rorq led Kenobi and Skywalker underground to observe one of Feeana Tala's temporary markets set up there for the mutual benefit of thieves and citizen-dwellers. Almost immediately the crimelord's keen senses locked in and she had the Jedi duo surrounded by her troops. When Kenobi had convinced her that they were indeed Jedi diplomats, she sat them down to negotiate: after hearing about their straightforward aims for her planet and the imminent arrival of the Senate security forces—when asked her desire if she gave her cooperation to the provisional government committee—she requested amnesty and a place in Mawan's new government. Thus was set in place, once all were in accord, a strange alliance of Jedi and Crimelord. But Kenobi knew that he and Anakin, if they were to maintain Tala's loyalty, had to move fast to neutralize Decca and Striker."}, {"tag": "p", "text": "Next, Rorq and Swanny helped Kenobi and Skywalker to infiltrate Decca's stronghold in perhaps a stranger alliance still. They did this by having the two Jedi perform as part of Swanny's band at one of Decca's celebratory \"revels,\" traditionally held by the Hutt and her cronies after any defeat against Striker. Obi-Wan took the vioflute, and Anakin, the keyboard. At the vast substation party, which the Rooters (both old and new) had crashed, a plethora of swaggering beings from across the galaxy downed \"flameouts\" as all feasted on meats and pastries. Decca the Hutt arrived to heave her enormous bulk upon her custom-built repulsorlift platform festooned with shimmersilk pillows; her lieutenants, including her two-tailed Kamarian assistant, jockeyed for position around her while some forty gang members milled about. After some time, Decca signaled for Swanny and the Rooters to cease their music, so that she might give a brief declamatory speech against the Jedi, who, rumor had it, had just arrived on the planet to drive them all away. As Decca concluded her words, a huge explosion rocked the substation: a group of Striker's men had attacked Decca's compound. In the commotion, as Kenobi fought to protect Swanny and Rorq while pursuing Decca, Anakin was blown off his feet by a thermal detonator. Although lucky to be alive, he lost his lightsaber (later recovered by Kenobi) and was hauled away in a refuse bin to be taken before Striker—to his self-berating dismay, he'd been captured."}, {"tag": "h3", "text": "Filling in the Blank"}, {"tag": "p", "text": "Finding himself in a much larger substation now, amidst a far sleeker, more professional operation than the shipshod or chaotic ones run by Feeana and Decca, Anakin, to his utter shock, faced again his and his Master's greatest enemy: Granta Omega. The Void in the Force, the Blank. For now he saw that \"Striker\" was, in fact, Omega."}, {"tag": "p", "text": "Resisting Omega's inevitable charms, Anakin made it clear to the \"Void\" once again before him that he was in nowise interested in the lures that Omega offered. For although Omega wasn't Force-sensitive, the dark side yet dominated his acts. He'd tried to kill Anakin's own Master, after all—over and over again, with a missile launcher. And Skywalker cared very little about Omega's quest to lure into the open the one Sith Lord at large in the galaxy—to be near him, to be close to the Force, to understand the source of such power. But what did matter to Anakin was how Omega was going about it: that he would use anyone or anything—even the Jedi, and certainly his own unfathomable wealth—to get what he wanted. Even now, he flattered Anakin, telling him that the young Padawan was stronger than any Jedi, including his Master, and that Anakin himself knew this: \"I'm still interested in the Sith, but I'm becoming even more interested in you.\""}, {"tag": "p", "text": "Meanwhile, Obi-Wan was contacted by Yaddle, who asked for him to meet her at the airlift which, like a repulsorlift (but using pressurized air columns instead), transported the underground dwellers topside. He told her Anakin was missing after the attack. But she felt that, working together, they soon might find a resolution: \"Your problem, my problem—fix each other, they might.\" Joining Kenobi and his small Mawan comrades at the airlift, Yaddle revealed that Striker had seized, in addition to the mainframe substation of the power grid, a critical central relay station—one that was crucial as a network point for restarting the grid: Substation 32. It was the same station in which Decca had held her \"revel,\" but which Striker had retaken that evening. By controlling that substation, Striker could override the power surge needed for power grid start-up. The Jedi had to retake it, and by achieving this, they could also provoke Striker, which was the very thing Kenobi and Anakin had been attempting to do, to draw him out. If they attacked the substation, Striker would be forced to send reinforcements, which they could then follow back to Striker's hideout, where they also might be holding Anakin. The problem they faced was that the station now would be heavily protected by Striker's \"best men\" manning grenade launchers and missile tubes, in order to protect the grid. And, according to Swanny, there was only one way in. But for the Jedi, Obi-Wan countered, there would always be another way."}, {"tag": "h3", "text": "Letting bygones be?"}, {"tag": "p", "text": "Like the professional he was, Omega expertly drew on Anakin's own memories and personal experiences as a Jedi—including especially intimate moments at the Temple that only Padawans, Anakin was sure, could ever know about—to entice Skywalker to defect from the Order (which he called \"rigid\" and \"boring\") and join with him. Omega mentioned meditating on favorite rocks in the Room of a Thousand Fountains, watching Senatorial starships dock from the Council receiving room, being reprimanded by Jedi instructor Rei Soffran. He tapped into Anakin's desire for freedom, a need to be truly free of all restrictions, including a Master and a High Council to whom he must always answer. It all made Anakin think back on his last mission and the amazing freedom enjoyed by Andara's student mercenary squad, who chose the missions they wished to be hired for, answering to none but themselves. Before their operation fell apart, Anakin had admired and perhaps even envied them, for it seemed like true freedom to him. Telling Anakin that the boy already had one foot on the dark path, and to forget his Jedi dreams (even of fulfilling his special destiny as the Chosen One), Omega told Anakin to face reality and ask himself if he was really, truly free. But Anakin responded: \"The dream is real because I'm living it.\" Omega countered that only wealth could secure freedom, and that he could offer him more freedom than the Jedi ever could. But it was a brand of freedom Anakin still would have nothing of: his resolve had become a durasteel bastion within him."}, {"tag": "p", "text": "But Skywalker was not prepared for what Omega offered him next: the liberating power of being able to raise an army and free his own mother from slavery—his deepest wish, hope, desire. Anakin's recent Force vision came flooding back to his mind: touching Shmi's binding cuffs and hearing them clamor to the floor. But then he realized that his dream had been a blinding glimpse of not what would be, but of what could be only: seeing the light in his mother's eyes, feeling so powerful, so sure—that liberation's mere thought, flaring up, searing him with promise. They could leave tomorrow, Omega whispered. Give true freedom a trial run, because he could always return to the desperate Jedi; they would take him back. Still, Skywalker would not relent, for he knew just as Omega did that the Jedi would not take Anakin back if he did such a thing, that Omega's offer therefore was hollow at its core. And so Omega suggested instead that they make a deal: he would take his operations offworld if Anakin, his safety insurance hostage, could persuade Yaddle (and no one else) to meet with him there to hear his conditions. He would arrange to bring Skywalker's comlink to him. Anakin could then make his final decision whether to join Omega as the crimelord prepared to depart the planet. But Skywalker was resolute: \"I don't have to make a decision. I know what I am. I know what I want.\" Notwithstanding, after Omega bemoaned the Jedi's unflinchingly \"self-righteous\" behavior and then departed, Anakin was left not only with questions—how did Omega know so much? had he corrupted a Jedi or infiltrated the Temple?—but also with the ache of his unrequited dream: We could leave here tomorrow ..."}, {"tag": "h3", "text": "Brave Masters"}, {"tag": "p", "text": "As Obi-Wan and Yaddle were poised underground to enact their plan to take over the power grid topside, Kenobi remembered the One Below of his Padawan's dream and worried about Yaddle's safety in their imminent attack on Substation 32. But Yaddle reassured him, after he'd attempted to dissuade her involvement, that she was not concerned about Anakin's vision, for she knew what Kenobi was thinking, and trying to shield her was simply a waste of time. Accepting her rebuke, they turned to the matter at hand."}, {"tag": "p", "text": "With assurances from Swanny that they could boost the power grid from another source once they'd taken out Substation 32's central relay (for otherwise the entire grid might blow), they asked Swanny if he could assist by redirecting the underground wastewater to flood the substation. For they knew they must accomplish their objective within the hour: Feeana was impatient, and they were depending not only on her forces to secure the recaptured city, but also the trust of the Mawans: the underground dwellers would surface only if they were promised that they could hold the city through the backing of Feeana's gang and control of the grid."}, {"tag": "p", "text": "As Swanny left to perform his part, Kenobi and Yaddle skirted the heavily fortified substation's perimeter to execute their attack. Soon floodwaters began seeping underneath the station's double durasteel doors; Yaddle called on the Force to hold their bursting until they'd risen high enough to set off the equipment alarms and to avoid forewarning the guards. Yaddle received confirmation on her comlink that the grid team had bypassed the station and only awaited now assurance that the power surge would restore the grid. With the alarms now ringing, the Jedi Masters engaged their attack. Gathering the Force around them they charged forward, releasing the floodgates, as the guards fled. The attack droids, of course, stood their ground, but Obi-Wan was amazed as he joined Yaddle in battle and witnessed her graceful movement, her lightsaber a blur, the rising Force charging the air about them as they deflected the heavy blaster fire. And soon, a platoon of battle droids lay sizzling in puddles of water."}, {"tag": "p", "text": "Once Yaddle got confirmation that the power grid was up, having been secured, and the city of Naatan lit once more, she left to rally the Mawans for a return to their homes. Kenobi waited for Striker's reinforcements; when they came, beheld the water, the sizzling droids, the absence of guards, they retreated to their leader's headquarters ... with Obi-Wan in tow."}, {"tag": "h3", "text": "The One Below ..."}, {"tag": "p", "text": "Anakin was fully confident that Master Yaddle could handle Granta Omega. He agreed at least to contact her with Omega's proposal, for then she would be able to tell Obi-Wan that he was still alive. But he'd discovered, although he didn't know why, that, for Omega, the conflict was a very personal one against his Master: that Omega hated Obi-Wan. Calling Master Yaddle on the comlink Omega had provided, Anakin revealed Striker's true identity and that Omega had for the second time made him his prisoner. When Yaddle was told of Omega's wish to meet with her, she told Anakin that she would have met with him simply if he had asked, and that there was no need of taking a hostage; but Anakin explained it was for insurance that she come alone and not betray him (but, to double the insurance, he would use tracking droids as well)."}, {"tag": "p", "text": "Skywalker disclosed also that he was unsure of their present location, for Omega had changed bases (as Kenobi had discovered after he'd followed Striker's reinforcements to their original headquarters, only to find Omega on the move again, for he'd detected Obi-Wan's pursuit). Anakin wanted Yaddle to confirm that she wasn't coming because of him, because he was fine, but she skirted the petition simply by stating that she would come once Obi-Wan had been informed. Omega had a list of coordinates to his new location that he would release, one at a time: if he detected at any point that Yaddle was not alone, he would disappear with Anakin. Yaddle agreed to the terms, and in great respect Anakin saluted her: \"May the Force be with you\"; which, upon hearing, Omega, rolling his eyes, uttered, \"Oh, please.\""}, {"tag": "p", "text": "When Kenobi learned from Yaddle that Striker was Omega, he was at once incredulous and angry, and wished to accompany Yaddle, but she refused him, not only because of Omega's terms, but also because she needed Kenobi's help with the Mawan exodus back to their homes. Even so, Obi-Wan's most dangerous enemy had in his possession his most treasured companion, his Padawan. But Kenobi understood too well the Jedi Way, and it grounded him: helping shepherd complete strangers back safely to their homes was most important now, putting their needs before his own. Agreeing to Yaddle's wish, he asked for her to tell Omega that Kenobi would see him soon, to which Yaddle responded sternly: \"A threat that is. And so deliver it I will not.\""}, {"tag": "p", "text": "Striker's new hideout was one of the airlift shafts that Anakin remembered he'd used only hours before to descend below, though it felt to him like days; they were now some twenty levels down, Anakin guessed, near the northeast quadrant of the tunnel system. Yaddle arrived to hear Omega's conditions right after he'd offered Anakin a final chance to choose his side, but Anakin replied that he'd already made his choice: \"Ah, the wee one approaches,\" Omega announced mockingly, only to follow up with rude mimicry of her species' particular manner of speech: \"Impressed with your speed, I am.\" He then prefaced his conditions by disclosing his possession of a \"beautifully simple\" canister—loaded into the airlift tube, its detonator remote-controlled—packed with powerful biochemical explosives: dihexalon gas, which was toxic and deadly to all life-forms. It was his insurance to get himself, his soldiers, equipment, wealth and records safely off-world."}, {"tag": "p", "text": "Yaddle was presented with three death-choices: she must choose death for either the Mawans (who even then were being taken to their homes by Kenobi, whose own death would simply be \"a bonus\"), Skywalker, or herself. It was then that Anakin guessed that Omega's ambition was growing, for he understood now what he truly wanted: still trying to impress the Sith Lord, Omega now had moved beyond Kenobi as a target to something bigger: a Jedi High Council member. This would be far more impressive to a Sith Lord than a run-of-the-mill Master or his Padawan. Moreover, Anakin began to suspect what Omega already knew—the no-contest choice Yaddle would make. She would sacrifice herself: The One Below will remain below."}, {"tag": "p", "text": "Anakin furiously berated and chastised himself for his stupidity in again allowing himself to be captured by Omega and for putting Yaddle in such peril. He'd been an unwitting pawn—used—once again. He had been the bait for Omega's lies and deception: this Void in the Force sought no agreement or truce, but wanted rather high-profile death to appease his own vanity and achieve a measure of galactic power by association with the Sith. And by Yaddle's choice, Omega would also have revenge on Anakin, who would have to live knowing he had caused Yaddle's death."}, {"tag": "h3", "text": "A Master's choice"}, {"tag": "p", "text": "In one swift lightsaber movement, which caught Omega in mid-sentence, completely by surprise, Yaddle had surgically severed Anakin's binding cuffs, which clattered to the floor. Skywalker's vision flashed in his mind—the cuffs were not Shmi's, they were his! Yoda and his Master had been correct in their caution about interpreting dreams: that one should not allow one's own emotions or desires to overlay themselves upon visionary images. \"Launch it!\" Anakin suddenly heard Omega exclaim, as the crimelord turned to Yaddle, who'd been a blur of light, advising her that she'd just ensured the deaths of thousands. But then Yaddle straightaway Force-jumped into the airlift tube, as it filled with a rush, hitting with her saber-hilt its maximum eject button. Then, like the blast from a laser cannon she shot upward, through the tunnel levels, high into the air. Omega stood there stunned, as immediately Anakin followed suit, jumping into the tube as he hit its maximum launch setting. Having been himself shot to the surface and into the night sky at an astonishing velocity, he lost his breath as he careened back towards the ground, the Force helping to slow his descent and break his fall. Rolling with the impact, he looked again skyward to the glittering heavens and saw Yaddle, still suspended by the Force, above Naatan's tallest buildings, holding a silver canister to her chest. Yet, even at her distance, she spoke clearly to him, whispering a special parting message to his mind: that if Anakin could someday find his way to embrace, with the aid of the Force, something that was for him personally very explosive—his anger—it might then be consumed and destroyed; his success or failure in that effort would dictate and define his role as the Chosen One."}, {"tag": "p", "text": "Hardly registering the meaningful words, a terrible realization began to flow over Anakin: he clearly saw now what Yaddle was about to do. He screamed out for her to stop, but knew it had already begun—she drew a great Force-net around her, so tightly, fiercely, strongly, that Anakin fell to his knees. Never had he felt the Force move in this way before. He was speechless, motionless. Far below, Granta Omega detonated the bioweapon, releasing only a sharp pop, as the Force burgeoned before Anakin's dazzled senses. Omega's deadly canister, meant to explode, had instead imploded as Yaddle absorbed into her own body its toxic gas and explosive power. In a shower of swirling light particles, the esteemed Jedi Master simply vanished, evaporating into the energy of the Force. In the cool night air Anakin's face streamed tears which he did not feel: Master Yaddle was dead."}, {"tag": "h3", "text": "Burden of the Chosen"}, {"tag": "p", "text": "A living Jedi legend was no more, and a numbed Anakin Skywalker could not get his head around it. Time for him stood still. Yaddle's astonishing strength and wisdom—so needed for these perilous times—had been violently silenced ... and all for him. Because he'd seen a thermal detonator too late, been captured and tricked again by Omega. But why had Yaddle sacrificed precious moments to save Anakin's life before going after the bomb? She'd risked thousands of lives for his. And then he reflected on her final whispering to him. Was that why she'd saved him? If so, he couldn't bear the responsibility of it, that burden."}, {"tag": "p", "text": "Suddenly Anakin's Master was there, above him: he'd felt a great disturbance in the Force, that something terrible had happened. Like a vacuum, he'd felt its forceful surge and retreat, then silence. In neutral tones, Anakin told Obi-Wan of Yaddle's death. Kenobi stood long in stunned silence also, gazing at the starry sky. When Skywalker broke the silence with a stream of self-accusation, his Master commanded him to stop, for self-judgment was not the Jedi way. Yaddle had made the only choice that she could see, and did so freely. Handing Anakin his lightsaber, Obi-Wan told him there would be a time to mourn, but now they must continue to be the Jedi they were sent to be. Even so, Anakin remained comfortless: he felt his Master's words were automatic and empty, that he was drowning under the great sorrow and guilt that had rushed in to fill him. And flashing again in his mind's eye was his vision: its explosion of light and sorrow told him that, indeed, he'd lost everyone he'd ever loved, including Obi-Wan. His vision had proven true."}, {"tag": "h3", "text": "Fond remembrances"}, {"tag": "p", "text": "Yoda was officially informed of Yaddle's death by emergency channel comlink, but the wise old Jedi had sensed her passing already, informed immediately by the Force. Obi-Wan had officially delivered the news that already had brought great pain to Yoda, whose voice was \"liquid with sorrow\" in his proper acknowledgment of it. But Kenobi felt the oppressive weight of that pain too, as did his Padawan."}, {"tag": "p", "text": "From his earliest memory, Yaddle had been part of Obi-Wan's life. Taking special delight in the young Jedi students, she'd turned a blind eye to their pranks, hidden sweets in their pockets. Her touch on young Kenobi's head had felt to him like the most comforting thing in the world. With the hard lessons of maturity, Yaddle was there still, but in a different way. When Yoda had seemed unapproachable, in seeking wisdom towards the right path, Obi-Wan had respectfully knocked on Yaddle's door on countless occasions—an exceptional allowance and availability, indeed, by a member of the Jedi High Council. He knew this loss to the Jedi Order was so precious, Yaddle's worth woven into the fabric of the Temple for so long, that he'd not seen it clearly until it was gone. Her quiet wisdom and presence simply were always there. And losing her was almost as bad as losing Yoda would be."}, {"tag": "h3", "text": "Recanting faith"}, {"tag": "p", "text": "The Jedi had not rested since Coruscant, because there simply was no time. Panic was growing in the Mawan streets, for with Yaddle's death the fragile coalition that she had built threatened to come undone; news of the bioweapon was everywhere. And what if Omega had another? The unstable situation in Naatan caused the Senate to recant: it went back on its word to send a security force, for it would not risk its galactic reputation on behalf of a planet's security if its forces were bound to fall to crimelords. Feana Tala, on the brink of deserting the city and pulling her patrols, was also close to recanting her faith in the Jedi. For she doubted that Naatan could withstand an attack by Omega. All would surely retreat underground again, but this time, they would remain below."}, {"tag": "p", "text": "Kenobi and Skywalker, as they ingested and imbibed much-needed nourishment in the second-level café of the Senate Provisional Committee's makeshift command center, were able to persuade Tala, however, to hold out a little longer. This, bolstered by the promise of Yoda's arrival (his personal transport to the planet having already taken flight) would help ensure the Senate's support, a renewed commitment to aid Mawan."}, {"tag": "h3", "text": "Fighting anger"}, {"tag": "p", "text": "Amidst the shifting tides of fear in the ranks of citizens and Senators, Obi-Wan Kenobi struggled with his own resurging anger, born of grief. He found it difficult to keep his temper cool or to speak in measured, reasonable tones. Instead, he wanted to shout at everyone that a great Jedi Master had sacrificed herself for their peace and security—and it would be a tremendous favor if they would just follow through! He understood his grief was making him short-tempered, and that his heart was, at once, heavy and angry that Yaddle had to die. Knowing that carrying these volatile emotions would only drag him down, Obi-Wan saw the need to absorb them and let them go. But he felt that he was struggling against a rising tide."}, {"tag": "p", "text": "His sorrowing Padawan, too, he was struggling to reach. Granta Omega, who doubtless was now planning his revenge, would moreover surely exploit that sorrow for his own ends. He'd already achieved his great goal of killing a member of the Jedi High Council. How could Kenobi ever banish his anger while he knew Omega gloated in satisfaction?"}, {"tag": "p", "text": "Yoda's Consular-class cruiser soon landed on Mawan in the cold, gray dawn. The Grand Master's first point of business was to see the place where Yaddle had died. And so, standing silent, he tilted back his head as if tasting the air, closed his eyes to feel her still-lingering presence, underneath the spot where Yaddle's life had ended—a private, final goodbye to his longtime friend. \"Ready, I am,\" Yoda finally said, and they headed back towards the command center. There, they learned from Swanny and Rorq that Decca and Omega had settled their feud and had joined forces, something Kenobi had feared. Worse yet, with Omega accessing Decca's fleet and Decca accessing Omega's weapons, they now planned an allied assault on the city. With only security patrols to put up what was sure to be a doomed defense of the capital, Yoda asserted that they had to prevent the combined attack by preemptively attacking the enemy's strengths—transports and weaponry."}, {"tag": "p", "text": "The Jedi-led team therefore conceived a plan whereby, with the help of Swanny and Rorq, they could re-route the underground wastewater pipes to intersect with Decca's fuel-depot pipes (Omega had just delivered to Decca a huge shipment of fuel). When the transport fueling began, the Hutt's transports would unwittingly be filled with wastewater instead of fuel, rendering them useless until they were pumped and dried out, which could take several days. Any water in the fuel would further cause engine problems. Anakin was to accompany the Mawan tunnel-workers to the point where the re-route would be done, to keep watch for them. Once finished, he'd rendezvous with Obi-Wan and Yoda at the fuel depot."}, {"tag": "p", "text": "Skywalker, too, was battling anger and thoughts of revenge against Omega. His burning rage frightened him and threatened to spin out of control. Grateful he was for the presence now of the greatest Jedi Master then living, which presence was as deep and huge as his rage. It would surely help to keep his anger in check, and he would also look to his Master for the control he sought. But Anakin knew that both Obi-Wan and Yoda also felt anger and grief—he could see it in their eyes, feel it in the air around them, note it in their movement and speech. Yet somehow, he could see but only admire, they were finding the means to manage and dispense these raw and forceful energies: Yoda, who was clearly grief-stricken, had yet traveled to Mawan to finish Yaddle's work, and he was not deterred, but remained, like Obi-Wan, still focused and disciplined, and nothing could deflect either of them, not even sorrow. Anakin yearned himself to possess that inner calm, and realized after all that he did need a Council and a Master, for they showed him how far he had to go, how much he had yet to learn. He must win Obi-Wan's trust back. But he knew he was drowning in his own guilt: Yaddle had died before his eyes, and he knew that because of that knowledge he would forever be marked."}, {"tag": "p", "text": "Finished with the wastewater re-route just in time, just as Decca's fuel-workers began to pump, Anakin raced back to join Obi-Wan and Yoda at the fueling depot entrance, where they hid behind a speeder. Decca was, of course, furious at Omega's suspected double-crossing sabotage. She released seeker-droids to track him down, and Yoda, Kenobi and Skywalker followed. They tracked Omega to a large landing area warehouse filled with enough weapons to mount an invasion. Omega was talking with an armored soldier, when suddenly Feeana Tala stepped out of the shadows and shot the seeker-droid down, announcing to Omega and the others that they had, it appeared, company: Feeana had betrayed the Mawan cause. Rolling into formation behind her were a troop of battle droids, armored gang soldiers with repeater blasters, and a grenade launcher."}, {"tag": "h3", "text": "Show of Force"}, {"tag": "p", "text": "Though hopelessly outnumbered and \"outgunned,\" with Omega's massive weapons stash piled around him, the Jedi yet leaped into battle at Yoda's command. Omega stood with Feeana smiling comfortably behind his troops on a gravsled, arms crossed, clearly anticipating a staged battle for his pleasure. A giant Force wave suddenly accompanied them, and it propelled Obi-Wan into the room. Charged in its flow, in a devastating sweep of five attack droids, he cut a swath through them all, their casings clattering to the floor in smoking heaps of twisted metal. Yoda himself took out ten of them, then lifted heavy durasteel containers into the air. In a spew of fire that rained down on the rest of the weapons, Yoda emptied the containers' flamethrower contents onto the ground, fusing the remaining weapons cache in a smoking, molten mass of intense heat."}, {"tag": "p", "text": "\"Forward!\" Omega screamed in panic. \"Gladly,\" Obi-Wan said, as he charged forward, with Anakin and Yoda at his side. Lines of droids were sent flying, mowed down and reduced to scrap as Omega's soldiers began to fall back and flee, with Omega himself leaping off the gravsled as he yelled at his retreating soldiers to hold the line. Anakin, clearly emulating Yoda's matchless form, was a paragon of balance and concentration: Kenobi had never seen his Padawan fight more brilliantly."}, {"tag": "h3", "text": "Bitter revelations"}, {"tag": "p", "text": "Leaving Yoda and Anakin to finish the droids, Obi-Wan went after Omega who was about to escape. Gathering the Force, he cleared the droid attack lines and sailed over the gang soldiers to follow Feeana and Granta into a plastoid tunnel in which a small, sleek cruiser was parked."}, {"tag": "p", "text": "Omega and Feeana were climbing to the cockpit to make their escape, when the enemy turned to boast that his father had taught him always to have a second exit plan. Kenobi paused, taken back both by Granta's expression and the realization that, in his background investigation of him, Omega had never known his father. \"Surprised?\" Granta said, as he reveled in revealing at last his father's identity: Omega was the son of Xanatos of Telos. Kenobi was dumbstruck: he should have guessed, seen through Omega's bitter jibes, insults, and general attitude—for his father was Qui-Gon's former Padawan who fell to the dark side, Jinn's greatest enemy, who had invaded the Temple and attempted even to kill Yoda. The clues had been there: Sano Sauro's snatching the promising boy from his mother's care on Nierport Seven (where Xanatos had hid them) in order to properly school him in the greater galaxy. Bitter that he hadn't inherited his father's Force gift, Omega now blamed Kenobi for his father's death. And to prove to his dead father that he was yet worthy to be a Force-sensitive, he'd chased the Force across the galaxy and grown even wealthier than his father had been."}, {"tag": "p", "text": "Obi-Wan could see clearly that Omega would sacrifice Feeana in order to escape. Grabbing her ankles Granta threw her off the hull of the ship. But Anakin, wrapped in the Force, came flying from the tunnel to snatch her mid-air and save her life. Notwithstanding, Omega, gunning the engine, took off—the Force Void, Xanatos' son, had escaped again. Feeana admitted to the Jedi how foolish she'd been in her alliance with Omega, whose treachery left her shocked; she'd acted in desperation for her troops and native fellow citizens. All the same, Tala was justly placed with the other prisoners."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Every Jedi student had heard the story of Xanatos and the Temple invasion, and Obi-Wan, though he'd spoken briefly to him about it, saw the many questions in Anakin's eyes. But he told his Padawan that they would discuss the matter later, as they had a mission to complete—just as it always seemed to be for Kenobi whenever he wanted to take that extra moment for his Padawan. Circumstances seemed to always get in the way, whether it was a mission to complete, somewhere important to go, or a battle that needed fought—beyond this, there had been so much in his own heart, Obi-Wan regretted, that had been left unsaid."}, {"tag": "p", "text": "When Decca's troops arrived, she and her forces were stunned at the destruction carried out by only three Jedi warriors. Yoda, after confronting Decca, had been able to convince her that she had indeed reached a dead end. His comments had also filled her with dismay when he suggested that the Jedi were thinking of setting up a satellite Temple on Mawan. That revelation sealed the Hutt's conviction that it was best to leave the planet. Anakin was grateful to have witnessed, beyond Yoda the master teacher, Yoda the warrior—the awesome demonstration of his astonishing power in the Force; and somehow he knew, even then, that he'd only seen but a small fraction of it. The Grand Master asked Anakin, after returning from speaking with Decca, if the boy could see how the right diplomacy was always better than battles, to which Anakin nodded his appreciative understanding."}, {"tag": "p", "text": "But Yoda was suddenly alerted to something else in the boy's face, and he spoke with him for a moment about his feelings concerning the cause of Yaddle's death. He wanted Anakin to know that her death was not his fault, just as when the stars move and fall, the cause and effect of their movement has nothing at all to do with Anakin Skywalker. Anakin was grateful for Yoda's words, but wondered why his own Master hadn't said them. Obi-Wan had simply been silent when Anakin had scorned and derided himself for Yaddle's demise. That his vision had been true there was no doubt, and its played-out veracity felt like a wound inside him. It was a deep loss. And it seemed that a great gulf now spanned the distance between him and his Master."}, {"tag": "p", "text": "Upon the Jedi team's return to Coruscant, a special memorial service was held for Yaddle in the Great Hall of the Jedi Temple. Crowding the Hall and the surrounding balconies and levels were hundreds of Jedi who had come to honor the great Jedi Master's incalculable impact on countless lives, including the recent thousands for whom she'd sacrificed her own life. Glowlights were extinguished; thousands of tiny lights were projected on the ceiling; then one blinked out. Guided by the Force, each Jedi trained their eyes and focused upon that one empty space, silent, still, lightless. With the power of every mind and heart centered on one being, the memory of Yaddle pulsed through the room and her absence filled the Great Hall. Anakin Skywalker was there, and it was he perhaps who felt the void most keenly of all."}, {"tag": "p", "text": "Yaddle's position on the Jedi High Council was soon thereafter filled by Togruta Jedi Master Shaak Ti."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}