{"url": "Mission_to_Mandalore", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of the Imperial Era", "Category:Battles of Mandalore"], "nodes": [{"tag": "h1", "text": "Mission to Mandalore"}, {"tag": "p", "text": "The Mission to Mandalore was a mission led by the Mandalorian Sabine Wren around 1 BBY during the Mandalorian Civil War to rescue her father Alrich Wren from the clutches of the Galactic Empire and their Mandalorian ally Governor Tiber Saxon on the planet Mandalore. Clan Wren managed to rescue Alrich with the help of their Mandalorian allies and the Rebel Alliance Spectres cell. In response, Saxon then unleashed the Arc Pulse Generator known as the Duchess against the Clan Wren forces, killing many. Seeking atonement for her role in creating the weapon, Sabine led the Mandalorians and rebels on a mission to infiltrate Saxon's Star Destroyer, which was berthed above the capital Sundari. Despite being ambushed by Saxon's forces, the Mandalorians and rebel allies managed to destroy the weapon and Saxon's flagship. Following the operation, Bo-Katan Kryze inherited the Darksaber and became the new Mandalorian leader."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Imperial Era, the Mandalorian Sabine Wren was an aspiring, talented cadet at the Imperial Academy of Mandalore. She designed a powerful weapon known as the Duchess, which was capable of targeting the beskar alloy in Mandalorian armor and incinerating the wearers. Sabine later became disillusioned with the Galactic Empire and joined the Spectres rebel cell, which later joined the Alliance to Restore the Republic. She came into possession of the Darksaber, an ancient symbol of Mandalorian leadership, after finding it in the Nightsister lair on Dathomir. The weapon had previously been in the possession of Darth Maul, a Sith Lord who had taken over Death Watch, a Mandalorian faction formerly led by Pre Vizsla that had overthrown the pacifist Duchess Satine Kryze in order to rule the planet late in the Clone Wars. Maul had been forced out of power and made to flee after the Siege of Mandalore and the rise of the Empire. After reconciling with her family and defeating the Imperial puppet Governor Gar Saxon, Sabine managed to win over her clan to the rebel cause. However, she learned that her father, Alrich Wren, had been taken hostage by the Empire in order to ensure Clan Wren's cooperation. Sabine earned the right to wield the Darksaber by defeating Gar Saxon in single combat when he was wielding it, which technically made her Mandalore's rightful leader. However, she did not want the responsibility, and vowed to pass on the sword to someone who could lead Mandalore."}, {"tag": "p", "text": "In return, Clan Wren helped Phoenix Cell and the Spectres escape the Battle of Atollon and regroup. Sabine then agreed to return a favor to her mother Ursa Wren, as the clan was locked into a civil war with the Imperial-allied Clan Saxon. While the Rebel Alliance was unable to send forces to aid Clan Wren, Phoenix Leader Hera Syndulla allowed Sabine to return and aid her family. Sabine was joined by several of her Spectres' comrades, the Jedi Knight Kanan Jarrus, Jedi Padawan Ezra Bridger, and Chopper. The Spectres members, as well as the Mandalorian forces that had gone to Atollon, split up with the remaining Rebel ships in deep space. Ezra's Gauntlet and the Fang fighters headed for Mandalore, while the Rebel ships went to Alliance headquarters on Yavin 4. Due to the Spectres being an asset to the Alliance, Hera had a difficult time persuading Mon Mothma to allow two-thirds of her crew to leave, and they were under orders to return after Sabine's father had been rescued."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Attack on an Imperial outpost"}, {"tag": "p", "text": "Around 1 BBY, Clan Wren, the Spectres, Lady Bo-Katan Kryze, warriors from Clan Kryze, and the surviving Mandalorian Protector Fenn Rau undertook a mission to rescue Alrich Wren from Imperial custody. After receiving information from spies in Sundari, the capital, that Alrich was being held at an Imperial outpost, Sabine and her comrades launched a surprise attack on the outpost, led by Sabine wielding the Darksaber. During the attack, the Empire deployed Jumptroopers and All Terrain Defense Pods, but were all ultimately defeated."}, {"tag": "p", "text": "After clearing the outpost, however, Alrich could not be found, and Sabine, Rau, Bridger, and Jarrus met with Kryze, the former regent of Mandalore. Sabine attempted to recruit Kryze as the new wielder of the Darksaber and Mandalore's new leader. However, Kryze declined, since Clan Saxon had conspired with the Empire to depose her and she felt that she had already had her chance to rule. Sabine made contact with her mother, who informed her that the Imperials were transporting Alrich back to the capital for a public execution. Sabine and her comrades devised a strategy to intercept the Imperial convoy that was transferring her father before it could reach the capital."}, {"tag": "h3", "text": "Rescuing Alrich Wren"}, {"tag": "p", "text": "The convoy consisted of three Imperial Troop Transports, escorted by several scout troopers on speeder bikes, and several Imperial Super Commandos that were riding on the transport carrying Alrich. The convoy was led by Captain Hark, who had been receiving his orders directly from Governor Tiber Saxon. A plan was made to separate the middle ITT carrying Alrich from the rest of the convoy, in order to isolate it and make it easier for someone to board it and rescue Alrich. Bridger volunteered, and the rebels soon ambushed the convoy. Sabine fired a paint bomb which smeared the window of the middle ITT, while the other rebels took out the other transports, stormtroopers, scout troopers, and Imperial Super Commandos. During the attack, Bridger infiltrated the ITT holding Alrich and rescued him, forcing Hark to escape."}, {"tag": "p", "text": "While the convoy was clear, the now-pilotless ITTs were drifting towards a cliff overlooking a canyon. Unfamiliar with the Mandalorian jetpacks, Bridger gave his to Alrich and while Alrich escaped, Bridger Force jumped out of the transport towards the cliff. He almost missed his grip, but Sabine managed to grab his hand. Hark contacted Saxon, informing him that Alrich had been freed. However, Saxon told him not to worry since he would be deploying their new weapon. After a brief reunion with her father, Sabine contacted her mother who, along with Sabine's brother Tristan Wren, had engaged Imperial forces and forced them to retreat."}, {"tag": "h3", "text": "Massacre on Mandalore"}, {"tag": "p", "text": "However, while all Imperial forces were in full retreat, Tristan informed the others that a Gozanti-class cruiser had deployed what seemed like a modified AT-DP, which soon began charging its primary weapon. Sabine, listening through Rau's comlink, recognized the sound as the Arc Pulse Generator, the weapon she had designed during her time at the Imperial Academy, which she had named the Duchess after the late Satine Kryze. She tried to warn her mother and brother to get off the battlefield, just as the weapon began firing."}, {"tag": "p", "text": "Sabine, her friends and fellow Mandalorians soon arrived at the site of the battle, and saw nothing but what remained of the defeated. Many bodies were left vaporized by the weapon, with only their scorched Mandalorian armor left remaining. Sabine, not being able to locate her mother and brother, feared the worst, and fell to her knees in tears. While the others were discussing what kind of weapon could do such damage, Sabine blamed herself for designing the weapon that had killed her mother and brother."}, {"tag": "p", "text": "However, just as Sabine was losing hope, she heard her brother yell for her, and saw them emerge from behind the wreckage of an ITT, wounded but still alive. Relieved, Sabine reunited with them, but just briefly, as Imperial aerial forces including Jumptroopers, Imperial Super Commandos, and TIE Fighters arrived to finish the survivors off. A Clan Kryze–affiliated Kom'rk-class fighter/transport came from behind the TIE fighters, shooting one down, and rescued the group. As the Kom'rk-class fighter was making its escape, it was hit by a TIE fighter, causing it to lose some power and its weapons systems. While Sabine repaired the ship's systems, Kryze and Bridger launched from the ship and engaged the TIE fighters. After destroying the remaining two, they returned to their ship, and made for their camp."}, {"tag": "h3", "text": "Mission to Sundari"}, {"tag": "p", "text": "As Sabine and the others landed at a camp, Clan Kryze warriors threatened to kill Sabine for her role in creating the weapon. They accused her of betraying her fellow Mandalorians. However, Sabine owned up to her mistakes, and Kryze convinced the others that Sabine would destroy the Duchess. The Wrens, Jarrus, Bridger, Rau, and Kryze met at the command center to discuss a strategy for destroying the Duchess. Kryze and Rau discussed on the sidelines while observing Sabine, that she should lead Mandalore. Alrich believed that Saxon would keep the Duchess in the most secure place on Mandalore, aboard his own Imperial I-class Star Destroyer, which was docked outside of Sundari. Sabine and Kryze would find the Duchess and destroy it, while Bridger, Jarrus, and Chopper would find and erase all memory of the weapon from Imperial systems and Rau and the remaining Mandalorian warriors diverted Imperial reinforcements to their location."}, {"tag": "p", "text": "They infiltrated the Star Destroyer via jetpack during the night through the hangar bay but they were noticed by a TIE fighter pilot. The Mandalorians and rebels were then attacked by Imperial stormtroopers. Sabine, noticing that the arc generator was not mounted on the Duchess, deduced that they must have moved the arc generator to a more secure location. She and Kryze found the arc generator in a control room overlooking the hangar bay. Before Sabine could disable it, the weapon fired in low-power mode, knocking her and Kryze to the ground. Saxon and Hark revealed themselves with Saxon demanding that she upgrade the arc generator to full capacity or he would kill Kryze. When Sabine refused and Hark warned that the Empire could use the weapon against all Mandalorians, Saxon fired the arc generator at Hark, Sabine, and Kryze."}, {"tag": "p", "text": "Meanwhile, AT-DPs were engaging Rau and Mandalorian warriors. Elsewhere, Bridger, Jarrus, and Chopper reached the databanks and Chopper began erasing all data. Bridger attempted to contact Sabine but received no response. Jarrus then sent her to help Sabine while he and Chopper finished erasing the data. Bridger entered the hangar and found Rau in the middle of a firefight. Rau sent Bridger towards the control room where Sabine and Kryze had headed. Meanwhile, Saxon managed to force Sabine to upgrade the arc generator despite Kryze's pleas. However, Sabine modified the arc generator to to target the material found in stormtrooper armor, which Saxon was also wearing. This had the effect of incapacitating Saxon and the stormtroopers., which allowed Hark to escape."}, {"tag": "p", "text": "With the tables turned on Saxon and the Empire, Sabine vowed to kill Saxon but Kryze managed to restrain her by telling her to be better than the Empire. Heeding Kryze's words, Sabine activated the Darksaber and sliced through the arc generator just as Hark escaped and Bridger arrived to help. As the arc generator overloaded, Sabine, Kryze, and Bridger met up with Jarrus, Rau, and the others in the hangar, escaping with their jetpacks just as the arc generator exploded, engulfing the Star Destroyer soon exploding and sending it crashing down towards the surface."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "At dawn, they arrived back at their camp. During the return journey, Kryze warned Sabine and Ursa that Mandalore would now face the full might of the Empire. After landing, Sabine stated that Kryze should lead them. When Kryze countered that Sabine had made the difficult decisions, Sabine thanked her for guiding her and told Kryze that she was worthy of wielding the Darksaber. Sabine added that the other clans shared her opinion that Kryze was a worthy leader. The various Mandalorian clans Clan Vizsla, Clan Rook, Clan Eldar, Clan Kryze, Rau representing the Mandalorian Protectors, and Clan Wren all pledged allegiance to Kryze, who accepted her position on behalf of her sister, her clan, and all of Mandalore. Shortly afterwards, Sabine, Ezra, Kanan and Chopper returned to the Rebellion, travelling to Yavin 4 on Ezra's Gauntlet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}