{"url": "Mission_to_Malastare_(The_Hunt)", "categories": ["Category:Legends articles", "Category:Battles of Malastare", "Category:Missions of The Hunt"], "nodes": [{"tag": "h1", "text": "Mission to Malastare  (The Hunt)"}, {"tag": "p", "text": "The Mission to Malastare was the third event in Jango Fett's participation in The Hunt, to locate the Bando Gora and its mysterious leader Komari Vosa. Following the fiasco of breaking Bendix Fust out of Oovo IV's prison, Jango, accompanied by the mysterious Zam Wesell, headed for Malastare to present Fust to the crimelord, Sebolto, in return for information on the whereabouts of the Bando Gora. Jango figured that he could get more information on the Bando Gora by doing his own investigating, and to do so, he had Zam distract the Dug by presenting Fust (as well as her \"charming\" good looks)."}, {"tag": "p", "text": "Zam headed for Sebolto while Jango hiked through the jungles of Malastare, fending off wild nexus and Sebolto's thugs. When Jango got to Sebolto's complex, he found Zam fighting more of the Dug's henchmen. The Dug realized Jango was searching for Komari Vosa and the Gora and went into hiding. Jango eventually caught up to Sebolto, and upon doing so, the frightened Dug quickly jumped into a secret passageway leading to the death stick factory. However, the Sebolto's hasty actions cost him his life, as he accidentally fell into a death stick processor."}, {"tag": "p", "text": "Continuing to search the factory for clues, Jango was introduced to the Bando Gora. After fighting off the deadly and deranged cultists, Jango once again encountered Montross. After a brief duel on skiffs, Montross escaped again. Jango returned to Zam and the Slave I. Remembering that some of the ships in Sebolto's complex had Huttese markings on them, Jango figured the Hutt's must have been involved with the Bando Gora as well. Relaying the information to Roz, the Toydarian told him that the reigning Hutts of Tatooine, Jabba and Gardulla, were in a tense feud over control of the desert world. Jango and Zam decided that at least one if not both of them had to be involved in the death stick scheme. The two bounty hunters set course for Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}