{"url": "Mission_to_Metellos", "categories": ["Category:Legends articles", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Metellos"}, {"tag": "p", "text": "The Mission to Metellos was an assignment in which, on the behest of the Jedi High Council, Plo Koon, who had recently been given the rank of Jedi Master, was sent to apprehend the individual, Dreed Pommel. The Council was hesitant to send Koon so soon after the death of his Master, Tyvokka, during the Stark Hyperspace War, but the Kel Dor insisted he was capable of handling the mission."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "After tracking Pommel for five days, Koon followed the criminal to Metellos, where he was occupying an executive suite in the city of Ektra. Failing to evade Pommel's scrutiny, Koon's presence was revealed and he was forced to proceed to the suite without any delay."}, {"tag": "p", "text": "When the Jedi entered the room, Pommel had taken a young girl hostage; her parents and two siblings lay dead on the floor. With a blaster to the girl's head, Pommel attempted to back towards the suite's private landing pad. With good reason to believe the murderer would kill the girl even if allowed to escape, Koon hurled a bolt of Electric Judgment from his fingertips. Pommel fell to the ground unconscious, and Koon summoned local authorities to deal with his jailing. Koon then saw to it that Claria, the little girl, was taken into a relative's custody at Stratablock 7 on Metellos."}, {"tag": "h2", "text": "Afterward"}, {"tag": "p", "text": "When Koon returned to Coruscant, the High Council requested that he submit his report of the mission to the Great Holocron, specifically for recording Koon's thoughts on the controversial ability of Electrical Judgment. The Council decided that it was safe for a trained Jedi to use, without dark side effects. Koon was appointed to the Council almost directly after this mission, and went on to perfect the technique, and teach it to select students at the Jedi Temple."}, {"tag": "h2", "text": "Sources"}]}