{"url": "Mission_to_Mek-Sha", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Mission stubs", "Category:Battles of the Third Galactic War", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Mek-Sha"}, {"tag": "p", "text": "A mission took place on the shadowport Mek-Sha around 3627 BBY as part of a larger conflict between the Sith Empire and Galactic Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A Republic fleet, led by Vice-Admiral Dol Narlock, key to the defense of Corellia stopped at Mek-Sha to purchase fuel to continue their journey. They came at the invitation of Junker Jott, the station's chief engineer and former Republic veteran."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "At the same time, a detachment of the Sith Empire, led by Darth Shaar, plotted to destroy the enemy fleet to weaken the defense of the Meridian Complex on Corellia, which the Empire was plotting to destroy. However, the Imperials simply couldn't stop the Republic fleet from refueling, as they'd simply consolidate their existing tanks into their most powerful warships and send them on their way and they didn't possess sufficient vessels to intercept them, leaving their only recourse to attack the Republic while they're refueling."}, {"tag": "p", "text": "As it so happened, the only reason Mek-Sha maintained such strong independence since revolting against their Hutt masters was because the station's unofficial queen, Huttbreaker, built in a failsafe that would neutralize all fuel on the station and any ships attached. The Empire saw the potential of amplifying the failsafe to destroy the Republic ships during their planned assault."}, {"tag": "p", "text": "Ultimately, the decision of permitting the Republic to refuel required a majority vote from the five top crews on Mek-Sha. Jott, being a Republic sympathizer, would vote in their favour; Huttbreaker would side with him to make herself a profit. However, the Brothers slaving group were known to do business with the Empire and it would look too suspicious if they suddenly voted for the Republic. The only two parties left for the tiebreaking vote were the Harido Wald and the Dar'manda."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}