{"url": "Mission_to_Morak", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Mission to Morak"}, {"tag": "p", "text": "Around 9 ABY, during the New Republic Era, a mission took place on the planet Morak, which included remnants of the Galactic Empire versus the Mandalorian Din Djarin and his allies, Carasynthia Dune, Migs Mayfeld, Boba Fett, and Fennec Shand."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Reaching the terminal"}, {"tag": "p", "text": "Upon entering the facility, Djarin and Mayfeld were congratulated by members of its garrison and work crew, who were unaware of their true nature as infiltrators. The duo made their way to the officer's mess, only for Mayfeld to recognize Valin Hess, an Imperial commander who he served under previously and who he was worried would out them both. Djarin took the code cylinder that would hold the data from Mayfeld and utilized the terminal to download the data after removing his helmet and allowing his face to be scanned, in direct defiance of the mandates of the Children of the Watch."}, {"tag": "p", "text": "Hess noticed Djarin and attempted to interrogate him on his TK number; Mayfeld intervened, offering fake identifications and claiming that Djarin was hard of hearing after his ship had decompressed over Taanab. The officer, after a moment of skepticism, invited the two over to his table for a drink in honor of their successful run; theirs was the only Juggernaut to complete its route."}, {"tag": "p", "text": "Sitting at the table, Hess offered a toast, dismissing the \"rote\" causes of health and success before asking Djarin about his home planet. Intervening again, Mayfeld instead offered a toast to Operation: Cinder, earning a remark of praise from Hess for knowing his history before the infiltrator clarified that he had \"lived it\" and been a participant in the purge's destruction of Burnin Konn; during the event, Mayfeld asserted, up to ten thousand Imperials, an entire division, lost their lives. Hess dismissed this, raising his drink to the dead as heroes of the Galactic Empire who gave their lives for the greater good and claiming that the New Republic was \"eating [itself] alive.\" The Remnant, Hess claimed, would create further chaos with the rhydonium that the infiltrators had delivered before returning to power, as the galaxy desired order over the alleged freedom of the New Republic, before offering a toast to the glory of the Empire."}, {"tag": "p", "text": "Thoroughly enraged, Mayfeld drew his blaster and shot Hess. The two infiltrators then killed several of the officers in the dining hall before escaping out the window, with Mayfeld offering Djarin his helmet and claiming that he hadn't seen his face."}, {"tag": "p", "text": "The duo escaped through a window to the roof of the facility as troopers began to pursue them; these reinforcements were picked off by Dune, many of them falling to their deaths in the waters below, as Shand shot the gunners on the defensive emplacements. Making their way up to the roof, Mayfeld and Djarin killed several more troopers before leaping into the open door of Slave I and making a narrow getaway. Taking up Fett's cycler rifle, Mayfeld placed a well-aimed shot into the cargo of rhydonium he had delivered, causing a massive explosion that set off the rhydonium in an adjacent transport, which in turn caused secondary explosions that inflicted heavy damage to the refinery."}, {"tag": "p", "text": "As Shand and Dune watched from the nearby cliff, a pair of TIE fighters raced after Fett's ship in pursuit, but a seismic charge made quick work of both ships. All members of the team were evacuated safely and rendezvoused in a clearing. Mayfeld dejectedly realized he was going to be taken back to the junkyard, but Dune said that he had died in the explosion and was free to go."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the retrieval of the coordinates, Mayfeld was let free by Djarin and Dune, who inferred that she would claim he had perished in the explosion he had caused. Although momentarily confused by this development, he quickly accepted his newfound freedom and walked off into the jungles of Morak, turning briefly to watch as Slave I lifted off."}, {"tag": "p", "text": "Subsequently, aboard his light cruiser, Moff Gideon was made aware by a subordinate that a message had been sent by Djarin repeating what the moff had said of the abducted Grogu on Nevarro, namely that the child was of a greater value than Gideon knew and that he would soon be returned to the custody of the Mandalorian."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission appeared in \"Chapter 15: The Believer\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, written and directed by Rick Famuyiwa and released on December 11, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}