{"url": "Mission_to_Mortis", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Articles needing illustration", "Category:Battles in Wild Space", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Mission to Mortis"}, {"tag": "p", "text": "During the Clone Wars, a trio of Jedi—Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, and Padawan Ahsoka Tano—unintentionally undertook a mission to the realm of Mortis. The Jedi were investigating a two thousand year old distress code when they were brought to Mortis by three powerful Force wielders: the Father, the Daughter, and the Son."}, {"tag": "p", "text": "These beings were representations of different aspects of the Force and believed that Skywalker was the Chosen One who would bring balance to the Force. The Father, who hoped that Skywalker would keep the balance between the Daughter and the Son—representations of the light side and the dark side, respectively—put him through a number of trials to test whether he was the Chosen One. Skywalker encountered the spirit of the late Jedi Master Qui-Gon Jinn, and he saw a vision of his future as the Sith Lord Darth Vader; the vision of the future was later erased from his memory. These trials confirmed that Skywalker was the Chosen One, resulted in the deaths of all three Force wielders, and brought balance to Mortis. When the Jedi left Mortis, they found that no time had passed in the galaxy while they were in the mysterious realm."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Admiral Nils Tenant and his Jedi cruiser intercepted a 2,000 year old distress signal from the Chrelythiumn system, the Jedi Council sent Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, and his Padawan Ahsoka Tano to investigate the signal's origin. The Jedi arrived in a Eta-class shuttle and planned to rendezvous Captain Rex and the cruiser he was on. The Jedi arrived, but when they did neither the Jedi's shuttle or Rex's cruiser could detect or see each other. The Jedi's shuttle lost contact with Captain Rex. The shuttle was suddenly pulled into a monolith and the Jedi blacked out."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "When they woke up, the Jedi found themselves on a strange world that was strong with force. They were met by a strange woman who called herself the daughter and asked if Skywalker was the One. The daughter then took the jedi to meet with the Father. However, Kenobi and Tano were separated from Skywalker and the daughter by a rock slide. Skywalker continued to follow the daughter while Kenobi and Tano returned to their shuttle. However, the shuttle was gone. Kenobi and Tano then met a man who was the Daughter's brother known as the Son and told them they could not have their ship yet. When the Son asked Kenobi if Skywalker was the Chosen One, Kenobi and Tano drew the lightsabers, The Son was able to deactivate them using only the force and Kenobi believe he was a Sith. The Son said he was and was not a Sith. The Son then told Kenobi and Tano to take shelter from the storm in a cave. Skywalker, after the Daughter left him, went into a monastery and met with the Son's and Daughter's Father. The Father then offered Skywalker a room for the night."}, {"tag": "h3", "text": "Visions from the past & future"}, {"tag": "p", "text": "In the cave, as Kenobi and Tano slept, Kenobi heard a familiar voice. Kenobi awoke and saw the spirit of Qui-Gon Jinn, his deceased former Master. Jinn asked Kenobi if he had trained Skywalker as he asked of him on his deathbed. At first, Kenobi drew his lightsaber in shock, but withdrew it upon Jinn's explanation about the planet being a conduit and amplifier for the Force. Jinn then told Kenobi, that inhabitants like him believed Skywalker was the Chosen One and that he would find balance here."}, {"tag": "p", "text": "At the monastery, the son visited Skywalker posing as his deceased mother, Shmi Skywalker Lars. Believing he was his mother, Skywalker confessed his sins which included killing the Tusken Raiders to avenge her and his secret marriage to Padmé. Shmi told Skywalker that Padmé was not his true destiny, despite his love for her. She disappeared and revealed the son's gargoyle form."}, {"tag": "p", "text": "Back at the cave, Tano heard a voice who asked if she was happy. Tano saw vision of her future self. The vision warned her that Skywalker was putting seeds of the dark side in her mind and that if she wanted to reach her true potential, she would leave both Mortis and her master behind. When Tano refused, the vision disappeared."}, {"tag": "h3", "text": "Testing Skywalker"}, {"tag": "p", "text": "In the monastery, Skywalker confronted the Father with his lightsaber drawn. Skywalker believed he was a Sith lord due to his powers. However, the Father said he was neither Sith nor Jedi by demonstrating his power by turing Skywalker's lightsaber off with a touch. The Father told them that he and his children were Force wielders who act as anchorites for the force. Their Force powers had become too powerful and they were force to withdraw to Mortis in order to maintain balance in the force. The Father also had to maintain the balance his Daughter and Son, who was drifting ever so closer to the Dark Side."}, {"tag": "p", "text": "When news that the Chosen One had been found, the Father decided to bring Skywalker to Mortis to see if he truly was the one. Despite Skywalker's disbelief in the Chosen One, the Father decided to test him and promised that he would let him and his friends leave. The Father had his children in their animal forms capture Kenobi and Tano and brought them to his Monastery. In the monastery's courtyard, the Father and Skywalker waited for his children to arrive."}, {"tag": "p", "text": "Upon their arrival, the Father had ordered his son and daughter to kill Tano and Kenobi if Skywalker did not choose which one to save. At first, Skywalker refused but the Father wanted to see if Skywalker could tame his children. Skywalker was able to use the force on the planet to force the Daughter and Son to let them go and forced to revert to their humanoid forms. This test convince the Father that Skywalker was the Chosen One and knew Skywalker could replace him on Mortis in order to maintain balance between the light and darkside in the force. However, Skywalker refused to take the Father's place. The Father allowed Skywalker and his friends to leave, knowing that it had to be Skywalker's choice to stay."}, {"tag": "p", "text": "As the Jedi's shuttle made their departure, Skywalker was then confronted by the Son in a dream posing as Skywalker himself. The Son tried to pursuade Skywalker to give in to the Dark Side but Skywalker resisted him and woke up. Unfortunately, the Son had boarded their shuttle and took Tano to his cathedral. Skywalker and Kenobi crashed their shuttle after they lost track of the Son. Despite Kenobi saying they should speak with the Father, Skywalker decided to rescue Tano from the Son. In the Cathedral, Tano was chained to a wall and met a creature who was able to free her. However, the creature bit her, revealed itself to be the Son, and watched as Tano moved into the darkside."}, {"tag": "p", "text": "The Son then rejoined his sister at his Father's monastery. Kenobi arrived at the Monastery in order to speak with the Father. The Son, growing impatient, awaited his Father's death. As the Father sent his Daughter away, he threatened his son to contain his son if he could not control his powers. The Son, out of anger, attacked his Father, and flew back to his Cathedral. Kenobi and the Daughter helped the father to his bed to regain his strength. The daughter, knowing her brother had to be stopped, took Kenobi to an Altar to retrieve a Dagger capable of killing force-wielders like her family."}, {"tag": "p", "text": "At the Cathedral, Skywalker found Tano. Tano, poisoned by the Dark Side, told Skywalker that the Son would kill her if he did not join him. Skywalker, refusing to let the son do this, was forced to fight his apprentice. As the son watched them duel, the Daughter and Kenobi arrived. Kenobi rushed off to help Skywalker in dueling Tano. The Daughter tried to help the Jedi, but her brother stopped her by lifting and tossing her. The Daughter and Son fought each other in their humanoid and animal forms. The Father, upon sensing this, awoke from slumber and went to the Cathedral."}, {"tag": "p", "text": "During their duel with Tano, Kenobi suggested using the Dagger to kill the Son and free Tano. The Son and Daughter continued their fight until their Father stopped them by hurtling them out of a window. Skywalker and Kenobi stopped their duel with Tano when the force-wielders landed in the courtyard. The son attacked his father with lightning that slowly weakened him. Upon seeing this, Kenobi and Skywalker decided to use the Dagger. As Kenobi tossed Skywalker the Dagger, Tano grabbed it and gave it to the Son. After receiving it, the Son then drained Tano's life-force with a tap to her forehead. As the son moved in to kill his Father, the Daughter rushed in and was killed with the Dagger. The Son then departed and the father saw that the balance had been broken and the Sith would gain power.. As the daughter died, she asked that her life-force be given to Tano. Upon the daughter's death, Tano woke up with no memory of what happened. The Father then told them to leave before the son could make his escape using their shuttle. The Father then buried his daughter in a grave with the Dagger."}, {"tag": "h3", "text": "Skywalker's temptation"}, {"tag": "p", "text": "As Tano repaired the shuttle, Skywalker and Kenobi questioned as to what to do about the Son. Skywalker decided to travel and speak with the Father about his son attempting to escape. The Father told Skywalker he would eliminate his Son before he could bring about dangers to the universe. At first, the Father refused to accept Skywalker's help, knowing his Son would us him to wreak havoc in the universe. The Father told him to let the force decide their fates and let Skywalker look inside himself."}, {"tag": "p", "text": "As Skywalker left the Daughter's grave, he encounter a apparition of Qui-Gon Jinn. Like the Father, Jinn urged Skywalker to look inside himself. He also told Skywalker to trust his instincts as he once told him. Jinn then told Skywalker to journey into the Well of the Dark Side in order to face his most personal challenge. The Father spoke with Kenobi at the Jedi's shuttle and told him of Skywalker's destination. Despite the Father's wishes for no interference, but Kenobi took a speeder to the Well."}, {"tag": "p", "text": "Skywalker went down into the well where he met the son in the fiery bowels at the bottom. The son once again attempted to draw Skywalker to the darkside by showing him visions of his future. Skywalker saw himself, killing younglings and Pame, dueling Kenobi, Alderaan's destruction, and his future form. Upon seeing these vision, the Son offered Skywalker the chance to change his future and Skywalker chose to go with him. Kenobi arrived, but found Skywalker had been poisoned by the Darkside and was left behind. Kenobi contacted Tano, told her that Skywalker had joined with son and had to disable the shuttle. Tano was able to disable the shuttle and escape on her speeder before Skywalker arrived. She picked up Kenobi. The son, knowing that the two jedi would join his father, went to his sister's grave to retrieve the Dagger."}, {"tag": "p", "text": "Skywalker was confronted by the Father, who erased his memory of the visions the Son gave him in order to free him from the Dark side. Skywalker and the Father were then joined by Tano and Kenobi at the monastery. The Son arrived and his Father pleaded for him to let go of his plans. When the Son refused, Skywalker, Kenobi and Tano attacked him to no avail. The Father then took the dagger and stabbed himself in order to strip the son of his powers. As the son made peace with his father, Skywalker killed the son. As the father died, he proclaimed Skywalker to be the chosen one due to him bringing balance to Mortis. The Father warned Skywalker to be aware of his innerself, lest he bring about what the son showed. As the Father died, Mortis dissipated and the crystal on top of the monastery fell and blinded the Jedi in a flash."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Skywalker, Tano, and Kenobi woke up upon hearing Captain Rex's voice. The Jedi found themselves back on their shuttle and realized only a few seconds have passed since they lost contact with Rex. Upon their return to Coruscant, Kenobi filed a report."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "During the age of the Galactic Empire, Skywalker, now Dark Lord of the Sith Darth Vader, and his Inquisitors discovered a Jedi temple on the planet Lothal. Imperial Minister Veris Hydan led Imperial and Mining Guild forces in excavating the temple. By 1 BBY, Hydan's forces then discovered a painting of the force-wielders known as the \"Mortis gods\" near the temple's roots. Hydan had found Kenobi's report that detailed these beings and believed they were the key to unlocking the temple and it's secrets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}