{"url": "Mission_to_Mustafar_(Skywalker_and_Tano)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Mission stubs", "Category:Battles of Mustafar", "Category:Events during the Clone Wars", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Mustafar  (Skywalker and Tano)"}, {"tag": "p", "text": "A mission was undertaken by Jedi Anakin Skywalker and Ahsoka Tano during the Clone Wars to rescue several Force-sensitive infants kidnapped by the bounty hunter Cad Bane, who was hired by Darth Sidious. Skywalker and Tano took the freighter Twilight to the planet Mustafar, where they had determined Bane took the children through examination of his starfighter's fuel computer. When Sidious' nanny droids told him that the Jedi had arrived, the Sith Lord ordered them to destroy the facility. Skywalker, Tano and R2-D2 managed to rescue the children, but the destruction of the facility by deactivation of the protective force fields prevented the Jedi from identifying the mastermind of the kidnapping plot."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 21 BBY,[source?] Dark Lord of the Sith Darth Sidious hired bounty hunter Cad Bane to break into the Jedi Temple on Coruscant to steal a holocron. After the successful completion of the mission, Sidious' next job for Bane was to capture Jedi Master Bolla Ropal, keeper of a data crystal containing a list of every Force-sensitive child in the galaxy known to the Jedi Order. The Jedi learned of this from Cato Parasitti, a Clawdite bounty hunter who had assisted Bane in the Temple burglary but revealed the information due to anger about Bane leaving her behind to get captured."}, {"tag": "p", "text": "Subsequently, Jedi Knight Anakin Skywalker, his Padawan Ahsoka Tano and their forces set out for Devaron, where Ropal had been stationed, in search of Bane. On Sidious' orders, Viceroy Nute Gunray gave Bane a fleet of Separatist warships with which he attacked Ropal's position and captured him. Skywalker and Tano boarded Bane's flagship in search, but Bane was able to capture Tano and hold her hostage to force Skywalker to open the holocron, allowing Bane to insert the stolen memory crystal so it could be read. After disguising himself as a clone trooper to escape the ship before it blew up, Bane was able to escape the Resolute and return to his hideout, Black Stall Station, where Sidious ordered him to choose four children from the crystal's list and take them to the Sith Lord's secret facility on Mustafar."}, {"tag": "p", "text": "While the Jedi attempted to divine where Bane would strike next, the bounty hunter set out for Glee Anselm and kidnapped the Nautolan infant Zinn Toa. Jedi Master Obi-Wan Kenobi foresaw Bane heading to Rodia and ventured there, but was too late to stop the Duros from abducting Wee Dunn. Skywalker foresaw Bane then travelling to the planet Naboo and travelled there with Tano. The two were able to ambush Bane in Jan-gwa city, preventing the bounty hunter from kidnapping the Gungan child Roo-Roo Page and taking him into their custody. However, a search of Bane's starfighter Xanadu Blood found no clues as to where the two kidnapped children had been taken. Kenobi, Skywalker and Mace Windu interrogated Bane, nearly breaking his mind before he agreed to take them to a location where he claimed the children were. As Skywalker wanted to inform Supreme Chancellor Palpatine of what was going on, he and Tano stayed behind while Kenobi, Windu and Clone Commander Cody escorted Bane to his coordinates. Skywalker, doing a further search of the Xanadu Blood with Tano, decided to look at the ship's fuel computer, an often-overlooked component, which revealed that Bane had travelled to Mustafar, a destination that was out of his way and fit the volcanic ash covering the ship. Taking the light freighter Twilight, Skywalker, Tano and Skywalker's astromech droid R2-D2 set out for Mustafar."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "At the facility, the two nanny droids tasked by Sidious with caring for the kidnapped children were preparing to subject Toa and Dunn to surgical slave conditioning when the Twilight's approach was detected by the building's sensors. Upon realizing that the approaching starship was not Bane's, the droids reported the intrusion to Sidious, who ordered them to destroy the facility and take the two infants to his backup location."}, {"tag": "p", "text": "When the Twilight landed, Skywalker and Tano both sensed the dark side of the Force. With R2-D2 tasked to watch the ship, Tano heard the children's crying, and she and her master headed for the facility's main room, where thee children had been held. The two droids each grabbed one child and hid in the shadows, turning off the lights and shutting down the facility's gravity supports."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}