{"url": "Mission_to_Myrkr", "categories": ["Category:Legends articles", "Category:Battles of Myrkr", "Category:Battles of the Yuuzhan Vong War", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Mission to Myrkr"}, {"tag": "p", "text": "The Mission to Myrkr, also known as the Mission, was an operation conducted by the New Jedi Order in 27 ABY with the purpose of destroying the Jedi-hunting voxyn creatures. A strike team of seventeen Jedi Knights, led by Anakin Solo, infiltrated the worldship Baanu Rass above the planet Myrkr and eliminated the voxyn queen, though six Jedi—Anakin among them—lost their lives in the process and Jacen Solo was captured."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "The Yuuzhan Vong War continued to rage as planets began to fall one by one, and with the birth of his son, Ben, Luke Skywalker was determined more than ever to drive back the aliens. After the discovery of the Jedi-killing voxyn, several Jedi were assigned to destroy the cloning facility at Myrkr, including the Solo children, Anakin, Jacen and Jaina, and their friends Tenel Ka, Tahiri Veila, and Zekk."}, {"tag": "h3", "text": "Delivery and torture"}, {"tag": "p", "text": "Lando Calrissian and Tendra Risant Calrissian pretended to be Yuuzhan Vong sympathizers from Talfaglio, a planet under Yuuzhan Vong blockade. They delivered the seventeen Jedi to a rendezvous point with the Yuuzhan Vong scout ship Exquisite Death, which delivered the team through the heavily mined Vong frontier to Myrkr. During their captivity, the Jedi were badly injured by Vong torture, and one, Ulaha Kore, almost died. Hoping to elevate himself in the eyes of his superiors by employing voxyn to torture the Jedi one by one, the Yuuzhan Vong commander Duman Yaght showed particular sadism against the Jedi by repeatedly inflicting pain upon the already injured Ulaha, and by forcing Jaina Solo to choose which of her brothers was tortured. The resulting injuries ranged from bruises, burns, and cuts to more severe injuries. Using a technique called Force meld, the Jedi managed to survive. They then turned on their captors, and secured the ship in hyperspace with the help of two of Lando's YVH-Series battle droids, who helped them destroy all the Yuuzhan Vong warriors and voxyn aboard."}, {"tag": "h3", "text": "Arrival at Myrkr"}, {"tag": "p", "text": "On arrival in the Myrkr system, several Vong ships, led by Nom Anor and Vergere on Ksstarr, pursued the Jedi frigate. Ulaha sacrificed her life to allow the Jedi strike team to land on the worldship, Baanu Rass, and led the enemy away while Anakin's force entered the ship. Ulaha perished soon after the Jedi were offloaded. Following their entrance into Baanu Rass, the Jedi encountered a Nightsister, Lomi Plo, and her apprentice, Welk. They agreed to assist the Jedi in finding the voxyn queen in return for safety and protection."}, {"tag": "p", "text": "Under Anakin's leadership, the team avoided a trap in a slave city and on board a captured AT-AT walker, a home to an insect nest. Nom Anor and Vergere relentlessly pursued the group towards the voxyn queen's lair throughout the journey; however, after the encounter in the slave city, Anakin's spleen was ruptured after rashly rescuing his sister. The remaining mission was spent in an attempt to stay away from the Yuuzhan Vong long enough for Anakin to go into a healing trance, as he refused the team to stop the mission because of his wounds. Not long afterward, the Jedi reached an arena-like area nearby the Shaper damutek where the queen hid from them."}, {"tag": "p", "text": "As they neared the arena, they found a freighter, Tachyon Flier, which they attempted to repair as a means of escape. While Lowbacca repaired the crashed ship, Raynar Thul recovered from his recent injuries. Lomi Plo and Welk showed their true colors by stealing the ship with Raynar on it and flying off into the Unknown Regions."}, {"tag": "h3", "text": "Anakin Solo's death and mission's conclusion"}, {"tag": "p", "text": "In an effort to complete the mission, the team continued. In a rearguard action, a severely wounded Anakin fought many Yuuzhan Vong as a means of allowing the team enough time to escape. He also levitated a thermal detonator to destroy the remaining voxyn tissue, which prevented the further creation of the Jedi-hunting creatures. Moments before his death, Anakin became a blinding pillar of light as he became one with the Force. Jaina, blinded by her grief, drifted into the dark side of the Force in order to retrieve Anakin's body. After killing the queen, Jacen, assisted by Vergere, was captured by Nom Anor. Unable to return to the worldship, Jaina, Tenel Ka, Zekk, Tahiri Veila, Tesar Sebatyne, Alema Rar, Ganner Rhysode, Tekli, and Lowbacca flew away from Myrkr on Ksstarr."}, {"tag": "h2", "text": "Aftermath and legacy"}, {"tag": "p", "text": "After Anakin's death, Jaina continued to wrestle with the dark side, and Tahiri, who had been romantically involved with Anakin, was sent to depths of despair. Jacen faced the Embrace of Pain at the hands of the Yuuzhan Vong, though he was thought to be dead by everyone except his mother; Ganner Rhysode later died while helping Jacen escape. Due to the heavy losses that came with the mission's bittersweet victory, the Solo family went into a deep depression. Luke Skywalker himself bitterly regretted not going along with the team to ensure a safe success and the guilt remained with him for many years afterwards."}, {"tag": "p", "text": "Just after getting elected Chief of State, one of Cal Omas's first priorities was to organize a ceremony where the survivors of the mission were knighted, and the dead were honored."}, {"tag": "p", "text": "Six years after the war's end, the Dark Jedi, including Raynar, started the Dark Nest Crisis. Due to the excessive use of the mind meld that was employed throughout the previous years, the survivors, with an exception of Jacen and Tenel Ka, were easily converted into Joiners. Jacen and Tenel Ka had a child, Allana, and fell in love."}, {"tag": "p", "text": "During the Second Galactic Civil War in 40 ABY, Jacen turned to the dark side and apprenticed himself to the Sith Lady Lumiya, through whom he discovered that Vergere had been a Sith. Alema Rar, who was presumed dead four years earlier, returned with the intent of exacting revenge on Jacen's family, in the process helping to ensure Jacen's fall; she was later killed. Later in the war, Jacen, by then the Sith Lord Darth Caedus, took Tahiri as his Sith Apprentice, corrupting her with false promises of bringing the deceased Anakin Solo back to life. The war ended with Caedus's death at Jaina's hands, whilst Tahiri, having realized the error of her ways, was redeemed by the now-teenaged Ben Skywalker."}, {"tag": "p", "text": "Of the seventeen Jedi that participated in the mission to Myrkr, only seven of them—Jaina Solo, Tenel Ka, Tahiri Veila, Lowbacca, Zekk, Tesar Sebatyne, and Tekli—survived both the mission and its long-lasting repercussions."}, {"tag": "p", "text": "In 43 ABY, sixteen years after his death, Anakin Solo's spirit met with Luke and Ben in the Maw. Saying that too much had died with him, Anakin warned his uncle and cousin not to repeat his mistakes. He also asked them to tell Tahiri he still loved her, a message she later received from Anakin's parents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The New Essential Chronology, it is repeatedly—and mistakenly—referred to as the 'Mission to Wayland'."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}