{"url": "Mission_to_Mygeeto", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Mygeeto"}, {"tag": "p", "text": "The Hutt crime lord Jabba Desilijic Tiure sent a group of his men led by the Rodian bounty hunter Greedo on a mission to the planet Mygeeto to kidnap a Givin codebreaker from the InterGalactic Banking Clan. Greedo managed to kill the Banking Clan Vice Chairman Anolo and gain control of the Givin; however, the codebreaker fell to his death after Greedo had him attempt to zipline from the Vice Chairman's office onto a waiting skiff during their escape."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Hutt crime lord Jabba Desilijic Tiure learned that a Givin codebreaker had his brain synced up to the Imperial algorithm that generates security codes. He sent the Rodian bounty hunter Greedo and a group of his men on a mission to the planet Mygeeto to kidnap the Givin codebreaker who was working with the InterGalactic Banking Clan to increase the Banking Clan's chances with winning a trade war with the Hutts. Jabba had originally considered Boba Fett for the mission. The Hutt ordered Greedo to bring in the codebreaker alive."}, {"tag": "p", "text": "Inside Vice Chairman Anolo's office the Givin and Anolo were discussing their future plans and the lightsaber of Jedi Master Ki-Adi-Mundi that rested in front of them. As the Vice Chairman was talking a  blaster shot through the window and Anolo ordered an evacuation. Nearby Greedo who was accompanied by Kadas'sa'Nikto bounty hunter, Takvaa slid down onto the escape skiff and prepared to enter the tower where the codebreaker was located."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "Back inside, the Givin and Anolo were running down the hall with the guards, when one of them noted that just a single autocannon was at the front gate which was where most of the guards were. The codebreaker then went over to a nearby wall where he observed that the wall was thirty percent less thick then the walls in Anolo's office. He then realized that Greedo had managed to get them right where he wanted them. An explosion followed with Greedo and Takvaa entering. They started to open fire on the guards, killing many of them. But more guards started to appear with their batons drawn and a worried Takvaa told Greedo that Jabba will kill them both if they fail. Greedo told Takvaa that he loved the thick skin of the Kadas'sa Nikto and proceeded to throw him in front of an attacking guard, killing him. Greedo then killed the remaining guards until it was just him, Anolo and the Givin. Anolo threatened Greedo that the InterGalactic Banking Clan will not allow him take their prized codebreaker alive. Greedo agreed and killed the Vice Chairman."}, {"tag": "p", "text": "As more guards started to appear, Greedo grabbed the Givin. They ran back into Vice Chairman Anolo's office, barricading themselves inside. The codebreaker started to calculate their low odds of success at less then ten percent. Greedo threatened the Givin if he kept talking. As the Givin continued calculate the odds, Greedo thought quickly and ordered Barada to bring the escape skill to his location as he grabbed Ki-Adi-Mundi's lightsaber. Greedo used the lightsaber to break the window and a grappling hook was shot across from the skiff, allowing Greedo and the Givin to zipline across. The Givin tried to tell Greedo that it was not safe for both of them to go on. But Greedo did not care and pushed him on anyways. The zipline snapped and the Givin codebreaker fell to his death."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Back at Jabba's Palace, Jabba threatened to feed Greedo to his rancor, Pateesa as failure for not bringing him the codebreaker. Greedo begged for his life and offered Ki-Adi-Mundi's lightsaber as compensation but Jabba refused. Right before Greedo was to be killed, the Ithorian collector, Dok-Ondar offered to buy the lightsaber and a dianoga put for double the price. Jabba agreed and let Greedo live, sending him on a more simpler mission."}, {"tag": "p", "text": "Many years later, at Dok-Ondar's Den of Antiquities a First Order stormtrooper sergeant examined the lightsaber while he was questioning Dok-Ondar. He did not care much for the lightsaber, telling Dok-Ondar that the future is more important than the past. But Dok-Ondar took the lightsaber and started to tell the sergeant how he acquired to lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}