{"url": "Mission_to_Nakadia", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Conflicts involving the Black Sun syndicate", "Category:Conflicts involving the Red Key Raiders", "Category:Conflicts involving the New Republic", "Category:Missions", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Mission to Nakadia"}, {"tag": "p", "text": "Prior to the Battle of Jakku in 5 ABY, Chancellor Mon Mothma sent Han Solo, Sinjir Rath Velus, Temmin Wexley, Jom Barell, and Conder Kyl on a mission to follow five senators who had voted against her resolution to send New Republic Defense Force forces to Jakku. These senators were Ashmin Ek, Rethalow, Dor Wieedo, Grelka Sorka, and Nim Tar. Three of them had been bribed by the Black Sun and Red Key Raiders while two of them had been coerced into opposing the resolution. Sorka's pet jerba and Nim Tar's child had also been kidnapped."}, {"tag": "p", "text": "While tailing the senators, Conder was kidnapped by Red Key gangsters. Meanwhile, Han was assaulted and thrown into a rubbish bin outside Rethalow's starship. Conder used a transceiver tooth to relay his coordinates to his rescuers. Solo flew the Millennium Falcon through the roof of a warehouse. Following a struggle, the team managed to subdue the Red Key gangsters and free Nim Tar's child and Conder. Despite not being able to save Sorka's pet jerba, Sinjir with Conder's help successfully convinced the five senators to switch their votes in favor of Mothma's resolution. This derailed both the Black Sun and Red Key syndicates' conspiracy to prolong the war and Senator Tolwar Wartol's plot to sabotage Mothma's leadership. As a result, the New Republic was able to send military forces to Jakku to defeat the Galactic Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Liberation Day attack on Chandrila in 5 ABY, Counselor Gallius Rax relocated the Galactic Empire to the Inner Rim world of Jakku. Several months later, Norra Wexley and her team discovered the Imperial fleet above Jakku. While Norra, the Zabrak bounty hunter Jas Emari, and the B1-series battle droid Mister Bones infiltrated Jakku, her son Temmin Wexley and the former Imperial loyalty officer Sinjir Rath Velus returned to Chandrila with news about the Imperial presence on Jakku."}, {"tag": "p", "text": "Temmin and Sinjir informed Princess Leia Organa and Chancellor Mon Mothma about the Imperial presence at Leia's domicile. Despite Chancellor Mothma's efforts to maintain confidentiality until she could formulate an official response, her rival Senator Tolwar Wartol had installed a listening device inside Leia's nanny droid T-2LC. Seeking to gain political capital, Wartol leaked this news to the press and accused Mothma of weakness. Wartol also tried to sow discord between Mothma's allies by sending Senate Guards to stop Temmin and Sinjir from departing on the Millennium Falcon for Jakku."}, {"tag": "p", "text": "Sinjir's former slicer lover Conder Kyl subsequently discovered Senator Wartol's listening device. Mothma convened an emergency session of the Galactic Senate but failed to secure majority support for a resolution authorizing intervention by five votes. With the Senate due to reconvene on Nakadia, Mothma managed to convince Wartol to let her travel with him aboard his Ganoidian tri-deck cruiser. During the journey, Mothma confronted Wartol about his the listening device in Leia's droid and his role in sabotaging her resolution to send New Republic Defense Force forces to Jakku. Wartol denied these accusations and vowed to fight Mothma at the next election."}, {"tag": "h3", "text": "Political intrigue"}, {"tag": "p", "text": "However, Mothma revealed a final trick up her sleeve: a pta fruit. Since Nakadia had strict biosecurity laws, Mothma decided to use the customs inspection to delay the re-vote on the Jakku intervention. Her plan was to give a team consisting of Sinjir, Leia's husband Han Solo, Temmin, Conder, and the former SpecForces commando Jom Barell enough time to spy on the five senators who had opposed her resolution and convince them to change their votes. These five senators were Ashmin Ek of Anthan Prime, Dor Wieedo of Rodia, the Frong Rethalow, Grelka Sorka of Askaji, and the Quermian Nim Tar. All five had previously caucused with Wartol in the past and served on the same committees."}, {"tag": "p", "text": "Sinjir and the other agents followed the other senators into a popular restaurant near the Quarrow Senate house called Izzik's. Sinjir and Solo posed as celebrities, Jom as a security guard, Temmin as a military veteran, and Conder as somebody seeking favor with the senators. Sinjir was tasked with watching Ek, Solo with Wieedo, Temmin with Sorka, Conder with Tar, and Jom with Rethalow. Solo eventually followed Wieedo to his starship in the northernmost spaceport outside Quarrow. For several hours, they kept watched over the senators for anything suspicious."}, {"tag": "p", "text": "That night, Solo contacted Sinjir to inform him that a couple of Nikto and a Klatooinian were approaching Wieedo's ship. These aliens turned out to be members of the Red Key crime syndicate, which was conspiring with Black Sun to prolong the Galactic Civil War. While Sinjir was trying to tail Conder and Tar, he was distracted by Dann and Merra, the son and daughter of the Akivan senator Pima Drolley. Sinjir managed to break away and found Ek threatening Tar at a narrow alley. Sinjir went to confront them but was knocked out by a stranger who had been following him. Meanwhile, Solo was thrown into a trash bin by the Red Key gangsters."}, {"tag": "h3", "text": "Unmasking a criminal conspiracy"}, {"tag": "p", "text": "The following morning, Temmin found an unconscious Sinjir on the streets. After rescuing Solo from the trash bin, Sinjir realized that Conder had been kidnapped. The three remaining team members were contacted by Jom, who had kidnapped Rethalow and was holding him aboard the Millennium Falcon. Sinjir managed to convince Rethalow to cooperate with them by posing as an adviser of Mothma and promising to help him if he revealed everything he knew. Rethalow confessed that he, Ek, and Wieedo had been bribed by Red Key and Black Sun into opposing Mothma's resolution in return for a trade deal. Rethalow also revealed that Tar and Sorka had been threatened by the gangsters. Nim Tar's child and Sorka's pet jerba had been kidnapped."}, {"tag": "p", "text": "Solo took the Millennium Falcon for a spin in order to search for Conder, Tar's child, and Sorka's jerba. Their search coincided with Wartol's cruiser clearing customs and being permitted to land. Meanwhile, Conder was held captive in a warehouse with a red roof by members of the Red Key and Black Sun syndicates. He managed to used his transceiver tooth to beam his coordinates to the Falcon. With the team running out of time to lobby the four other senators into changing their votes, Solo decided to find the warehouse, attack the gangsters, and rescue their captives."}, {"tag": "p", "text": "Solo used the Falcon's belly turret to blow a hole in the top of the warehouse roof. While Temmin guarded Rethalow, Sinjir, Solo, and Jom disembarked to confront the gangsters. A Nikto gangster tried to swing an ax at Sinjir but the former Imperial officer dodged his blade and broke his arm. The gangster was then shot by Jom, who was charging into fray. Han and Jom then shot two more Nikto gangsters. Sinjir then shot a charging Ithorian gangster in the head. Jom then tackled an Iotran gangster to the ground while Solo opened fired with his blaster."}, {"tag": "p", "text": "Sinjir shot another gangster after breaking his neck. Sinjir found Conder and Nim Tar's child at the far end of the warehouse. The former was bound and kneeling on the floor while Nim Tar's child was kept in a cage. A Herglic gangster took Conder hostage and threatened to break his neck. However, Sinjir shot him through the mouth, killing him."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After tending to Conder and embracing him, Sinjir solicited his friend's help in slicing into the five senator's datapads. Posing as an adviser to Mothma, Sinjir issued the five senators a missive offering to pardon them and give them political favors in return for voting in favor of Mothma's resolution. Sinjir also reassured Tar and Sorka that his child and her prize jerba were rescued. In truth, Sorka's jerba had already been sold by the syndicates on the butchers' black market. Sinjir's plan worked and the Galactic Senate voted to send military forces to Jakku, setting the stage for the Battle of Jakku."}, {"tag": "p", "text": "Following the events on Nakadia, a grateful Mothma hired Sinjir as her new adviser. He and Conder subsequently foiled a plot by a vengeful Wartol to assassinate Mothma. Sinjir subsequently took part in the peace negotiations with Grand Vizier Mas Amedda which produced the Galactic Concordance that formally ended the Galactic Civil War and facilitated the Empire's surrender. Temmin would fly with Phantom Squadron during the Battle of Jakku while Jom died in combat there saving his fellow commandos from a concussive missile. Lastly, Han and Leia gave birth to a son named Ben Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Nakadia serves as one of the subplots of Chuck Wendig's 2017 novel Aftermath: Empire's End. It is told from the point of view of Sinjir Rath Velus, one of the novel's protagonists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}