{"url": "Mission_to_Nar_Shaddaa_(Dark_Trooper_campaign)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Dark Trooper Project", "Category:Battles of Nar Shaddaa", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Nar Shaddaa  (Dark Trooper campaign)"}, {"tag": "p", "text": "During the Galactic Civil War, the Alliance to Restore the Republic continued a crusade against the Galactic Empire's efforts in creating droid soldiers called Dark troopers. During the standard year 1 ABY, the Alliance's two head operatives for the campaign, Kyle Katarn and Jan Ors, embarked on a mission to the moon Nar Shaddaa to track a down a nava card that would hopefully reveal the location of the factory starship Arc Hammer, which was producing the Dark troopers. After Ors dropped Katarn off at a landing point, Katarn fought his way through Imperial troops and various bounty hunters who were out to kill him. Katarn eventually located the nava card and was retrieved by Ors in their ship, the Moldy Crow."}, {"tag": "p", "text": "However, as they left Nar Shaddaa, they were captured by the Star Jewel, the personal yacht of the crime lord Jabba the Hutt. Ors was imprisoned and Katarn was set to be executed, as their various missions against the Empire had threatened Jabba's stake in the Imperial project. However, Katarn defeated Jabba's kell dragon with his bare hands, retrieved the nava card, rescued Ors, and escaped the Star Jewel with the Moldy Crow."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War, the Galactic Empire devised a new weapon to combat their enemy, the Alliance to Restore the Republic. Referred to as Dark troopers, they were droid soldiers equipped with state-of-the-art weaponry. The brain child of General Rom Mohc, the Dark troopers were built on the factory starship Arc Hammer. To combat the Dark Trooper Project, the Alliance dispatched two agents, Kyle Katarn and Jan Ors, to disrupt and ultimately end the project once and for all."}, {"tag": "p", "text": "After destroying a robotics facility on the planet Anteevy during the year 1 ABY, Ors learned, by tracking smuggler ships that had visited Anteevy to drop off supplies for the Empire, that all roads for the smuggler activity led to the moon Nar Shaddaa. With the ship Moldy Crow, Ors and Katarn embarked to what was often called the \"Smuggler's Moon\" to further disrupt the smugglers' efforts in aiding the Empire and steal a nava card that could potentially lead to the Arc Hammer's location. However, Mohc placed a bounty on Katarn's head, which made him a valuable target for Nar Shaddaa's resident bounty hunters."}, {"tag": "h2", "text": "The mission to Nar Shaddaa"}, {"tag": "h3", "text": "Shootouts in the Vertical City"}, {"tag": "p", "text": "Ors dropped Katarn off near a moving platform before flying off to wait for Katarn's completion of the main objective: stealing the nava card. Alongside a strong Imperial presence, the path to the Imperial facility was littered with various bounty hunters and mercenaries working for an as of yet unknown crime lord."}, {"tag": "p", "text": "As Katarn began his trek through the city streets, he was quickly attacked by a lone remote droid, which Katarn dispatched. The attack was followed by an encounter with several Gamorreans with axes. Katarn fought his way through the aliens, killing those he encountered. Katarn also dueled thermal detonator throwing Gran and concussion rifle toting Trandoshans. Using a Jeron fusion cutter for most of the enemy encounters, Katarn eventually recovered a Stouker concussion rifle from a fallen Trandoshan and used in conjunction with the fusioncutter and an E-11 blaster rifle. The Rebel agent also used thermal detonators of his own to disable enemy-planted claymores."}, {"tag": "p", "text": "After prolonged battling, Katarn eventually reached an Imperial facility protected by various Imperial stormtroopers, commandos, and officers. After blasting his way through the Imperials and further mercenaries, Katarn came across a blue-colored keycard. Katarn searched for the door that it corresponded too and opened it. Eventually, Katarn fought his way through a narrow catwalk guarded by detonator tossing Gran. Katarn survived their attacks, killed the Gran, and successfully made it across and found a small Imperial control room. The room contained the sought-after nava card, guarded by stormtroopers, and commandos. Katarn killed all three Imperials and snatched the card. With the nava card firmly in his possession, Katarn was picked up by Ors."}, {"tag": "h3", "text": "Captured by Jabba the Hutt"}, {"tag": "p", "text": "As the Rebel pair lifted from Nar Shaddaa, the Moldy Crow was near-immediately snared in the tractor beams of the luxury yacht Star Jewel, the personal craft of the crime lord Jabba the Hutt. As it turned out, it was Jabba's smugglers that had been helping the Empire make the necessary trips to deliver the materials that the Dark Trooper Project needed across the galaxy. Ors was imprisoned in the ship's brig, and Katarn was stripped of his gear and brought to the lair of Jabba's favorite kell dragon, to which Katarn was to be fed too. After being escorted to the pit by two Gamorrean guards, Jabba contacted his prisoner via a hologram, as Jabba was not actually present on his ship. The Hutt taunted Katarn, noting that his only regret was that he would be unable to personally see Katarn die. Katarn tried to threaten Jabba under the impression that Ors had been hurt, but was subsequently thrown into the Kell dragon pit by the guards."}, {"tag": "p", "text": "Despite having no weapons, Katarn killed Jabba's Kell dragon with his bare hands, along with several other Kell dragons. In response to this, a large door in the pit opened, revealing more Kell dragons and another door that led deeper into the ship. Katarn bested the kell dragons and two Gran, liberated the area of personal energy shields and the Grans' dropped detonators, and then moved further into the ship. Katarn's first order of business was to retrieve his confiscated gear, which consisted of his personal Bryar pistol and all of the other weapons he had collected in missions past. Katarn found his gear and recovered it after killing the Gamorreans guarding it. Now fully equipped, Katarn blasted his way through the remainder of Jabba's troops and Kell dragons using the weapons he had prioritized on Nar Shaddaa. After abducting a yellow keycard from a dianoga-inhabited waste pit, Katarn was able to locate the confiscated nava card."}, {"tag": "p", "text": "Finally, Katarn set out to rescue his partner. After battling through more guards and kell dragons, Katarn finally located the brig and killed the Trandoshan, Gran, and Gamorrean defenders. Katarn found Ors' cell and freed her, and together they escaped the Star Jewel aboard the Moldy Crow, depriving Jabba of his revenge against Katarn."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the nava card in hand, Ors and Katarn traveled to the Imperial capital planet Coruscant so that they could infiltrate the Imperial Security Operations building and decode the nava card. After decoding the card, the Rebel duo were one step closer to defeating Mohc and the Dark Trooper Project for good. Eventually, Ors and Katarn effectively ended the Imperial endeavor with the destruction of the Arc Hammer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kyle Katarn's mission to Nar Shaddaa first appeared in the 1995 video game Star Wars: Dark Forces, where it comprised of the ninth and tenth levels of the game. More information regarding the mission as well as a suggested path of completion were provided in the Dark Forces: Official Player's Guide, which was written by Jeff Hoff. This article is written under the assumption that 100% game completion involves following the guide's instructions and suggestions, such as what weapons to use in what situations, while playing on the game's \"Hard\" difficulty setting."}, {"tag": "p", "text": "The game's briefing screens referred to the level on Nar Shaddaa as \"Nar Shaddaa, the Vertical City: The Death Mark,\" and named the escape from Jabba's ship \"Jabba the Hutt's ship: Jabba's Revenge.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}