{"url": "Mission_to_Nar_Shaddaa_(Galen_Marek)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Duels", "Category:Missions of the Great Jedi Purge"], "nodes": [{"tag": "h1", "text": "Mission to Nar Shaddaa  (Galen Marek)"}, {"tag": "p", "text": "Shortly after escaping from the Empirical, Galen Marek, Darth Vader's secret apprentice, conducted a mission to The Undertow on the planet Nar Shaddaa in 2 BBY. This mission to find Rahm Kota resulted in a standoff between the Force-user and both Imperial-aligned bounty hunters in the tavern and the armed forces of the Galactic Empire. Before Starkiller's arrival on Nar Shaddaa, his master ordered him to create an army that would fight the Empire for control of the galaxy. Once Darth Sidious, the Dark Lord of the Sith who was publicly known as the Emperor Palpatine, became sufficiently distracted by the rebellion, Vader assured Starkiller that they would both assassinate Sidious before usurping control over the Empire."}, {"tag": "p", "text": "Shortly after Starkiller began his mission, he decided to search for an ally who could provide him with the contacts and resources that were required to build an army of rebels and dissidents. His choice fell on General Rahm Kota, a Jedi fugitive whom Starkiller severely injured on a TIE Fighter Construction Facility above Nar Shaddaa. Tracking the Jedi Master to the Undertow, Starkiller also learned that Kota had lost his sight; his eyes had been burned by his own lightsaber during his duel with Starkiller above Nar Shaddaa."}, {"tag": "p", "text": "As Starkiller attempted to persuade the drunken Jedi to fight the Empire once more, a group of Imperials entered the cantina and located their target—Rahm Kota. As a result, Starkiller had to fight Imperial soldiers throughout the cantina; he was also forced to protect Kota, especially due to the general's intoxicated and depressed state of mind. Although Starkiller defeated the Imperial garrison, including a member of the Emperor's Shadow Guard, Kota still regarded resistance against the Empire and its \"infinite\" army as a futile course of action. Nevertheless, Starkiller still convinced Kota to provide the contacts that he needed to begin a galactic-wide rebellion."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Starkiller's search for Rahm Kota took him across the galaxy, from the Jedi's last sighting on Nar Shaddaa to the ancient Sith world Ziost. From there, he tracked Kota to Nar Shaddaa. As a result of his defeat and blinding by Starkiller, Kota gave up his struggle against the Galactic Empire and turned to alcoholism in order to suppress his jaded state of mind. Deciding to check the last place he saw Kota, Marek then arrived at the Undertow on Nar Shaddaa."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Upon arrival at the cantina, Marek approached the Whiphid bartender of the Undertow, who was under the impression that he was another customer. Marek then told him he was looking for someone by the name of Rahm Kota, and asked if he knew where he was. The bartender denies any knowledge of him. Marek eventually tried to pull a Mind trick on the bartender, although he still denied any knowledge. Pushed to his limit, Marek then telekinetically strangled him and demanded to know where he was. Eventually, the bartender revealed that Kota's little more than a stumbling distance from the Undertow, assuming he wasn't already \"dead at a gutter.\" The bartender then told the patrons, who were all bounty hunters, that Marek was likely to be a Jedi, and that they should get him so they can be awarded a bounty. Marek was then forced to fight the patrons within the bar while trying to locate Rahm Kota."}, {"tag": "p", "text": "When he found the former Jedi General, Kota was half-passed out and extremely intoxicated. Hence, he was uncooperative and insistent on being left alone."}, {"tag": "p", "text": "Starkiller, who masqueraded as a Jedi at the time, attempted to reason with the unkempt general, but a further group of bounty hunters arrived, forcing Marek to defend Kota against the onslaught. To make matters worse, just as he was about to leave, Imperial Navy commandos and EVO troopers, who had presumably been notified of both Marek and Kota's presence at the cantina, were waiting just outside the door, thus forcing Marek to fight his way through them as he returned to the entrance."}, {"tag": "p", "text": "Starkiller then arrived at the entrance, calling out Kota's name, only to be unexpectedly shoved back telekinetically by an Emperor's Shadow Guard, who was seemingly accompanied by four EVO troopers. After taking out his accompanying troops, Marek then dueled with the Shadow Guard. A short time later, however, the Shadow Guard revealed an ace up his sleeve: Shadow Troopers who promptly decloaked to aid the Shadow Guard in subduing Marek. Despite a difficult fight, Marek ultimately managed to beat the Shadow Guard via a Force Repulse when the latter attempted to use Force Grip, sending the Shadow Guard flying out of the tavern."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Kota, who had witnessed the fight from behind the bar, was unimpressed by Starkiller's victory; his defeat at Nar Shaddaa left him with a pessimistic view of the galaxy. Thus, he asserted that victory was ultimately impossible to achieve because of the \"infinite army\" that enforced Palpatine's Empire. But after Starkiller appealed to his warrior sense of honor, Kota agreed to be of partial help to the apprentice's cause. He confided in Starkiller that he had a contact in the Imperial Senate who could use the assistance of a Force-sensitive warrior, especially one who was eager to fight the Empire. Shortly after being extracted by the Rogue Shadow, Starkiller felt drawn to the Jedi Temple, which thus caused him to return to Coruscant for a third time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This mission does not appear in the PS3 and Xbox 360 versions of the game, with the search for Kota being instead on Cloud City in a cantina called the Vapor Room with a Shadow Guard (four times as many in the novelization), many stormtroopers and ugnaughts to fight. Despite this, however, the mission was nonetheless implied to have occurred offscreen in that version due to Marek when meeting Kota mentioning that he tracked him down \"from Nar Shaddaa to Ziost.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}