{"url": "Mission_to_Nathema_(Zildrog)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Chorlian sector", "Category:Battles of the Order of Zildrog campaign"], "nodes": [{"tag": "h1", "text": "Mission to Nathema  (Zildrog)"}, {"tag": "p", "text": "The mission to Nathema was the Eternal Alliance's attempt to stop the Order of Zildrog from awakening Iokathi machine god Zildrog on Nathema. After the Order learned of Zildrog's location, undercover agent Theron Shan sent an encrypted message to the Alliance, leading them to an Abandoned Listening Post where they learned the Order's history and motivations. The Alliance Commander and Lana Beniko traveled to Nathema based on the information left for them by Theron Shan, who rejoined them to help them stop the Order. They fought through the Order's defences and reached Zildrog's location under an ancient Sith Temple but were too late to prevent Zildrog's awakening. Trapped in a force field by GEMINI 16, they could do nothing but watch as Zildrog's primary form was revealed to be the Gravestone itself. The Alliance's key asset was parked on Odessen, from where Zildrog took it over and used its omnicannon to obliterate the entire Eternal Fleet. Zildrog then prepared to target Odessen itself, but the Alliance leadership used that opening to engage and destroy GEMINI 16, defeat Vinn Atrius and finally destroy Zildrog itself. However, the last act also triggered the self-destruct mechanism of the Gravestone and disabled the Eternal Throne, depriving the Alliance of their most valuable military assets and causing many of its members to leave in the aftermath."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Theron Shan obtained the information from Sith Emperor's holomap on Copero, he relayed it to the Order of Zildrog, revealing to them that the ancient machine god Zildrog was located on Nathema, a world to which the Force had returned in the aftermath of Vitiate's death. The Order moved its base of operations from an abandoned listening post to Nathema, tasking Shan with wiping out all data. However, because his true allegiance secretly lay with the Eternal Alliance, Shan instead left encrypted backups of the data and leaked a message with the word \"Zildrog\" to the Alliance. This was was found by the Alliance Commander and Lana Beniko, and they decided to to personally investigate. Making their way to the listening post, Lana and the Commander watched the holomessages that revealed to them the Order's key figures and their motivation. The last data entered before their arrival contained a set of coordinates on Nathema and was encrypted with a unique method that Theron and Lana developed together on Rishi during the Revanite crisis. Forced to flee after the self-destruct mechanism was activated and completely obliterated the station, Lana and the Commander returned to Odessen just when the work of restoring the Copero holomap was finished, confirming the validity Theron's information."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Lana and the Commander headed to Nathema in a shuttle to stop the Order while Hylo Visz mobilized the Eternal Fleet in orbit of Odessen. Meanwhile, the Order had excavated Zildrog in the ruins of an ancient Sith Temple, assisted by their allies with personal vendettas against the Commander. Lana and the Commander landed on Nathema and headed to the coordinates, while fighting Nathema Zealots and beasts that escaped from the destroyed Sanitarium. Meanwhile, Theron slipped away from the Order and rejoined them at the rendezvous coordinates, where he revealed his true intentions and asked for understanding and forgiveness. The three of them then rushed to stop the Order, but GEMINI 16 noted their presence and began the ritual meant to awaken Zildrog ahead of schedule, while another member of the Order send an Ancient Guardian Droid to stop the Alliance. The GEMINI deceived and betrayed some of their allies, locking them inside energy transfer chambers to be used as fuel for Zildrog's awakening. After descending into the Verdant Valley, the Alliance reached the temple and prevailed over the machine, after which they headed inside the temple itself. They reached Zildrog's location just in time, and Theron Shan immediately shot Vinn Atrius. GEMINI 16 then trapped the three of them in a force field and revealed that the ritual was already finished and that Zildrog had awakened. Zildrog then used his connection to the Dark Sanctuary to remotely take over the Gravestone which was parked on Odessen."}, {"tag": "p", "text": "Zildrog took the Gravestone into Odessen's orbit and proceeded to obliterate the Eternal Fleet with its omnicannon. Zildrog then targeted Odessen itself and began to recharge before the next attack, but back on Nathema this disabled the force field, forcing GEMINI 16 to engage the Alliance directly. Lana, Theron and the Commander battled and destroyed the GEMINI droid, and Theron attempted to shut Zildrog down, but was suddenly stabbed in the back with a lightsaber pike by Vinn Atrius. Desperate to have his vengeance, Atrius ordered Zildrog to enhance him with its power, after which he attacked Lana and the Commander with his new increased strength. The two of them defeated Atrius and destroyed Zildrog, but the last act also triggered the self-destruct of the Gravestone and disabled the Eternal Throne. The Commander decided Atrius' fate while Lana tended to Theron's wounds, determining that he needed to be immediately brought to Odessen for treatment."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Hylo Visz send a shuttle after them, and after returning to Odessen, Lana reported to the Commander that Odessen suffered minimal damage with no casualties to Alliance personnel. However, the Gravestone and the Eternal Fleet, two of Eternal Alliance's strongest weapons were gone, and with them any advantage the Alliance had over Republic and the Sith Empire, who redoubled on their preparations for the inevitable renewal of open hostilities. Additionally, with the Alliance's original goal of toppling the Eternal Empire accomplished, many of its members choose to leave and rejoin their respective factions. Although the factions that were associated with the Order of Zildrog offered their formal apologies, this blow showed that the Eternal Alliance was not invincible, causing Lana and the Commander to look into potential allies in the upcoming conflict. The new government of Zakuul also used this opportunity to break away from both the Alliance and their former colonies, becoming an independent world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission is depicted during \"The Nathema Conspiracy\" flashpoint, released with the Update of the same name. During the mission, the identity of the person who confronts the player before the Ancient Guardian Droid fight changes depending on the player's class, alignment and previous choices, with each class facing one of two possible antagonists related to their class story. The identities of the other two victims used to awaken Zildrog likewise depends on the choices made during the Knights of the Eternal Throne expansion."}, {"tag": "p", "text": "At the end of the flashpoint, players can take light side options to either take Vinn Atrius prisoner or send him back to Zakuul to be dealt with by his own people or kill him on the spot in a dark side option. The player then has to either abandon Theron Shan to die in a Dark Side option or take him back to Odessen to heal in a Light Side option. The latter case is followed by a neutral choice to either welcome Theron back into the Alliance or to permanently banish him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}