{"url": "Mission_to_Nur", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles in the Atravis sector", "Category:Duels", "Category:Jedi missions", "Category:Missions of the Stinger Mantis"], "nodes": [{"tag": "h1", "text": "Mission to Nur"}, {"tag": "p", "text": "During the Great Jedi Purge, the Mantis crew undertook a mission to the water moon Nur to retrieve a Jedi holocron from Fortress Inquisitorius, the stronghold of the Inquisitorius of the Galactic Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The crew of the Stinger Mantis had undergone a journey across the galaxy to follow the footsteps of Jedi Master Eno Cordova and find a Jedi holocron in order to rebuild the Jedi Order. After Cal Kestis managed to open the Zeffo vault on Bogano and claim the holocron, the Second Sister a.k.a. Trilla Suduri ambushed him and fought him in a duel. Kestis was incapacitated when he laid his hands on the Second Sister's lightsaber and was forced to relive her capture through his psychometry, allowing the Second Sister to escape with the holocron. In the aftermath, the Second Sister's former master Cere Junda realized she was going to take it to the Fortress Inquisitorius on Nur where all Inquisitors were born."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The Stinger Mantis was able to approach the Fortress undetected thanks to a magick ritual conducted by Nightsister Merrin. Kestis and Junda approached the Fortress by air-dropping into the surrounding ocean and snuck in through an airlock. Kestis and Junda separately battled their way through the Fortress, and Junda eventually stayed behind to keep Imperial reinforcements at bay. Kestis made his way to the heart of the Fortress where both the holocron and the Second Sister await. Kestis and the Second Sister engaged in a fierce duel, ending in Kestis' victory."}, {"tag": "p", "text": "Junda arrived and attempted to convince her wayward apprentice to renounce the dark side of the Force, but they were unexpectedly confronted by Darth Vader, who immediately and summarily executed Suduri for her failure. Kestis and Junda attempted to attack Vader, but swiftly proved no match for the Dark Lord of the Sith. Vader threw Junda down a pit, forcing Kestis to frantically retreat. However, he was cut off by Vader, and only narrowly survived thanks to Junda's intervention. Junda nearly tapped into the dark side in order to slow Vader down, but was talked down by Kestis. Instead, Kestis flooded the corridor they were in, forcing Vader to divert his attention towards keeping the water at bay and allowing the Jedi to escape victorious."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The acquisition of the holocron would have allowed Kestis and Junda to recruit Force-sensitive younglings across the galaxy. However, Kestis decided to leave their fates to the will of the Force and destroyed the holocron. On that note, the crew of the Stinger Mantis set off for new adventures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}