{"url": "Mission_to_Nyemari", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Meridian sector", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Nyemari"}, {"tag": "p", "text": "A mission to the planet Nyemari was undertaken by the Alliance to Restore the Republic to steal access codes from the Nyemari to use against the Galactic Empire. The mission became a bust when Leia Organa tripped the silent alarm, alerting the palace to her and her comrade's intrusions after they had acquired the codes. Luke Skywalker, Han Solo, and Chewbacca hid while Organa stole an airspeeder. The Rebels escaped and went back to their hidden starship, the Millennium Falcon. The Nyemarian hiding the Falcon told them they were being followed, so the Rebels pursued the Glymphid. The Glymphid played a message for Skywalker from Rezi Soresh, threatening a ship full of hostages if Skywalker did not travel to meet him. Then the Glymphid died from some sort of delayed poison to prove Soresh's intentions. Skywalker and his companions then went to meet Soresh to save the hostages."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "The Palace infiltration"}, {"tag": "p", "text": "Rebel leader Leia Organa and her companions Luke Skywalker and Han Solo infiltrated the Royal Palace on Nyemari to steal access codes for the Galactic Empire garrison. The Rebels were forced to exfiltrate when Solo bumped Organa and she hit the silent alarm. Organa went off to acquire a means of escape while Skywalker and Solo hid in a closet, while the Wookiee Chewbacca stood watch, blending in with the Palace guards. Organa barreled through the walls of the palace with an airspeeder with blasters blazing and picked up her companions. Organa's piloting allowed them to avoid the Royal guards giving chase through the city on 74-Z speeder bikes."}, {"tag": "p", "text": "With the codes in hand, the Rebels returned to the South Anem Spaceport, where they had hid their starship, the Millennium Falcon, with a Nyemarian, Li Preni, who owed Solo a favor. The man lied about meeting the Glymphid following the Rebels, but told the truth when Chewbacca threatened him. Thinking it was a bounty hunter from Jabba following them, Solo convinced the others to confront the Glymphid."}, {"tag": "h3", "text": "Mysterious messenger"}, {"tag": "p", "text": "The Rebels cornered the Glymphid following them. The Glymphid approached Skywalker and gave him a hologram from former Imperial Commander Rezi Soresh asking for Skywalker to meet him in the Sixela system, and threatening to kill a colony vessel full of over 100 passengers if Skywalker didn't comply. As a measure of his power, Soresh had the messenger killed in fromt of Skywalker using some sort of time-delayed poison. Skywalker knew he had no choice and would go alone to meet Soresh, but his companions would not let him go without backup. They then left Nyemari to meet Soresh on his barren moon, instead of continuing to Organa's diplomatic trip to the Winagrew system, as was originally planned."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission appears in Alex Wheeler's 2010 book Rebel Force: Uprising."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}