{"url": "Mission_to_Nirauan", "categories": ["Category:Legends articles", "Category:Battles in Wild Space", "Category:Battles of the Caamas Document Crisis", "Category:Empire of the Hand events", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Mission to Nirauan"}, {"tag": "p", "text": "The Mission to Nirauan was attempted by Luke Skywalker in 19 ABY to rescue Mara Jade after her disappearance on the mysterious planet Nirauan. It resulted in the discovery of the powerful Empire of the Hand in the Unknown Regions and in the recovering of an unaltered copy of the Caamas Document that later resolved the Caamas Document Crisis."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Ten years after Grand Admiral Thrawn's death, rumors that Thrawn was alive and active in Imperial Remnant found their way to the Unknown Regions. Admiral Parck dispatched several Nssis-class Clawcrafts to the known galaxy in order to investigate about this. The Clawcrafts were detected in the Kauron asteroid field by Luke Skywalker and Mara Jade and later in the Nosken system by the Errant Venture. Jade was eventually able to triangulate the location of Nirauan from the ships' vectors and followed them back to there with the Starry Ice."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Mara Jade's mission"}, {"tag": "p", "text": "Jade journeyed to the Hand of Thrawn complex on Nirauan, losing contact with the Starry Ice after setting down on the planet in a Defender starfighter. While exploring the area near the fortress, she fell and knocked herself out on a rock. Her absence and failure to report in caused the second-in-command, Faughn, to head out on the Starry Ice to seek help, leaving her stranded there."}, {"tag": "p", "text": "Faughn reported to Talon Karrde, who was with Luke Skywalker at the time. The Jedi agreed to go to Nirauan to rescue her, bringing her Jade's Fire and his X-wing to the remote planet."}, {"tag": "h3", "text": "Infiltrating the Hand of Thrawn"}, {"tag": "p", "text": "Fifteen days after, Luke Skywalker finally reached the cave Mara Jade had been hiding in, surrounded by the local Qom Jha who had carried her there when she had fallen unconscious. The two were able to convince the aliens to help them get into the fortress, via a series of underground passages. The layered cortosis in the walls near the tunnel entrance, along with semi-sentient predators and fire creepers, slowed them down, but they were able to penetrate the fortress."}, {"tag": "p", "text": "Along with their native guides and R2-D2, they explored the lower levels, but stopped after Chiss gunmen opened fire on them, injuring Jade in the shoulder. Skywalker helped her out back into the caves, where he put her into a Jedi healing trance. However, when she awoke, Skywalker and Jade entered the fortress again."}, {"tag": "p", "text": "The two Jedi split up to explore the fortress and Mara Jade encountered a group of ysalamiri and the leaders of the fortress, Admiral Voss Parck and General Soontir Fel. Parck gave her the true story of Thrawn's mission and history, while trying to recruit her into the Empire of the Hand. He also informed her of numerous threats in the Unknown Regions, which the Empire of the Hand was supposed to guard against. When she refused and they became aware of Skywalker's presence, they decided to keep the two Jedi prisoner by forcing them into hibernation trances, namely by inflicting non-lethal wounds on Jade with a charric. She attempted to avert being shot, but Parck was unconvinced. Fortunately, Skywalker intervened by cutting through the wall. Parck ordered his troops to stand down to prevent unnecessary slaughter, and the two escaped, pursued by Chiss troops once they were clear of the officers. Arriving in the fortress hangar, they disabled the clawcraft there, taking one for their escape."}, {"tag": "h3", "text": "Return to the fortress"}, {"tag": "p", "text": "Admiral Parck had also revealed to Jade that Thrawn had anticipated his return ten years after his declared death. Ignoring that Thrawn's return was a manipulation organized by Moff Disra, Parck had decided to send an emissary to Bastion, the Imperial Remnant's capital, and finally reveal their existence to rally the Imperial Remnant. Outside the fortress, the two Jedi realized they can't let the Empire of the Hand turn its considerable territory and resources over to the Imperial Remnant. A great sacrifice for her, Mara jade used a beckon call to crash her ship, Jade's Fire, into the hangar, destroying all crafts and preventing him from sending anything to Bastion."}, {"tag": "p", "text": "Sneaking in through a second passageway shown to them by their Qom Jha and Qom Qae guides, Skywalker and Jade entered a different part of the fortress, that time discovering Thrawn's secret cloning chamber and encountering an unripe clone of Thrawn. However, two guard droids, layered with cortosis armor, attacked them on a floor laced with rope snares. Fighting back to back, the two joined minds to battle the droids in perfect coordination, though they had little chance of defeating the two droids. However, R2-D2 distracted one of the droids long enough for the two to cut through the wall, letting water from a lake on the other side of the wall into the room, and in the confusion from the flood, Skywalker destroyed the two droids. Realizing that the water had trapped them inside, Skywalker confessed his love to Jade and asked her to marry him. She accepted."}, {"tag": "p", "text": "Skywalker then realized that letting water into the fusion generator into the cloning chamber would create a blast big enough to blow through the wall. Jade, however, actually made the cut, as she had more experience with the type of technique needed, a Paparak cross-cut. As the water roared through the newly created outlet, Skywalker put her in a hibernation trance and they both flew through the water unconscious. The explosion killed the clone but the Jedi managed to escape. With the aid of the alien natives, Mara Jade and Luke Skywalker left the Hand of Thrawn and boarded the stolen clawcraft to leave the planet. As an added bonus, R2-D2 had picked up Thrawn's copy of the Caamas Document while in the fortress, which they took back to resolve the conflict that had broken out over Bothawui."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following Luke Skywalker and Mara Jade's intervention, the Hand of Thrawn was attacked and looted by the Cavrilhu Pirates who were involved in some skirmishes with the Jedi and had followed them to Nirauan. Due to the destruction of their defenses by the Jedi, the personnel of the base were forced to evacuate. Fearing that the pirates could have obtained information about the secret Chiss installations in the ruins, Commander Stent went to the Syndic Mitth'raw'nuruodo training academy in the Rata Nebula to prevent a pirate attack."}, {"tag": "p", "text": "Fortunately for Admiral Parck, the false Thrawn was eventually exposed before Parck could make contact with the Imperial Remnant, keeping knowledge of the Empire of the Hand and its vast resources limited to Luke Skywalker and Mara Jade."}, {"tag": "p", "text": "These events were the occasion for Luke Skywalker and Mara Jade to spend some time together and accept their feelings. They get married three months later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}