{"url": "Mission_to_Oba_Diah_(Clone_Wars)", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Battles in the Kessel sector", "Category:Duels", "Category:Events during the Clone Wars", "Category:Jedi missions", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Mission to Oba Diah  (Clone Wars)"}, {"tag": "p", "text": "During the Clone Wars, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker undertook a mission to the planet Oba Diah to investigate the Pyke Syndicate and what they may have known about the years-old death of Jedi Master Sifo-Dyas, the man who ordered the clone troopers from the Kaminoans for the Galactic Republic. On the mission, they discovered that the Pykes had killed Sifo-Dyas at the behest of the Sith. Separatist Head of State Count Dooku, the Sith apprentice of Darth Sidious, arrived on Oba Diah as well and engaged in lightsaber combat with the Jedi. During the duel, the Jedi learned that Dooku was in fact the man named Tyranus who selected Jango Fett as the clone template, and that the Sith had been involved in the creation of the clone army."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Machinations of the Sith"}, {"tag": "p", "text": "Sometime prior to the Trade Federation's invasion of the planet Naboo, the Jedi Master Sifo-Dyas, a member of the Jedi High Council, had visions of a coming war which led him to believe the Jedi Order would need an army. The other High Councillors, judging his views too extreme, removed him from the Council. Undaunted, Sifo-Dyas secretly travelled to the remote world of Kamino, whose native species were skilled cloners, discussing with them the possibility of ordering a clone army. However, the Sith found out about Sifo-Dyas' plans through the Jedi Master's old friend Dooku, a former Jedi who had secretly fallen to the dark side of the Force and become the Sith Lord Darth Tyranus, and decided to take over the project, as part of their long-term plans to destroy the Jedi."}, {"tag": "p", "text": "Not long after his visit to Kamino, Sifo-Dyas was asked by Supreme Chancellor Finis Valorum to secretly negotiate with the Pyke Syndicate in order to avert a war in the criminal underground over the spice trade. Valorum sent his personal aide, Silman, to accompany the Jedi Master to the Pykes' stronghold on the planet Oba Diah. However, before negotiations could begin, the Jedi Council, unaware that Sifo-Dyas had been sent to Oba Diah, ordered him to Felucia to settle a tribal dispute there. Intending to return, Sifo-Dyas and Silman departed Oba Diah in their T-6 shuttle. The Pykes, however, had been approached by Tyranus, who paid them well to shoot down Sifo-Dyas' starship, a job they accepted as it would give them an advantage over other crime families. The shuttle crashed into Oba Diah's moon, with Sifo-Dyas dying in the crash. Silman, however, survived. The Pykes gave the Jedi's body to Tyranus, but secretly imprisoned Silman in their dungeon as potential leverage, knowing that anyone who paid to have a Jedi killed was dangerous. Tyranus took Sifo-Dyas' corpse to Felucia and made it appear that the tribes there had killed him, concealing the true circumstances of his death from the Jedi Order."}, {"tag": "p", "text": "Tyranus, posing as Sifo-Dyas' representative to the Kaminoans, hired bounty hunter Jango Fett to serve as the clone template, and also had the clone troopers secretly engineered to kill the Jedi when commanded, deceiving the Kaminoans into believing this was a mere contingency in the case of rogue Jedi that the Order in general did not need to know about."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "A decade after the Invasion of Naboo, which had led to Sheev Palpatine becoming Supreme Chancellor, the Galactic Republic was in the midst of a serious political crisis, as thousands of star systems had seceded to form the Confederacy of Independent Systems, led by none other than the former Jedi Master Count Dooku. In the midst of this crisis, which the Jedi were hoping would not lead to a full-scale war, Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker were set to protect Senator Padmé Amidala, who was being targeted for assassination. After a failed attempt by the bounty hunter Zam Wesell that led to her being killed by a toxic dart, a trail of clues led Kenobi to Kamino, which had been mysteriously erased from the Jedi Archives. There, Kenobi discovered the clone army. The Clone Wars officially broke out shortly thereafter at the First Battle of Geonosis, with Chancellor Palpatine commissioning the clones as the Grand Army of the Republic. Unbeknownst to the Jedi, however, Palpatine was secretly Darth Sidious, the Dark Lord of the Sith and Dooku's Sith Master, and the two Sith Lords were controlling both sides of the war with the goals of destroying the Jedi and transforming the Republic into an Empire."}, {"tag": "p", "text": "Several years into the conflict, the wreckage of Jedi T-6 shuttle 775519, which had been left where it crashed on Oba Diah's moon, began emitting a distress signal that was picked up by the Republic. Jedi General Plo Koon and the 104th Battalion were sent to investigate. Upon locating the wreckage, Plo discovered Sifo-Dyas' lightsaber at the scene, which led him to order everything packed up for transport to Coruscant. Kenobi and Skywalker, by then a Jedi Master and Knight, respectively, were sent to Felucia to question the tribal leaders, but Kenobi could not understand them well due to their archaic dialect, eventually learning that there had apparently been another Jedi with Sifo-Dyas, and his body had been cremated after his death. Finding that Sifo-Dyas' file had been sealed by the office of the Chancellor, Jedi Grand Master Yoda asked Palpatine if he knew anything, but the Chancellor professed ignorance and suggested that the file must have been sealed on Valorum's orders. Speaking with Valorum, Yoda learned of Sifo-Dyas' secret mission to Oba Diah, and that he had only been accompanied by the aide Silman. Needing more answers, Kenobi and Skywalker were dispatched to Oba Diah to speak with the Pyke Syndicate in the hopes of finding answers to Sifo-Dyas' fate."}, {"tag": "p", "text": "Sidious, angered that Dooku had clearly left enough loose ends for the Jedi to be investigating the matter, contacted his apprentice on Serenno and ordered him to deal with the matter, punctuating his orders with a Force choke over the holographic transmission to make his displeasure clear."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Upon their arrival on Oba Diah in an Eta-class shuttle, Kenobi and Skywalker were met by Pyke guards who escorted them to an audience with the Syndicate's leader, Minister Lom Pyke. The pair asked Lom if he had any knowledge of Sifo-Dyas and Silman's visit, but the Pyke denied it, only saying that the two had been there. Skywalker, however, noticed that Lom was wearing a necklace he had seen Silman wearing in a file image, inscribed with Valorum's seal of office, and seized it with the Force. Confronted with this evidence, Lom admitted that Silman had, in fact, been present. Leading the Jedi into the Pykes' dungeons, Lom recounted how the syndicate had been hired to kill Sifo-Dyas by Tyranus, a name Kenobi recognized from Fett, who had mentioned it when he met the bounty hunter on Kamino. Lom explained that Silman still lived, and brought Kenobi and Skywalker to the cell in which he had been kept for the intervening years, hoping that his cooperation would mean the Jedi would forget the Pykes' involvement in Sifo-Dyas' death."}, {"tag": "p", "text": "Kenobi and Skywalker entered Silman's cell to question the former Chancellor's aide. However, Silman had lost his mind during his years of imprisonment, speaking to the vermin in his cell as though they were people and believing his cell was his home. He was initially frightened of his visitors, but eventually asked them if they had any food. After Skywalker gave him a ration bar, Silman used it to feed the vermin. Kenobi and Skywalker attempted to get any details at all about Sifo-Dyas' death and the reasons for it from the sick man, and eventually learned, in what fashion Silman was able to recount, that Sifo-Dyas had been murdered because someone wanted to \"be\" the late Jedi Master. While the questioning was going on, Dooku arrived on Oba Diah in his Punworcca 116-class interstellar sloop. Met by two guards who asserted that Tyranus had no more business with the Pykes, he Force-threw them to their deaths off the landing platform before proceeding inside. Dooku arrived at Silman's cell just as Kenobi was attempting to discern who exactly had wanted to impersonate Sifo-Dyas and promptly Force-choked the aide to death. However, the murder and Dooku's presence gave the Jedi the answer they sought anyways, Skywalker commenting that the Count had actually come to do his own \"dirty work\" for once."}, {"tag": "p", "text": "Kenobi and Skywalker engaged Dooku in a lightsaber duel, which took them from the Pyke Palace detention level to an exposed area on the side of the building. While the trio were fighting, Minister Lom arrived with a force of guards. Upon seeing Dooku, Lom addressed him as Tyranus — the only name by which he knew the Sith Lord — when stating the Count had no further business with the Pyke Syndicate. Kenobi was shocked to learn that Dooku was the mysterious Tyranus, and shouted to Lom that if he was going to help, he had best do it now. Lom ordered his men to kill Tyranus, and Kenobi and Skywalker attempted to Force push Dooku towards the Pyke guards. However, Dooku jumped out of the way, leading the Pykes to be knocked over instead, before running Lom through on his lightsaber. Dooku was forced to defend himself from Pyke reinforcements that arrived, before Kenobi and Skywalker engaged him again. Eventually, Dooku managed to gain the upper hand, covertly summoning his ship. As the two Jedi confronted him again, Dooku stated that Sifo-Dyas had known the future, which was why he had helped him, but Kenobi dismissed this as a lie. Dooku claimed that he had told Kenobi everything he needed to know on Geonosis before the war had began, before dropping off the platform to land on an ascending Coruscant Freighter. Kenobi Force-threw Skywalker after the escaping Dooku, and the two dueled atop the starship. However, Dooku's own ship arrived, and the Sith Lord damaged the freighter's engine before leaping to his own ship. Dooku mockingly saluted the Jedi before escaping. Skywalker was left dangling by one hand from the damaged freighter, frustrated."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Jedi Council was left with the news that the Sith had been involved in the clone army's creation, and questions as to why this had been done. With Master Yoda testifying to the clones' loyalty and valiant service, the Council chose to keep the revelation secret from the Chancellor and the Galactic Senate, fearing that the news would make the public lose confidence in the war effort. Skywalker was not pleased with the decision, but he grudgingly went along with it. The Jedi never connected the Sith's involvement in the clones' creation with the biological inhibitor chips implanted in the clones, supposedly there to keep them mentally stable and curb their aggression, which had been discovered to be present after the clone trooper Tup's chip malfunctioned during the Battle of Ringo Vinda, leading him to kill Jedi General Tiplar. The incident had led ARC trooper Fives to investigate and uncover the chips, but he was eventually discredited and killed thanks to Palpatine's machinations, never being able to prove his claims about the danger of the chips to the Jedi. The official story was that both clones' chips had malfunctioned due to a rare Ringo Vindan parasite."}, {"tag": "p", "text": "After the revelations from Oba Diah, Yoda went on a vision quest to discern the future after encountering the Force spirit of Jedi Master Qui-Gon Jinn. Yoda saw visions of the still-mysterious Sidious and the downfall of the Jedi Order, and came to believe that the Jedi would lose the war, though he did not know how. However, he believed that the light side of the Force would prevail in the end."}, {"tag": "p", "text": "At the end of the Clone Wars, Palpatine, having disposed of Dooku as he no longer needed him, executed his plot by ordering the clones to carry out Order 66, which killed the majority of the Jedi, sending the galaxy into a period known as the dark times. Yoda and Kenobi survived the first wave of the Great Jedi Purge, but Skywalker fell to the dark side thanks to Palpatine's manipulations, becoming the Sith Lord Darth Vader. After confronting Vader and Palpatine, Kenobi and Yoda went into hiding, after ensuring that the newborn Skywalker twins were hidden as well. Yoda informed Kenobi that the Force spirit of Jinn would be communing with him so that he too could learn to preserve his spirit after death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Oba Diah first appeared in \"The Lost One,\" an episode of season 6 of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}