{"url": "Mission_to_Ord_Mantell_(0_ABY)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Ord Mantell  (0 ABY)"}, {"tag": "p", "text": "The Mission to Ord Mantell took place during the Yavin blockade."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Mission to Jarnollen, the Millennium Falcon was damaged and its crew forced to go to Ord Mantell in order to repair the ship."}, {"tag": "h2", "text": "On Ord Mantell"}, {"tag": "p", "text": "After the reparation of the Millennium Falcon, the bounty hunters Skorr and Gribbet discovered the presence of Han Solo in Worlport and decided to capture him and earn the bounty placed on his head by Jabba Desilijic Tiure."}, {"tag": "p", "text": "At night, they captured Luke Skywalker and Leia Organa and proposed Solo to exchange them. They hope to capture Han Solo during the exchange. The exchange was done in the Stellar-energy station atop the Ten Mile Plateau. Eventually, they were rescued by Chewbacca in a cargo flyer."}, {"tag": "h2", "text": "In space"}, {"tag": "p", "text": "The rebels escaped the planet with the Millennium Falcon. In the Bright Jewel system, they were caught between an Imperial fleet on maneuvers and Skorr's starship. Eventually, the rebels manage to lure the Imperials and the bounty hunters were captured by an Imperial I-class Star Destroyer."}, {"tag": "p", "text": "After that, Darth Vader arrived in his TIE Advanced x1 and attacked the Millennium Falcon but the rebels managed to escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The rebels left the system and joined Yavin 4. The two bounty hunters were sent to the Spice Mines of Kessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This story was created by Archie Goodwin from a line Han Solo said at the beginning of The Empire Strikes Back: ...the bounty hunter we ran into on Ord Mantell changed my mind."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}