{"url": "Mission_to_Parnassos", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Battles in the Unknown Regions", "Category:Missions", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Mission to Parnassos"}, {"tag": "p", "text": "After Phasma's brother and clan leader Keldo refused to help General Hux, Phasma and her most trusted warriors left the Scyre territory and traveled with Hux and his stormtroopers. During the journey, the group encountered venomous gold beetles, a raiding party, dangerous skinwolves, and self-aware Con Star droids.They were also briefly captured by Arratu forces but escaped after Phasma killed the ruling Arratu. Phasma and Hux's party eventually reached the \"dead lands\" where Hux's ship had crashed but were pursued by Keldo, who was now commanding the combined Scyre and Claw forces."}, {"tag": "p", "text": "Phasma, her warriors, and Hux's stormtroopers managed to wipe out the opposing forces despite sustaining heavy casualties. Meanwhile, Hux managed to summon a rescue mission from the First Order. When the First Order arrived, Phasma and the youngest Scyre child Frey accompanied General Hux. However, Phasma barred Siv from following them for refusing an order to kill the gladiatorial warrior Wranderous. Before leaving Parnassos, General Hux destroyed the Scyre territory and Arratu Station as a demonstration of the First Order's power."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A hundred years before the New Republic Era, the planet Parnassos was a lush, mining colony controlled by the Con Star Mining Corporation. Following a nuclear disaster, Con Star abandoned the planet and its colonists, erasing most records of the planet. As the planet's environment deteriorated, society on Parnassos degenerated into a barbaric and primitive state. The planet was also cut off by a still functioning automated defense system, which shot down many approaching ships."}, {"tag": "p", "text": "Around 24 ABY, the First Order General Brendol Hux embarked on a campaign to recruit warriors for the First Order, a remnant of the \"Old Empire\". Hux was a former Commandant at the Arkanis Academy who became the architect of the First Order's stormtrooper training program. The First Order sought to overthrow the New Republic, which it regarded as an illegitimate regime created by the Rebel Alliance."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "A crash-landing"}, {"tag": "p", "text": "While traveling to the purportedly uninhabited world of Parnassos, General Hux's ship was shot down by Parnassos' still functioning automated defense system. While the crew were killed, Hux and his stormtroopers managed to escape in two escape pods. Hux, his black metal droid and three stormtroopers PT-2445 (\"Pete\"), LE-2003 (\"Elli\"), and HF-0518 (\"Huff\") landed in their escape pod in the Claw territory, the home of the Claw clan led by the Dug Balder. Hux lost contact with the second escape pod, which carried four stormtroopers."}, {"tag": "p", "text": "Hux and his troopers were captured by Balder, who brought them back to his people. At the Claw plateau, Hux told the Claws that he and his soldiers needed help in returning to their ship and promised them a life of comfort and plenty in return. Phasma, the military leader of the Scyre clan and a rival of Balder, offered her services. Balder objected to Phasma's presence and Phasma stabbed him to death, provoking a fight between the Claws and the Scyre warriors. Phasma convinced Hux and his men to follow her and her warriors back to the Scyre stronghold Nautilus. Hux's droid was destroyed during the skirmish but Phasma managed to recover one of its legs."}, {"tag": "p", "text": "During the journey back, Phasma gained Hux's trust. In return, Hux told her about the First Order and its goal of \"restoring order\" to the galaxy. Phasma tried to convince her older brother Keldo, the leader of the Scyre clan, to send warriors to help accompany Hux and his men back to their ship in return for riches and glory. However, Keldo was angry that Phasma had broken their truce with the Claws and refused to sanction the mission."}, {"tag": "p", "text": "In response, Phasma and her four most loyal warriors Siv, Torbin, Gosta, and Carr departed that night with Hux and his men. They also brought several supplies including the clan's two detraxor units, machines capable of harvesting nutrients from the bodies of the diseased and converting it into a nutritious past."}, {"tag": "h3", "text": "A dangerous journey"}, {"tag": "p", "text": "Embarking on their journey, Phasma led the group away from the coastal region to a high mountain. Following a long, arduous climb, the group finally reached their landmass' surface, which was covered by a wide, sandy desert. Carr was bitten in the hand by a venomous gold beetle. Over the next few days, his condition deteriorated and he swelled up before bursting and disintegrating; leaving behind water, blood, bones, and viscera. Parnassos beetles then feasted on his remains."}, {"tag": "p", "text": "While traveling through the desert, the group was also attacked by marauders riding sleds drawn by large lizards. The Scyre and Hux's stormtroopers managed to defeat and kill the attackers. Phasma's warriors used their detraxors to extract nutrients from the bodies of the fallen. Later, the group was also attacked by a pack of skinwolves. Brendol was wounded in the arm and became ill. While making camp that night, the group encountered a Con Star protocol droid called TB-3."}, {"tag": "h3", "text": "Detour at Terpsichore Station"}, {"tag": "p", "text": "Believing that the travelers were Con Star employees, TB-3 led the group to Terpsichore Station, Con Star's former primary mining facility on Parnassos. TB-3 arranged for the feverish Brendol to be treated in the Station's advanced medbay. Unable to pay for Brendol's medical bills since they lacked the credits to do so, Phasma and the others reluctantly agreed to work for sixty days as indentured miners at the Terpsichore Station mines."}, {"tag": "p", "text": "At Phasma's prompting, the group tried to disable their mining supervisor D473 but they were knocked out by sleeping gas. When they awoke, Phasma and the other prisoners accepted TB-3's orders to work in the mines. Phasma also befriended the stormtroopers and they reached an agreement to obey the droids until Brendol had recovered and devised an escape plan. As Brendol recovered, Phasma briefed him about their predicament. Brendol came up with a plan to disable the control room in order to disable the station's 47 droids."}, {"tag": "p", "text": "After two work shifts, Phasma's warriors and Hux's stormtroopers managed to infiltrate the control room and disable the droids. Brendol attributed the droid's behavior to a lack of maintenance for at least 186 years. The group then salvaged Terpsichore Station for supplies before leaving in a Ground assault vehicle and three speeder bikes. With little sense of direction, Phasma convinced the group to travel towards a settlement in the distance."}, {"tag": "h3", "text": "Prisoners of the Arratu"}, {"tag": "p", "text": "As they approached the settlement, Phasma and her companions saw that it was dominated by a tall tower. This settlement turned out to be Arratu Station, a former Con Star fabrication plant. As they approached Arratu, they found their path blocked by a ditch full of pikes. One of the stormtroopers Elli crashed her bike into a ditch and sustained a broken neck. The group was soon ambushed and captured by several armed warriors in ground assault vehicles calling themselves the \"Arratu.\""}, {"tag": "p", "text": "Phasma and the others were brought into Arratu Station, which had evolved into a city where a wealthy elite ruled over the starving masses. The group were thrown into a prison inhabited by starving prisoners. There, they met an elderly man named Vrod, who held the title of guardian. He informed the group that the city's ruler, the Arratu, staged gladiatorial fights using the prisoners in order to keep the starving masses amused. Lacking the means to treat Elli, Hux made the decision to abandon her and allowed Phasma to don her stormtrooper armor."}, {"tag": "p", "text": "The following day, Phasma and Torben were forced to fight a prisoner named Wranderous for the amusement of the crowd and the Arratu. After that fight, Phasma and her companions were forced to fight a pack of skinwolves but managed to kill them. Their exploits impressed the Arratu who gave them more comfortable quarters and food."}, {"tag": "p", "text": "On the second day, Phasma, Torben, and Siv fought against Wranderous. Working together, they managed to fatally wound him. However, Siv disobeyed Phasma's orders to kill the enemy warrior. Using Torben as a jumping board, Phasma then leapt into the Arratu's box and killed the ruler and four of his bodyguards. Phasma's actions drew the cheers of the crowd but created a leadership vacuum."}, {"tag": "p", "text": "The guardian Vrod begged Phasma to assume leadership of Arratu but Phasma and Hux were not interested. After killing Vrod, the group fought their way out of Arratu and escaped on three ground assault vehicles into the desert."}, {"tag": "h3", "text": "Into the \"dead lands\""}, {"tag": "p", "text": "Following their escape, Hux and Phasma's group rested for the night. In the morning, Brendol chastised Phasma for their mistaken decision to travel towards Arratu. Seeing that Phasma had potential as a leader and trainer, Hux counseled her to submit to her superior's orders. Phasma agreed since she viewed Hux as her ticket offworld."}, {"tag": "p", "text": "Continuing their journey, the group encountered a Gand named Churkk, who was completely covered with gold beetles. Churkk warned the travelers not to cross the fence into the \"dead lands\", which were contaminated with radioactive waste. Shortly later, a vengeful Keldo arrived with the combined Scyre and Claw forces."}, {"tag": "p", "text": "Abandoning their vehicles, the travelers fled through a hole in the fence. Under Brendol's orders, the stormtroopers Pete and Huff blew up the vehicles with their blasters to prevent the enemy forces from using them. The wounded Gosta was stuck in the fence and Phasma and the others were forced to abandon her. The stormtroopers then opened fire on the advancing Scyre and Claw forces. Gosta and Churkk were killed in the crossfire along with numerous Scyre and Claws. Beetles then feasted on the bodies of the dead and wounded."}, {"tag": "p", "text": "Venturing into the \"dead lands\", Brendol and Phasma's party took refuge in an abandoned amusement park. Following a long journey, the group reached the wreckage of Brendol's ship.They also encountered an abandoned Con Star power plant, which had been destroyed during a nuclear accident which triggered the devastation of Parnassos."}, {"tag": "h3", "text": "Letting the past die"}, {"tag": "p", "text": "While Brendol entered the wrecked ship to call the First Order for help, Phasma's remaining warriors and the stormtroopers formed a defensive perimeter. Keldo and his forces soon arrived and a skirmish ensued. During the skirmish, Siv killed Ylva, the mother of Frey, the sole child in Scyre clan. Torben was also killed by his own brother, who in turn was killed by Siv. Pete and Huff were also slain in combat."}, {"tag": "p", "text": "In the end, Phasma was left facing her estranged brother Keldo. Keldo blamed Phasma for destroying their peace but Phasma chastised him for throwing away his opportunity to save their people. Realizing Phasma was right, Keldo begged for Phasma to call on the First Order for help as he began to succumb to the effects of radiation poisoning. Ignoring his pleas, Phasma shot him dead."}, {"tag": "p", "text": "However, Phasma spared Frey, believing that the six-year old girl would make a good warrior for the First Order. Several hours later, a First Order Resurgent Star Destroyer arrived with an Atmospheric Assault Lander. Phasma, Brendol, Siv, and Frey were greeted by Brendol's son Armitage Hux and a contingent of stormtroopers."}, {"tag": "p", "text": "Brendol permitted Phasma and Frey to join them but barred Siv, deeming her too far gone and soft. Siv appealed to Phasma but Phasma spurned her for disobeying her order to kill Wranderous. Before leaving, Phasma told Siv that there was another station nearby stocked with medical supplies. Phasma then left with Brendol and Frey aboard the troop transport."}, {"tag": "p", "text": "While ascending into space, Phasma and Frey watched their homeworld of Parnassos for the first time from orbit. As a demonstration of the First Order's power, Brendol used the shuttle's laser cannons to bomb Arratu Station and the Scyre territory from orbit, destroying these locations and killing numerous people. Phasma was grief-stricken and horrified but maintained her composure."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite the high casualties incurred during the course of the mission to Parnassos, General Hux succeeded in recruiting Phasma and Frey into the First Order. Phasma would eventually rise to the rank of Captain and was placed in charged of half of the First Order's stormtrooper training program, focusing on the older teenagers and adults. Frey became a stormtrooper cadet with the designation UV-885."}, {"tag": "p", "text": "As Phasma rose through the ranks of the First Order, she conspired with Brendol's son Armitage to murder his own father and her benefactor. He poisoned her with a Parnassos beetle, resulting in his death. Phasma also killed her kinswoman Frey during a suspicious training accident in order to eliminate anyone who knew her past or who could recognize the symptoms of a Parnassos beetle bite. Phasma succeeded in covering her tracks and rose to be a hero in the First Order's propaganda output."}, {"tag": "p", "text": "Unknown to Phasma, Siv managed to reach Calliope Station and survived. She later gave birth to a child named Torbi. Ten years after the events of the Parnassos mission, Siv met the Resistance spy Vi Moradi and revealed the story behind Phasma's origins. Vi was later captured by the stormtrooper Captain Cardinal, who was a rival of Phasma. Seeking to eliminate Phasma, Cardinal pressed Vi for incriminating information about Phasma."}, {"tag": "p", "text": "Vi revealed Phasma's origins and her role in the destruction of her own clan and Brendol's assassination. After learning that Armitage was complicit in Brendol's murder, Cardinal attempted to exact vengeance against Phasma. However, he was defeated in combat by Phasma, who stabbed him with a poisoned blade. Cardinal, however, was rescued by Vi, who helped him escape the Resurgent Star Destroyer Absolution."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}