{"url": "Mission_to_Phelarion", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Battles in the Seswenna sector", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Phelarion"}, {"tag": "p", "text": "In 1 ABY, Alderaanian Princess Leia Organa was dispatched on a reconnaissance mission to Phelarion for the Alliance to Restore the Republic. Unfortunately, her ship was picked up by an Imperial-class Star Destroyer commanded by Lord Darth Vader, and a TIE fighter pilot identified by the call-sign of ZG-35 was dispatched to disable the vessel. Leia's copilot and fellow Rebel agent, Hume, anticipating that they will not be able to escape capture, knocked Leia out before placing her on a gossamer glider, and then sacrificed himself by blowing up the vessel."}, {"tag": "p", "text": "Afterwards, she was then recruited as a servant for Lady Thalassa Tarkin, the widow of Grand Moff Wilhuff Tarkin, who had perished at the Battle of Yavin, adopting a false identity of Lerna, and was likewise tasked with helping organize the Thirteenth Imperial Diplomatic Conclave. While undercover, she tried to hide traces of her true affiliation to the Rebel Alliance long enough to send a distress signal to the Rebel Alliance requesting for her rescue. She eventually managed to accomplish this, also killing one of the servants Nardo and covering it up as an accident. Unfortunately, the transmission was also intercepted by Vader's Star Destroyer, prompting Vader to make an unexpected visit to the Diplomatic Conclave."}, {"tag": "p", "text": "Two of the servants, Sparv and Calus later discovered the wreck of Leia's gossamer glider, and also killed a stormtrooper that discovered it to silence him. Afterwards, they dragged Leia out of the Diplomatic Conclave, as they realized that her disguise as \"Lerna\" was nearly uncovered. Upon spiriting her away, Vader deduced that \"Lerna\" was actually Leia and had his soldiers pursue after her. Using the mines for the Megonite moss as a means to temporarily deter the pursuing Imperial forces, they eventually reached a docking bay, and after a firefight, were picked up by Han Solo with the Millennium Falcon."}, {"tag": "h2", "text": "Appearances"}]}