{"url": "Mission_to_Prefsbelt_IV", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Articles with gameplay alternatives", "Category:Battles in the Prefsbelt sector", "Category:Missions of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Mission to Prefsbelt IV"}, {"tag": "p", "text": "The Mission on Prefsbelt IV took place when the Rebel pilot Wedge Antilles, coordinated by General Madine, attempted to reclaim the Imperial shuttle Tydirium. Antilles infiltrated the Academy through the southern mountain pass and avoided detection by the Sensor Outposts. He then docked with the shuttle and took off toward the rendezvous point. After his escort arrived, he escaped."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Rebel Alliance required an Imperial shuttle to deliver a commando team on the moon of Endor. In 4 ABY, Rebel pilot Ace Azzameen managed to capture the Lambda-class shuttle Tydirium from Outpost 327 during the Mission to Zhar, but the Galactic Empire managed to recapture the shuttle soon after, and had it transferred to Prefsbelt IV."}, {"tag": "p", "text": "General Crix Madine sent Rogue Leader Wedge Antilles to the Imperial Naval Academy on Prefsbelt IV to steal the Tydirium for Rebel use."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "Madine ordered Wedge Antilles to approach from the south through the mountain pass, and told him the shuttle was parked at the northern Academy platform. Madine also cautioned him to avoid the Sensor Outposts. Antilles was able to avoid detection by the eight sensors and moved into the next section of the Academy."}, {"tag": "p", "text": "He then abandoned his starfighter to steal a TIE/LN starfighter after eliminating the pilot. Antilles then infiltrated the Academy. He then proceeded to the Academy, passing the landing platforms and other installations and the AT-ST defenses. Near the Academy, he strafed the rows of TIE starfighters and the gun turrets, revealing his presence. He also flew through one of the other landing pads and acquired a vehicular upgrade."}, {"tag": "p", "text": "The Academy staff announced that the Academy would go on lockdown in four minutes, and the fighters were deployed. Antilles knocked out the four turrets guarding the shuttle, docked on the landing pad, and transferred to the Tydirium."}, {"tag": "p", "text": "Pursued by TIE fighters and interceptors, he flew toward the rendezvous point, where three pursuing fighters were eliminated by Antilles' newly arrived escorts, two pilots from Rogue Squadron. Together they escaped the Academy."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Some time after the mission, Rogue Squadron joined in a raid on the tibanna gas storage on Bespin. Alliance General Han Solo was able to use the Tydirium to infiltrate the Endor system along with his commandos, prompting the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There were 2 versions of the mission in the 2001 video game Star Wars: Rogue Squadron II: Rogue Leader; night and day, depending on the GameCube's clock. During the night, you pilot a Speeder and during the day, a Y-wing."}, {"tag": "p", "text": "As there are two versions, this article incorporates only the information which appears in both missions, without specifying which version is official. If the player fails to capture the shuttle before the lockdown goes into effect, the shuttle will be lowered into the landing pad and the mission will fail. There are separate vehicle upgrades available in either version. For the daytime version, the player can acquire Advanced concussion missiles. The nighttime mission has the player acquiring Advanced spread proton bombs instead. This article assumes the player picked it up during the mission."}, {"tag": "p", "text": "In the co-op campaign included in Star Wars: Rogue Squadron III: Rebel Strike, both players have to board the Tydirium before the player can use it. The first player is relegated to the pilot cockpit, whereas the second player will use its aft gun to shake off the pursuing TIEs."}, {"tag": "p", "text": "The player may unlock the TIE fighter by capturing it in both versions, and there are separate upgrades to be found in the versions. This article assumes the player captures the TIE fighter as part of the infiltration. In the day version, the player must hit the TIE with the ion cannon, and in the night version, the player must shoot the pilot near an Imperial outpost. The player may choose to not capture the TIE fighter and continue in their starfighter. The player may also destroy any Imperial target as long as they destroy the four turrets guarding the shuttle. The player can also maintain cover up until they reach the loading platform for the Tydirium, with Wedge noting upon arrival that he can't steal the shuttle while the turrets surrounding the loading platform are still active. The strategy guide recommends that the player conduct several pre-emptive attacks beforehand in order to gain a medal for the mission, and suggests using the Y-wing to do the attacks rather than the TIE fighter. The strategy guide also recommends that the player head straight to the rendezvous point, and this article follows that recommendation."}, {"tag": "p", "text": "Madine's opening dialogue is slightly different in each version. If the player steals the TIE fighter at night, there is a separate cutscene where Antilles picks up his speeder's gunner. \"I've found him. We're on our way\" is Antilles' alternate dialogue. There is no dialogue at the end of the day mission."}, {"tag": "p", "text": "The capture of the Tydirium was also featured in the 1999 video game Star Wars: X-Wing Alliance, where it was stolen from an Imperial station by Ace Azzameen. The 2007 reference book Star Wars: Complete Cross-Sections attempted to reconcile the sources by saying that Antilles stole the shuttle while Azzameen acquired codes. Leland Chee, the Keeper of Lucasfilm Ltd.'s Holocron continuity database, has stated that both thefts of the Tydirium occurred, and that the X-wing Alliance mission happened first."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}