{"url": "Mission_to_Radnor", "categories": ["Category:Legends articles", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Mission to Radnor"}, {"tag": "p", "text": "The Mission to Radnor took place in 27 BBY."}, {"tag": "p", "text": "Following an accidental leak of deadly toxins into the atmosphere of the planet Radnor, the Jedi Council (at the request of the Galactic Senate) sent four Jedi―Obi-Wan Kenobi, Siri Tachi, Soara Antana, Ry-Gaul, and their Padawans (Anakin Skywalker, Ferus Olin, Darra Thel-Tanis, and Tru Veld, respectively)―to aid in the evacuation of the surviving populace from the Twin Cities, Aubendo and Tacto."}, {"tag": "h2", "text": "The Mission"}, {"tag": "h3", "text": "Arrival on Radnor"}, {"tag": "p", "text": "Once they had landed on Radnor, the group of Jedi met with a Radnoran named Galen, a scientist who was put in charge of the evacuation effort after the government officials and most of the security personnel panicked and fled the planet. One of the many problems Galen introduced the Jedi to was the looting. A band of raiders had managed to steal a small army of prototype battle droids from a research laboratory, and used it as cover while they continued to loot abandoned businesses, residences, and shops. As Galen led the Jedi towards the Isolation Sector, they witnessed the raiders terrorizing a Radnoran family."}, {"tag": "p", "text": "The Jedi quickly stepped in and engaged the looters and their droids in battle. Siri ordered the Padawans to protect the family while the Masters dealt with the battle droids. All of the Padawans, except for Anakin, obeyed her command. Anakin, who felt that the other Padawans could handle the situation without him, decided to assist the Masters in eliminating the droids. Once the raiders began to fall back, he returned to the other Padawans and helped them deflect blaster fire aimed at the Radnoran family. As the Padawans fought off the onslaught, Anakin let his minor jealousy of Ferus begin to annoy him, and the two, from that point on, began to get in each other's way, on each other's nerves, and to set each other off balance. Though the looters managed to escape, the attacking droids were soon defeated."}, {"tag": "h3", "text": "The Isolation Sector"}, {"tag": "p", "text": "As Galen prepared to take the assaulted and injured Radnoran family in a transport for medical care and evacuation, he gave the Jedi directions to the Isolation Sector and presented them with a case of medication, to be dispensed among the afflicted people there, and also the four remaining \"bio-iso\" (biological isolation) suits in his possession, which they would need before passing beyond the energy gate that separated the two sectors. The Masters decided that they, among the Jedi, should be the ones to take the suits and enter the sector to dispense the medication and investigate; the Padawans they directed to stay behind to tend to the needy and the wounded, endeavor to maintain order and calm, and prevent rioting and violence. Galen returned to escort the Jedi Masters to the Isolation Sector after taking the Radnoran family and the Padawans to the med center."}, {"tag": "p", "text": "Upon entering the Isolation Sector, the Masters met Galen's sister, Curi, who was caring for the dying survivors of Aubendo. Curi informed the Jedi that it was her and her brother's fault for the catastrophe, as they were the ones who owned the bio-weapons lab that accidentally leaked the toxin into the air. She also told them that now that they had entered the Isolation Sector, it would be too much of a risk to reenter the Clear Sector. The Jedi were surprised that Galen would have failed to give them such an important piece of information; as a result, Obi-Wan soon contacted Anakin and the other Padawans to tell them of their newly changed situation."}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "The Padawans, now cut off from their Masters for the duration of the mission, were assigned to keep the Clear Sector firmly under control, without bloodshed, through the setting up of safety patrols. Under the advice of Anakin, they decided to search for the raiders who were continuing to terrorize other defenseless Radnorans. To find them, Anakin (with the help of Tru), managed to circumvent the mind wipe of one of the battle droids they had faced and incapacitated earlier. They then followed it back to the raider's hideout. What the Padawans did not expect after they found the raiders' location was that the droid they reactivated suddenly gave off an intruder signal, immediately informing the raiders of their presence. Again the young Jedi faced off with more battle droids. By the time they'd silenced them, however, the raiders were gone."}, {"tag": "p", "text": "The Padawans decided to rethink their strategy, but Anakin and Ferus held different opinions on what the best plan of action should be. Ferus thought the best course of action, for the good of the planet, should be to gather more information, while Anakin felt that seizing the moment to capture the raiders was most important. Ferus pointed out that Anakin, by his own inadvertent admission, simply wanted to impress his Master by showing him that he was capable of handling a complicated mission. Because he knew that Ferus was right, the accusation agitated and angered Anakin even more, further distancing the two Padawans."}, {"tag": "p", "text": "While Anakin investigated on his own, Ferus, Darra, and Tru searched the hideout until Darra found a stash of files detailing the evacuation process. The holographic files were also coded \"ECC,\" marking them as coming from Radnor's emergency command center: someone was providing information access. The raiders, by studying which areas of Tacto were scheduled for evacuation first, had an easy, well-planned strategy. Clearly, someone on the evacuation team was tipping the raiders off, either with bribes or for more sinister reasons."}, {"tag": "h3", "text": "The Avoni Fleet"}, {"tag": "p", "text": "The Masters split up into pairs and patrolled Aubendo. As Obi-Wan and Siri were making their rounds among the dead and dying, Curi met up with them and introduced them to Dol Heep, an ambassador from the nearby planet of Avon who was stranded on Radnor due to the plague. Heep sympathized with the Radnorans and informed the Jedi that his planet was sending a large fleet to transport safely offworld any of Radnor's survivors, despite the fact that the Galactic Senate was already sending transports of their own. The Avoni transports simply awaited orders from the Jedi to proceed."}, {"tag": "p", "text": "After Dol Heep left, Obi-Wan and Siri discussed their doubts about his \"offer.\" After speaking with Curi, who informed them of Radnor's general distrust of the Avoni, the Jedi suspected that Avon intended to use their fleet for a temporary occupation instead of rescue."}, {"tag": "h3", "text": "Questioning Galen"}, {"tag": "p", "text": "After discovering the files from the raiders' hideout, the Padawans traveled to the emergency command center to question Galen. Ferus suggested to his companions, so as to not intimidate or corner Galen, that only one of them question him. They voted to send Ferus as the questioner, as he among the Padawans had the most experience (though Anakin was reluctant to agree)."}, {"tag": "p", "text": "Ferus, who kept a polite tone, asked Galen about the possibility of someone getting a hold of the important and sensitive evacuation information. Galen, who dismissed the Padawans patronizingly, as if they were helpless little children, said that, even if such had occurred, it wasn't important to stop the raiders, and that their top priority was to keep the remaining survivors alive. Their discussion was interrupted by a transmission from the Senate transports: apparently the ships were being delayed by engine troubles. Galen clearly appeared more stressed than he'd already been: the wind currents would soon bring the toxic clouds of Aubendo to the Clear Sector. Time was running out."}, {"tag": "h3", "text": "The immune Radnoran"}, {"tag": "p", "text": "After Obi-Wan and Siri regrouped with Soara Antana and Ry Gaul, Curi informed them of the Senate's transmission. The Jedi thought about reconsidering Dol Heep's offer, but before they could discuss the matter further, Soara and Ry-Gaul announced a discovery they'd made. While they were on patrol in the Isolation Sector, the two Masters had encountered a Radnoran named Wilk without a bio-iso suit, who was apparently immune to the effects of the toxin. Curi, hopeful, immediately requested a lab analysis of the Radnoran and excused herself from the Jedi."}, {"tag": "p", "text": "The Masters soon encountered again Dol Heep, who was still awaiting the Jedi's decision on whether or not to accept Avon's fleet. With the Senate transports delayed and time running out, the Jedi reluctantly accepted Heep's offer, informing their Padawans to expect the imminent arrival of Avoni transports."}, {"tag": "h3", "text": "Communications disruption"}, {"tag": "p", "text": "The Padawans had just enough time to hear their Masters' brief message before the comlinks cut off. They concentrated next on the breakup of a riot in front of the last store in Tacto selling bio-isolation suits, after which Anakin and Tru attempted to restore the communication signal while Ferus and Darra headed off to further investigate how the raiders had obtained their high-tech battle droids (which Anakin had recognized earlier as being similar to the Baktoid B1-Series battle droid he'd observed in the Battle of Naboo)."}, {"tag": "p", "text": "Anakin and Tru returned to the command center to get permission from Galen before attempting to access the central communications power source. Galen granted them access to the power source, but it was only shortly after they had begun their examination that Anakin and Tru became puzzled about something: the planet's communications should not have been disrupted because of toxic particles in the planet's atmosphere; they had to have been jammed by something external, emanating from space. In light of this and the other information they'd gathered, the Padawans immediately realized that the Avoni fleet was preparing for invasion."}, {"tag": "p", "text": "Back in the Isolation Sector, Curi informed the Masters that her and her scientists had not been able to discover what had caused Wilk's immunity. Curi also was investigating more into the cause of the plague and was beginning to believe that the supposed accidental release of toxins, because of missing gaps in the research data, was not an accident after all. Before they could discuss it further, they received reports of the Avoni ships landing in the Isolation Sector. Obi-Wan and Siri took an airspeeder to the landing site on the outskirts of Aubendo. Keeping themselves hidden, they saw Avoni officers and personnel dressed in bio-iso suits unloading skiffs containing durasteel crates. Upon further investigation, the two Jedi came across a large cargo bay filled with a contingent of all-too-familiar battle droids, the same caliber as those they'd faced when they encountered the raiders in the Clear Sector. The Jedi were quickly detected and forced to defend themselves. But after a quick battle, Obi-Wan and Siri escaped to regroup with Soara, Ry-Gaul, and Curi."}, {"tag": "p", "text": "Curi informed them that she'd at last discovered what had caused Wilk's immunity—he hadn't been infected at all. Moreover, Wilk had actually escaped to the Clear Sector, then crept back in to the Isolation Sector days later to see his wife. The weapons toxin clearly had a short half-life and was now benign. To prove her hypothesis, Curi courageously took off her bio-iso suit (suggesting for insurance, however, that the Jedi continue to keep theirs on, in the event she started showing symptoms). Knowing now that Avon's intent was clearly invasion, the Avoni had to know that the toxin had long dispersed and were simply feigning ignorance, should any notice, by donning the bio-iso suits that Siri and Obi-Wan had seen their workers wear."}, {"tag": "p", "text": "With faith in the high probability that the threat of the bioplague was now over, the Masters directed their attention to the Avoni. As they contemplated this new threat, Curi informed them of news she'd felt compelled to hold back from them: she already was acquainted with Dol Heep through her business activities prior to the release of the toxin. Somehow Heep had learned of Radnor's use of the toxin in the development of its high-tech and bio-weapons, and the Avoni had demanded \"exclusive rights\" to it, offering Galen and Curi a fortune for it. While Curi was firmly against such a deal, Galen wanted to embrace it, claiming that anyone in the galaxy, including the Avoni, were equal customers. The two siblings had argued heatedly over what to do until Galen ostensibly decided to accept Curi's position on the matter. Dol Heep was furious."}, {"tag": "p", "text": "But now Curi began to wonder how Galen, one of the top scientists in the toxin's development, did not know of its short half-life. Obi-Wan suggested to her that Galen, in fact, did know."}, {"tag": "h3", "text": "Ruuin"}, {"tag": "p", "text": "When the Padawans regrouped, Ferus and Darra reported that they'd discovered that the battle droids were from a factory owned by Galen and Curi. Though they didn't point fingers at anyone specifically, they guessed that someone in their recent circle of contacts was somehow involved. Anakin declared that it would be best for them to go to the Isolation Sector and inform their Masters of what they had learned, in case Curi was involved and dangerous. Ferus was against the idea, claiming that it would go against their original orders to stay in the Clear Sector, trusting their Masters' abilities to contain the situation and take care of themselves. The two Padawans quarreled until Darra and Tru intervened. Tru felt that both of them were right and suggested that they allow the Avoni to proceed until the Radnorans were evacuated, and only then do what they might to prevent their invasion."}, {"tag": "p", "text": "To make sure the evacuations went smoothly, the Padawans split into pairs again and headed for the evacuation points. On their way, Anakin and Tru discussed the possibility of a connection between the raiders and the Avoni; with neither of them wanting the opportunity to escape of discovering the truth, they decided to return to the raiders' hideout. When they got there, the two Padawans encountered a Radnoran named Ruuin, whom they caught red-handed, feverishly loading stolen goods for transport onto a gravsled. They convinced him to reveal who he was working for―someone named Nonce. Ruuin claimed that it was Nonce who obtained the evacuation files from an unknown insider at the command center. He also confirmed that the raiders were, in fact, dealing with the Avoni, who planned to airlift them off-planet to new lives and possessions after fulfilling their task of agitating panic, unrest and disruption among the Radnorans, but before the Senate evacuation ships arrived. That's why Ruuin and his accomplices were now rushing to get off-planet, to avoid detection."}, {"tag": "h3", "text": "Attack on the Jedi"}, {"tag": "p", "text": "After further tests confirmed that the plague was no longer a threat, the Masters were allowed to take off their bio-isolation suits. They then decided to depart Aubendo and head back to the Clear Sector to stop the evacuations, knowing that those evacuations would only clear the way and help the Avoni in their takeover. Taking two speeders, the Masters paired up and headed for Tacto. On their way they encountered a smaller version of what seemed to be a Trade Federation MTT (Multi-Troop Transport) moving towards Tacto. Obi-Wan, who was familiar with the MTTs that the Trade Federation used in the Battle of Naboo, knew that the transport could carry a large number of battle droids; this one carried perhaps 70-100. But, suddenly, the Jedi realized, the MTT had shifted its trajectory and was now heading for them (Dol Heep, it was later learned, had planted tracking devices in the Jedi's airspeeders). The MTT chased them into the nearby \"ground canyons,\" where it cornered them after injuring Soara Antana. It then unloaded its battalion of battle droids."}, {"tag": "h3", "text": "Connections revealed"}, {"tag": "p", "text": "After leaving Ruuin in the custody of a nearby security officer (one of the few still left on the planet), Anakin and Tru regrouped with Ferus and Darra. Anakin suggested that they confront Galen, now that his high-tech battle droids had unquestionable ties to both the Radnoran raiders and the Avoni invaders. When they found him, Galen was preparing to leave in his airspeeder. The Padawans' quick thinking stopped him, however, and they discovered that the files in his datapad matched those of Ruuin's datapad: both disclosed the coordinates of the same Avoni landing site at which Galen now rushed to rendezvous. There was now proof that Galen, at least, was involved in the Avoni's plans for invasion."}, {"tag": "p", "text": "Having eavesdropped on the conversation, Curi, only just arrived from the Isolation Sector, was deeply distressed upon learning of her brother's betrayal. She informed the Padawans that while the plague was no longer a threat, their Masters, she'd only just discovered, were being pinned down in the \"ground canyon fields\" outside Aubendo by the Avoni invaders, who had destroyed their speeders. Because Curi found that Dol Heep had had all of them under surveillance the entire time, and had also placed trackers in her own transports, she had raced to warn the Jedi, when, suddenly, she'd come upon their plight in the canyons as an MTT forced them down: \"They are under attack from a platoon of Battle Droids. Our Battle Droids,\" she added, glancing at Galen. Clearly, the Avoni's plan was to pin down the Jedi as they conducted their \"bloodless\" invasion."}, {"tag": "p", "text": "Reaching out with the Force, Anakin felt strongly that they could trust Curi's information. The plague was no longer a threat: they must trust this. The other Padawans, surprised at Anakin's depth of contact with the Force, unanimously agreed—commandeering Galen's airspeeder, all rushed off to rescue their Masters."}, {"tag": "h3", "text": "Perilous rescue"}, {"tag": "p", "text": "Arriving in the canyons, Anakin also readily recognized the droid transports as being similar to, but somewhat smaller than, the Federation's MTTs. Judging by how many droids they were up against, however, the Padawans decided that stealth was the best course of action. Anakin and Tru, who knew the most about the technical schematics of that type of transport, would attempt to hijack it (gaining entrance through its idling exhaust vents), while Ferus and Darra sought out the Masters to advise them not to attack the Padawan-bearing MTT, which would ambush the droids after the Jedi had drawn them into a predesignated clearing."}, {"tag": "p", "text": "Upon reaching their Masters (who'd taken down twenty or more droids while sustaining, beyond Antana's ankle, additional injuries to Gaul's shoulder and Tachi's brow above the eye), Ferus and Darra informed them of Anakin and Tru's plan. Together, the six of them faced off the onslaught of battle droids as they executed their planned retreat, battling their way back towards the clearing where the MTT would strike. But in retracing their steps to the clearing, they realized that the entrance they'd initially come through was now blocked by a rock-slide. Boldly accepting their lot, they faced the Avoni droids with a \"do your worst\" attitude. Suddenly, a tremendous noise shook the canyon as the Padawan-controlled MTT bashed its way through the sheer rock of the blocked entrance, its engines belching smoke beneath bashed casings. Lurching forward, its proton cannon-fire roared to life: \"Obi-Wan had no doubt who was at the controls.\" The Jedi, as one, leapt towards the battered and bent transport hatch. When all were safely on board, Anakin and Tru commandeered the MTT to finish off the remaining droids. The Jedi team then headed back to Aubendo and the Isolation Sector."}, {"tag": "h3", "text": "Conclusion"}, {"tag": "p", "text": "Upon returning to Aubendo, the Jedi found that the Avoni lacked the firepower to defeat \"a roused population.\" When they confronted Dol Heep, the Avoni ambassador called the ruse \"a complete misunderstanding\" in his people's attempt to \"help Radnor\" and denied that his planet had anything to do with an invasion (when, in fact, it was an enraged Heep who'd prepared the planet for invasion by releasing, by his own devices, Galen's toxin to the air). He maintained further that the battle droids were there merely \"for crowd control\" and apologized for their \"malfunction.\" Claiming also that the sabotaging of Radnor was not their doing, Heep immediately had his Avoni \"tech experts\" restore communications, whereupon the fleet departed."}, {"tag": "p", "text": "The Senate ships, which ostensibly had been sabotaged (it was only suspected, for there was no proof), were ordered to return to Coruscant. The Jedi knew that there was nothing they could do about such blatant and criminal duplicity as they'd witnessed in the Avoni. Even if they did take Heep into custody, the Avoni wouldn't pay for their crimes for years, unfortunately, due to the typical but never-ending debates that such a scandalous affair would inevitably cause within the Senate. However, the Jedi did manage to place Galen into custody. Arriving at the Tacto prison where Galen was being held, the Jedi found him with Curi. A guard informed them that she'd held a blaster to his head for nearly two hours out of rage."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the Jedi left Radnor, the Radnorans were beginning to rebuild, even as they mourned their dead. Fending for themselves, the citizens of Tacto and the Clear Sector did nothing to help those in Aubendo and the Isolation Sector. In some ways the situation on Radnor was now worse than when the Jedi first arrived. Even so, it was neither the Jedi's mission nor their mandate to rebuild Radnor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}