{"url": "Mission_to_Raxus_Secundus", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles in the Tion Hegemony", "Category:Duels", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Raxus Secundus"}, {"tag": "p", "text": "Jedi Master Quinlan Vos and bounty hunter Asajj Ventress undertook a mission to assassinate Count Dooku, who was attending a gathering on the Confederate capital world of Raxus Secundus to receive the Raxian Humanitarian Award for his service in the Clone Wars. The Jedi Council had earlier sent Vos to assassinate Dooku in an effort to bring a speedy end to the conflict. Vos enlisted the help of Ventress, who trained him in the dark side of the Force. Despite their planning and precautions, the two Force-users were no match for Dooku who defeated Vos and took him prisoner. Only Ventress escaped to warn the Jedi of Vos' capture."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following Count Dooku's massacre of civilians on Mahranee, the Jedi Council resolved to assassinate the Separatist leader in order to bring a speedy end to the Clone Wars. For this mission, the Council assigned Master Quinlan Vos to kill Dooku. Vos accepted the mission but also enlisted the help of Asajj Ventress, a former Dark sider and a bounty hunter. After working together as bounty hunters for a brief stint, Vos revealed his true identity and Ventress agreed to help him kill Dooku due to hatred for her former Sith master."}, {"tag": "p", "text": "Ventress took Quinlan to her adopted homeworld of Dathomir where she trained him in the ways of the Nightsisters, a cult that used the dark side. Following a rigorous training program, Ventress learned from one her Separatist contacts, the Gossam Sumdin, that Dooku was planning to visit Raxus Secundus, a planet in the Tion Hegemony. Dooku was planning to give a speech at a public celebration there. After Vos completed his final trial by using the dark side to kill a crustacean creature called The Sleeper, Ventress deemed him ready to face Dooku. Together, the two Force-users departed on her starship, the Banshee to Raxus."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Going undercover"}, {"tag": "p", "text": "Upon landing in Raxulon, the capital city of Raxus, Vos and Ventress donned their disguises and rendezvoused with Sumdin in the spaceport. After Sumdin had given them the invitations to Dooku's function, Ventress killed her with her lightsaber. When Vos expressed revulsion, Ventress responded that letting Sumdin live would allow information to leak out about their operation. As they approached Raxulon's public square, the two Force-users used mind tricks to convince a guard to let them through without checking for weapons. The public celebration was a Separatist ceremony to award Dooku with the Raxian Humanitarian Award."}, {"tag": "p", "text": "Count Dooku addressed the crowd from a balcony of the Separatist Senate Building with General Grievous standing at his side. During the speech, Dooku lauded the Confederacy for calling for change and equality. He then attacked the Galactic Republic and the Jedi for meeting their demands for reform with brutal military force. Before accepting the humanitarian award, Dooku concluded by stressing the justness of the Separatist cause and disparaging the Republic's Clone troopers as slaves who had been sent to their deaths. As the public banquet began, the two assassins put their plans into action."}, {"tag": "p", "text": "While Ventress would lure Dooku to a lonely place, Vos would overpower Grievous and his battle droid escorts. Asajj managed to mingle with the crowds and encountered her former Sith master. She managed to challenge Dooku to a fair fight at the overlook. The Count accepted the offer but then moved away discreetly to contact Grievous for reinforcements. Meanwhile, Vos managed to ambush Grievous and his battle droids. Following a struggle, he locked the cyborg general in a chamber and then went to join Vos at the overlook. Upon arriving at the overlook, Dooku tried to contact Grievous but received no response, leaving him to fight the two assassins alone."}, {"tag": "h3", "text": "Fighting darkness with darkness"}, {"tag": "p", "text": "Dooku attempted to distract his opponents by drinking a glass of Alderaanian wine. Before Vos and Ventress could strike him with their lightsabers, Dooku drew his and ducked. As the three Force-users parried with their lightsabers, Quinlan remembered Asajj's lesson and gave into his pain and hatred in an effort to harness his dark side powers. Ventress then managed to fight her former master to a corner and both fighters had their blades intersecting with each other. However, Dooku managed to shove her aside and sent her sprawling to the floor."}, {"tag": "p", "text": "Enraged by Dooku's assault on Ventress, Vos charged at the Sith Lord behind. However, Dooku whirled around and caught Vos' strike with his lightsaber. As they parried, Vos tried to stab Dooku in the chest but the Sith Lord twisted out of the path of his lightsaber. Vos then made the mistake of circling Dooku despite Ventress's warnings. This allowed Dooku to levitate Quinlan with the Force and shove him against a pillar, temporarily knocking him out. The Sith Lord then turned his attention to Ventress and used the Force to shove her against another pillar, knocking her unconscious."}, {"tag": "p", "text": "Sensing Quinlan's grief and fear, the Sith Lord taunted the undercover Jedi by asking him how many Jedi vows he had broken to destroy him. Enraged by Dooku's taunts, Vos parried with the Sith Lord. Ventress stirred and tried to warn her former pupil not to listen to Dooku. Emboldened by Ventress' survival, Vos continued his lightsaber duel with Dooku. The Sith Lord then remarked that the dark side was stronger in Quinlan than in his former apprentice Ventress. Dooku also attempted to sow discord between the two assassins by claiming that Ventress had not properly taught him in the ways of the dark side."}, {"tag": "p", "text": "Their duel was interrupted by the arrival of General Grievous. Vos managed to kick him, causing the cyborg general to tumble over the railing. However, Grievous then grabbed Ventress' arm and dragged her down with him. Fearing that Ventress would die, Quinlan physically attacked Dooku and kicked him hard in the face. However, Dooku seemed unharmed and instead goaded the Jedi into using his anger. Giving into his anger, Vos parried with Dooku and managed to knock the Sith Lord's lightsaber out of his hand. With his lightsaber a centimeter away from Dooku's throat, Vos tried to decapitate the Sith Lord."}, {"tag": "p", "text": "However, Dooku grabbed Vos's wrist before he could deliver the blow and tackled him to the ground. Dooku subdued Vos by planting his knee on the Jedi's back. Vos was unable to free himself since Dooku's strength was augmented by the Force. Dooku then twisted his armed and deactivated his lightsaber. Meanwhile, Ventress landed on the edge of the lower level. Grievous landed on top of her and placed his metallic foot on her throat. The cyborg then grabbed Ventress and hurled her down to the level below. Ventress managed to survive her fall and managed to fight off Grievous. As she fled Grievous and his droid reinforcements, she used the Force to retrieve Vos' fallen lightsaber."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Quinlan Vos and Asajj Ventress's assassination attempt against Count Dooku failed due to the Sith Lord's mastery of the dark side and the timely arrival of General Grievous. Having captured Vos, Dooku then struck him with Force lightning, knocking the Jedi Master unconscious. As he slipped into unconsciousness, Vos caught side of Ventress fighting off battle droids and fleeing into sewers. Despite being pursued by Separatist droid forces, Ventress managed to escape offworld on her ship, the Banshee. Before fleeing offworld, Ventress vowed to rescue her lover Vos."}, {"tag": "p", "text": "Meanwhile, Vos was taken captive by Count Dooku and imprisoned at his palace on Serenno. There, Vos was subjected to extended periods of torture and psychological manipulation. Dooku managed to turn Vos to the dark side and recruit him as his new Sith apprentice by revealing that Ventress had murdered his late Master Tholme. In secret, Vos planned to gain Dooku's trust in order to force Dooku to lead him to his mysterious master Darth Sidious and destroy the Sith Order once and for all. Unwilling to abandon her lover to Dooku, Ventress hatched a rescue mission with the help of Boba Fett's bounty hunter syndicate. However, Vos, consumed by his hatred for Ventress, spurned her rescue offer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Raxus Secundus appeared in the 2015 novel Dark Disciple, written by Christie Golden and adapted from an unfinished eight-episode story arc for the Star Wars: The Clone Wars animated series, which was written by Katie Lucas, Matt Michnovetz, and Dave Filoni. The duel between Dooku, Ventress, and Vos was storyboarded for the original arc by Spyros Tsiounis."}, {"tag": "p", "text": "In Star Wars: Galactic Atlas, Asajj Ventress is pictured wielding her red-bladed lightsabers rather than her yellow-bladed lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}