{"url": "Mission_to_Ruul_(Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Core Worlds", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Ruul  (Galactic Civil War)"}, {"tag": "p", "text": "The Mission to Ruul was Brenn Tantor's first mission after defecting to the Rebel Alliance."}, {"tag": "p", "text": "Having defected, Tantor offered to provide the Alliance with an All Terrain Armored Transport as a sign that he was not a traitor. To do so, however, required the cooperation of Beri Tulon, Tantor's old mentor, who had been assigned to an AT-AT factory for years. The complication was that Tulon had been captured by the Galactic Empire during an attempt to defect—by Tantor, in fact—and was sent to Tarkin Detention Facility on Ruul."}, {"tag": "p", "text": "Under the close supervision of General Tyr Taskeen, Tantor took a light force to Ruul, where he set up to ambush the convoy escorting Tulon to the prison. Before Tulon got there, however, a lighter force passed, escorting a captured leader of the Ruulian Rebels. Tantor swiftly eliminated the guards and returned the leader to his people nearby."}, {"tag": "p", "text": "Tulon's escort passed by not long after. Tantor's troopers descended from the hills, bringing down the stormtroopers and walkers that guarded him. Tulon was quickly bundled into a transport and the party rushed to the designated evacuation zone, running into Imperial patrols and turrets along the way."}, {"tag": "p", "text": "Once safe, Tantor questioned Tulon as to the location of the factory. Tulon revealed that it was on the asteroid Trasse, but could not be approached without the proper codes. Fortunately, the nearby Imperial computer bank at Sounder Flats would hold such codes."}, {"tag": "p", "text": "Still using only infantry and transports, supplemented by the Ruulian Rebels and four of their captured walkers, Tantor subdued the Imperial bases guarding the complex and made a successful information raid, despite several strong Imperial counterattacks. Once Beri Tulon had sliced the codes from the facility, Tantor and his forces faded away as quickly as they had struck."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}