{"url": "Mission_to_Serenno_(Nightsisters)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the D'Astan sector", "Category:Duels", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Serenno  (Nightsisters)"}, {"tag": "p", "text": "During the Clone Wars, the Nightsisters undertook a mission to assassinate Count Dooku after he betrayed his apprentice Asajj Ventress. Taking Karis and Naa'leth to Castle Serenno on Serenno, Ventress sought revenge, but the Sith Lord repelled the attack, defeating his assailants."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Sullust, Darth Sidious contacted his Sith apprentice Darth Tyranus, telling Dooku that he was becoming concerned about the power of his assassin, Asajj Ventress. Dooku, not wanting to admit he had been training her to help overthrow his master, ordered their forces to abandon Ventress to her death. She was recovered in her damaged Ginivex-class fanblade starfighter by a salvage crew, and commandeering their ship, she returned to her homeworld Dathomir. There, Mother Talzin agreed to aid in getting revenge on Dooku, providing poisons and invisibility potions."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Asajj Ventress and her two Nightsisters, now invisible, landed in the forests outside Dooku's castle on Serenno and infiltrated it through a vent. After locating him, Ventress shot a poison dart into Dooku's neck that blinded him, although he could still sense them through the Force and mistook them as Jedi. Ventress attacked Dooku with a lightsaber, beginning their duel in the count's bedroom and eventually leading into his office. Ventress, who had managed to stay disguised during the entire confrontation, managed to disarm the Sith Lord and was about to strike the killing blow, but the count defended himself by striking Ventress and her accomplices with Force lightning, throwing them out the window and over a cliff, ending the attack. However, the three Nightsisters survived and returned to Dathomir."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Due to his attackers' use of Jedi lightsabers, Dooku mistakenly believed that the Jedi had tried to assassinate him. Wishing to protect himself, he sought a new apprentice to replace Ventress (whom he erroneously believed to be dead)."}, {"tag": "p", "text": "Given the failure of their direct attempt to kill Dooku, the Nightsisters developed a new plot to kill the Sith Lord using a double agent. To arrange the plan, Mother Talzin contacted Dooku, offering to provide one of the Nightbrothers to be his new assassin. Dooku, seeing this as an opportunity to get the new apprentice he desired, agreed. After selecting Savage Opress to be their pawn, Talzin presented the hulking Zabrak to the count, who was pleased with Oppress, unaware of his secret loyalties. The loyalties were also undercover to Opress himself, but were later be activated by Ventress to help her in another attempt to kill Dooku."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}