{"url": "Mission_to_Serenno_(Krayt%27s_Claw)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Serenno  (Krayt's Claw)"}, {"tag": "p", "text": "During the Clone Wars, Asajj Ventress enlisted Krayt's Claw, the syndicate of bounty hunters led by Boba Fett, to undertake a mission to rescue Jedi Master Quinlan Vos from Castle Serenno on Serenno. However, Count Dooku had already turned Vos to the dark side by revealing that Ventress had murdered his late Master Tholme. Thus, Vos spurned Ventress' rescue offer and instead attacked his former lover. Ventress and her bounty hunter associates were forced to flee while Vos stayed behind and became Dooku's new Sith apprentice."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Count Dooku massacred civilians on Mahranee, the Jedi High Council decided to assassinate the Sith Lord and Separatist leader in order to end the Clone Wars. For this mission, they selected Quinlan Vos, a Jedi Master who was skilled with undercover work. Vos enlisted the help of Asajj Ventress, a Nightsister who had once been Dooku's Sith apprentice. Ventress agreed to help in order to seek revenge against Dooku and enrolled Vos in an intense training regimen decided to hone his dark side powers."}, {"tag": "p", "text": "Later, Ventress and Vos received intelligence that Dooku was traveling to Raxus Secundus, a Separatist world in the Tion Hegemony, to receive the Raxian Humanitarian Award at a public ceremony. The two Force-users managed to infiltrate the ceremony and engaged the Sith Lord in a fight at an isolated overlook. Despite their preparation, they were no match for Dooku's mastery of the dark side. Ventress was forced to flee when General Grievous and Separatist droid forces arrived to aid Dooku. In the end, Vos was taken captive and struck unconscious with Force lightning. He was then taken to Castle Serenno on Serenno."}, {"tag": "p", "text": "In Dooku's custody, Quinlan was subjected to prolonged periods of torture. After holding out for an unknown period, Vos finally gave into the dark side after Dooku revealed that Ventress had murdered his late Master Tholme. Thus, Dooku also succeeded in turning Vos against his lover. Meanwhile on Tatooine, Ventress traveled to Chalmun's Spaceport Cantina where she met the bounty hunter Boba Fett and his syndicate Krayt's Claw, which included bounty hunters Bossk, Latts Razzi, Embo, and C-21 Highsinger. Ventress enlisted the bounty hunters' support to rescue Vos for 250,000 credits, which was all of the wealth she had gained throughout her bounty hunting career."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Asajj Ventress and Krayt's Claw traveled to Serenno in the Slave I and Embo's saucer-shaped Guillotine. Ventress then put her plan into action. While the bounty hunters created a diversion, Ventress would infiltrate Dooku's palace and make her way to the prison. After some deliberation, the bounty hunters agreed to steal a starship. Under Fett's leadership, the bounty hunters attacked two disembarking ships and their battle droid escorts. While Embo decapitated two droids with a disk-shaped metal object, Latts used a grappling boa to ensnared another droid. Highsinger than crushed it with his metal feet."}, {"tag": "p", "text": "While the bounty hunters exchanged fire with battle droid reinforcements, Ventress infiltrated Dooku's prison. In the prison complex, she found that almost all of the cells had been abandoned. While navigating her way through the prison complex, she used her lightsaber to dispatch several droid sentries she encountered, including two carrying battle staves. After destroying the droid sentries, Ventress finally found Vos' cell. However, Vos, grieving over the murder of his Master Tholme, was enraged by Ventress' presence and Force choked her while denouncing her as a liar and murderer."}, {"tag": "p", "text": "Ventress tried to reason with her former lover, but Vos flung her hard against the dungeon's stony floor. During the assault, Asajj noticed that Quinlan's eyes had turned a blood-rimmed shade of yellow; meaning that he had turned to the dark side. Consumed by rage, hatred, and the dark side, Vos activated Tholme's lightsaber and attacked Ventress. She was forced to draw her lightsaber in self-defense. As they parried, Vos accused her of using him while Ventress tried to reason with him by telling him that his mind was clouded by the dark side. Ventress also suggested that Vos leave Dooku and the Jedi Order behind."}, {"tag": "p", "text": "Unable to reason with Vos, Ventress was forced to flee the prison. Quinlan followed her and used the Force to hurl broken parts of battle droids at her. In the end, Asajj managed to exit the prison where she was met by Boba Fett and his companions, who had trapped Dooku under some webbing. With Vos intent on killing Ventress and everyone in his way, she and her bounty hunter allies were forced to flee Serenno without Vos. As Ventress left aboard a stolen shuttle, she saw Vos and Dooku walking together. This indicated that Vos had become Dooku's newest Sith apprentice."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the failed rescue mission, Asajj Ventress made her way to Coruscant where she informed Quinlan's friend, Master Obi-Wan Kenobi that he had joined Count Dooku. For the next several months, Vos assumed his place as Dooku's new right-hand man and earned the moniker \"Admiral Enigma\" in HoloNet news reports. At some point, Ventress encountered Vos' friend, the Jedi Knight Akar-Deshu (\"Desh\"), who informed her that the Jedi were debating on rescuing Vos. At Kenobi's request, Desh invited Ventress to help convince the Jedi Council to support their plan to rescue Vos."}, {"tag": "p", "text": "At the Jedi Council Chambers, Ventress was greeted with hostility by some of the Jedi Masters, but Masters Kenobi and Yoda vouched for her. During the meeting, Ventress admitted that she had trained Vos in the ways of the dark side, believing that it was the best method to accomplish the mission to kill Dooku. When some of the Jedi criticized her, Ventress responded by reminding the Council that they were the ones who had paired her with Vos in the first place. After further deliberation, the Jedi Council agreed to hatch a mission to rescue Vos. They also reluctantly agreed to allow Ventress to participate in the mission in return for pardoning her of all crimes against the Republic and the Jedi. The Council's decision to proceed with the rescue mission was invigorated by an intelligence report from Admiral Wullf Yularen that Dooku and Admiral Enigma were planning to attack Taris."}, {"tag": "p", "text": "With the help of Ventress, Master Kenobi and his former apprentice Anakin Skywalker managed to infiltrate Dooku's Providence-class Dreadnought. Together, they made their way to the bridge where they confronted Dooku and quickly deduced that \"Admiral Enigma\" was a pseudonym. They also managed to reach the ship's brig and find Vos. While Vos appeared to be emaciated and brutalized, Ventress quickly sensed that it was a deception and that her former lover had succumbed to the dark side. Despite her protestations, Vos was welcomed back into the Jedi Order. However, he used his position to advance the Separatist cause. In secret, Vos planned to use his loyalty to Dooku to learn the identity of his mysterious master Darth Sidious and destroy the Sith once and for all."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}