{"url": "Mission_to_Skako_Minor", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Cleanup", "Category:Missions of Clone Force 99", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Skako Minor"}, {"tag": "p", "text": "The Mission to Skako Minor was an unsanctioned operation led by Jedi Knight Anakin Skywalker to the planet Skako Minor, which was neutral during the Clone Wars, to rescue ARC trooper CT-1409 \"Echo\" from the Techno Union in the city of Purkoll."}, {"tag": "p", "text": "Echo had been believed killed during the Battle of Lola Sayu, but unusually severe Galactic Republic losses during the campaign for control of the planet Anaxes led Clone Captain Rex of the 501st Legion to suspect that Echo was still alive and being used for intelligence by the Separatist military. An infiltration of the Separatists' Cyber Center on Anaxes involving the irregular clone commando unit Clone Force 99, the so-called \"Bad Batch\", led to the discovery of a signal from Skako Minor that sounded like a human voice and identified itself with Echo's number of CT-1409. Despite lacking official permission, Skywalker, Rex and the Bad Batch traveled to Skako Minor, found Echo, and were able to rescue him and return to Anaxes."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the campaign between the Galactic Republic and Confederacy of Independent Systems over control of the Core Worlds planet Anaxes and its important shipyards, Republic forces began to lose ground, sustaining unusually heavy losses. Clone Captain Rex of the 501st Legion realized that the Separatist forces, led by Admiral Trench, were somehow using his own battle plans and strategy algorithm to counter the Republic Military. However, besides Rex, the ARC troopers CT-5555 \"Fives\" and CT-1409 \"Echo\" were the only other people who had known of the algorithm's existence, and both of them were dead. Fives had died on Coruscant with Rex present, and Echo had been caught in an explosion during the Battle of Lola Sayu. Rex concluded that Echo was the only possible weak point for how the Separatists could have acquired the algorithm, meaning that he might be alive."}, {"tag": "p", "text": "Rex's theory was correct: at the Citadel, Echo had barely survived the destruction of the Sheathipede-class Type B shuttle he had been attempting to retrieve. Grievously injured, he had been salvaged by the Separatists and handed over to the Techno Union, who turned him into a cyborg to extract information from his brain, including the strategy algorithm. He was held in stasis at a facility in the city of Purkoll on Skako Minor. The algorithm derived from Echo was transmitted live to a Cyber Center on Anaxes, which allowed Trench to make use of it."}, {"tag": "p", "text": "Rex and Marshal Commander CC-2224 \"Cody\" came forward to Jedi Generals Mace Windu and Anakin Skywalker with the theory that the Separatists had somehow managed to figure out Rex's strategic \"playbook\", and Cody proposed taking a team behind enemy lines to figure out how they were doing it. Rex left out his theory of Echo's survival as he feared the Jedi would think he was crazy, as he was skeptical of the idea even though he had come up with it. Cody, told of the theory before they set out, was highly skeptical."}, {"tag": "p", "text": "To assist in the operation, Cody called in Clone Force 99: an irregular unit of clone commandos with unique abilities informally known as the \"Bad Batch\". After the squad arrived at Fort Anaxes, they boarded an LAAT/i gunship along with Cody, Rex, ARC trooper CT-5597 \"Jesse\" and clone medic CT-6116 \"Kix\". However, the gunship was shot down by droid forces on the way in, with Cody seriously injured in the crash. Bad Batch member Wrecker used his strength to push the wreckage off of the Commander before Clone Sergeant Hunter gathered his squad together to swiftly rout approaching battle droid reinforcements. After the strike team had moved out of the canyon, Rex took over command and called an evac flight for Cody, Kix staying behind to assist the injured Commander. When the strike team finally reached the Cyber Center, Bad Batcher Tech gained access to the computers while searching for Rex's algorithm, but both clones were surprised to discover that it was not a computer program but a live transmission from Skako Minor. Tech noticed that it sounded like a human voice, and when Rex asked him to send a request for the voice's identity, the response was \"CT-1409\", Echo's identification number, proving that he was still alive."}, {"tag": "p", "text": "After returning to Fort Anaxes, Rex reported the news of Echo's survival and proposed a mission to rescue him. Skywalker decided to come along as well. While waiting for news as to whether the Jedi High Council would approve the mission, Skywalker had a private conversation with his secret wife, Senator Padmé Amidala, and told her that he thought Rex was letting his emotions get to him too much regarding the possibility of Echo's survival. Amidala reminded him that he himself was often guilty of the same vice, and suggested that he support Rex in his effort to rescue his friend. When Obi-Wan Kenobi arrived to attempt to inform Skywalker that the Council had not approved the mission, Skywalker talked over him and made it clear he intended to carry out the mission anyways, which Kenobi resigned himself to. The strike team departed on the Bad Batch's shuttle, the Havoc Marauder."}, {"tag": "p", "text": "Admiral Trench, meanwhile, informed that the strike team had made a connection to Skako Minor, contacted Techno Union foreman Wat Tambor and warned him that Republic operatives were likely to violate corporate neutrality to come to the planet in search of the source of the algorithm."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Encounter with the Poletecs"}, {"tag": "p", "text": "Shortly after landing on Skako Minor, the Havoc Marauder was attacked by a native Poletec warrior riding a keeradak. When everyone got out, Hunter and Wrecker intended to attack the warrior, as Hunter wanted the keeradak off of his ship, but Skywalker thought that was a bad idea and suggested talking to them instead. The warrior managed to have his mount grab Skywalker in his claws and fly away, with the Jedi dropping his lightsaber in the process, which was retrieved by Rex. Crosshair fired a grappling cable after the creature, and Hunter hooked himself to the cable and was pulled along."}, {"tag": "p", "text": "Hunter reeled in the cable and fired his blaster pistol at the keeradak's rider, but the Poletec maneuvered his mount so Hunter lost his grip on the weapon. On approach to the Poletec village, the keeradak flew through multiple rock pillars, and Hunter eventually detached himself from the cable in order to not hit anything, landing on a rock spire above the village. He contacted Tech with his coordinates, and Rex and the other three Bad Batchers followed in the Marauder. Skywalker, pinned to the ground by the keeradak, attempted to speak to his abductor, who was the chief of the village, but a language barrier made communication difficult."}, {"tag": "p", "text": "Arriving at the village, Rex noted that Skywalker was trapped and decided that they would go in, but reminded the Bad Batch of the General's earlier orders and told them not to shoot any of the villagers. Hunter had Wrecker set a large boulder rolling into the village, with the two of them, Rex and Tech following in its wake while Crosshair stayed in a sniper position. As the Poletecs were fleeing the boulder, Crosshair fired a shock dart into the leg of the keeradak holding Skywalker down, forcing it to release him."}, {"tag": "p", "text": "The clones fired multiple warning shots, disarming several Poletec warriors, as they ran into the village. As a standoff ensued, Tech was called upon to translate between the strike team and the Poletecs. Learning that the chief had kidnapped him because he did not want their war on his planet, Skywalker told him via Tech that Wat Tambor and the Separatists were those truly responsible for bringing war to Skako Minor, and Rex offered an apology for the damage to the village and an explanation that they were there to rescue one of their own men from Purkoll. The chief offered the services of scouts to lead the strike team to the city, but nothing else."}, {"tag": "h3", "text": "Entering Purkoll"}, {"tag": "p", "text": "After the scouts had led the strike team within view of Purkoll, Tech discovered that he had somehow lost Echo's signal, which he attributed to possible atmospheric disturbances. Hunter suggested that there was a possibility the Separatists could have set a trap for them, and that Echo might be dead. Rex got into a brief fight with Crosshair and Wrecker when the sniper showed a lack of sympathy for Echo's having been left for dead, and Skywalker ordered Hunter to take his men and scout an entrance into the towers of Purkoll while he had a talk with Rex. The Captain was willing to concede that Echo might be dead, but insisted that it was more likely that he was alive and that he wasn't going to give up hope that that was indeed the case."}, {"tag": "p", "text": "Regaining Echo's signal, Tech traced it to the base of one tower, and the Bad Batch was joined by Skywalker and Rex just as he managed to get the door open. Inside, they found and entered a turbolift which took them up to the city above. Skywalker reminded everyone on the way up that this was a stealth operation, and that as the enemy was unaware of their presence, they should avoid using blasters or explosives. However, when the lift arrived at the top and they were confronted with a room full of D1-series aerial battle droids, Wrecker unhesitatingly charged ahead and began smashing and shooting the droids, shortly followed by the rest of his squad; this caused Rex to quip to Skywalker about the lack of stealth."}, {"tag": "p", "text": "Heading deeper into the facility, the team entered a curved hallway patrolled by droids just as Tech lost Echo's signal again. When Rex pointed out that atmospheric distortions were unlikely this high up, Tech realized that the signal variance was likely because it was only detectable when Echo was actively transmitting the algorithm. Skywalker ordered the team to split up and check every door, and that whoever found Echo should call everyone in, as they would go in together. The Jedi General and Crosshair went one way, while everyone else went the other direction. Skywalker entered a doorway and went down a narrow hallway, where he soon found himself confronted by droids."}, {"tag": "p", "text": "As Rex and Wrecker entered doors further down the hall, Tech was about to enter a doorway when the signal restarted again, and he was able to track it to a large doorway set back in an alcove, followed by the others. Elsewhere in the facility, Skywalker and Crosshair destroyed the droids they had encountered before setting off to rejoin the others. As Rex ordered Tech to get the door open, Tambor appeared on a viewscreen next to the door and gloated that the algorithm had allowed him to predict the strike team's every move. Rex angrily retorted that he was holding a prisoner of war, and when Tambor denied this, insisted that he would be leaving Purkoll with his friend. Tambor claimed that Echo was dead, which caused the Captain to call him out as a liar, before ordering approaching battle droids to execute the clones."}, {"tag": "p", "text": "As Rex, Hunter, Wrecker and Tech fought off the droids, they were joined by Skywalker and Crosshair. After the first wave was defeated, Skywalker ordered Tech to open the door for Rex. The two clones went through two sets of doors to find a lab, with a stasis chamber mounted on the wall above the controls. Tech detected a lifeform inside and remarked that he did not like the look of this. Opening the stasis chamber, an unaware Echo partially fell out. Horrified at what had been done to his friend, Rex pulled Echo down and set him on the floor, having to call his name a few times to make him aware of his surroundings, as he was still reliving his last moments of consciousness at the Citadel. After comforting Echo that he was safe and that he would be going home, Rex waved Tech over and the two began to disconnect Echo from the machinery."}, {"tag": "h3", "text": "Escaping Purkoll"}, {"tag": "p", "text": "However, Echo could not be completely unplugged until Tech had decrypted his neural interface inside the Techno Union computer. While this was going on, Skywalker and the rest of the Bad Batch retreated inside the lab, with Hunter and Crosshair welding the first door shut. Tambor and several of his aides came personally, and were informed by the leader of the D-wing droids that the clones were completely surrounded. The foreman ordered the Decimator sent against the intruders. As the droid began to cut through the first door, Hunter, Wrecker and Crosshair retreated behind the second door and welded that shut as well."}, {"tag": "p", "text": "When Tech finally finished the decryption, Rex unplugged the last three cables connecting Echo to the lab's computers, causing the ARC trooper to cough and remark that he had a headache. As the Decimator moved on to cutting through the second door, Echo pointed out a ventilation hatch in the ceiling that the team could use to get out, using the computer interface socket on his prosthetic arm to open the hatch. When Crosshair wondered how they were going to reach the hatch, Wrecker grabbed Hunter and threw him up into the shaft without warning, to the sergeant's irritation. Crosshair, Tech (carrying Echo) and Rex were subsequently tossed up into the shaft, but Skywalker declined an assist and used the Force to assist his jump. Despite the Decimator nearly being through the door, Wrecker then took the time to toss thermal detonators all over the lab in order to send a message to Tambor about what he thought of his \"science experiment\". As the Decimator breached the door, Skywalker levitated Wrecker towards the shaft. The commando was nearly detected by the Decimator's energy tentacles before Skywalker pulled him safely inside the shaft and the hatch closed. Detecting no organic matter in the room, the Decimator shut off."}, {"tag": "p", "text": "When informed of why the Decimator had shut off, Tambor was angered, and when he went to look into the lab through the hole the droid had cut, he had just enough time to react to the sight of the explosives Wrecker had planted before they went off. Tambor and his aides were knocked back by the explosion, and when the foreman entered the destroyed lab, he was furious that his \"property\" was gone, ordering the droids to locate the Republic operatives. In the ventilation and coolant ducts, Echo directed the team's route, explaining that while the Techno Union had accessed his memories during his time hooked up to their computers, he had acquired a fair amount of data from their mainframe, including the layout of Purkoll. Echo's escape route, however, required the team to cross a long, narrow pipe to another building that contained a landing pad. Wrecker's fear of heights made him especially reluctant to cross."}, {"tag": "p", "text": "When the team was about halfway down the pipe, they found themselves trapped as they were located by D-wing droids that converged upon them from both ends of the pipe, and repelling them would be difficult. Crosshair nearly fell to his death before Wrecker caught him, with the two of them hanging on to a structure below the pipe. Tech, having a habit of recording everything he came across, played a keeradak distress call he had recorded during their earlier encounter with the Poletecs, which summoned a group of the creatures. Everyone jumped off the pipe and landed on a keeradak, with Skywalker riding one by himself and the clones split up between three of the creatures. However, the D-wing droids, being capable of flight, pursued."}, {"tag": "h3", "text": "Defending the village"}, {"tag": "p", "text": "One of the droids crashed into a rock spire during the ensuing chase, and the keeradaks eventually brought the team back to the Poletec village. The chief was impressed that they had tamed the reptiles, but displeased that they had returned and brought war to the village. The remaining droid pursuers attacked, and while several of them were shot down or crashed, one escaped, returning to Purkoll and reporting their whereabouts to Tambor. The foreman sent a force of D-wings and two Octuptarra droids to attack the village and recapture his \"experiment\"."}, {"tag": "p", "text": "The chief was angered that the Republic team had broken their word, and Rex, agreeing that he was right, managed to persuade the Poletecs to help them by pointing out what the Techno Union had done to Echo. The team and the village's warriors prepared for the oncoming attack, taking positions around the village. Skywalker, Crosshair and Echo took up positions atop a large spire of rock that projected over the village. Rex loaned Echo one of his blaster pistols."}, {"tag": "p", "text": "When the first D-wing droids landed at the village, they initially found it empty. Signaled by Skywalker, Wrecker began the defense by sending a boulder rolling down into the village, flattening multiple droids. Afterwards, the Poletec warriors charged into the village, attacking the droids. While they inflicted casualties, many of the warriors fell to the droids' blaster fire. As the battle continued, Hunter borrowed Wrecker's combat knife to use alongside his own, and Tech deployed electromagnetic pulses against the droids, which they proved resistant to."}, {"tag": "p", "text": "When the Octuptarra droids joined the fight, many more casualties began to be inflicted. On the rock spire, Skywalker, Crosshair and Echo were surrounded by D-wing droids that they quickly dispatched, with the sniper patting Echo on the shoulder in acknowledgement after he shot down some droids. Realizing the trouble the three-legged droids posed, Skywalker ordered Rex to take one of them while he took the other. As Skywalker leapt from the spire and landed atop one Octuptarra droid, Rex, Hunter, and Wrecker attacked the other, shooting it from below and keeping its attention on them. Skywalker quickly disarmed his target by cutting off its three turrets. Wrecker, noting that that had worked, grabbed Rex and Hunter and threw them onto the other Octuptarra droid, to the Captain's irritation. Rex shot out one of the droid's visual sensors, Hunter took out another with a knife, and Crosshair shot out the third from his sniper position. Skywalker then cut off one of the legs of the other droid, leapt off, and Force-pushed it into the blinded droid, causing both Octuptarras to fall over. The remaining D-wing droids retreated from the village."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Informed that his droid forces had failed to recapture Echo, Tambor regarded the loss as a serious blow to the Techno Union's profit margins. Wishing to recoup the investment he had made in the clone, Tambor decided not to immediately inform the Separatists of Echo's rescue by the Republic. Saying farewell to the Poletecs, Skywalker was informed by the chief that the Jedi would always have an ally on Skako Minor. Rex told Echo that he hoped things would be \"just like old times\" before they left the planet, although the ARC trooper did not seem so sure."}, {"tag": "p", "text": "Back on Anaxes, Echo was fitted with new cybernetics and armour. Despite concerns about his loyalty, he was eager to fight against the Separatists and Trench's forces, who were unaware that they no longer had the advantage that Echo's strategy algorithm had given them. While Windu, Kenobi and their forces led an attack on the planet's captured shipyards, Echo, Rex, Skywalker and the Bad Batch infiltrated Trench's flagship so Echo could feed Trench false information before sending a pulse that shut down all the battle droids on Anaxes. However, when Trench activated his backup plan of a bomb powerful enough to destroy most of Anaxes, Echo raced to give Windu the code to shut the bomb down, but was located and shocked unconscious by a pulse before he could give the last number. Skywalker subsequently attacked Trench and forced him to give up the final number, allowing Windu to disarm the bomb, before killing Trench. After the victory on Anaxes, Echo accepted an offer from the Bad Batch to join their team."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Skako Minor first appeared in the Star Wars: The Clone Wars episode \"A Distant Echo\", which was initially released in 2015 as an unfinished story reel before the completed episode premiered on Disney+ in 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}