{"url": "Mission_to_Sinta_Glacier_Colony", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Missions of the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Mission to Sinta Glacier Colony"}, {"tag": "p", "text": "The Mission to Sinta Glacier Colony was a mission undertaken in 35 ABY by members of the Resistance to obtain information regarding a First Order spy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following a mysterious galaxy-wide transmission in the voice of the late Darth Sidious, General Leia Organa of the Resistance dispatched secret agents across the galaxy to investigate the origin of the transmission. One such group, led by Commander Poe Dameron, was sent to the Sinta Glacier Colony to investigate possible leads pointing to a spy within the First Order. Their informant, Boolio, originally told them he would provide them with a regulator to repair the Resistance flagship, the Tantive IV, as he did not want to reveal the information he was privy to over the HoloNet."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The group of Resistance members traveled to the colony on the Millennium Falcon. En route, Poe Dameron and Finn played a game of dejarik against Chewbacca. When the two suggested Chewbacca was cheating, he flew into a rage, which abated when the ship's navicomputer announced their arrival. As Dameron aproached the cockpit, he asked fellow crew member Klaud whether the Falcon's power surge was fixed, with Klaud replying in his own alien language."}, {"tag": "p", "text": "The Falcon exited hyperspace, flying through the passages of the glacier. Hovering beneath a maintenance hatch, the ship opened its top hatch so Finn could collect Boolio's data reel. The wire was plugged into R2-D2, and the data transfer began. However, First Order spies had tracked the mole's transmission to Boolio, and had dispatched a swarm of TIE fighters to the colony. With time ticking down, the Falcon began its hasty retreat, data onboard, with Boolio telling the Finn that a Resistance victory would suffice as a thank you."}, {"tag": "p", "text": "As Poe flew the Falcon through the colony, Finn manned the ventral gunner position. Whilst his shots downed one of the four fighters pursuing them, he was unable to dispatch the other Special Forces craft. Dameron instead rolled the ship to allow Finn a clear shot at a nearby walkway, which collapsed, taking the enemy TIEs with it. As more fighters approached the ship, Poe flew through a nearby ice wall, jumping to lightspeed."}, {"tag": "p", "text": "With the enemy fighters still in pursuit, the Falcon dropped out of lightspeed in the Crystal Chaos of Cardovyte. Dameron slalomed the ship through the crystal spires, with one of their pursuers colliding with a spire. The Resistance ace then jumped the ship to lightspeed again, employing lightspeed skipping, an old pirate trick, in order to outwit the First Order's hyperspace tracking systems. The ship dropped out of lightspeed, now at the Mirror-Spires of Ivexia. Two more TIE whisper starfighters were destroyed, before the Falcon jumped to lightspeed once again. The final jump brought them to the Megafauna Chasm of the Typhonic Nebula, home to a variety of large beasts. One such creature reared up in front of the ship, with the two remaining enemy fighters crashing into it's gaping maw, and the Millennium Falcon made a rapid return back to the Resistance base on Ajan Kloss."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon the Falcon's return, the overloaded systems blew, and large parts of the freighter caught fire. Poe and Rey became locked in a short, albeit heated argument, with the latter chastising the condition of the late Han Solo's beloved craft. Poe retorted by scolding Rey's apparent lack of conviction regarding the Resistance's cause, claiming that her efforts should focus on practical military matters rather than those concerning the Force. Shortly thereafter, R2-D2 uploaded the critical information obtained into the base's main computer. Later that same day, the majority of the Resistance congregated in the main hangar to listen to the now decrypted message. The message confirmed the rumors of Sidious' return, and his designs to launch a fleet of Xyston-class Star Destroyers from the world of Exegol. With the planet's location unknown, Rey decided to follow in her old master, Luke Skywalker's footsteps, and departed with her friends to Pasaana, where she hoped to pick up Luke's trail, and find a Sith wayfinder, a device which could lead her to Exegol."}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}