{"url": "Mission_to_Sulon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Brema sector", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Sulon"}, {"tag": "p", "text": "During the year 5 ABY, the Human mercenary Kyle Katarn was given permission by the New Republic to track down and eliminate the Dark Jedi Jerec and his Imperial faction, and stop his plans to uncover the mythical power of the Valley of the Jedi. The operation began when Katarn partook on a mission to his old home on the moon Sulon, along with the New Republic agent Jan Ors. Upon arriving to his father's homestead, Katarn observed three of Jerec's Dark Jedi followers, Boc Aseca, Sariss, and Yun, remove several cart fulls of ceiling tiles from the homestead before leaving for the nearby city of Barons Hed."}, {"tag": "p", "text": "Katarn infiltrated his Imperial guarded home alone, and eventually found the family droid, WeeGee. WeeGee deciphered a datadisc that Katarn had retrieved from the moon Nar Shaddaa, which was originally from his family home, and discovered a message from his father, Morgan Katarn. Morgan explained that Katarn was to be a Jedi, and gave him a lightsaber and a map to the Valley of the Jedi, which was carved into the ceiling. However, Katarn realized that the ceiling tiles were missing, and that they were the tiles the Empire had confiscated earlier."}, {"tag": "p", "text": "The Imperials brought the map to the Sulon Government House, where it was placed under the care of 8t88, a droid information broker who was also working for Jerec. 8t88 was supposed to eventually deliver the map to Jerec personally, but instead the droid took the liberty of translating the etchings into a digital map file, which he could then transmit to Jerec's Star Destroyer remotely. Katarn tracked down the physical map, evading various Imperial troopers and bounty hunters, and learned about 8t88's digital copy of the map. Katarn killed 8t88's guards and cornered the droid, but they were interrupted by Yun, who was sent to destroy the physical map. Yun succeeded in his initial mission, and then dueled Katarn with his own lightsaber while 8t88 made his escape. Katarn bested Yun, but spared the Dark Jedi's life. Katarn fought his way through the towers of the Government House, and chased 8t88 to a roof top. He was too late, however, and 8t88 escaped to Fuel City, where he was to retrieve his payment from Jerec. 8t88 boarded the starship Sulon Star, and was subsequently beheaded by two more of Jerec's Dark Jedi, Gorc and Pic."}, {"tag": "p", "text": "Katarn and Ors followed 8t88 to Fuel City, and Katarn was dropped off near the fuel station where the Sulon Star was being refueled. Ors kept the traffic communication officer Captain Zyak occupied while Katarn snuck aboard the Sulon Star, eventually finding 8t88's deactivated body. Before he could recover 8t88's cranial unit, which housed the digital map, it was eaten by 8t88's pet hornagaunt Grendel. Gorc attempted to ambush Katarn immediately after, but Katarn shot him in the face, killing him. Pic attacked, but was knocked unconscious. Grendel was also killed, and Katarn cut 8t88's head out of Grendel's stomach. Soon after, Pic awoke and tried to attack again, but Katarn used the droid's heavy, metal cranium to kill Pic."}, {"tag": "p", "text": "Katarn fought his way out of the ship, and reached a topside hatch, where he was picked up by Ors in the ship Moldy Crow. They returned to the Katarn homestead to study 8t88's map, and discovered that Jerec was heading to the planet Ruusan, where the Valley was located. After they were joined by rebel hero Luke Skywalker, they departed Sulon together to rejoin the New Republic fleet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Jerec's hunt for the Valley of the Jedi"}, {"tag": "p", "text": "During the year 5 ABY, the Galactic Empire warlord and Dark Jedi Jerec was making a bid to seize control of the galaxy from the newly formed New Republic by finding the mythical Valley of the Jedi and use the power imbued their to attain his throne as Emperor. Jerec captured the Jedi Qu Rahn over the planet Dorlo, and after an interrogation, discovered that a map to the Valley's planet existed, and that it was in the possession of Morgan Katarn, a man Jerec had murdered years prior. Jerec was assisted in his search by the Model 88-series administration droid information broker 8t88, who ransacked Morgan's homestead on the moon Sulon and found a variety of datadiscs."}, {"tag": "p", "text": "Among the assorted discs included one that 8t88 was unable to decode, leading to him to believe that the disc was of importance. He then sought out Morgan's son Kyle Katarn, a former Imperial cadet and Rebel Alliance operative, on the moon Nar Shaddaa and attempted to force Katarn to decode the disc under the guise of telling Katarn who murdered his father. Katarn, however, refused to help, prompting 8t88 to order his hired guns to kill Katarn. 8t88 underestimated Katarn's abilities, however, and Katarn was able to recover the datadisc and escape Nar Shaddaa with the help of his friend and ally, Jan Ors, a New Republic agent"}, {"tag": "h3", "text": "The New Republic's involvement"}, {"tag": "p", "text": "Given Katarn's injuries obtained from the shootouts with hired killers on Nar Shaddaa, Ors brought Katarn to the New Republic medical frigate Mercy. While he was recovering, Ors found the datadisc and with the help of Warrant Officer Xiong Wong and a slicer named Wires, the disc was partially decoded. They discovered that the disc was a message from Morgan to his son, and that Morgan had both a map to the Valley of the Jedi and that he had Rahn's lightsaber—the latter of which was to be given to Katarn as he was sensitive to the Force and had the potential to become a Jedi. Ors brought the disc to New Republic leaders Mon Mothma and Princess Leia Organa and the Jedi Knight Luke Skywalker. After they viewed the message, Ors explained that Katarn had plans to personally hunt Jerec down in revenge for Morgan's death. Mothma, however, doubted Katarn's ability to carry out the mission against Jerec due to the fact that the Valley of the Jedi was considered to be the stuff of legends, and was further troubled by Katarn's past as an Imperial soldier and the conflict of interest that that history could present."}, {"tag": "p", "text": "Skywalker, however, pointed out that if the Valley was real, it would be well worth any risks to stop Jerec from taking it, regardless of Katarn's past. Furthermore, Skywalker pressed that Katarn needed to find his destiny. Despite this opinion, Skywalker also believed that any number of things could go wrong with a self-taught Jedi. Nonetheless, Mothma ultimately agreed to let Katarn do what he will, but ordered Ors to execute Katarn if he turned on them. Ors, who was in love with Katarn, lied that she would."}, {"tag": "p", "text": "Meanwhile, Katarn had a vision in the sickbay, where he was visited by the spirit of Rahn. The Jedi implored Katarn to not make his mission one of revenge, but to make it a mission to save the galaxy from the wrath of Jerec. Katarn awoke sometime later, fully recovered. Ors had since replaced the datadisc into Katarn's pouch, and expressed her concern towards Katarn chasing after Jerec. Katarn, who was still unaware of the disc's contents, was not ready to chase Jerec yet, and believed that he would find answers in his old home on Sulon. Katarn's HWK-290 light freighter, the Moldy Crow, had to be repaired before it could go anywhere."}, {"tag": "p", "text": "Meanwhile, 8t88 had returned to Sulon, and took residence in a Government House in the city Barons Hed, which was constructed during Jerec's brief rule as governor of the moon."}, {"tag": "h2", "text": "The mission to Sulon"}, {"tag": "h3", "text": "Returning home"}, {"tag": "h4", "text": "Morgan's homestead"}, {"tag": "p", "text": "Jerec moved his entire force over Sulon, and sent three of his seven Dark Jedi down to the moon's surface—Sariss, her Epicanthix apprentice Yun, and the Twi'lek Boc Aseca. Morgan's map had been located in his workshop, and was removed tile-by-tile to be placed on a Lambda-class T-4a shuttle. As the process went on, Katarn watched from half a kilometer away, hiding in tall grass. Aseca sensed Katarn through the Force, and briefly stared right at him, although his warning went unheeded by Sariss and Yun. Likewise, Katarn sensed Aseca. When the last of the tiles were loaded onto the shuttle, the Dark Jedi prepared to leave, and Katarn disembarked towards his father's home. The map was delivered to 8t88, as he was to decipher it."}, {"tag": "p", "text": "Although the Dark Jedi had left, the farm was left under the heavy guard of Grave Tuskens, mercenary Tusken Raiders from the planet Tatooine that acted as the personal soldiers of the Dark Jedi Maw. Imperial stormtroopers and a single All Terrain Scout Transport also patrolled the farm grounds."}, {"tag": "p", "text": "Katarn first encountered a bowcaster wielding Tusken guarding the front door, and after dispatching the mercenary, the agent discovered that the front door was jammed shut. Fighting through more mercenary Tuskens, Katarn accessed the inside of the house by crashing through a wooden window frame, which landed him a bedroom. He continued to move through the house, and made it back to the front door, which forced open by Tuskens on the outside. Katarn killed the attackers, and attempted to cross a wooden beam which extended past a hole in the floor. However, the beam collapsed under the agent's weight, forcing him to find his way through a kitchen."}, {"tag": "p", "text": "Katarn was routinely displeased with the state of disrepair that his home had fallen into. However, he did come across a 3-D photo of his mother, which he removed from the farmhouse's wall and stored in his pocket. Katarn eventually encountered a locked door which required a red colored key. After some searching, Katarn found the key in the homestead's garage, which was also filled with Tuskens. Katarn killed them, and opened the previously locked door. Nearby the door existed a collapsed ceiling which blocked off access to other areas of the house, such as Morgan's workshop. Katarn eventually came to the home's water well. Due to the structural damage of the house, areas of the dam had been damaged. Using a pair of wrenches, Katarn moved parts of the dam to drain a portion of the well, and accessed a previously cut off door, which led him to a large pool of battery acid. Katarn was able to traverse the pool, but encountered mailocs, flying creatures with a deadly stinging tail, that tried to attack him. Katarn fended the mailocs off, and found his father's workshop."}, {"tag": "h4", "text": "Finding an old friend"}, {"tag": "p", "text": "After conducting a brief search of the workshop, Katarn uncovered the family droid WeeGee, who had been knocked out of commission years earlier by a stormtrooper. Katarn twisted several of the droid's parts back together, and managed to get WeeGee's disc reader back in working condition. Katarn played the disk, and saw the message from his father. Although the map Morgan spoke of had been confiscated by the Imperials, Rahn's lightsaber had been stored in one WeeGee's internal compartments. WeeGee came to life moments later, but did not initially believe Katarn to be who he claimed to be. However, Katarn was able to convince his old friend after further discussion. After WeeGee was brought up to speed on past events, WeeGee explained to Katarn that the ceiling tiles had the map to the Valley of the Jedi etched on to them, and were then covered in plaster in order to hide them. WeeGee also explained that Rahn had stayed at their home for a while and helped Morgan with the map."}, {"tag": "p", "text": "Afterwards, Katarn considered his options, and planned to head after the Imperial shuttle in Barons Hed. He also decided to bring WeeGee with him. The best way out was through the farm's elaborate irrigation system, but the exit of the house was guarded by a stormtrooper and the Gamorrean mercenary Brollo. WeeGee provided a distraction, however, by ramming through a door and into another hallway, which surprised the guards. While they tried to figure out what was going on, Katarn shot and killed them both."}, {"tag": "p", "text": "Katarn and Weegee made their way through the Tusken guarded irrigation system and, eventually, Katarn and WeeGee entered an underground portion of the irrigation system labeled \"main central.\" This particular tunnel lead to a vehicle park, where Katarn hoped to acquire transportation. However, on the way they encountered the hunter killer droid 8-13, an outdated war droid that had found its way into the tunnel via unknown means. WeeGee closed the gap between him and 8-13, and they engaged in melee combat. 8-13, who was programmed to fight Humans, was unable to overcome WeeGee, and the farm droid ripped the war droid's head off."}, {"tag": "h4", "text": "Roadblock rescue"}, {"tag": "p", "text": "Upon leaving the irrigation system, Katarn and WeeGee found an unattended T-4 speeder. However, the Imperials had discovered the bodies of Brollo and the stormtrooper, and were placed on alert. Katarn and WeeGee boarded the speeder, and took off down a road heading for Barons Hed."}, {"tag": "p", "text": "They were spotted, however, and they were pursued by Grave Tuskens on speeder bikes, led by the Tusken leader Rogg and his second-in-command Bordo. Rogg opened fire on Katarn's speeder when it came into range, prompting Katarn to man the T-4's turret. Katarn killed several Tuskens and triggered an explosion, but Rogg survived the blast and kept coming as they moved onto a massive bridge. Katarn left the turret to focus on piloting the craft, and tried in vain to make the speeder move faster. Due to the distraction, Bordo and another Tusken managed to get close enough to the T-4 to board it. However, with the other Tuskens distracted, Bordo decided to usurp control from Rogg, and shot the Tusken leader off of his bike. The other Tuskens failed to notice Bordo's betrayal."}, {"tag": "p", "text": "As the chase continued, Ors arrived in the Moldy Crow, and WeeGee pointed out that the Imperials had set up an unavoidable roadblock. Ors paged Katarn over a comlink, and lowered the ship's ramp. However, the ship was too high to reach. Katarn shot Bordo and the other Tusken off of the T-4, and WeeGee grabbed Katarn and rocketed onto the Crow using his repulsors, seconds before the speeder crashed into the blockade, knocking an AT-ST off of the bridge and killing a platoon of stormtroopers."}, {"tag": "p", "text": "Most of the remaining Tuskens were going to fast to avoid the blockade themselves, and ultimately only a few Grave Tuskens survived the battle. The damage was enough to allow the Crow to escape to Barons Hed."}, {"tag": "h3", "text": "Barons Hed"}, {"tag": "h4", "text": "Into the fallen city"}, {"tag": "p", "text": "Although 8t88 was supposed to eventually deliver the physical map tiles to Jerec's Vengeance-class Super Star Destroyer Vengeance, the droid instead took the liberty of translating the map into a digital file. However, upon arriving to the Barons Hed Government House, which was also known as the Dark Palace, the building's commanding majordomo, who disliked droids, sent 8t88 to reside in a coat room, passing it off as a VIP guest suite. 8t88 figured out the duplicity—as he realized that a suite had no business being adjoined to a ballroom—and executed the majordomo as a result. Afterwards, 8t88 fed the body to his pet hornagaunt Grendel."}, {"tag": "p", "text": "The majordomo's death caused the house servants to be more compliant towards 8t88, and he and the map were moved to the ballroom, which contnained a turbolift that rose to the building's roof. It was there that 8t88 completed the digital map."}, {"tag": "p", "text": "Meanwhile, Katarn and Ors parked the Moldy Crow on a ridge overlooking Barons Hed and guessed that 8t88 was in the Government House, which was under heavy guard. As such, Katarn opted to enter the city alone. Upon reaching the city limits, Katarn found that security had been heightened due to the operative's previous engagement with the Imperials. Katarn considered several methods of entry, including disguises and ruses, but settled on hitchhiking on the leg of an AT-ST that was attempting to maneuver past a herd of gra. Katarn rode the AT-ST into Barons Hed's perimeter, and eventually disembarked when no one was looking. He eventually made it to a canal that fed the city's water supply."}, {"tag": "p", "text": "Katarn moved north upstream, and found that Jerec had hired Gran bounty hunters and mercenaries to patrol the streets for potential threats, working alongside the Grave Tuskens. Katarn made his way up the stream, which fed into the Barons Hed Lagoon, and dispatched any mercenaries he encountered, while sparing any civilians who managed to get in the way. Katarn eventually had to bypass the lagoon and avoid the drugons that swam beneath the water's surface. He finally made it to the paved streets, and cleared a residence of Grave Tuskens and Gran."}, {"tag": "h4", "text": "Gran, Tuskens, and rabbits"}, {"tag": "p", "text": "As he exited the building, he came across a locale known as the House of Max, which was a residence that was inhabited by a woman and the pint-sized lagomorph Max. Katarn accessed the otherwise locked house when the woman opened the door for herself, and Katarn followed her in. Katarn met Max, and the hyper-kinetic rabbit agreed to accompany Katarn and fight the Imperial mercenaries. Together, they blasted through Jerec's hires."}, {"tag": "p", "text": "Among their exploits against the hired bounty hunters, there was a tavern that hosted five Gran bounty hunters, one named Shmorg, who began to murder each other over a dispute over a bar tab. After two of the Gran were killed, Katarn finished off the survivors. Katarn and Max later came across a mercenary infested bazaar and later a local shop where two Gran were harassing the storeowner—all of the bounty hunters and mercenaries encountered were slain by Katarn and Max. The storeowner, a Rebel sympathizer, allowed Katarn to access her hidden storerooms in gratitude."}, {"tag": "p", "text": "Katarn and Max later came across a large outdoor marketplace that was being attacked by Gran and Tusken mercenaries. While rescuing the local citizens from the onslaught, Katarn discovered that a section of Barons Hed had been sealed off from the rest. Once the mercenaries were killed, the destructive pair briefly visited Club Hed before moving through a ransacked apartment. However, as Katarn neared the sealed off portion of the city, he and Max parted ways."}, {"tag": "h3", "text": "The Dark Palace"}, {"tag": "h4", "text": "Infiltration"}, {"tag": "p", "text": "Katarn, alone again, moved towards the center of the city towards Barons Knoll, which was where the Government House was located. However, a cyborg bounty hunter had spotted Katarn's lightsaber hanging from his belt and cornered the fledgling Jedi in an alley. She asked for the lightsaber so that she could sell it for credits, but Katarn declined and sarcastically offered to trade the lightsaber for the hunter's remote droid instead. The woman went for her blasters, but Katarn was quicker and shot her through the neck. The remote revealed a large blade, and descended upon its master's killer with haste. Katarn tried to shoot the droid, but found that it was too nimble, and while avoiding it he stumbled over a curb and dropped his blaster. As the droid came closer, Katarn once again heard the voice of Rahn who instructed Katarn to use his lightsaber and trust in the Force. With Rahn's guidance, Katarn destroyed the remote with his eyes closed."}, {"tag": "p", "text": "After that Katarn moved into the sealed portion of the city, which lay in ruin. Upon reaching the edge of the ruins, Katarn was immediately set upon by a Viper probe droid. After destroying it, Katarn continued through razed buildings, evading sequencer charges and destroying more probe droids as he went. Eventually, Katarn discovered the beginnings of an Imperial base, and used a turbolift to gain access into a room of probe droids, some of which were inactive. Katarn destroyed the active droids, and began to move through a corridor that contained a two-man stormtrooper patrol. Katarn dispatched the troopers, and finally came to the base of the tower."}, {"tag": "p", "text": "Heavily guarded, the tower's defenses included patrols of stormtrooper, Imperial officers, a TIE/sa bomber, multiple AT-STs and automated turrets. Katarn fought the ground forces in a clockwise movement, circling the tower while taking out squads of stormtroopers, officers, and the walkers. A bridge in the tower had been lowered, however, forcing Katarn to find the two control rooms that could control its movements. Katarn killed the Imperial guards, but found that the multiple control rooms required several individuals to operate the bridge controls at once. Katarn called upon the Force to increase his movement speed and managed to activate all of the necessary control panels, which gained him access to the bridge. After taking out another AT-ST and its pilot, Katarn accessed the tower. Eventually, after a debacle with bulkhead doors and further troopers, Katarn reached the main anteroom and took an elevator to the upper levels of the Government House. At some point Katarn encountered 8t88's personal bodyguards—Rol, Hontho, and Trox—and killed them."}, {"tag": "p", "text": "As these events unfolded, Jerec contacted 8t88 from the Vengeance, and demanded to know why the map had yet to be sent to him. 8t88 explained that the delay was because of the liberty he had taken in creating a digital map to the Valley of the Jedi. Jerec was pleased with the droid's creativity, and as such no longer had any need of the physical map. He ordered Yun to destroy the physical map, and told 8t88 to collect his payment in Fuel City, which was outside of Barons Hed."}, {"tag": "h4", "text": "Duel with a Dark Jedi"}, {"tag": "p", "text": "With the digital map sent to Jerec and Yun on his way to destroy the physical map, 8t88 prepared to leave for Fuel City, where his payment awaited on the freighter Sulon Star. However, Katarn had made it to the droid's room, and held the informant at gunpoint and demanded the map. 8t88 offered the physical map, but Katarn had learned about 8t88's digital copy and wanted that instead. At that moment, the room's turbolift lowered, revealing the Dark Jedi Yun. Leaping from the lift to the map, Yun super-heated the stone tiles with his lightsaber until they exploded, and then pushed Katarn back with the Force. 8t88 used the distraction to escape alongside Grendel, and they headed for the hangar in the palace's second tower, where his shuttle awaited. Yun taunted and disarmed Katarn of his blaster, forcing the New Republic operative to pull out his own lightsaber. Yun was amused by the act, but Katarn noted that he had learned fencing at the Imperial Academy of Carida. Yun struck, and the two dueled."}, {"tag": "p", "text": "As they fought, Yun used Force abilities such as Force Jump, persuasion, and blinding. Despite these abilities, Katarn won the duel after he struck Yun's arm. Yun fell and lost his lightsaber, finding himself at Katarn's mercy. The Dark Jedi urged the light side Jedi to kill him, just as Yun would kill Katarn if the situation had been reversed."}, {"tag": "p", "text": "However, Katarn spared the Dark Jedi's life. Confused, Yun backed away and called Katarn weak. Yun levitated himself from the room, leaving through the ceiling hatch from which he had originally arrived. Imperial stormtroopers and a non-commissioned officer arrived soon after, and Katarn called on Ors for a pickup at the tower. Katarn killed the attackers, and gave chase to 8t88 yet again."}, {"tag": "h4", "text": "Escaping the Dark Palace"}, {"tag": "p", "text": "With the elevator 8t88 used to escape occupied, Katarn opted to ride the turbolift that Yun arrived on to the roof of the tower. However, the lift was unable to ascend that high, and instead took Katarn to a basement under the ballroom. Katarn killed the resident stormtroopers, rode the lift back up, and used his lightsaber to slice through a circuit board in the ballroom floor that forced the turbolift to ascend completely. The Imperials were waiting, however. While a TIE bomber carpet bombed the tower's roof in an effort to kill the newly arrived Jedi, stormtroopers patrolled the perimeter while automatic guns scanned for targets. Katarn killed the stormtroopers, evaded the bomber, and jumped down into the tower's ventilation system. Katarn crawled through the air ducts and made his way to a control room, killing all encountered resistance, including a stormtrooper who called for reinforcements. Katarn eliminated further threats until he reached a turbolift that descended deeper into the tower."}, {"tag": "p", "text": "However, rather than finding further Imperial troops, Katarn instead landed in a room containing a large kell dragon. Impervious to conventional blasters, Katarn was forced to use explosive weapons and his lightsaber to slay the beast. Katarn reactivated the turbolift with a nearby control panel. Traveling a floor up, Katarn entered another elevator, climbed out of it as rose, and jumped onto a descending elevator. Katarn jumped down another shaft, which ended up throwing him onto the end of a large ventilation pipe, where Katarn was instantly greeted by a squad of field stormtroopers and an Imperial commando, all of which were eliminated."}, {"tag": "p", "text": "As the hangar 8t88 had fled to was in the second tower of the Government House, Katarn needed a way to get to the other tower before the droid could leave. As it turned out, the towers' ventilation tubes faced each other, and using a gust of wind from one of the tubes, Katarn was able to jump the gap between the towers. Traversing the edge of the second tower, Katarn dropped into a blackened room, fought off the Imperials located there, and continued into another, brighter room chock full of field troopers. Katarn fought his way through the troopers, and eventually made it to an elevator that rode to the roof of the second tower, which was actually a large bay door for incoming and outbound ships, such as 8t88's Lambda-class shuttle. The elevator led to a corridor that led to the roof, which was was sparsely guarded. Katarn contacted Ors, requesting a pickup at the top of the tower. However, when Katarn arrived, the bay doors opened and 8t88's shuttle flew off to Fuel City."}, {"tag": "p", "text": "The Moldy Crow arrived scant seconds later to pick up Katarn, and they prepared to follow 8t88's shuttle. 8t88 arrived at Fuel City the next day, and went directly to the Sulon Star, which was currently docked at Fuel City in order to refuel before it embarked on its journey to Ruusan along with the rest of Jerec's fleet. Once aboard, 8t88 was received by two more of Jerec's Dark Jedi, the so called \"Brothers of the Sith,\" Gorc and Pic. 8t88 demanded his payment, and was decapitated by Pic. His head was then placed back onto his body, and was put under Grendel's guard."}, {"tag": "h3", "text": "Escapades in Fuel City"}, {"tag": "h4", "text": "Brothers of the Sith"}, {"tag": "p", "text": "With the helpful photoreceptors of WeeGee, Ors followed 8t88's shuttle, Furious, to Fuel City, and planned to drop Katarn off on the roof of fueling station six. They were quickly received by the Imperial traffic controller Captain Zyak. Ors dropped off Katarn at the chosen insertion point, and Ors communicated to Zyak that she was simply lost. Zyak had encountered pilots in similar situations, and let Ors off with a warning. However, attracted to her voice, Zyak informed Ors to watch out for danger, having heard about Katarn's fighting in Barons Hed, unaware that Ors had actually been apart of it. Initially, Katarn was unsure of what fueling dock held 8t88's destination. Three of the nine stations were occupied, and Katarn narrowed it down to the Sulon Star, noting that one of the other ships was fully automated, and the other was too small to be an Imperial ship. The ship was guarded by Imperials and Trandoshan mercenaries, but Katarn found an emergency hatch on the roof of the ship and jumped in. Greeted by troopers, Katarn began to fight his way through the ship."}, {"tag": "p", "text": "Along with various troopers, the ship was also inhabited by automatic sentry guns and probe droids. Katarn found a set of turbolifts that led to a control room, and Katarn killed the guards and stole a red keycard which he used to access a weapons cache. Eventually Katarn made it to an observation deck overlooking the ship's small docking bay, where the Furious stood in plain sight, confirming 8t88's presence on the ship. Moving further into the ship, the red key continued to come in handy, unlocking other stock rooms. Katarn made it to the reactor control room, and fought through a wave of field troopers and their officer before deactivating several force fields in order to grab a blue keycard."}, {"tag": "p", "text": "After clearing a storeroom of stormtroopers and killing two field troopers in a corridor, the Jedi made his way into the ships ventilation system, where he traversed a precarious spinning fan. Survivng the ducts, Katarn found his way into the ship's reactor core, and shut it off for forty-five seconds, which was enough time for Katarn to sprint through the core room and avoid any radiation poisoning. The core ended up leading to the shuttle bay, where Katarn finally encountered the Furious in person. Figuring that 8t88 could not be far, Katarn pressed on. However, having difficulty pinpointing the droid, Katarn called on the Force, and managed to locate the droid in a cargo room. Ignoring Grendel's snarling, Katarn confronted 8t88 for the last time, only to watch the droid's head fall from his shoulders and get eaten by Grendel."}, {"tag": "p", "text": "Gorc stepped from the shadows, and ignited his lightclub. Gorc had used the Force to hide his presence, and Katarn was surprised by the ambush. Gorc rushed Katarn, arms open, only to receive a blaster shot in the face, killing the Dark Jedi. As Katarn reflected on Gorc's mistake, Pic leaped from the shadows and began to tear and claw at Katarn's back and face, repeatedly trying to stab him with a knife. After an intense struggle, Katarn knocked Pic unconscious. Grendel attacked next, but instantly lost the top of his head to Katarn's lightsaber, before being dissected by the Jedi. Katarn pulled 8t88's head from Grendel's intestines as Pic regained consciousness, who lunged at Katarn from behind."}, {"tag": "p", "text": "Katarn reacted to Pic's attack through reflex, and swung 8t88's head in the Dark Jedi's direction. Skulls collided, and Pic was instantly killed by 8t88's heavy cranium. Imperial troops quickly arrived on the scene, forcing Katarn to flee the room and head back into the belly of the Sulon Star. Katarn faced various stormtroopers, commandos, and officers, but eventually fought his way to an elevator hub, and acquired red, blue, yellow, and green keycards that accessed different parts of the ship. After a series of guard rooms and catwalks, Katarn eventually made it back to the top of the ship."}, {"tag": "h4", "text": "Escape from Fuel City"}, {"tag": "p", "text": "The fighting on the Sulon Star quickly reached the ears of Captain Zyak, who was just starting to leave his station for the day, with an air-traffic control school graduate, Lieutenant Nomo, having just arrived to take his place. Zyak ordered Nomo to contact the troopers around station six to cease fire, in fear of a wayward shot igniting a fuel container. Meanwhile, another tech noticed that the Moldy Crow was returning, as Nomo relayed a message from the ground officer informing Zyak that Katarn was to be killed at whatever cost. Zyak dismissed the ground officer, and upon realizing that Ors had lied to him, ordered that she be shot down. Ors evaded the turbolasers, and destroyed storage tank sixteen, causing a massive explosion, which Nomo thought was the Moldy Crow exploding. As Zyak tried to control the situation, Ors shot tanks fifteen, fourteen, and thirteen."}, {"tag": "p", "text": "Realizing that there was no hope of salvaging the mess, Zyak sarcastically informed Nomo that if the graduate could figure out how to ease the situation by Monday, Nomo would be promoted to captain, or else face a sentence to work in mines. Believing that the blame would fall on his shoulders anyways, Zyak decided to go AWOL."}, {"tag": "p", "text": "Evading the explosions and further laser fire, Ors eventually made it to the Sulon Star and plucked Katarn from the roof. The Jedi introduced Ors and WeeGee to 8t88's cranium, and Ors pushed the ship off. However, their escape was disrupted by the appearance of two TIE/LN starfighters. Katarn suggested they head to the Nefra Canyons to lose them. With fancy flying, the first TIE fighter was unable to imitate Ors' piloting through the rocky cliffs and outcroppings, and crashed into stone. The second pilot proved to be better, and managed to match Ors' flying."}, {"tag": "p", "text": "Katarn climbed through a hatch on top of the Crow and used his Bryar pistol to shoot at the fighter. Although the pistol did little to damage the TIE fighter, a bolt scuffed up the cockpit window, forcing the pilot to lean over and lose his concentration. The pilot tried to follow the Crow through the canyon, but did not see Ors jerk up to avoid an oncoming cliff face. The TIE fighter slammed into the wall, killing the pilot. With no further resistance, the agents were free to go on their way, and returned to the Katarn homestead."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Ors piloted the Crow back to the Katarn homestead and orbited the grounds three times to look for Imperial troops. Finding that the coast was clear, Ors hid the ship in the ruins of an abandoned factory, and the agents camped there for the night and next day before returning to the farm the following night. Back in Morgan's workshop, WeeGee plugged into 8t88's cranium and used its photoreceptors to display the digital map over the room. Upon finding Ruusan's location, Ors and Katarn celebrated by dancing and a kiss, which was inturrupted by the appearance of a ship. Believing it to be Imperial, Katarn rushed to turn off the home's lights, but found that it was a New Republic X-wing fighter. The pilot was Skywalker, having arrived to check on Katarn's progress."}, {"tag": "p", "text": "Katarn realized that Ors had shown his datadisc to Republic command, and the two had a brief argument before Skywalker greeted them. The experienced Jedi gave Katarn some advice about the latter's continuing journey, and learned that Jerec was already on his way to the Valley of the Jedi. He also revealed that he had known Morgan Katarn, and told them of a prophecy that dealt with the liberation of Jedi spirits trapped in the Valley. They left Sulon and rendezvoused with the New Republic fleet in the Milagro system, where they briefly fought an Imperial force."}, {"tag": "p", "text": "Eventually, using the map, Katarn, Ors, and WeeGee made it to Ruusan and fought Jerec's forces. Katarn slew the remaining Dark Jedi, excluding Yun who had actually sacrificed himself to save Katarn from Sariss, and eventually confronted Jerec after the Dark Jedi successfully drew upon the Valley's power. Ors was captured during the operation, but escaped with Katarn's help. Jedi and Dark Jedi clashed in the Valley for a final time, and Jerec was killed. The Dark Jedi's death caused the Jedi spirits trapped in the valley to escape, and Katarn fulfilled the prophecy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kyle Katarn's mission to Sulon first appeared in the 1997 video game Star Wars: Jedi Knight: Dark Forces II, and was introduced in the game's third level. From there, the mission would last an additional nine levels, thus ten total, comprising of nearly half of the entire game. The first level dealt with Katarn infiltrating his old home; the second level featured Katarn leaving his home through the irrigation systems; the third level introduced Barons Hed; the fourth level featured Katarn's entry into the Dark Palace; the fifth level was the duel with Yun; the sixth level was Katarn's escape from the palace; the seventh level took place in Fuel City; the eighth level was Katarn searching the Sulon Star for 8t88; in the ninth level, Katarn dueled with Gorc and Pic; in the tenth level Katarn escaped from the Sulon Star."}, {"tag": "p", "text": "According to Rick Barba, author of the game's official strategy guide, the third and fourth levels of the mission (the fifth and sixth levels of the game) were originally designed to be a single mission. However, the level was instead split into two different parts. Each level of the mission was accompanied with live-action cutscenes starring Jason Court as Kyle Katarn, and appeared at the beginning and end of each level. The exceptions are \"Mission 5: The Barons Head: The Fallen City,\" and \"Mission 6: Into the Dark Palace,\" which have no cutscenes set between them. \"Mission 9: Fueling Station,\" was originally designed where Fuel City was actually a spaceport not on Sulon's surface. The Outrider, the personal ship of Dash Rendar from the video game Star Wars: Shadows of the Empire, would have made a cameo in a cutscene."}, {"tag": "h3", "text": "Adaptions"}, {"tag": "p", "text": "The the first half of Jedi Knight: Dark Forces II was adapted by novelist William C. Dietz into the form of Dark Forces: Rebel Agent, a novella that was published by Dark Horse Comics and released in 1998. The book had several full color illustrations, all of which were created by Ezra Tucker. Rebel Agent was one of a trilogy of books by Dietz, the others being Dark Forces: Soldier for the Empire and Dark Forces: Jedi Knight. Jedi Knight served as a sequel to Rebel Agent, while Soldier for the Empire acted as a prequel for the game Star Wars: Dark Forces, which was Jedi Knight: Dark Forces II's predecessor. Tucker only provided illustrations for Rebel Agent, however, several of which depict the mission to Sulon."}, {"tag": "p", "text": "Chapters five through seven, the last chapters of Rebel Agent, deal with the mission, and the mission is mentioned again in Jedi Knight. The mission was retold yet again when Rebel Agent was adapted into a full cast audio drama."}, {"tag": "p", "text": "In addition, Katarn's duel with Gorc and Pic was adapted into a scenario for the Star Wars Miniatures tabletop game, Kyle Katarn's Tale, Mission 4: Showdown on the Sulon Star, written by Abel G. Peña and Jason Fry. The scenario is loosely derived from how the duel is presented in the novella, but borrows some elements from the game as well, such as Pic's use of a lightsaber, whereas in the novella he uses his claws and a dagger."}, {"tag": "p", "text": "The scenario presents three factions: Katarn's New Republic faction, Gorc and Pic with the Empire, and 8t88 and Grendel acting as an independent faction. As the game did not have pieces to accuratly represent the characters and locations, the scenario suggests the use of a map based on Cloud City, and that the player uses stand-ins for Katarn, the twins, 8t88, and Grendel."}, {"tag": "p", "text": "All of the levels constituting the mission were fully detailed by Barba in Jedi Knight: Dark Forces II: The Official Strategy Guide, who goes through the game on the hardest difficulty setting."}, {"tag": "h3", "text": "Differences between versions"}, {"tag": "p", "text": "Between the game, the novella, and the audio drama, a number of differences and contradictions between the depictions of events present themselves. Firstly, in both the game and the novella, Katarn initially goes to Sulon by himself, as it's mentioned in the game that the Moldy Crow needed repairs. However, in the audio drama, Jan Ors scouts out Morgan's homestead with Katarn, and then stays behind when Katarn infiltrates his home alone. Later, when Katarn finds WeeGee, the game depicts Katarn leaving the droid behind. Both the novella and the audio drama depict Katarn bringing WeeGee along through the irrigation system. In all sources, after reaching the end of the system, they encounter a speeder. However, in the game, Katarn is picked up by Ors in the Crow. In the other two versions, Katarn and WeeGee use the speeder to leave the farm, and are later picked up by the Crow during a speeder chase, after which they depart to Barons Hed. The next obvious contradiction is the presence of 8t88's pet hornaguant, Grendel, which appears in the novella and the drama. The pet does not appear whatsoever in the game. Next comes Katarn's infiltration of Fuel City and the Sulon Star. In the game, Katarn battles Imperial forces around the Sulon Star while trying to empty fueling tanks and pipes, which would allow him to crawl into the belly of the ship via its fuel pipes. However, in both the novella and the audio drama, Katarn sneaks aboard the ship through a hatch on the top of the ship without raising alarms. It should be mentioned, though, that the game level after Fuel City begins at the ship's top hatch, and like the novella and audio drama, Katarn enters the ship through the hatch. Thus, the game actually contradicts itself in this matter."}, {"tag": "p", "text": "The next set of differences lie in the duel with Gorc and Pic. In the novella and audio drama, when Katarn finds the beheaded 8t88, Grendel consumes the droid's head. This doesn't happen in the game, as Grendel does not exist in the game. The actual duel between Katarn and the twin Dark Jedi is also different. In the novella and audio drama, Gorc attacks first, is shot in the face and dies, and then Pic attacks. Pic is knocked unconscious, and then later killed when he attacks again. Afterwards, Katarn cuts 8t88's head out of Grendel. In the game, Katarn battles Gorc and Pic in a straightforward lightsaber duel at the same time. Katarn then simply picks up 8t88's head off of the ground after killing the Dark Jedi."}, {"tag": "p", "text": "In order to deal with the various differences, this article foremost treats the general events of the novella as the correct depiction of events, while treating the events in the game as correct when they do not directly contradict the novella, such as when game events could take place in-between certain events. For example, the Barons Hed game mission is placed in-between Katarn's infiltration of the city, and his encounter with a bounty hunter right before he begins his infiltration of the tower. Moments that appear in the game that do not appear in the other sources are also treated as correct when it the events do not directly contradict the novella. For example, the novella does not explain how Katarn got into the Government House, whereas the game does. When this article follows the game, it goes by Barba's guide, and assumes that it is followed in its instructions and suggestions, such as when to spare civilians, and what areas of a level are visited."}, {"tag": "p", "text": "The audio drama's events are treated as canon when they do not directly contradict the novella from which it is based upon. For example, the audio drama states that Ors and Katarn scouted Morgan's home at the same time. The novella, however, states that Katarn scouted his old home and spied upon the Dark Jedi invading it on his own. The audio drama is also used to procure names for certain individuals, such as the droid 8-13, who does not appear in the game, and goes unnamed in the novella. The audio drama also presents new dialogue, most of which is converted from prose paragraphs in the novel. However, the dialogue is also treated as correct when it does not obviously or directly contradict the novella's script."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}