{"url": "Mission_to_Storinal", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Noonian sector", "Category:Battles of the Hunt for Zsinj"], "nodes": [{"tag": "h1", "text": "Mission to Storinal"}, {"tag": "p", "text": "The Mission to Storinal was a Wraith Squadron covert operation with a goal of protecting their assumed collective identity as the crew of the Night Caller."}, {"tag": "h2", "text": "The Mission to Storinal"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "After their successful escape from the pirates at M2398-3,Warlord Zsinj, still believing Captain Darillian alive, contacted the Wraiths to inform them they were shadowed. Face, acting as Darillian, proposed to ambush his pursuers, but Zsinj ordered him to join with Admiral Trigit instead for another mission. But before, Night Caller was to rendezvous with another of Zsinj's vessels, the Hawkbat to receive additional intel and supplies."}, {"tag": "p", "text": "This new turn of events put the Wraiths in dire risk of discovery, since the Hawkbat captain, Bock Nabyl, wanted a meeting with Darillian face to face, and as a secondary problem, they lacked two TIE fighters from the Night Caller complement. Falynn Sandskimmer told them that wouldn't be too much of a problem: TIE fighters were readily available nigh everywhere around them, and stealing two wouldn't be too much of a challenge for the Wraiths. Ton Phanan then proposed that they simply show up at the rendezvous under a quarantine flag, but Wedge dismissed the idea, stating it would raise Zsinj' suspicion. Face then proposed to infect the Hawkbat crew instead, to divert any suspicion of Zsinj upon the Hawkbat. Wedge was highly skeptical, but Phanan chimed in, stating that if they could find a planet were the Hawkbat would grant its crew some shore leave, infecting them would be easy, since any planet with a spaceport automatically had some sort of disease containment center to treat incoming ships under quarantine. With his skills as a doctor, he could easily identify and handle an infectious agent and lavish it on the Hawkbat crewmen."}, {"tag": "h3", "text": "Arrival on Storinal"}, {"tag": "p", "text": "After refining their plan some more, the Wraiths made for Storinal in the Narra, wearing heavy disguises. With Wedge, Janson and a few other on the Empire's criminal lists, they simply couldn't go in as themselves. The Wraith separated in three groups, each with their own objectives on Storinal:"}, {"tag": "p", "text": "- Janson, disguised as senator-in-exile Iskit Tyestin of Bakura, with Atril Tabanne, Falynn and Piggy parading as his bodyguards formed Joyride Group. Theirs was the task to find and make possible the theft of two TIE fighters."}, {"tag": "p", "text": "- Kell Tainer, Tyria Sarkin and Ton Phanan, the Plague Group, were tasked with acquiring the infectious agent."}, {"tag": "p", "text": "- Wedge, Face and Myn Donos, disguised as Agamaran idiots formed Yokel Group, tasked with finding and entertaining the Hawkbat crewmember."}, {"tag": "p", "text": "- Grinder was to remain hidden into the Narra smuggling compartment unless called upon, victim of the Empire extreme suspicion of any Bothan after their hand in Palpatine's death."}, {"tag": "p", "text": "- Runt would remain hidden in an X-Wing, since, being the only Thakwaash for lightyears around, he was far too recognizable. He could however assist them escaping should things get rough."}, {"tag": "h3", "text": "The operation"}, {"tag": "p", "text": "Once arrived, each group went around doing what the mission required of them, without any major incident."}, {"tag": "p", "text": "- Plague Group had to call on Grinder's expertise, but they were able to infiltrate the Scohar Xenohealth Institute without problems, and Phanan recovered vials of Bunkurd Sewer Disorder, an ailment similar to food poisoning: mild, not very dangerous, but highly infectious. Both he and Grinder also stole a small box containing a Storini glass prowler. Phanan because he liked insects, Grinder to use in some prank."}, {"tag": "p", "text": "- Yokel Group easily identified the Hawkbat crewmember and befriended them by buying them large amounts of drinks while playing stupid. Doing that, they got information about them and their various ships."}, {"tag": "p", "text": "- Joyride Group managed to dome some reconnaissance of the starport's TIE hangars, and identify most security measures. Doing this, Falynn fell from the hangar's roof, and got bruised. While not severely injured, she would have to sleep off the rest of the operation."}, {"tag": "p", "text": "Once their preliminary tasks were completed, the Wraiths regrouped and went about filling their two objective: infection and theft."}, {"tag": "p", "text": "Half of the Wraiths, including Tyria, Janson and Tainer, masqueraded as a maintenance crew, and, while servicing the two shuttles from the Hawkbat, installed the canisters containing the BSD in the air intake system. They managed to get out and reach the Narra in time, despite running in the genuine maintenance crew. Kell goaded the lead mechanic into attacking him, knocked him out and then threatened to report everything. The other mechanic's comrade asked him not to, saying no report was necessary on both their unnecessary presence and fight, and Kell reluctantly agreed before making good his escape."}, {"tag": "p", "text": "The other half of the Wraiths asked Runt to strafe the starport, and made use of the diversion to commandeer two TIE fighters. The remaining Wraiths then quickly boarded the Narra and the whole of them made for Night Caller at full speed."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Wraith mission was successful, since when they reached the rendezvous point, Captain Nabyl informed Face (as Darillian) that his ship was under quarantine, preventing any contact between the crews. Zsinj never harbored any suspicion, since he immediately ordered the Night Caller to join with Admiral Trigit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}