{"url": "Mission_to_Tatooine_(Disciples_of_Ragnos_crisis)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions to Tatooine"], "nodes": [{"tag": "h1", "text": "Mission to Tatooine  (Disciples of Ragnos crisis)"}, {"tag": "p", "text": "The Mission to Tatooine was carried out in 14 ABY by Jedi Master Kyle Katarn and his student, Jaden Korr, for the New Jedi Order. It was also one of Korr's first missions since he started his training at the Jedi Academy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "An old moisture farmer overheard a conversation about the Disciples of Ragnos in a local bar on Tatooine and had his R5 unit record the conversation. He began to fear for his life, however, and decided to sell the droid to some local Jawas. Jaden Korr and Kyle Katarn were sent on a mission to Tatooine to purchase that droid from the Jawas. Katarn considered the mission to be a blue milk run which would give Korr a chance to practice his negotiation skills."}, {"tag": "h3", "text": "Mission"}, {"tag": "p", "text": "However, when they arrived, the Jawas were nowhere to be found. Katarn sent Korr to look for their sandcrawler and went to talk to the local moisture farmers to learn more about the Sith cult."}, {"tag": "p", "text": "Korr ran into some Jawas who were under attack by Tusken Raiders. Fighting his way through caves, canyons and hordes of Tusken Raiders, Korr eventually stumbled upon the sandcrawler, only to find that it had been overrun by the Tusken Raiders and most of the Jawas ruthlessly killed. Korr searched through the sandcrawler, killed all the Tusken Raiders, and eventually found the R5 unit."}, {"tag": "p", "text": "Upon exiting the sandcrawler, more Tusken Raiders attacked Korr, but were defeated. The R5 unit's recorded conversation, along with the droid itself, was retrieved unharmed."}, {"tag": "p", "text": "Back at the Jedi Academy, R2-D2 scanned the R5 unit's memory banks, but presumably found nothing useful."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}