{"url": "Mission_to_Tatooine_(Imperial_Era)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Duels", "Category:Events during the Imperial Era", "Category:Missions to Tatooine"], "nodes": [{"tag": "h1", "text": "Mission to Tatooine  (Imperial Era)"}, {"tag": "p", "text": "During the Galactic Civil War, the Jedi Padawan Ezra Bridger and the C1-series astromech droid Chopper went on a mission to stop the former Sith and Nightbrother Maul from locating the Jedi Master Obi-Wan Kenobi on the planet Tatooine. Unknown to Ezra, Maul had lured him here with the intent of using him to draw Kenobi out of hiding. After being attacked by Tusken Raiders, Ezra and Chopper found themselves lost in the deserts of Tatooine. They were rescued by Master Kenobi, who instructed them to escape from Tatooine. Maul then fought Kenobi but was defeated and killed by the Jedi Master."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Dathomirian Darth Maul was abducted in his childhood by the Sith Lord Darth Sidious, who trained him as his Sith apprentice during the last decades of the Galactic Republic. After being bisected by the Jedi Padawan Obi-Wan Kenobi at the Battle of Naboo against the Trade Federation during their invasion of Naboo, Maul was cast away by Sidious. After being rescued by his brother Savage Opress, Maul sought revenge against his old adversary Kenobi for nearly killing him and causing him to lose his place in the Sith during the Clone Wars."}, {"tag": "p", "text": "Maul established the Shadow Collective and briefly took control of the planet Mandalore. However, Sidious captured Maul on Mandalore; and his new apprentice Count Dooku, and the Confederacy of Independent Systems destroyed the Shadow Collective. Maul escaped the Sith and was forced into hiding again. Years after escaping the former Padawan Ahsoka Tano, Maul ended up on the ancient Sith world of Malachor. He sought to enter the Malachor Sith Temple, which he believed held a Sith holocron that held the key to destroying the Sith."}, {"tag": "p", "text": "Around 3 BBY, Maul encountered the young Jedi rebel Ezra Bridger on Malachor, and sought to recruit the boy as his apprentice. After obtaining the Sith holocron and Ezra's Jedi master Kanan Jarrus' holocron, Maul and Ezra underwent a ritual in which the former learnt that Kenobi still lived. Following another encounter with Ezra on Dathomir, Maul and Ezra learnt that Kenobi was hiding on a world with twin suns."}, {"tag": "p", "text": "Following the Great Jedi Purge, Kenobi had settled on Tatooine to hide from the Galactic Empire and to protect Luke Skywalker, the son of the former Jedi Knight Anakin Skywalker. Kenobi had vowed to watch over the younger Skywalker until he came of age. Unaware of his ancestry, Luke lived on the Lars moisture farm with his uncle Owen Lars and his aunt Beru Whitesun Lars. While Ezra and Maul believed that Kenobi held the key to destroying the Sith, in truth Skywalker was the one who had been mentioned in the holocrons."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Maul's ruse"}, {"tag": "p", "text": "Maul eventually made his way to Tatooine, but found himself lost in the planet's deserts and unable to find Kenobi. Out of desperation, the former Sith used a fragment of the Malachor Sith holocron to lure Ezra to Tatooine. Despite the objections of Ezra's mentors Kanan and Hera Syndulla, the young Jedi stole a RZ-1T trainer and traveled to Tatooine with the C1-series astromech droid Chopper, who had stowed aboard the trainer without Ezra's knowledge. Chopper only revealed himself to Ezra after their ship had dropped out of hyperspace above Tatooine. Ezra used another fragment of the Sith holocron and a fragment of the Jedi holocron as a makeshift compass. Upon landing, Ezra discovered the Sith holocron fragment and realized that Maul had lured them into a trap."}, {"tag": "p", "text": "The two found themselves under attack from a band of Tusken Raiders who destroyed their starship. Maul then slew the Tusken Raiders, before leaving Ezra and Chopper to fend for themselves inside the canyon. At daybreak, Ezra and Chopper reached the end of the canyon. After some debating, Ezra was influenced by an apparition of Maul to travel into the desert. Using the holocrons as a beacon, Ezra believed that Maul was hiding in the desert. The two rebels then entered a sandstorm and were tormented by the heat, sand, and wind."}, {"tag": "p", "text": "Chopper eventually broke down as his power cells drained. Succumbing to heat exhaustion, Ezra was tormented by apparitions of Maul. The two exhausted rebels were eventually found by Master Kenobi, who brought them to his camp. Kenobi recharged Chopper's power cells and allowed Ezra to rest. After nightfall, Ezra awoke to find himself and Chopper in the company of Master Kenobi. Ezra conversed with Kenobi, who revealed that Maul had used the holocrons to lure him to Tatooine. After some discussion, Kenobi reassured Ezra that the Jedi Master was able to handle Maul on his own."}, {"tag": "h3", "text": "Settling scores"}, {"tag": "p", "text": "Shortly later, Maul arrived to finish his vendetta with Master Kenobi, interrupting his and Ezra's conversation. Kenobi instructed Ezra and Chopper to leave on a dewback, directing them to Maul's ship Nightbrother. As he prepared to engage Kenobi, Maul mocked his old adversary's lackluster living conditions, and wondered aloud if it would be more cruel to simply leave him as he was. Kenobi responded by pointing out that Maul had nothing at all, as he defined himself by his ability to kill, and his desires to dominate and possess. The evaluation touched a nerve in Maul, who ignited his lightsaber with an angry retort and struck the ground in front of Kenobi's campfire, showering it with sand and extinguishing it. Maul began to speculate as to why Kenobi might have come to Tatooine of all places, deducing that the Jedi Master was there to protect someone. Realizing Maul had to die to protect Luke, Kenobi ignited his own lightsaber and assumed the Soresu ready stance. Maul then ignited the second blade of his weapon and the two opponents squared off. As they did so, Kenobi openly switched his stance from that of Soresu to Ataru, the style in which his master Qui-Gon Jinn had been proficient. Maul took note of this and after a few more moments of preparation, attacked. The two adversaries crossed blades twice before Maul attempted to hit Kenobi with the same sort of pommel strike that had allowed him to kill Jinn. However, Kenobi had evidently anticipated this, and struck downwards at Maul as the former Sith struck up. As a result, Kenobi's attack cleanly bisected the body of Maul's weapon, and carved a lethal wound into Maul's chest."}, {"tag": "p", "text": "Maul, shocked at the turn of events, slowly dropped the two pieces of his still functional lightsaber and collapsed to one knee. However, before he could fall to the ground, Kenobi caught and held him. Dying, Maul asked Kenobi if the person he was protecting was the Chosen One. Kenobi, at that point of the opinion that Vader was beyond redemption, told Maul that he was. Maul appeared to take some solace in this knowledge, and stated his belief that both he and Kenobi would ultimately be avenged for all the wrongs the Sith had dealt them. Out of respect and pity for his enemy, Kenobi closed the fallen darksider's eyes and sat beside him beneath two of Tatooine's moons."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Commandeering Maul's own vessel, Ezra and Chopper returned to Chopper Base on the planet Atollon. There, he apologized to Kanan and Hera for leaving them on an errant mission. Ezra realized that his true place was with Phoenix Cell, which was planning to attack Lothal. Meanwhile, Kenobi visited the Lars moisture farm from afar, where he watched Luke answering his aunt call. At some point, Kenobi built a funeral pyre for Maul's body."}, {"tag": "p", "text": "Prior to the Battle of Yavin, Kenobi instructed Luke Skywalker in the ways of the Jedi before sacrificing himself at the hands of Darth Vader, Anakin's Sith persona. The younger Skywalker played an important role in the Alliance to Restore the Republic and convincing his father to turn back to the light side and restore balance to the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Tatooine made its first appearance in the Star Wars Rebels third season episode \"Twin Suns,\" which premiered on Disney XD on March 18, 2017. In the Star Wars Legends continuity, a comic entitled \"Old Wounds\" depicted a similar encounter between Darth Maul and Obi-Wan Kenobi in which Maul was killed by Luke Skywalker's uncle Owen Lars. In the episode, Kenobi calls Maul an \"old wound,\" a possible reference to the comic. Prior to \"Twin Suns,\" the \"Old Wounds\" storyline was referenced in Star Wars: Galactic Defense, a video game which illustrated a gray-haired Kenobi and a resurrected Maul on Tatooine for a limited-time event."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}