{"url": "Mission_to_Tatooine_(Kyber_Saber)", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Search for the Kyber Saber"], "nodes": [{"tag": "h1", "text": "Mission to Tatooine  (Kyber Saber)"}, {"tag": "p", "text": "In 3 ABY, the Freemakers undertook a mission to the planet Tatooine to service the Toong podracing pilot Ben Quadinaros' podracer. However, this was a trap set by the Hutt crime lord Graballa, who wanted to capture Rowan Freemaker in order to find more Kyber Saber crystals. The Freemakers managed to evade Graballa and his henchmen by taking part in the 29th Annual Bricklayers' Classic. Graballa and his henchmen cornered them at a wrecked sandcrawler where a siege took place. The Freemakers were rescued by the undercover Sith Naare, who defeated Graballa's forces and helped them escape offworld."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After escaping from their prison cell in Cloud City, the bounty hunters Dengar, Baash, and Raam returned to the Hutt crime lord Graballa's starship Rancor's Fist. There, Dengar informed Graballa that they had found the identity of the mysterious Force-sensitive boy Rowan Freemaker. Graballa was pleased with this news because he had failed a second time to convince his cousin Jabba to loan him enough money to build a beachside resort and buffet. Graballa engineered a trap for the Freemakers by coercing the Toong podracing pilot Ben Quadinaros to hire the scavengers to service his podracer at Mos Espa."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "The unplanned podrace"}, {"tag": "p", "text": "Since the Freemakers were low on funds to pay their rent, Zander accepted Ben's offer. The Freemakers including their B1-series battle droid Roger traveled to Mos Espa. When Zander asked Quadinaros to pay his bill, Ben summoned Graballa and his henchmen. Graballa confronted Rowan and his siblings and demanded that the boy help him to find other Kyber Saber crystals. Before Graballa could question the Freemakers further, Jabba and his entourage including the bounty hunter Boba Fett entered the workshop and confronted Graballa for making an unauthorized visit to Tatooine."}, {"tag": "p", "text": "While Graballa tried to convince Jabba that his business with the Freemakers did not concern him, the Freemakers took their opportunity to escape on the podracer they were repairing. Graballa ordered Dengar, Baash, and Raam to give chase on their speeder bikes. With Graballa on their trail, the Freemakers had no choice but to participate in the upcoming 29th Annual Bricklayers' Classic in an attempt to lose their pursuers. Dengar pursued the Freemakers through the race course and fired his blaster at them."}, {"tag": "p", "text": "After the Freemakers' podracer headed inside a tunnel, they managed to damage Dengar's bike. However, Dengar hijacked a blue podracer and continued pursuing the Freemakers, who had reached fourth place. By the second round, Baash and Raam had entered the race and tried to ambush the Freemakers with their bikes. However, Zander sped up his podracer, causing the two Iktotchi to crash their bikes into each other. By the third round, the Freemakers had managed to beat several other podracers including Ben Quadinaros. Dengar eventually caught up with the Freemakers and fought Rowan atop their podracer. However, Rowan managed to hit Dengar with the stabilizer control, causing the bounty hunter to lose his grip."}, {"tag": "h3", "text": "Standoff at the sandcrawler"}, {"tag": "p", "text": "The Freemakers then crashed their podracer in the Dune Sea. The Freemakers then sought refuge in a nearby sandcrawler, which had been abandoned by its Jawa occupants. Despite Rowan's concerns, Kordi and Zander decided to contact Naare for help. They used Roger's transmission pack as an improvised long-distance transmitter and homing beacon. Zander managed to summon Naare for help just as Graballa and his henchmen caught up with them at the sandcrawler."}, {"tag": "p", "text": "After failed negotiations, the Freemakers managed to hold Graballa and his henchmen off by hurling thermal detonators. Graballa and his henchmen were forced to scatter and hide in the sand dunes until the Freemakers ran out of detonators. Graballa then ordered his henchmen to storm the sandcrawler but they were attacked by Naare, who had arrived in her starship Eclipse Fighter. Naare used her lightsaber and Force powers to overpower Graballa's henchmen. She then told the Freemakers to flee into her ship."}, {"tag": "p", "text": "Rowan managed to escape but Roger, Zander, and Kordi were captured. Naare used her Force powers and lightsabers to free them. Meanwhile, Rowan discovered Naare's Sith lightsaber and overheard a transmission from Emperor Palpatine telling Naare to use force against Rowan to ensure better results. Shortly later, Naare returned with the other Freemakers and they returned back to the Wheel."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Graballa was unable to pursue the Freemakers because Naare destroyed his sail barge. To add to his humiliation, Graballa was forced to call his cousin Graballa for a ride. Meanwhile, Naare returned to the Wheel. She warned Rowan not to run off again. However, the boy stole her Sith lightsaber. Later, he informed his siblings about Naare's true identity. As a result, the Freemakers made preparations to flee the Wheel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to Tatooine serves as the main plot of the LEGO Star Wars: The Freemaker Adventures Season One episode \"Race on Tatooine\", which premiered on July 18, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}