{"url": "Mission_to_Tawntoom", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim"], "nodes": [{"tag": "h1", "text": "Mission to Tawntoom"}, {"tag": "p", "text": "The Mission to Tawntoom was a successful attempt to rescue Nilz and Auren Yomm who were kidnapped and taken to the fortress in Tawntoom province. Gaff had taken Nilz to force him to treat Governor Bisad Koong who had fallen ill to the Rooze disease while also taking Auren as insurance to ensure that Mungo Baobab did not attempt to follow them. But Baobab managed to find them both and secured their release before a series of events led to the Galactic Empire withdrawing from Roon and Koong succumbing to the disease while Baobab and his allies escaped onboard the Caravel."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following the skirmish in the Roon Sea, Mungo Baobab and his droid companions C-3PO and R2-D2 began preparing for their departure from Roon back to Manda. The three were taken by Nilz and Auren Yomm to the Pinnacles of Felth to locate the Rainbow Comets in order to chart their path home. However, it was at this exact moment that Governor Bisad Koong, in an attempt to impress Admiral Terrinald Screed, unleashed the Rooze disease upon the Umboo province to save face from his three previous failures (the lightstation, the games, and the Roon Sea). However, Koong accidentally infected himself in the process and sent his chief lieutenant Gaff to bring Nilz Yomm to him, since Yomm was the only healer on Roon capable of treating him."}, {"tag": "p", "text": "Gaff visited the Yomm residence where Nilz was tending to his infected wife Bola, and in an ensuing commotion, incapacitated Auren. He directed the two stormstroopers with him to bring Nilz in addition to Auren as insurance that Baobab not try an attempt at mounting a rescue. However, before Auren could be taken away, Baobab planted half of his memling in Auren's belt as a way to find them."}, {"tag": "h2", "text": "The rescue operation"}, {"tag": "p", "text": "Onboard the cloudcraft, Baobab was able to track the Yomm's to the fortress in Tawntoom using the memling like a compass. He tried to bring the ship through a shortcut into a volcano but the ensuing lava forced them to crash into the snow on the cavern's other side. A second eruption saw an avalanche that sent R2-D2 crashing into a mirror which was in actuality a molecular disruptor that dramatically shrunk the astromech droid."}, {"tag": "p", "text": "Baobab and C-3PO then managed to subdue two alien merchants with Baobab's seed launcher and stole their robes so as to distract the guards at the entrance while R2-D2 went through the ventilation shaft to locate the Yomm's. He managed to enter their room while narrowly avoiding a sleeping Gaff and a goorl. With their cell unlocked, Nilz attempted but failed to use the Rooze cure to incapacitate Gaff; but the attempt failed since a Kobak was immune to the Rooze disease."}, {"tag": "p", "text": "Reunited with Baobab and C-3PO, the five try to board the Caravel, but are cornered by Gaff who arrives on a sandskimmer and alerts Screed and Koong. With the Yomm's safely aboard the Caravel, Baobab and the droids hijack Koong's aerial drilling platform where Baobab issues an ultimatum: he will give up the cure and the location of the Roonstones in exchange for Umboo being left alone. However, when the Roonstones are uncovered, Screed betrays Koong, forcing the governor to take command of the drill and accidentally sending all the Roonstones into the volcano. In doing so, it froze the fortress's only heat source, which would freeze the entire citadel. While Screed and his forces flee and withdraw from the planet entirely, Baobab gives the cure to Koong before he and his allies flee. However, it is too late for Koong, who fades away and dies into nothingness, as the fortress freezes in ice."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The mission to the fortress ended Baobab's time on Roon, however, en route to Umboo, he discovers a single Roonstone inside R2-D2. Back at Umboo, the cure is successfully administered to Bola and other infected people, while Baobab instructs the droids to remain on Umboo until he returns from Manda to update his father on his progress on Roon."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Appearances"}]}