{"url": "Mission_to_Tatooine_(Luke_Skywalker)", "categories": ["Category:Legends articles", "Category:Missions of the Galactic Civil War", "Category:Missions to Tatooine"], "nodes": [{"tag": "h1", "text": "Mission to Tatooine  (Luke Skywalker)"}, {"tag": "p", "text": "The mission to Tatooine occurred some time after the events of the Battle of Yavin. Luke Skywalker reluctantly underwent the mission after an Imperial transport capsule was identified to have crash landed on Tatooine. What began as a mission to investigate the capsule was complicated by the news that the transport capsule, along with similar capsules that had fallen on other planets, had caused outbreaks of the highly contagious and deadly Bledsoe's disease which were followed shortly thereafter by attacks on nearby Rebel bases. Luke Skywalker and an assigned Rebel contact, a female Ogemite named Anduvil, discovered the connection between these events when Luke was infected with Bledsoe's disease. The Empire was using a genetically modified strain of Bledsoe's to send secret information on Rebel targets. Luke was cured, and with Anduvil he destroyed the local Imperial garrison base, capturing its commander to ensure their escape from the planet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War, the Galactic Empire sent various transport capsules to the planets of Rebel sympathizers. These capsules contained Squills infected with a genetically modified form of Bledsoe's disease, which led to an outbreak. This outbreak undermines the social order of planets suspected of leaning toward the Rebellion. Meanwhile the specific genetic modifications of the disease caused the eyes of the infected to develop discoloration, which could be read as star maps which revealed the locations of secret Rebel bases. These bases could then be attacked by Imperial forces. Meanwhile, after the destruction of the Death Star, Imperial forces managed to consolidate their hold on Tatooine and construct an Imperial garrison base. An Imperial transport capsule containing infected Squills was sent to Tatooine, there to be recovered by Stormtroopers and used to infect the populace. However, Jawas found the capsule first, foiling the plan since Jawa eyes were unreadable. Observers at Anchorhead detected the capsule crash, reporting it to the Rebel Alliance."}, {"tag": "h3", "text": "The Mission"}, {"tag": "p", "text": "Massassi One of the Rebel Alliance ordered a reluctant Luke Skywalker to abandon his space reconnaissance mission and head to Tatooine to investigate the capsule due to it being designated a Code Grave mission. Luke was initially reluctant to return to his home planet due to having bad memories of his time on the planet, but he eventually agreed, accompanied by C-3PO and R2-D2. Upon exiting hyperspace Luke received a mysterious transmission directing him to Chalmun's Spaceport Cantina in Mos Eisley, and a contact named Anduvil of Ogem. Luke soon discovered that the Empire's new base on Tatooine had greatly increased traffic and military presence in Mos Eisley."}, {"tag": "p", "text": "Chalmun's cantina still had a strict no-droids policy, so Luke entered alone. He was almost ambushed by a bounty hunter working for Jabba Desilijic Tiure, but was saved by his contact Anduvil. She informed him that his mission was not merely to investigate a transport capsule, but to crack an Imperial intelligence operation and discover the link between the crashed transport capsules, the outbreaks of Bledsoe's disease, and the attacks on Rebel bases. Before Luke could learn much more, however, a Jawa in the cantina collapsed. The Bledsoe's outbreak had reached Mos Eisley."}, {"tag": "p", "text": "Fleeing the outbreak in Anduvil's landspeeder, Luke guided them to Ben Kenobi's hut to discuss their next move. They were attacked by Tusken Raiders who smashed Anduvil's Landspeeder, but after defeating the raiding party Luke and Anduvil took their banthas. Anduvil guided them to the Jawa sandcrawler that had first found the transport capsule, only to find Imperial Stormtroopers staring into the Jawa's eyes. However, Jawa eyes did not properly show the discoloration of Bledsoe's disease, and the Stormtroopers eventually left. Investigating the sandcrawler for an explanation of the strange behavior, Luke was bitten by a Squill. Anduvil sadly informed him that Squills carry Bledsoe's disease, and that Luke was possibly infected. Before Luke could come up with a plan, however, the Stormtroopers returned. Upon discovering that Luke had been bitten, the Stormtroopers captured them all and took them to the Imperial garrison base, leaving C-3PO and R2-D2 behind in the desert."}, {"tag": "p", "text": "At the base Luke was delivered to Doctor Kaaldar, who discovered that Luke's eyes had become discolored from Bledsoe's disease, becoming a star map. Luke and Anduil discovered that the Imperials had been using genetically modified Bledsoe's to send coded messages and star charts to many worlds, secretly coordinating attacks on Rebel strongholds. Anduvil begged Kaaldar to give Luke an antidote to the disease, but Kaaldar refused as long as Luke's eyes revealed the location of a secret Rebel base. Luke was able to overcome his captors, even in his weakened state, and forced Kaaldar to give him the antidote."}, {"tag": "p", "text": "Outside the garrison base C-3PO and R2-D2 had commandeered the abandoned sandcrawler, and driven it through the main gate of the base. This successfully distracted the Stormtroopers, but led to the capture of the droids. While Luke Skywalker rushed to their rescue and took the Imperial commander hostage, Anduvil sabotaged the ion drives of the base's TIE Fighters. Luke, Anduvil, the droids, and the captured commander fled the base just before the sabotaged ion drives exploded, destroying the garrison base."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "With the base destroyed, Luke, Anduvil, the droids, and their hostage returned to Mos Eisley. They used Luke's starship to escape the planet, with their hostage to guarantee their safety during their return to Yavin 4. They would force the commander to reveal the details of the Empire's scheme, ensuring that Bledsoe's disease would no longer serve as a vector for secret Imperial information."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}