{"url": "Mission_to_Tatooine_(The_Hunt)", "categories": ["Category:Legends articles", "Category:Missions of The Hunt", "Category:Missions to Tatooine"], "nodes": [{"tag": "h1", "text": "Mission to Tatooine  (The Hunt)"}, {"tag": "p", "text": "The Mission to Tatooine was one of the final events of The Hunt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After their success on Malastare, Zam Wesell and Jango Fett contacted Fett's Toydarian friend Rozatta. She informed Jango that a junk dealer got wind of a bounty posted by Jabba the Hutt- Longo Two-Guns. Considering the large bounty, the two set course for Tatooine."}, {"tag": "p", "text": "According to Roz, Jabba and his nemesis, Gardulla the Elder, were feuding for control of Tatooine, though she was unaware which of them was in league with Komari Vosa. Jango decided to apprehend Longo to gain access to Jabba, while Zam was ordered to investigate Gardulla, the more solitary of the two Hutts."}, {"tag": "p", "text": "Upon landing in Mos Gamos, Jango's jetpack malfunctioned from the heat, forcing him to leave his boost pack behind on the Slave I. Longo's gang of thugs desperately attempted to apprehend Fett, but most of them were killed in the firefights waging through the streets. Upon arrival at the podracer hangar where Longo Two-Guns resided, Fett apprehended Two-Guns and hauled in the bounty."}, {"tag": "p", "text": "Jabba explained to Jango that Gardulla houses Bando Gora in her palace, so Zam went to scout out the area around her lair, and Fett landed the Slave I in Tusken Canyon behind Gardulla's palace. While speaking to her on his comlink, he heard ruffling sounds in the background and realized she had been captured. Setting out to the palace on foot through the valley, Fett encountered clans of Tusken Raiders and their massiffs. While making his way through the valley fighting the Tuskens, an execution team feeding criminals to a sarlacc situated in the valley turned their blasters on Fett. The entire execution team was wiped out by Fett and the sarlacc."}, {"tag": "p", "text": "Upon reaching Gardulla's Palace, Fett found Zam in a cell. He said he would be back when he had dealt with Gardulla, but Zam thought he would just leave her there and cut her out of the prize. She called for the guards, who captured Fett and presented him to the Hutt. He was stripped of his weapons and armor and sentenced to be fed to Gardulla's krayt dragon, but he escaped the dragon's arena through a small ventilation shaft."}, {"tag": "p", "text": "Fett recovered his gear and proceeded through the palace, killing gangs of thugs throughout the skiff hangars. He finally found his way to Gardulla's throne room, where interrogated the Hutt about the Bando Gora. Gardulla refused to comply, and released her krayt dragon into the chamber. However, Jango turned the tables and fed Gardulla to the beast, then killed it through a hefty fight (but Gardulla survived as the dragon was killed before it could fully digest her)."}, {"tag": "p", "text": "Fett told Zam that she had blown it, and he was going to leave her there. While leaving Tatooine, he tried to contact Roz. But Montross answered his call, telling him he found Roz and took all the data she had. Jango immediately set a course for Roz's station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}