{"url": "Mission_to_Tatooine_(Separatist_Crisis)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with elements from unlicensed sources", "Category:Events during the Separatist Crisis", "Category:Genocides and massacres", "Category:Missions of the Separatist Crisis"], "nodes": [{"tag": "h1", "text": "Mission to Tatooine  (Separatist Crisis)"}, {"tag": "p", "text": "This mission to Tatooine took place shortly before the First Battle of Geonosis, the first battle of the Clone Wars, in 22 BBY. After the Jedi High Council gave Jedi Padawan Anakin Skywalker a mission to protect Senator Padmé Amidala on Naboo, Skywalker had a dream of his mother suffering and both Skywalker and Amidala left Naboo to go to Tatooine to find his mother, Shmi Skywalker Lars. Skywalker received information of Shmi's whereabouts from his old slaver, Watto, and soon Skywalker met the Lars family, who bought Shmi from Watto, and discovered she had been kidnapped by a Tusken Raider raiding party and was believed dead. After much investigation, Skywalker tracked his mother, who was extremely weak after a month of torture, who then died in his arms. Consumed by rage, the young Jedi touched the dark side of the Force and massacred nearly the entire village, killing every male, female and child he could find, and paid no attention to the spirit of Qui-Gon Jinn, who spoke to Skywalker in an attempt to prevent the carnage, while Yoda felt Anakin's grief grow darker as the Jedi Master meditated in the Jedi Temple."}, {"tag": "p", "text": "Skywalker returned to the Lars Homestead with his mother's body in his arms. The Lars family, protocol droid—C-3PO, Skywalker and Amidala buried Skywalker's mother near the Homestead and paid their respects. Enraged, he told Padmé Amidala of the massacre and showed no mercy to the Tuskens. He blamed the death of his mother on his master, Obi-Wan Kenobi, who had taught him to be mindful of his thoughts and dreams of his mother would pass in time. Skywalker's astromech droid, R2-D2, arrived during the funeral to alert Skywalker and Amidala of Kenobi's transmission from Geonosis. C-3PO accompanied Skywalker, Amidala, and R2 and left Tatooine for Geonosis on Amidala's personal yacht."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After his departure from his mother, Shmi Skywalker Lars, on Tatooine in 32 BBY, young Jedi Initiate Anakin Skywalker couldn't let go of his attachment for his mother. The Jedi High Council saw this within Skywalker when Jedi Master Qui-Gon Jinn had brought him to the Jedi, due to his high Midi-chlorian count and believed that Skywalker was the Chosen One, a Force-sensitive that will destroy the Sith and bring balance to the Force. Prior to Jinn's death on Naboo, Jinn told his Padawan, Obi-Wan Kenobi, to train Skywalker in the ways of the Jedi. The Jedi Council promoted Kenobi to Knighthood and agreed with Jinn's request—Skywalker became Kenobi's Padawan."}, {"tag": "p", "text": "Ten years after the Invasion of Naboo, Kenobi and Skywalker were called to protect the Senator from Naboo, Padmé Amidala. Following her arrival on Coruscant, Amidala was involved in a plot to kill her, which was conducted by two bounty hunters, Jango Fett and Clawdite Zam Wesell. Skywalker, who had not seen Amidala since the Invasion of Naboo, was intoxicated by her presence and endured a sense of attachment. While Kenobi assured his apprentice that a Jedi must not become attached, Skywalker was having problems with his attachment to his mother; who he had not seen for ten years. Kenobi knew of Skywalker's problem with attachments and encouraged his apprentice that the dreams of his mother would pass in time."}, {"tag": "p", "text": "The plot to assassinate Senator Amidala caused turmoil within the Jedi Council, who had sent Kenobi to the lost wild space planet of Kamino to track one of the two bounty hunters that were responsible for the threat against Amidala's life. The council had given Skywalker a mission to protect Amidala and transport her to her home planet of Naboo. As his attachment for Amidala grew on Naboo, dreams of his mother worsened and soon one night, he had a nightmare of her suffering. Skywalker insisted that he should return to Tatooine to find his mother, which disobeyed Kenobi's request for Skywalker to stay on Naboo and protect the senator. However, Amidala followed Skywalker and the two of them left for Tatooine on a mission to find his mother."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "The Lars Homestead"}, {"tag": "p", "text": "Amidala and Skywalker entered the Tatoo system on Amidala's personal yacht. They landed in Skywalker's childhood town of Mos Espa, which the two had not seen for ten years. Skywalker approached his old Toydarian master, Watto near his shop. Due to Skywalker's ten year absence, Watto did not recognize who the outlander was. The Jedi Padawan refreshed his former owner's memory by asking where his mother, Shmi, was. Surprised, Watto was thrilled to see his old slave. Skywalker demanded to know the whereabouts of his mother, to which Watto informed him that he had sold her after Skywalker left Tatooine in 32 BBY. The Toydarian sold Shmi to a moisture farmer family that lived near the city of Mos Eisley. Watto gave Anakin the location of Shmi and both Skywalker and Amidala departed Mos Espa."}, {"tag": "p", "text": "The duo was greeted by Skywalker's old protocol droid, C-3PO, who went with Shmi when she was sold by Watto and left Mos Espa. C-3PO took his former master into the Lars homestead, where Skywalker met the family who bought his mother. Young Owen Lars and his girlfriend, Beru Whitesun, greeted Skywalker and Amidala. The owner of the homestead, Cliegg Lars, approached Skywalker after he questioned Owen about his mother's whereabouts. The group went inside the homestead while Cliegg explained his relationship with Shmi. He bought Shmi from Watto after falling in love with her, freed her, and married her soon after."}, {"tag": "p", "text": "One early morning, a group of Tusken Raiders stormed the homestead and took Shmi with them. Cliegg and his fellow moisture farmers began a search party, though only a few returned and Cliegg lost part of his right leg from an undisclosed incident while he searched for Shmi. Cliegg told Skywalker that he didn't want to lose hope, but she had been gone for a month."}, {"tag": "p", "text": "Skywalker insisted that he would find his mother. However, Cliegg, without hesitation, told him that she was dead. Skywalker ignored him and prepared to leave the homestead, intent on searching for his mother. Amidala joined him outside and soon Skywalker departed on the Lars's swoop bike, determined to find his mother before it was too late."}, {"tag": "h3", "text": "Reunion and massacre"}, {"tag": "p", "text": "The voyage to find his mother proved to be a challenge for Skywalker. He received information from a Jawa about a Tusken camp not far from his location. Skywalker continued on and stopped near the edge of a cliff. The young Jedi saw a Tusken camp barely illuminated by its campfire and knew that his mother was there. Quietly, he proceeded towards one of the tents and used his lightsaber to cut a hole through the thick cloth that held the tent together."}, {"tag": "p", "text": "Skywalker saw his injured mother who was tied to two wooden poles inside the tent he entered. Skywalker proceeded to free his mother and lowered her into his arms. Pleased to see her son, Shmi had a brief conversation with Skywalker. She weakly expressed that in seeing Anakin one last time, she was complete. Their talk ended when Shmi died from her injuries in her son's arms."}, {"tag": "p", "text": "Enraged, Skywalker left his mother's body in the tent, ignited his lightsaber, and killed the two Tuskens guarding the tent. The sound of the lightsaber alerted more Tuskens who were nearby which caused them to attack Skywalker, flanking several Massiffs as they launched their attack. However, the Jedi showed no mercy and proceeded in his Tusken massacre. He did not stop until the entire camp was silent and every man, woman, and child in his path was destroyed."}, {"tag": "p", "text": "The spirit of Qui-Gon Jinn, tried to calm Skywalker in an attempt to prevent the carnage, but it was in vain. On Coruscant, Grand Master Yoda heard Jinn's voice through the Force and felt Skywalker's pain, and also told Mace Windu when he asked about it."}, {"tag": "h3", "text": "Return to the Homestead"}, {"tag": "p", "text": "Skywalker returned to the homestead on the swoop he left with. Shmi's body was wrapped in a large piece of cloth. The Lars family and Amidala, whom thought she could not be found, were shocked to see Skywalker with his mother's body. Cliegg was one of the few who could not bear to look at the sight while Skywalker entered the homestead."}, {"tag": "p", "text": "The rough moment for Skywalker turned when Amidala entered the room where Skywalker was inside the homestead. She tried to ask him of what happened and Skywalker revealed to Amidala of the massacre that he started. His hatred for Tuskens grew worse as he claimed that he slaughtered the Tuskens for the death of his mother. He blamed his master for not letting him find his mother during the ten year span of his absence from Tatooine. Skywalker soon became emotional and wept for his mother's loss."}, {"tag": "p", "text": "Shortly after, Skywalker, the Lars family and Amidala buried Shmi outside, near the homestead. Skywalker assured his mother that he would not fail to lose another loved one again. During the funeral, Skywalker's astromech droid, R2-D2, approached the group. C-3PO told Skywalker that R2 had received a message from a person named Obi-Wan Kenobi and soon Skywalker, Amidala, and the droids left the homestead to listen to the message that Kenobi transmitted from Geonosis, on Amidala's yacht."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Shortly after the Mission to Tatooine, Skywalker and Amidala endured on a rescue mission to release Kenobi, who was captured by former Jedi Master, Count Dooku on Geonosis. The First Battle of Geonosis, the first battle in the Clone Wars, soon began after a Jedi Strike Team arrived, led by Mace Windu. Skywalker married Amidala after the Battle of Geonosis on Naboo and his attachment for Amidala grew more during the war."}, {"tag": "p", "text": "During the Clone Wars, Skywalker became a Jedi Knight and took on a mission in 21 BBY. Skywalker thought he wouldn't return to Tatooine due to what had happened months prior to his return. It was painful for Skywalker to speak of his past and would not tell his Padawan, Ahsoka Tano, who accompanied Skywalker during the mission."}, {"tag": "p", "text": "On Tatooine, various Tusken Raiders learned of the event, and came to refer to Anakin Skywalker as the \"Demon Outlander,\" due to his butchery of the camp as well as his allegedly not being from Tatooine. They also conducted sacrifices to appease the \"Demon Outlander.\""}, {"tag": "p", "text": "In 19 BBY, shortly after Skywalker killed the Separatist leader, Count Dooku, over Coruscant, Supreme Chancellor Palpatine, a close friend of Skywalker, when feigning sympathy for Skywalker's guilt for doing so, referenced Skywalker's massacre when mentioning it wasn't the first time the boy gave in to anger, due to Skywalker having earlier told him about the event. In addition, Skywalker had dreams of Amidala dying from childbirth. Palpatine had knowledge of the massacre and his marriage and soon this knowledge would play a role when Palpatine revealed himself to be Darth Sidious, though it is uncertain if the dark side had been involved in the killing of Shmi. When Mace Windu dueled the Sith Lord on Coruscant, Skywalker was present at the time of the duel and saw Windu attempted to murder Sidious. Enraged and desperate, Skywalker severed Windu's lightsaber hand, and Sidious blasted Windu with Force lightning. With the knowledge of Amidala dying, Skywalker joined the dark side and became Darth Vader. After Vader's duel with his former master, Obi-Wan Kenobi, Vader received life threatening injuries from the fires of Mustafar. Sidious brought his apprentice back to Coruscant to be resurrected with the suit he would wear for the rest of his life. Amidala soon died on Polis Massa after giving birth to Luke Skywalker and Leia Amidala Skywalker."}, {"tag": "p", "text": "In large part because of the pain this event afflicted on Skywalker/Vader, as well as his past in general, Vader rarely ever visited Tatooine, which likewise resulted in Vader's son, Luke, growing up with minimal risk of ever encountering Vader on Tatooine. In addition, when Vader successfully managed to arrest Leia Amidala Skywalker, by that time going by the name of Leia Organa due to being separated at birth from her twin brother, he was largely displeased about the arrest occurring above Tatooine due to having lingering memories of the event."}, {"tag": "p", "text": "Ultimately, only one survivor of Anakin's slaughter existed, KkH'Oar'Rrhr, who had been bonding with his bantha at the time of the massacre. KkH'Oar'Rrhr would later end up working as a Teräs Käsi student of the Emperor's Hand Arden Lyn and fight Luke Skywalker, under the belief that he was the \"Demon Outlander,\" by 1 ABY."}, {"tag": "p", "text": "23 years after the mission, Vader and his Sith apprentice, Tao, encountered a vengeful Tusken Raider that belonged to the group of Tuskens that were murdered on Tatooine. The Tusken engaged Vader in a fight, and soon brought Vader to his knees. As a act of revenge, the Tusken claimed that Vader murdered his entire family that night in 22 BBY. The Tusken was about to kill Vader until Tao saved his master's life by killing the Tusken. Tao was injured and soon died in Vader's arms which caused Vader to scream in rage."}, {"tag": "p", "text": "29 years after the resulting massacre, Skywalker's daughter, Leia Organa Solo, and her husband Han Solo came to Tatooine for a mission to stop an auction that included an Alderaanian piece of art. However, their journey in Tatooine soon became a mission of learning the past. Leia's father, Anakin Skywalker, murdered a group of Tusken Raiders some 29 years prior to their mission, in a camp called Valley of the Spirits. Leia and Han traveled across the area and were consumed by wind like weather, possibly the spirits of the Tuskens."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission first appeared in Star Wars: Episode II Attack of the Clones. Anakin Skywalker's problems with attachments began when he left his mother in The Phantom Menace, and it became worse throughout his life as a Jedi. In Star Wars: Episode III Revenge of the Sith, Anakin would have dreams of his wife, Padmé Amidala, dying from childbirth. The image of Amidala dying in Anakin's dreams was shown on screen and would play a major part in Anakin's downfall to the dark side in Revenge of the Sith. George Lucas has commented about Anakin and his dreams in the audio commentary of Revenge of the Sith DVD, stating that after he left Tatooine in Episode I, the pain of losing his mother would continue on in his Jedi life until her death in Episode II. While Anakin had matured much since then, he still had problems with attachments, which only worsened with his dreams of Padmé's death during childbirth in Revenge of the Sith.."}, {"tag": "p", "text": "In an interview with eucantina.net, James Luceno, one of the authors of the DK visual dictionary lines, implied that Darth Sidious was involved in the Tusken Raider's abduction of Shmi Skywalker as a means to ensure that Anakin would fall to the Dark Side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}