{"url": "Mission_to_Trask", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Mission stubs", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Mission to Trask"}, {"tag": "p", "text": "A mission to the estuary moon of Trask occurred after the mission to Tatooine, in which Din Djarin was tasked by Peli Motto with delivering \"Frog Lady\" to her husband on the moon in exchange for the location of a group of Mandalorians. However, after Djarin encountered two New Republic X-wings, who recognized the ship as having raided a New Republic prison ship and gave chase, he was forced to flee and eventually, Djarin, Grogu, and Frog Lady crash landed on the planet Maldo Kreis."}, {"tag": "p", "text": "After waking up from being knocked out from the crash, Djarin saw extensive damage to the Razor Crest, including a breached hull. As he worked on repairs, Frog Lady left the area to find warmth, which she found in the form of a small thermal vent pool. As Djarin caught up to her and warned her to stay near him so he could protect her, they were surrounded by a group of knobby white ice spiders. Djarin used his grenades, blaster pistol, and a flamethrower against the horde, but only succeeded in slowing them down. Eventually cornered inside the ship's cockpit, Djarin attempted to take off, only for a much larger spider to fall on top of the ship, crashing it back into the ground. As the massive spider started to stab into the cockpit, a sudden barrage of blaster fire started to pelt the spiders as the X-wing starfighters that had previously been chasing Djarin had landed, with pilots Carson Teva and Trapper Wolf firing on the spiders with A280C blaster rifles. Citing Djarin's arrest warrant for his heist of the prison ship, but also noting his capture of three criminals and putting his life in danger for Lieutenant Davan, who despite his efforts, was killed during the raid, the two pilots ultimately left Djarin as he was, warning him to get a transponder before taking off. Djarin patched up the Razor Crest to the best of his ability, having only the cockpit sealed, before taking off and continuing towards Trask in his damaged ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}