{"url": "Mission_to_Tralus", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Corellian sector", "Category:Missions of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Mission to Tralus"}, {"tag": "p", "text": "The Mission to Tralus took place in 4 ABY. Rogue Squadron defeated General Weir in the Corellian system but failed in rescuing Ten Numb."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Two weeks after the Battle of Endor, General Weir ordered a small strike against Coronet City, the capital of Corellia. Weir was surprised to discover a small band of Rebels defending the Coronet citizens. Although his men were unable to eliminate Rogue Squadron, Weir was satisfied with the amount of destruction they caused and with the capture of Rebel pilot Ten Numb."}, {"tag": "p", "text": "Weir personally undertook the interrogation of Numb and quickly found a homing beacon attached to Numb's wrist. He proceeded to torture Numb with electricity and Numb soon broke and supplied Weir with all the information he wanted, including sizes and secret locations of military forces. Weir planned to provide the information to Imperial High Command."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Rebel astromech droid R2-D2 helped the pilots track down the base to Tralus. The Rogues found the secret base by enlisting the help of Lady Leyli, a Selonian who reluctantly agreed to risk helping the Rebels upon learning of the death of Emperor Palpatine. In response, Weir ordered a full-scale evacuation of the Imperial outpost. Although aware that his soldiers could not defeat the Jedi, he ordered his stormtroopers to attack the Rebels as a stalling tactic, while Weir fled in his TIE Interceptor to provide Numb's information."}, {"tag": "p", "text": "As Wedge Antilles and Tycho Celchu pursued the general in stolen TIE Fighters, Weir scrambled Sunspot Squadron and led the Rogue pilots through narrow underground tunnels in an unsuccessful attempt to destroy them. Once the fighters reached the surface, Antilles shot the left wing off of Weir's interceptor, causing the starfighter to crash land on Tralus. As Celchu destroyed the remaining TIE, Antilles landed and apprehended Weir, who escaped from his ship's wreckage before it exploded but was unable to flee due to injuries."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Antilles was tempted to kill Weir in retaliation for Ten Numb, but resisted the urge because he did not want to reduce himself to the general's level. Instead, Weir was arrested and extradited to Sullust, where he was to be interrogated by Rebel officers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}