{"url": "Mission_to_Upekzar", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Sith Worlds", "Category:Jedi missions", "Category:Lost Tribe of Sith emergence"], "nodes": [{"tag": "h1", "text": "Mission to Upekzar"}, {"tag": "p", "text": "In 44 ABY a mission to the planet of Upekzar was organized by Jedi Grand Master Luke Skywalker in the hopes of confronting the ancient being known as Abeloth, who was strong in the Dark side of the Force. He led the majority of the New Jedi Order to the planet, only to find that Abeloth had set a trap for them, one the Order barely escaped from."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Grand Master Luke Skywalker decided that in order for him to destroy Abeloth he needed the force of the majority of the Jedi, so he proclaimed that the New Jedi Order defect from the Galactic Alliance in order for them to stop involving the Jedi in politics. In reality his purpose was searching for Abeloth while at the same time keeping a distance from Coruscant. Luke discovered the Senate was infiltrated by the Lost Tribe of Sith's members; he thought that after he destroyed Abeloth first, it would be easier to eliminate the Sith infiltrators later. So the Jedi departed Coruscant to go to the Sith-associated world of Upekzar. (which had been discovered through research from Jedi Knight Natua Wan as the original manufacturing place of Ship. It is believed that Ship may have returned to Upekzar to hide. Leia Organa Solo stayed behind in order to help advise in the Galactic Alliance leadership, and Tesar Sebatyne and his fellow Barabel Jedi secretly guarded the Jedi Temple from the caverns they nest in."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "Arriving on the planet the Jedi soon discovered that a Dark Side nexus was collocated on the volcanic islands of Circle of Visions, so they began exploring the island dividing in small group; they rapidly finding an abandoned city. Part of the Jedi strike force entered the abandoned city and found a Keshiri Sith named Tola Annax. Abeloth had infused the woman with dark side energy in an effort to trap and kill the Jedi. If the Jedi had killed Annax upon meeting her, it would have released the pent-up energies inside her body, causing a massive explosion, like a mind-bomb technique. Although the Jedi had stayed their hands, the build-up of dark side energy was tearing Annax apart. Luke fortunately understood that this was a trap and ordered an immediate retreat."}, {"tag": "p", "text": "As the Jedi escaped from the city, the ground began to shake, and Abeloth's laughter could be heard around them. The ground began to shake and crack, causing chasms that the Jedi had to use the Force to leap over. Clouds above the city started to produce Force lightning, which arced out to strike both the Jedi on the ground, as well as those Jedi flying top cover. As they ran, Annax exploded behind them; the release of dark side energy threw the retreating Jedi into the air, and triggered a dormant volcano that began spewing hot ash and boiling rock. The majority of the Jedi used the Force to cool the superheated air, although a few did not, dying as they tried to inhale. The surviving Jedi exited the city ahead of a pryoclastic surge from the volcano that would turn their bodies to charcoal the moment it made contact, making for either their own ships, or for larger transports. Although several Jedi were lost, most of the ground force survived the trap."}, {"tag": "p", "text": "Meanwhile Ben, Vestara, and Natua are tasked by Luke to explore the lava tunnels below the planet and were attacked by a mutated Rhak-skuri; while fighting it, Ben become unconscious with hallucinations and Vestara, seeing no other way to saved his life, incapacitated Natua to feed the beast instead of Ben, rescuing his life. Despite managing to rescue his life, making the choice to kill a Jedi instead of trying to fight the beast some other way made her realized that she might be too much of a Sith to ever truly become a Jedi. Vestara reflected that one day, she will be forced to returned to her Sith roots, and may also be forced to unhappily kill Ben as a result."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}