{"url": "Mission_to_Vassek%27s_third_moon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Articles with conjectural titles", "Category:Battles in the Wazta sector", "Category:Duels", "Category:Jedi missions", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to Vassek's third moon"}, {"tag": "p", "text": "Jedi Master Kit Fisto, Jedi Knight Nahdar Vebb, and a squad of clone troopers undertook a mission in 22 BBY during the Clone Wars to recapture Trade Federation Viceroy Nute Gunray, who had recently escaped from Republic custody. However, Confederate Head of State Count Dooku, displeased with General Grievous's recent failures in the war, used a Republic homing beacon to lure the Jedi and clones to the general's castle on the third moon of Vassek as a test for Grievous. Gunray deceived the Jedi and troopers through a holotransmission, and once they uncovered the ploy, Dooku contacted the Republic agents and put them on the trail of the \"alternative prize\" of Grievous."}, {"tag": "p", "text": "The Jedi and their troops set a trap for Grievous and confronted the cyborg general once he arrived. However, Grievous was able to eliminate several clone troopers, and after sustaining injuries, escape to the castle's secret command center. Sealing off the exits, the Confederate general trapped the Jedi and clones inside his castle. While Grievous was repaired by his caretaker droid, the general pitted the Jedi and the remaining clones against the castle's defenses—a molten incinerator pit and the general's pet roggwart, Gor. The clones were killed, but the Jedi were able to eliminate Gor. As Grievous resolved to personally confront the Jedi, Fisto and Vebb infiltrated the castle's command center. Vebb remained outside, however, and fought Grievous himself, but was killed by the general. After Fisto dueled Grievous on the castle's outer platform, the Jedi Master was able to escape."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 22 BBY during the Clone Wars, Trade Federation Viceroy Nute Gunray—who had been captured by Republic forces on Rodia—was to be transferred aboard the Star Destroyer Tranquility to Coruscant for trial. The viceroy was kept under heavy guard by Jedi Master Luminara Unduli and Padawan Ahsoka Tano; however, Gunray was able to escape with the help of Dark Acolyte Asajj Ventress and turncoat Senate Commando Captain Faro Argyus. The Confederate agents stole a Republic frigate to make their getaway, and the ship's homing beacon allowed the Republic to track the stolen cruiser. Since Jedi General Kit Fisto and his fleet were near Gunray's last known position, Unduli contacted the Nautolan Jedi Master to follow and recapture Gunray."}, {"tag": "p", "text": "Meanwhile, the Confederate Head of State, Count Dooku, had become displeased with the ongoing stalemate in the war between his best general, Grievous, and the Republic and Jedi Order. Grievous had failed in several recent operations, resulting in Confederate defeats at the Battle of the Kaliida Nebula and the Battle of Bothawui, as well as the loss of the listening post Skytop Station. As Dooku's Sith Master, Darth Sidious, demanded more dead Jedi, Dooku decided to arrange a trap for Grievous in order to reassess the cyborg's abilities. The Sith Lord remotely deactivated the general's personal IG-100 MagnaGuard bodyguards in his castle on the third moon of Vassek and deployed the Republic tracking beacon from Gunray's stolen ship to the general's lair, seeking to lure the Jedi to the castle so that Grievous would be able to hunt them for sport."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Bait for the Jedi"}, {"tag": "p", "text": "Fisto took his Delta-7B starfighter and his astromech droid, R6-H5, and followed the signal of the Republic beacon to the Vassek system, deep in Confederate-held space. The Jedi Master contacted Unduli and Tano at the Outer Rim Command Center, and they reported that Fisto's former Padawan, Nahdar Vebb, had also tracked the beacon to the system. Vebb had already arrived on Vassek's third moon—where the beacon had been located—with a shuttle and several clone troopers. Fisto detached his starfighter from its hyperspace docking ring, and proceeded to the moon to rendezvous with Vebb."}, {"tag": "p", "text": "Once Fisto had landed and left R6-H5 to look after his fighter, the Jedi Master met with Vebb. Clone Commander Fil had tracked the beacon to the south end of the gorge, and, leaving troopers Bel and Niner to guard the shuttle, the group proceeded to the castle. While Vebb and Fil intended to use lightsabers and thermal detonators, respectively, to forcefully open the entrance to the building, Fisto was able to find a secret switch that activated a mechanism that opened the castle's door. Approaching the sanctum overlook chamber of the castle, the Jedi and clones overheard a hologram of Gunray giving orders to a squad of B1-Series battle droids, led by a Lieutenant, from behind a high-backed chair. Unaware that Gunray was not actually present, Fisto and Vebb led the attack on the droids and were able to eliminate their opponents. However, when Vebb turned the chair around with the Force, the group discovered Gunray's hologram, and the viceroy taunted the Jedi before severing the connection."}, {"tag": "p", "text": "Count Dooku contacted the Jedi and directed them toward an \"alternative prize\" to compensate for their failed attempt to recapture Gunray. The Jedi were uncertain of who their offered quarry was, and Vebb activated a mechanism through the chair that revealed another hallway. As the Jedi and clones walked through the castle, rooms opened along the way; inside the rooms were statues of Kaleesh warriors—some featuring cybernetics—that resembled Grievous himself. The group finally entered Grievous's secret armory and workshop, and deduced that the castle belonged to the general. While inspecting Grievous's trophy room, home to a collection of trophies from the Jedi that the general had murdered, Fisto received a report from Bel and Niner that Grievous's personal starfighter, Soulless One, was approaching the castle. Fisto ordered the two clones protecting the shuttle to keep out of sight, while the Republic infiltrators decided to capture Grievous in an attempt to satisfy the \"dead or alive\" warrant on the Confederate general."}, {"tag": "h3", "text": "Capturing a cyborg"}, {"tag": "p", "text": "As Grievous entered his castle, the Jedi and clones appeared and surrounded the cyborg general. Grievous activated two of his stolen Jedi lightsabers, and engaged Fisto and Vebb in combat. However, as the two Jedi saberlocked with the general, Grievous split his arms and activated two more of his lightsabers. The two Jedi were forced to break the bladelock as they avoided being slashed by the extra weapons, and Fisto ordered the clones to fire their blaster rifles' cables at Grievous. The clones aimed their grappling hooks at the general's legs, and as Grievous engaged the Jedi in another saberlock, Fisto used his lightsaber to sever the cyborg's legs."}, {"tag": "p", "text": "Although crippled, Grievous was able to jump up and hold onto one of the beams attached to the roof. The clones' grappling hooks were still attached to the general, and the troops were able to pull Grievous to the ground. As Vebb crossed blades with the cyborg, the lightsaber that Grievous was holding spun out of his hand. The general jumped back up, and one of the clones holding the grappling hooks was thrown backward, while the other was pulled toward Grievous. The general batted the dead clone against Fisto, forcing the Jedi Master backward, before throwing the trooper on top of Vebb. Grievous's faceplate was damaged from one of the clones' laser shots, and as the general escaped, Vebb and several of the troopers gave pursuit. However, Grievous killed two more of the clones before entering the castle's secret command center; of the clone troopers, only Fil and another trooper remained alive."}, {"tag": "p", "text": "The Confederate general discovered from his personal caretaker droid, EV-A4-D, that his IG-100 MagnaGuards had been remotely turned off for recharge. Grievous reactivated his droid bodyguards and ordered them to lock down the perimeter. As Fisto, Vebb, and the clones headed to escape from the castle, the general sealed off the building's exits, trapping the Jedi and clones inside his lair. Commander Fil contacted Niner and Bel back with the shuttle and ordered the two clones to signal the Republic outpost at Bestine that they required reinforcements. However, as Niner and Bel entered the shuttle, Grievous's MagnaGuards fired a rocket at the craft, causing the shuttle to explode. The droids closed in on R6-H5 and Fisto's fighter, and the astromech droid escaped with the Jedi starfighter, spinning the ship and throwing off a MagnaGuard clinging to the fighter's hull."}, {"tag": "h3", "text": "Hunted"}, {"tag": "p", "text": "Grievous opened a hololink and contacted the Jedi and clones, encouraging them to \"experience all his home had to offer,\" before severing the connection. The general then opened up a molten incinerator pit, and while Fisto and Vebb were able to jump to safer ground, the two clones fell into the pit. Fil fired a grappling hook to the ceiling, and the Jedi were able to rescue him, but the other trooper plunged into the incinerator. Fisto then destroyed a holocam that Grievous was using to watch his opponents, and the Confederate general signaled his ravenous pet roggwart, Gor, to \"entertain their guests.\" EV-A4-D began to repair Grievous from the injuries he had sustained."}, {"tag": "p", "text": "As the Jedi and the clone trooper grouped together in the middle of a hallway junction, Gor appeared and approached the group. Fil opened fire on the roggwart, but Fisto's lightsaber was knocked out of his hand. Gor lunged at Fil and the two Jedi and the three quickly split up, surrounding the creature while Fisto retrieved his weapon. The clone commander directed blaster fire at Gor's neck and Vebb jumped onto the roggwart, plunging his lightsaber into Gor's back until he was bucked off. The roggwart swung its tail and seized Fil, batting Vebb with the captured clone. Fisto slashed the roggwart in the head, and Fil was slammed against the ground before Vebb severed Gor's tail. The Jedi Master cut off the roggwart's arms, and as Gor fell to the ground, Fisto killed the roggwart by driving his lightsaber into the back of the creature's neck. Vebb was shaken by Fil's death, but left the fallen clone and followed Fisto to the castle's command center."}, {"tag": "p", "text": "A repaired Grievous was angered upon learning of Gor's death, and the general soon discovered from Count Dooku that the Sith Lord himself had set the trap for him as a test. Resolving to personally eliminate the Jedi, Grievous left the command center with three MagnaGuards, despite EV-A4-D's admonition that he required rest. As Grievous started to head away, Fisto and Vebb sneaked up to the entrance to the command center and the Jedi Master tried to figure out the secret mechanism that opened the door. However, EV-A4-D was watching the events from inside the chamber and alerted Grievous to the Jedi's presence. As the general spun around and headed over to confront the intruders, Vebb decided to remain outside of the command center and fight Grievous himself, despite Fisto's protest. Before the Jedi Master could convince Vebb otherwise, EV-A4-D remotely closed the door, separating Fisto from his former Padawan."}, {"tag": "p", "text": "Vebb quickly eliminated the three MagnaGuards, but turned to see Grievous with two more of his droid bodyguards. After eliminating the remaining MagnaGuards, Vebb engaged the general in lightsaber combat. EV-A4-D meanwhile spectated the duel from the command center; however, Fisto entered the room and eliminated the caretaker droid. Unable to help his former Padawan, Fisto watched as Vebb and Grievous engaged in a saberlock. The general took out a blaster with one of his extra arms and killed Vebb, stealing the fallen Jedi's lightsaber to add to his collection. R6-H5 soon contacted Fisto, and the Jedi Master told his astromech droid to meet him at the castle's south landing platform. Knowing that Fisto was watching from the command center, Grievous stated that the Jedi Master was his next target; however, Fisto damaged the command center's controls before escaping."}, {"tag": "h3", "text": "Duel outside the castle"}, {"tag": "p", "text": "Fisto exited the castle and walked out onto the outer platform. However, Grievous climbed onto the platform from below to confront the Jedi Master, and as both duelists activated their lightsabers, Fisto saberlocked with the cyborg general. Taking advantage of the moon's foggy atmosphere, the Jedi Master deactivated his lightsaber and disappeared into the mist. A confused Grievous spun his lightsabers in a defensive maneuver, and Fisto attacked the general from behind. The two bladelocked once more, and Grievous pushed Fisto backward, slashing at the Jedi Master. Fisto was able to avoid the blow, and as he ran forward he severed the hand of the cyborg that held Vebb's lightsaber. Catching the weapon of his former Padawan, the Jedi Master used the two lightsabers in combat against his opponent."}, {"tag": "p", "text": "The Jedi Master was able to land a blow on the general and Force-pushed Grievous to the ground. However, as the cyborg got to his feet and continued the duel, three of the general's MagnaGuards appeared and advanced toward the Jedi, forcing Fisto to break off from fighting Grievous and confront the droids. With the Jedi Master surrounded and outnumbered, the general ordered Fisto to surrender. However, as the Jedi deactivated his lightsabers, R6-H5 piloted Fisto's fighter to rise up to the platform. The MagnaGuards slashed at the Jedi, but Fisto backflipped onto his fighter and, once they were heading away from the castle, the Jedi Master entered the ship's cockpit and escaped the moon of Vassek."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Returning to his castle, Grievous proceeded to the sanctum overlook chamber, where Count Dooku awaited a report via hololink. Grievous stated that the Jedi had been defeated, and while Dooku revealed that victory over Vebb and the clones had been expected, the Sith Lord was pleased, believing that the general had bested the Jedi Master Fisto. However, Dooku was disappointed when he learned that Fisto had escaped and stated that there was \"room for improvement\" before severing the connection. Fisto himself returned to the Jedi Temple on Coruscant and reported his mission to Masters Yoda and Mace Windu of the Jedi High Council. Upon learning of Vebb's intent to answer Grievous's power with that of himself and his deviation from the Jedi way in doing so, Yoda stated that the war presented the Jedi with a danger of \"losing who they were.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission first appeared in \"Lair of Grievous,\" an episode in the 2008 first season of the Star Wars: The Clone Wars television series, and was also featured in the young readers' book Grievous Attacks! It introduced the character of Nahdar Vebb as well as General Grievous's castle and featured the series introduction of Jedi Master Kit Fisto. The episode also completed a three-episode story arc centered around the capture of Viceroy Nute Gunray that began with the episodes \"Bombad Jedi\" and \"Cloak of Darkness.\""}, {"tag": "p", "text": "There has been much controversy regarding whether the mission took place on the third moon of Vassek or the world of Vassek itself. Both the series' The Visual Guide and Visual Guide Ultimate Battles state that it was on Vassek, while the online guide for \"Lair of Grievous\" states that it was on the third moon. Because of the online guide's closer relations to the episode, this article assumes that the mission was to Vassek's third moon."}, {"tag": "h3", "text": "Different portrayals"}, {"tag": "p", "text": "The non-canon computer game Path of the Jedi, released on Cartoon Network's official site, depicts an alternate storyline with either the Jedi Ahsoka Tano, Anakin Skywalker, or Yoda being sent to aid Fisto."}, {"tag": "p", "text": "The Nintendo DS version of the 2009 video game Star Wars: The Clone Wars: Republic Heroes presents a different portrayal of the mission. Nahdar Vebb is completely absent from the story; instead, Kit Fisto is assisted only by Clone Captain CT-7567—nicknamed \"Rex\"—and two clone troopers. While the two troopers remain outside, Fisto and Rex infiltrate Grievous's castle, and, after navigating through its mazes and fighting numerous B1 battle droids and B2 super battle droids, confront the general himself. After a brief duel with Fisto, Grievous retreats further into the castle, and Rex tells the troopers outside to contact the Republic fleet at the planet Bestine and ask for reinforcements. The troopers, however, fail their mission as the only means to contact Bestine—their Nu-class attack shuttle—is destroyed by a Vulture droid. Fisto and Rex continue their pursuit of Grievous, but are forced to split up. Fisto then defeats an IG-100 MagnaGuard and faces the Separatist general for the second time."}, {"tag": "p", "text": "After a lengthy battle with Grievous and the droids that assist him, Fisto escapes aboard his interceptor. Following this encounter, Grievous leaves the base, but increases the security inside it. Later, when the Republic faces the need to obtain recent Confederate clearance codes in order to bypass the defensive perimeter of the Separatist-controlled space station Juma 9, Kit Fisto remembers that during the mission to Vassek his starfighter's scanners had picked up an energy reading coming from within the castle. Believing that such energy levels could only mean the presence of a Separatist archive containing the codes, the Jedi dispatch Jedi Master Luminara Unduli and Clone Commander CC-1004 to retrieve them. Because of such a confusing storyline that would take too much speculation to implement into the pre-existing story, this article assumes that the video game's mission is non-canon."}, {"tag": "p", "text": "The 2011 non-canonical video game LEGO Star Wars III: The Clone Wars features the mission in its humorous depiction of \"Lair of Grievous.\" In the game, Fisto and Vebb engage Grievous's forces—several MagnaGuards—before even fighting Grievous himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}