{"url": "Mission_to_Void_Station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Bothan sector", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to Void Station"}, {"tag": "p", "text": "The Mission to Void Station took place in 0 ABY, when Darth Vader was sent to extract information from an information broker called Jib Kopatha, regarding the whereabouts of the Alliance to Restore the Republic, and to intimidate Kopatha."}, {"tag": "p", "text": "Upon arrival, Vader interrupted Kopatha's greetings by Force choking the Bothan, which resulted in the Sith Lord being attacked by Jib's bodyguards, namely an Gamorrean and a Nikto. They were easily defeated by Vader, who then proceeded by telling Kopatha that the information he provided had become increasingly unreliable, that the Empire didn't accept incompetence and that the consequences, if the trend was to continue, would be very dire."}, {"tag": "p", "text": "Kopatha desperately swore that it would not happen again. When Vader requested information about the rebels, he insisted on that they were very good at covering their tracks. Instead, he offered a multitude of delicacies, beverages and women. Vader refused and left Kopatha. On his way to his Lambda-class shuttle, he was approached by a Falleen woman by the name of Xora, who claimed that Jib knew more than he had told Vader."}, {"tag": "p", "text": "She managed to lure him with her to an empty docking bay, where she told Vader that she had no knowledge of the Rebels. Instead, she revealed that she were out to avenge the thousands of Falleen which Vader had killed when he ordered the sterilization of a major city on Falleen. Six of her comrades, among them Zuur, came out of hiding, attacking the Sith."}, {"tag": "p", "text": "It were a brief fight, as Vader easily managed to overcome the would-be assassins. In her last breath, Xora told him that he could never escape his past. Leaving the dead Falleen on the floor, Vader returned to his ship, were an officer who had accompanied him to the station noticed that his suit had been damaged. When asked about it, Vader merely told him to prepare the ship for take-off."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally, Star Wars: Empire 19 incorrectly placed five months after the Battle of Yavin although the Evacuation of Yavin (mentioned in the story) took place six months after the Battle of Yavin according to most sources, including The New Essential Chronology. The mistake has been corrected with the release of Omnibus: At War with the Empire Volume 1."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}