{"url": "Mission_to_Zakuul_listening_post", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in Wild Space", "Category:Battles of the war against Zakuul", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to Zakuul listening post"}, {"tag": "p", "text": "In 3630 BBY, the Alliance and Havoc Squad joined forces for a mission to plant a wiretap on a Knights of Zakuul listening post in the Endless Swamp on Zakuul. Tired from the inaction of the Galactic Republic politicians, Major Aric Jorgan took his squad to start a private war with Zakuul in what essentially amounted to treason. The Alliance that opposed Eternal Emperor Arcann offered their official support and the Alliance Commander joined Havoc for the bulk of the mission, while the rest of the Alliance leadership ambushed Zakuulan forces to provide distraction from the main objective. The Commander and Jorgan successfully infiltrated the outpost and planted the wiretap, but were discovered and had to fight their way out. Havoc Squad member Xaban was wounded by skytrooper crossfire, but the day was saved by the Zakuulan exiles led by Pashna Veyaad, who took care of Eternal Empire reinforcements in gratitude for the earlier help from Jorgan and Havoc. In the aftermath of the mission, Havoc Squad remained embedded with the rebels on Zakuul, while Jorgan traveled to the Alliance base on Odessen, where he offered his formal support to the Alliance leadership."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3630 BBY, the Alliance that opposed the Eternal Empire of Zakuul obtained the schematics of the Spire in the Raid on the Overwatch. Theron Shan passed a portion of that data to Jonas Balkar, his former colleague from the Republic Strategic Information Service. Balkar in turn leaked that information to Republic Special Forces Division Havoc Squad, led by Major Aric Jorgan. The intelligence convinced Jorgan and his squad to take a leave of absence from their official duties and undertake an unsanctioned mission to Zakuul in violation of the Zakuul–Republic treaty. Their objective to wiretap a Knights of Zakuul listening outpost in order to gain access to the Eternal Empire communications, Havoc Squad established a camp in the Endless Swamp. Learning about this, Theron Shan convinced the Alliance Commander to travel to Zakuul and meet with the Havoc Squad."}, {"tag": "p", "text": "Theron Shan and the Alliance Commander approached Havoc Squad at the arranged meeting point in the Endless Swamp, where Jorgan introduced his squad and explained that they were in the middle of the operation. The meeting was interrupted when they were discovered by a probe and attacked by Skytroopers flanked by Eternal Empire Walkers. After the group fought the first wave off, Jorgan ordered everyone to split up in pairs, sending Dengril and Xaban to the north, Abbeth and Torg to the south, ordering Kanner to take Theron Shan straight to their camp, while Jorgan himself teamed up with the Alliance Commander to cover their trail from skytroopers, who had both numbers and mobility. Assuming a vantage point, Jorgan sniped off multiple skytroopers before he noticed several civilians fleeing from them. Jorgan and the Commander rescued the Zakuulan exiles, who asked them to stop the skytroopers from burning their homes. After making a detour and evacuating the civilians from their makeshift homes, Jorgan was addressed by their leader Pashna Veyaad. Unwilling to leave the civilians behind, Jorgan radioed ahead and ordered Havoc to prepare their camp for the arrival of the refugees, before clearing the path for them alongside the Commander. Safely back at the camp, Jorgan ordered Kanner to get the refugees settled in and told everyone to get some rest."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The next morning, Jorgan presented his plan to the Alliance, explaining that successfully planting a wiretap required either a month of preparation work, or a distraction big enough to draw away most of the outpost's personnel.\nThe Commander agreed to commit the Alliance forces and contacted Alliance personnel on Odessen, who along with Theron Shan went to provide the distraction from the main objective. Meanwhile, Havoc Squad and the Alliance Commander traveled by shuttle to the listening post, where Commander gave the Alliance forces the signal to attack. Responding to the enemy presence, many Knights of Zakuul rushed to their speeder bikes to join the fighting, leaving the outpost with only a token defense. While the rest of Havoc squad proving their cover, Jorgan and the Alliance Commander disabled the outpost's security and successfully planted the wiretap. However, their presence was then discovered and Zakuulan forced rushed back to the outpost. Meanwhile, the diversion team had problems of their own and was unable to assist, being boxed in by numerous skytroopers and flanked by Zakuulan Knights. Jorgan and the Commander took care of Battle Droid Atherna, while the rest of Havoc Squad fell back to their position, which came under heavy fire. Facing a host of skytroopers in front of them and seeing Zakuulan shuttle deploying reinforcements behind, Jorgan and the others were prepared to make their last stand. However, Zakuulan exiles led by Pashna Veyaad came to their aid, taking off several shuttles worth of reinforcements with missile launchers, and allowing Havoc to pick off the remaining enemy forces by collapsing the tunnel behind them with thermal detonators. Expressing their gratitude to Veyaad, Havoc Squad and the Alliance Commander returned to their camp."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Their mission successful, Jorgan expressed a desire to train the exiles into a proper resistance force. Leaving the rest of Havoc with the rebels on Zakuul, Jorgan then traveled to the Alliance base on Odessen, where he got acquainted with the Alliance leadership before making his way back to his squad. By comparing the information from the listening post with the Spire schematics, SCORPIO revealed the existence of the GEMINI frequency, the means by which Emperor Arcann controlled the Eternal Fleet. The Alliance then planned an attack on the Hyperwave relay station hidden ten kilometers beneath the Spire and connecting the Eternal Throne to the Eternal Fleet, with Havoc Squad again assisting on the mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission is part of the Star Wars: The Old Republic: Knights of the Fallen Empire Chapter XI: Disavowed, while the distraction by the Alliance forces takes place almost entirely off-screen. If the player previously made Dark Side choices that caused Koth Vortena to abandon the Alliance, he will not be a part of the distraction team."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}