{"url": "Mission_to_destroy_a_kyber_crystal", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions of the Ghost", "Category:Missions to Lothal"], "nodes": [{"tag": "h1", "text": "Mission to destroy a kyber crystal"}, {"tag": "p", "text": "After their mission to Stygeon Prime, the rebel crew of the Ghost undertook a mission to locate and destroy a powerful kyber crystal held by the Galactic Empire. In order to locate it, the rebels required an Imperial decoder from the office of ISB Agent Kallus at the Imperial Headquarters on Lothal. To gain access to the complex, Ezra Bridger was tasked with infiltrating the Imperial Academy below in order to steal the decoder. He spent several weeks in the academy, during which time he was trained by the Imperial Army. He finally located the decoder and stole it with the help of fellow cadet Zare Leonis, who held rebel sympathies after his sister, cadet Dhara Leonis, disappeared from the academy."}, {"tag": "p", "text": "Bridger provided the decoder to the rest of the rebels, allowing Kanan Jarrus and Hera Syndulla to go to the coordinates of the kyber crystal. The Spectres then passed the decoder to Leonis' girlfriend Merei Spanjaf, who needed it to access several classified ISB files on Dhara. While they did so, Bridger remained behind in order to save fellow cadet Jai Kell, who was in danger from the Grand Inquisitor after showing signs of Force sensitivity. Leonis and Kell commandeered an All Terrain Defense Pod in order to assist in their escape, and the three were able to make it out of the academy before the Inquisitor arrived. Bridger and Kell fled, but Leonis remained in order to find out more about his sister, under the official pretense of having tried to stop the other two. Meanwhile, Jarrus and Syndulla tracked down the Imperial convoy carrying the kyber crystal and destroyed it. In the aftermath of the mission, Bridger returned to the Ghost, Kell went into hiding, and Leonis was brought before the Inquisitor to tell him about Bridger."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "About five years before the Battle of Yavin, the Spectres undertook a mission to intercept an Imperial convoy transporting a powerful kyber crystal. In order to locate the crystal, the rebels had to steal a ZX-5 decoder from the office of the ISB Agent Kallus at the Imperial Headquarters in Lothal's Capital City. To gain access to the decoder, Ezra Bridger infiltrated the Academy for Young Imperials below the complex disguised as an Imperial cadet named \"Dev Morgan\". While Hera Syndulla and Kanan Jarrus waited aboard the Ghost in space, the other crew, Sabine Wren, Garazeb Orrelios, and Chopper, waited outside the Academy to extricate Ezra once he had obtained the decoder."}, {"tag": "p", "text": "The Spectres' mission was complicated by Imperial cadet Zare Leonis' quest to find his sister Dhara, who had mysteriously disappeared the previous year while training as a cadet at the academy. Disillusioned with the Empire's policies towards Lothal, Leonis had infiltrated the Academy with the intention of finding his sister and working to undermine the Empire from within. Leonis was supported by his girlfriend Merei Spanjaf, who had managed to gain access to the Imperial data network on Lothal by creating a fake ISB account and using snoopers to hack into the Transportation Ministry's headquarters."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "An unlikely ally"}, {"tag": "p", "text": "For several weeks, Ezra Bridger underwent training at the Academy for Young Imperials under the pseudonym \"Dev Morgan\". He was assigned to Unit Aurek, which was part of squad LRC077. During his time undercover, Ezra befriended cadets Leonis and Jai Kell. After the three cadets came first in a grueling training assessment in the Well, Commandant Cumberlayne Aresko rewarded them by assigning them the \"honor\" of working as aides at Imperial Headquarters upstairs. Having passed the test, Ezra signaled to a disguised Chopper, who passed the word to the other rebels. Unbeknownst to Ezra, Zare noticed him signalling the droid."}, {"tag": "p", "text": "Putting his plan into action, Ezra managed to slip into Agent Kallus' office under the pretext of delivering datapads. Ezra removed the ZX-5 decoder from a computer on the desk and tucked it inside his cadet helmet. When he opened the door to leave, he was confronted by Leonis, who shoved him back inside the office and spotted the decoder in his helmet. Instead of reporting \"Morgan\", however, Zare warned him that taking the decoder out of Kallus' office would trigger a sensor, causing the facility to go into lockdown. This unexpected development delayed the Spectres' plans to intercept the Imperial convoy by one day."}, {"tag": "p", "text": "In private, Zare and Morgan talked about their motivations for resisting the Empire. After Morgan revealed his involvement in a rebel cell, Leonis recounted his sister Dhara's suspicious disappearance. The two cadets then made an agreement to finish in the top three places the following day in order to get back inside Imperial headquarters. After Dev explained that his rebel comrades needed the decoder in order to intercept an Imperial shipment the following day, Zare revealed that his girlfriend Merei also needed the decoder to access some Imperial files on Dhara. After tossing a chance cube, Leonis and Dev reached an agreement that Morgan and his rebels would get to use the decoder first."}, {"tag": "h3", "text": "An unexpected problem"}, {"tag": "p", "text": "The following day, Zare and Dev put their plans into action. Despite opposition from an obnoxious cadet named Nazhros Oleg, Ezra and Zare managed to come out in the top three. However, in the process, Dev was forced to push his friend Jai onto a lower repulsorlift platform, as Zare had been falling behind in the assessment. Dev regretted hurting Jai, but conceded that his mission was more important. Together, the two rebellious cadets made their way into Imperial headquarters. Prior to the second attempt, Leonis had arranged with Merei to produce a fake procurement order for spare podracer parts in order to distract Agent Kallus."}, {"tag": "p", "text": "Since taking the decoder through the door of Kallus' office would trigger the sensor, Ezra entered Imperial Minister Maketh Tua's office to climb into a ventilation shaft that passed over Kallus' office. While Leonis distracted Kallus with the fake order, the young Jedi used the Force to levitate the decoder into his palm. Kallus, already suspicious of the fake order, noticed Zare's distraction as he watched \"Morgan\" levitate the decoder. When he turned around, however, Ezra had already grabbed the device and shut the grate to the ventilation shaft. On his way back, Ezra overhead a conversation between Commandant Aresko and the Grand Inquisitor, whom he had encountered earlier on Stygeon Prime. Aresko had identified two cadets who met the Inquisitor's \"special criteria\": Dev Morgan and Jai Kell. The Inquisitor announced that he would come the following day to test the cadets and take them into custody if they proved Force-sensitive."}, {"tag": "p", "text": "After stealing the decoder, Dev told Zare about his new predicament with the Grand Inquisitor. When pressed by Leonis, Dev conceded that he was a Jedi but did not reveal his true identity. Ezra then passed the decoder to Chopper, who brought it to Sabine and Zeb. Communicating via hologram, Ezra told his rebel comrades that he had to stay behind in order to stop the Grand Inquisitor from abducting Kell. Sabine then contacted Hera and Kanan, who proceeded to the Imperial convoy's coordinates. While Kanan was disturbed that Ezra had elected to stay behind a little longer, Hera reiterated that they had to focus on their mission first. Having finished using the decoder, the Spectres then passed it to Merei, who encountered them in the streets of Capital City."}, {"tag": "h3", "text": "Escaping the Academy"}, {"tag": "p", "text": "Later that night, Dev awoke Jai Kell from his bunk and led him to a nearby storeroom where Zare Leonis was waiting. Due to the \"betrayal\" earlier that day, Jai initially did not believe them and thought it was a trick to get him expelled from the Imperial Academy. While Kell was skeptical of the Grand Inquisitor's existence, he believed that the Inquisitor could train him and give him a top rank in the Empire. Leonis was able to sway Kell over to their side by recounting his sister Dhara's disappearance. Since Kell's only family was his mother, he was unwilling to leave her forever."}, {"tag": "p", "text": "Having won over Kell, Dev and Zare then put into a motion a plan which involved winning the next assessment in order to get a ride on an Imperial AT-DP walker. The following day, their escape plot encountered another unexpected problem. While Jai and Zare came in the top three, the second place was taken by Nazhros Oleg, who was unaware of their escape plan. Despite the predicament, Morgan told the other rebels to stick with their original plan while he found a way to get aboard the walker. Meanwhile, Chopper planted a bomb on one of the legs of another AT-DP walker."}, {"tag": "p", "text": "Once aboard the AT-DP walker, Kell and Leonis put their plans into action. After hearing an explosion within the Academy's hangar bay, Jai used his blaster to stun the Imperial combat driver and Oleg. Zare then took control of the walker and headed towards the Academy's blast doors. When Grint realized that the cadets' AT-DP had been hijacked, Aresko ordered that the Academy's blast door be shut. Using the walker's laser cannons, Zare managed to damage an approaching AT-DP outside the Academy, causing it to block the blast door. However, the walker then came under fire from an Imperial Troop Transport approaching from the plaza."}, {"tag": "p", "text": "At that point, Ezra used his Force abilities to climb aboard the AT-DP; leading Aresko to believe that he was trying to stop the hijackers. At that point, the hijacked walker was struck down by the Imperial Troop Transport's laser cannons, causing it to topple to the ground. The walker's head landed outside the Academy. Ezra survived the fall, but found himself surrounded by several stormtroopers. However, Zeb and Sabine shot the Imperial troops. They then managed to evacuate Ezra and Jai on a landspeeder. However, Leonis chose to stay behind in order to find his sister. With Aresko, Grint, and more stormtroopers approaching the vicinity, Leonis pretended to fire upon his rebel friends in order to maintain his cover."}, {"tag": "h3", "text": "Destroying the kyber crystal"}, {"tag": "p", "text": "Meanwhile in deep space, the Ghost approached the Imperial convoy. The convoy consisted of three Imperial Gozanti-class cruisers, which each carried several TIE fighter escorts. Using the Force, Kanan sensed that the kyber crystal was aboard the middle ship. Kanan then used the Ghost's auxiliary ship, the Phantom, to lure the TIEs away from the convoy while Hera attacked the middle ship."}, {"tag": "p", "text": "With the convoy under attack, the middle ship's Imperial captain ordered his crew to prepare the ship for a hyperspace jump while every remaining ship covered them. Braving enemy fire, Hera used the Ghost's firepower to strike the cruiser's engine systems, triggering a massive explosion, fueled by the kyber crystal, that destroyed the convoy ships and remaining TIE fighters. Before the explosion caught up with them, Kanan managed to dock the Phantom with the Ghost. The rebels then jumped into the safety of hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The mission to destroy the kyber crystal gave the Spectres another victory against the Galactic Empire. It also had significant repercussions for Jai Kell, Zare Leonis, Merei Spanjaf, Commandant Aresko, and Taskmaster Grint. The Spectres managed to reunite in Lothal's wilderness. There, Hera arranged for Jai Kell and his mother to go into hiding. Despite his annoyance with Chopper and Zeb's body odor, Ezra came to appreciate his place in the Spectres as a result of the undercover mission at the Academy. In return, Kanan came to understand that Ezra was perfectly capable of looking after himself."}, {"tag": "p", "text": "Meanwhile, Zare Leonis received praise from his Imperial Academy instructors and peers for trying to stop the \"traitors\" Jai Kell and Dev Morgan. He was later even awarded a commendation by Commandant Aresko. Later, Leonis was summoned for a private meeting with the Grand Inquisitor, who recognized Morgan as Ezra, one of the rebels he had encountered on Stygeon Prime. After confirming that Morgan was indeed a pseudonym, Leonis tried to probe into his sister Dhara's fate by claiming that he had a Force-bond with his sister."}, {"tag": "p", "text": "Using the stolen decoder, Merei Spanjaf discovered that Dhara had been identified as Force-sensitive by the Grand Inquisitor and forcibly inducted into Project Harvester, a top-secret program run out of the Arkanis Academy. Merei's efforts to slice into the Imperial data network attracted an Imperial investigation which subsequently forced her and her family to go into hiding on the planet Garel."}, {"tag": "p", "text": "Due to the rebel attack, the Lothal Academy's reputation was damaged and the Imperial authorities began screening all Imperial cadets for disloyalty. This incident was one of the many rebel activities on Lothal that preceded a planetwide crackdown on sedition. Later, Leonis was transferred to the Arkanis Academy under the pretext of rewarding him for his leadership abilities and loyalty. However, the Grand Inquisitor had arranged for this transfer in order to investigate his links to the Spectres. Before Leonis could find his sister Dhara, he was identified as a traitor and scheduled for execution. Due to the intervention of the Spectres and Merei, Zare and his sister were able to escape with their family into hiding on Garel."}, {"tag": "p", "text": "Following a string of repeated failures to stop the Spectres, Commandant Aresko and Taskmaster Grint were executed by the Grand Inquisitor under the orders of Grand Moff Wilhuff Tarkin, the Governor of the Outer Rim Territories. Tarkin wanted to send a warning to his Imperial subordinates that the Empire would no longer tolerate any more failure."}, {"tag": "p", "text": "Four years later, Ezra, Sabine and Chopper wound up on a mission with notorious extremist Saw Gerrera, where they discovered the Empire was transporting another giant kyber crystal. This one was destroyed as well, when Gerrera rigged it up to the hyperdrive of the freighter it was being transported on, creating a bomb. After the mission, Kanan was reminded of the earlier incident, and he and Sabine wondered what the Empire could want with the crystals, and if it really was trying to weaponize them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Spectres' mission to destroy an Imperial kyber crystal shipment forms the main plot element of the Star Wars Rebels episode \"Breaking Ranks\", which premiered on Disney XD on October 27, 2014. The mission was also further expanded in Jason Fry's 2015 junior novel Servants of the Empire: Rebel in the Ranks, which was told from the point-of-view of Zare Leonis, a secondary character who first appeared in Breaking Ranks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}