{"url": "Mission_to_obtain_Embersteel_wings", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to obtain Embersteel wings"}, {"tag": "p", "text": "In 4 ABY, the Freemakers went on a mission to the planet Mygeeto obtain embersteel wings from a Theta-class H-2 executive star shuttle. They needed the wings as part of a quest to build the Arrowhead, a starship capable of turning the tide of the Galactic Civil War. Kordi Freemaker's plan was to steal the shuttle during the Imperial auction at the Mygeeto Auction House. Her plan was complicated by her brother Zander Freemaker's impulsiveness and the presence of Graballa the Hutt and his henchmen."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the mission to Alistan Nor, the Freemakers embarked on a quest to build the Arrowhead, a starship that was said to be able to turn the tide of the Galactic Civil War. To build the Arrowhead, the Freemakers needed to obtain several items including a pair of embersteel blades. Kordi Freemaker received intelligence that the Galactic Empire was holding an auction on the planet Mygeeto to sell starships that had been confiscated from Rebel Alliance sympathizers."}, {"tag": "p", "text": "One of the starships was a Theta-class H-2 executive star shuttle that had embersteel wings. The auction was taking place at the Mygeeto Auction House. Kordi managed to obtain a 75,000 credit loan from the Rebel Alliance leadership to procure the Theta-class shuttle and its embersteel wings. For the mission, Kordi disguised herself as the Clawdite princess Alo Kortessi while her brothers Zander and Rowan Freemaker disguised themselves as her entourage."}, {"tag": "h2", "text": "The Mission"}, {"tag": "h3", "text": "Undercover on Mygeeto"}, {"tag": "p", "text": "Disguised as Princess Alo Kortessi, Kordi managed to force the stormtroopers guarding the Mygeeto Auction House to let her and her \"entourage\" inside. Meanwhile, Roger stayed behind to guard the StarScavenger. When the real Princess Kortessi arrived, the stormtroopers mistook her for an impostor and arrested her. Once inside, the Freemakers' plan was complicated by several factors. Firstly, Kordi and her brothers learned that it was customary for nobles to delegate their servants to the bidding process. This undercut Kordi's plan because she had the best negotiating skills within the group. Her older brother Zander by contrast was impulsive and prone to making rash decisions."}, {"tag": "p", "text": "Secondly, an old enemy Graballa the Hutt and his entourage visited the Mygeeto Auction House in order to procure investors for his proposed beachside resort and buffet. While Kordi was monitoring her brothers, she was forced to ward off Graballa's advances. Graballa believed that Kordi was Princess Kortessi and tried to convince her to invest in his beachside resort. Thirdly, a rash Zander decided to bid for an Eta-2 Actis-class light interceptor. Zander had dreams of becoming a starfighter pilot in the Rebellion and decided to bid for the Jedi starfighter, believing it to be worth 30 credits. However, the starfighter cost 30,000 credits, leaving the Freemakers short of the necessary funds to purchase the Theta-class shuttle."}, {"tag": "p", "text": "Fourthly, one of Graballa's bounty hunters Raam accidentally bidded for the Theta-class shuttle. In an attempt to obtain the shuttle and its embersteel wings, Kordi traveled to Graballa's starship Rancor's Fist at the local spaceport. Believing \"Princess Kortessi\" to be wealthy, Graballa instead kidnapped her; hoping to extort a ransom from the Clawdite royal family. Rowan, Zander, and Roger followed in the StarScavenger and the Jedi starfighter in pursuit."}, {"tag": "h3", "text": "Escaping Graballa's clutches"}, {"tag": "p", "text": "In space, Graballa tried to contact the Clawdite royal family but was held back by their complicated answering machine. When Rowan and Zander approached in their starships, the bounty hunter Dengar led several starfighters in pursuit. While Rowan and Zander led Graballa's starfighters on a chase, Kordi use her negotiating skills to proposition herself as a business adviser. She convinced Graballa to release her from her chains. Kordi then proceeded to give Graballa business advice including installing energy efficient light emitters, turning down his thermostat, and reducing his staff. Kordi also led Graballa towards the ship's hangar."}, {"tag": "p", "text": "Having gained Graballa's trust, Kordi managed to convince the Hutt to give her his Theta-class shuttle in return for becoming his business adviser. Shortly later, Rowan and Zander arrived in the Rancor's Fist's hangar with the StarScavenger and the Jedi starfighter. Kordi then bound Graballa in chains. When Baash and Raam tried to intervene, Zander hurled a container at them. Before they could leave, Dengar returned in his starfighter and demolished Zander's Jedi starfighter. Following a struggle, Kordi managed to knock Dengar out by swinging a crane at him."}, {"tag": "p", "text": "Kordi then left on the Theta-shuttle while Rowan and Zander followed in the StarScavenger. When Graballa ordered his henchmen to pursue the Freemakers, Baash and Raam demanded that Graballa negotiate a compensation settlement with them. They were joined by Dengar who complained about working conditions."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After returning to the Alliance flagship Home One, the Freemakers and the rebel shipbuilder Quarrie managed to melt the embersteel wings and install the blades on the frontal cannons. Kordi and Zander also reconciled. The Freemakers subsequently undertook a mission to Taul to obtain a proton suspension housing from a wrecked Corellian Defender. Meanwhile, Darth Vader solicited Graballa's mining expertise in obtaining kyber crystals for the Empire's second Death Star."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to obtain Embersteel wings serves as the main conflict of the LEGO Star Wars: The Freemaker Adventures Season Two episode \"The Embersteel Blade\", which premiered on August 1, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}