{"url": "Mission_to_obtain_a_Kyber_crystal", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to obtain a Kyber crystal"}, {"tag": "p", "text": "In 4 ABY,[source?] the Freemakers undertook a mission to obtain a Kyber crystal from Baird Kantoo's planet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War, Rowan Freemaker and his family embarked on a quest to build the Arrowhead, a starship they believed that could turn the tide of the war. As part of the quest, the Freemakers traveled to the planet Qalydon seeking kyber crystals to power up the Arrowhead. Unwilling to take the local Lurmen villagers' kyber crystals, the Freemakers continued their search for kyber crystals."}, {"tag": "p", "text": "Continuing their search, Rowan Freemaker used the Force to find a planet with kyber crystals. Despite being pursued by the Imperial hunter droid M-OC, Rowan managed to take the StarScavenger to a set of coordinates in the Outer Rim Territories that were twelve parsecs past the planet Terminus. M-OC was forced to suspend the hunt after Emperor Palpatine summoned him back to Coruscant for a \"dressing down.\""}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Rowan's trials"}, {"tag": "p", "text": "After exiting hyperspace, the StarScavenger crash-landed on an uncharted planet that was covered in kyber crystals. The StarScavenger lost its stabilizer fin during descent and also sustained damaged to its hull. While Zander Freemaker and Roger stayed behind to repair the damaged ship, Rowan and his older sister Kordi Freemaker went to search the planet."}, {"tag": "p", "text": "Meanwhile, Rowan and Kordi explored a nearby cave which had murals and inscriptions. Realizing this was a temple, Rowan believed that there were kyber crystals inside. Unable to find stairs, Rowan realized that he had to use the Force to raise the floor after reading the inscription that \"the key to unlocking the mysteries before you is to turn to the Force.\""}, {"tag": "p", "text": "Rowan and Kordi reached a chamber with a hole at the ceiling. After reading the inscription \"that the Force builds and lifts us all,\" Rowan attempted to use the Force to raise the rocks and debris into a makeshift staircase. However, these attempts did not work. Re-reading the inscription, Rowan used the Force to assemble a platform for him and Kordi and then used the kyber crystals below to funnel them to the top."}, {"tag": "h3", "text": "Building the crystal"}, {"tag": "p", "text": "Rowan and Kordi reached the summit only to see a tall tower in the distance, which was separated by a deep chasm. Believing the crystals lay at the top, Rowan used the Force to levitate three stony treads and to reassemble them systematically in order to reach the top of the tower. At the top, he discovered a holocron belonging to Jedi Master Baird Kantoo, who had forged the Kyber Saber a long time ago."}, {"tag": "p", "text": "Deeming Rowan worthy of learning the secret of building with kyber crystals, the hologram revealed that the crystals that he needed were in the pit below. Master Kantoo warned that the crystals were extremely powerful and that one misstep could lead to terrible consequences, pointing to the shattered moon above."}, {"tag": "p", "text": "Returning to the summit, Rowan told Kordi that he had to build the kyber crystal himself. He feared that the kyber crystal was a dangerous weapon that could cause great harm. Kordi advised her younger brother that if he did nothing, the Emperor would devastate the galaxy. Recalling Master Jek-14's advise that he was a Force Builder, Rowan used the Force to assemble the crystals."}, {"tag": "h3", "text": "Repairing the StarScavenger"}, {"tag": "p", "text": "Zander and Roger's repair work was hampered by a flock of mynocks, which wanted to drain the ship's power, Zander and Roger tried to drive the mynocks away with the StarScavenger's weapons but ended up causing the tiny kyber crystals around them to explode and tilt the ship upside down."}, {"tag": "p", "text": "With the mynocks continuing to drain the StarScavenger's power, Zander came up with an idea of outfitting Roger with a jetpack. Roger flew out to distract the mynocks while Zander completed the repairs to the StarScavenger. Meanwhile, Rowan and Kordi returned with a large kyber crystal and the stabilizer fin. After rescuing Roger, the Freemakers headed back to rejoin the rebel fleet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After obtaining the giant kyber crystal, the Freemakers had obtained all the parts needed to build the StarScavenger. They returned to the rebel fleet only to find it under attack from the Imperial Navy. To finish installing the kyber crystal, the Freemakers traveled with Quarrie and Lieutenant Valeria to the planet Jakku. Despite losing the energy matrix activator and running into the Imperial officers Durpin and Plumestriker, the Freemakers managed to assemble the Arrowhead."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to obtain a Kyber crystal first appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"The Pit and the Pinnacle,\" which premiered on August 9, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}