{"url": "Mission_to_obtain_a_Type_A_vector_coil", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Events of the Galactic Civil War", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to obtain a Type A vector coil"}, {"tag": "p", "text": "In 4 ABY,[source?] the Freemakers undertook a mission took place to collect a Type A vector coil for the Rebel Alliance starfighter pilot Valeria's U-wing starfighter. Under the leadership of Kordi Freemaker, the Freemakers traveled through several planets bartering objects until they managed to obtain a Type A vector coil. Due to their efforts,\nKordi was able to repair Valeria's U-wing. In return, Admiral Ackbar decided to hire them."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Rowan Freemaker stole and destroyed the Kyber Saber, the Emperor Palpatine placed the Freemakers on his most wanted list. Seeking to enlist the Freemakers' services for the Rebel Alliance, Admiral Ackbar sought out the Freemakers in space and invited them aboard his MC80A Home One Type Heavy Star Cruiser Home One. Shortly after arriving, Lieutenant Valeria's U-wing needed a new Type A vector coil. With the rebels lacking spareparts, Kordi Freemaker volunteer her family's services in obtaining one. Admiral Ackbar promised to hire them if they could deliver the vector coil."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The Freemakers departed on their starship StarScavenger and visited several worlds. Using an ignition switch she had taken from the rebels, Kordi Freemaker and her family traveled to Cloud City where she managed to get a pair of Ugnaughts to swap it for a comlink gasser. The Freemakers then traveled to a desert planet where Kordi managed to barter the comlink gasser with a CZ-series secretary/business communications droid for an ion projector. The Freemakers then traveled to Takodana where they bartered with a Rodian merchant. When the Rodian gave them a Type Two power cell, Rowan protested. The Rodian then brought his associate the bounty hunter Grummgar who forced the Freemakers to accept the trade."}, {"tag": "p", "text": "The Freemakers then traveled to the Wookiee homeworld of Kashyyyk where the Wookiees were still fighting against the Trandoshans. After Roger's head got knocked off, Kordi managed to convince to Wookiees to swap their repulsor disc for the power cell. Later, they traveled to Tatooine where Kordi managed to convince a band of Jawas to barter their Type A vector coil for their repulsor disc."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Having accomplished their mission, the Freemakers returned to the Home One where Kordi repaired Valeria's U-wing. A grateful Admiral Ackbar then hired the Freemakers and assigned them to finding spareparts for the Rebel Alliance's starfighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to obtain a Type A vector coil serves as the main plot of the LEGO Star Wars: The Freemaker Adventures Season Two animated short \"Home One\", which was released on the LEGO Star Wars website on May 4, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}