{"url": "Mission_to_rescue_Shmi_Skywalker_Lars", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Events during the Separatist Crisis", "Category:Genocides and massacres", "Category:Missions to Tatooine"], "nodes": [{"tag": "h1", "text": "Mission to rescue Shmi Skywalker Lars"}, {"tag": "p", "text": "During the Separatist Crisis, Anakin Skywalker traveled to Tatooine in an attempt to rescue his mother, Shmi Skywalker Lars, from a camp of Tusken Raiders. This followed weeks of visions in which Skywalker saw his mother suffering. Meanwhile, he was tasked by the Jedi Council with protecting Senator Padmé Amidala, who was the target of multiple assassination attempts by the Confederacy of Independent Systems, so he traveled with her to her homeworld of Naboo for safety. While there, he had more dreams of his mother and chose to leave Naboo for Tatooine."}, {"tag": "p", "text": "Skywalker and Amidala, who chose to help him, arrived in the settlement of Mos Espa and learned that Watto, Skywalker's master from when he was a slave, had sold Shmi to a moisture farmer, Cliegg Lars, years earlier and that Lars had freed her and married her. Skywalker learned from the Lars' that Shmi had been kidnapped by Tusken Raiders and set out to find their camp, where he discovered that Shmi had been severely beaten and was near-death. She died in his arms, and Skywalker slaughtered the entire camp."}, {"tag": "p", "text": "The slaughter of the Sand People became one of Skywalker's first steps towards the dark side of the Force. His inability to let go of his attachments led him to fall to the dark side and become Darth Vader, a Dark Lord of the Sith, in a failed attempt to save Amidala—who by then had become his wife—from death. Vader continued to hold a grudge against all Tusken Raiders for decades after his mother's death."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Ten years before the Clone Wars, a young slave named Anakin Skywalker was discovered in the settlement of Mos Espa on Tatooine by Jedi Master Qui-Gon Jinn. Jinn believed that Skywalker was the Chosen One destined to bring balance to the Force and destroy the Sith, so the Jedi Master helped to secure Skywalker's release from the boy's owner, Watto; Skywalker won his freedom in the Boonta Eve Classic podrace, and Jinn bet Watto that the boy could beat the competition. Jinn was not, however, able to secure the release of Skywalker's mother, Shmi Skywalker. Skywalker said goodbye to his mother and left Tatooine for the Jedi Temple on Coruscant, but he was unable to let go of his strong attachment to his mother, missing her for many years. Skywalker was accepted into the Jedi Order and became the Padawan of Jedi Knight Obi-Wan Kenobi, who had been Jinn's apprentice, after Jinn was killed during the Battle of Naboo. Even though he was accepted, the Jedi Council was wary of the boy, as he held a deep attachment to his mother and feared losing her."}, {"tag": "p", "text": "In the years after Skywalker left Tatooine, Shmi was purchased from Watto, who had lost almost all of his wealth and possessions in the failed podrace bet, by a moisture farmer named Cliegg Lars. Lars fell in love with Shmi and freed her, and the two married soon thereafter. She lived on the Lars moisture farm with her husband, as well as her new stepson Owen Lars and his girlfriend Beru Whitesun. One month before the outbreak of the Clone Wars, however, she was kidnapped by Tusken Raiders and brought to their camp, where she was brutally beaten. Cliegg and twenty-nine other people attempted to save her, but twenty-six of them were killed. Cliegg, who lost his leg in the fight against the Sand People, and only three others returned. Meanwhile, Skywalker began having dreams of his mother suffering at the hands of the Sand People, though he believed they were dreams and did not yet know why he was having them."}, {"tag": "p", "text": "Around the same time, in the midst of the Separatist Crisis in which thousands of star systems began leaving the Galactic Republic to join the Confederacy of Independent Systems, Senator Padmé Amidala of Naboo was targeted for assassination by the Separatists. After two failed assassination attempts, Skywalker was tasked by the Jedi Council with protecting Senator Amidala, so he accompanied her to Naboo, where he would lead her protection detail. While there, the two began to have romantic feelings for one another, and Skywalker continued to have dreams about his mother. Unable to let them go, Skywalker told the Senator that he had to leave Naboo and travel to Tatooine to find out if anything had happened to Shmi. Amidala decided to go with him."}, {"tag": "h2", "text": "The rescue mission"}, {"tag": "p", "text": "Skywalker and Amidala traveled to Tatooine and arrived in Mos Espa. Once there, Skywalker sought out Watto in order to find his mother. Watto, who marveled at how his former slave had become a Jedi, told the Padawan about how Cliegg had bought, freed, and married Shmi. He also told Skywalker that Cliegg and Shmi lived far from Mos Espa, on the other side of Mos Eisley. Skywalker and Amidala left Mos Espa and found the Lars farm, where Skywalker met his step-family for the first time; he also reunited with C-3PO, the protocol droid he had built for his mother as a child. Cliegg explained that Shmi had been kidnapped and that the attempted rescue failed."}, {"tag": "p", "text": "Despite Cliegg's insistence that Shmi was already dead, Skywalker refused to accept that she had died and set out to find the Tusken Raider camp. He traveled alone across the desert and throughout the night, at one point stopping to find information about the Sand People from Jawa scavengers. He found the Tusken camp early the next morning, arriving on a ridge high above the camp. He jumped down the cliffside and quietly made his way through the camp and used the Force to sense the hut that his mother was being held in, slicing open a hole with his lightsaber in order to enter undetected. Once inside, he found his mother tied up, badly beaten, and near-death. She survived long enough to tell her son that she was proud of him and that she loved him, but she soon succumbed to her injuries and died in Skywalker's arms."}, {"tag": "p", "text": "Enraged by Shmi's death, and unable to control his emotions due to his attachment to her, Skywalker ignited his lightsaber and slaughtered the guards standing outside the hut. He did not stop there, however, and continued his rampage throughout the camp. He killed every Tusken in the camp, including the male warriors as well as the women and children."}, {"tag": "p", "text": "The slaughter of the Sand People was powerful enough that it sent a disturbance through the Force, which was felt across the galaxy by Jedi Master Yoda, who sensed that the Padawan was in terrible pain. Fellow Master Mace Windu spoke to Yoda immediately after Yoda felt the pain, and Yoda told him that he believed Skywalker was suffering and that death surrounded him. Though he did not share this with Windu, Yoda also heard Qui-Gon Jinn's spirit cry out through the Force, begging Skywalker not to kill the Tusken Raiders. Not only was the slaughter Skywalker's first step towards the dark side of the Force, it was also Yoda's first step in learning that a Jedi could achieve immortality by becoming one with the Force at death, as Jinn had."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Later that day, Skywalker returned to the Lars farm with his mother's body. As the family prepared for her burial, Skywalker retreated the homestead's garage, where he tinkered with the machinery he found there. When Amidala went in to check on him, he told her that he should have been strong enough to save his mother and that he would one day become so powerful that he could learn to stop people from dying. Skywalker also confessed to her that he slaughtered the Sand People, and that as a Jedi he should have known better. Amidala allowed him to express his feelings, and she treated her pained friend with compassion."}, {"tag": "p", "text": "When the preparations were finished, the Lars family held a burial for Shmi on the farm. Skywalker said goodbye to his mother and promised he would never again fail to save those he loved, as he blamed himself for being unable to save her. Skywalker and Amidala then left Tatooine and traveled to Geonosis, where they fought for the Republic in the first battle of the Clone Wars against the Separatists."}, {"tag": "p", "text": "After Shmi's death, Skywalker—who had become a Jedi Knight—hoped to never return to Tatooine, due to the painful memories of his mother's death, but he was forced to return during the Clone Wars as part of the rescue of Rotta, Jabba the Hutt's infant son. Later in the war, Skywalker saw a vision of his mother in the realm of Mortis, where he had been taken by three Force wielders who put him through tests to determine if he truly was the Chosen One. The vision was conjured by the Son, a being who represented the dark side of the Force, and Skywalker expressed regret for giving into his anger and killing the Sand People. The vision of Shmi told him that he was not at fault for letting her die but he had drawn a burden of guilt around himself as well as that he should to give up his love for Amidala, whom he married shortly after the Battle of Geonosis, saying that he did not truly love her and that she was poison to him. Similarly, the leader of the Force wielders, known as the Father, told Skywalker that the Jedi Knight was indeed the Chosen One, but warned that he had to beware the feelings that his heart created."}, {"tag": "p", "text": "The Son's warning was proven true during the final days in the war, when the same emotional attachment that led Skywalker to kill the Sand People led him to fall to the dark side in a failed attempt to save Amidala from death; he had seen a vision, much like his visions of Shmi, where Amidala died in childbirth. He was seduced to the dark side by Darth Sidious, the Dark Lord of the Sith publicly known as Supreme Chancellor Palpatine, who promised Skywalker the knowledge of Sidious' old master, Darth Plagueis. Palpatine, to whom Skywalker had told the story of happened with Shmi and the Sand People, explained that Plagueis had learned how to save people from death. Skywalker pledged himself to Sidious and became Darth Vader, a Dark Lord of the Sith, and helped Sidious destroy the Jedi Order as well as the Separatists. Despite falling to the dark side to learn how to save people from dying, as he had promised to do after his mother's death, Amidala died soon after giving birth to their twins, Luke Skywalker and Leia Organa."}, {"tag": "p", "text": "Two decades later, Vader—who was horribly injured in a lightsaber duel with Kenobi shortly after Sidious transformed the Republic into the Galactic Empire, requiring him to live in a suit of black armor—continued to hold ill will towards the Tusken Raiders. He was sent by the Emperor to Tatooine in order to negotiate a weapons supply deal with Jabba the Hutt, partly as punishment for Vader's failure to stop the Alliance to Restore the Republic from destroying the Death Star during the Battle of Yavin, as the Emperor knew that Tatooine brought up painful memories for his apprentice. While on Tatooine, Vader encountered a camp of Sand People, slaughtered them, and left the camp in flames."}, {"tag": "p", "text": "He learned of Luke's existence during the Galactic Civil War, and the boy followed in his father's light side footsteps and became the last of the Jedi Knights. During the Battle of Endor, Luke pleaded with his father to turn back to the light side. The Emperor attempted to kill Luke, but Vader was unwilling to lose his son and killed the Emperor. In doing so, he was mortally wounded. He died aboard the second Death Star moments before the Rebel Alliance destroyed it, but not before he let go of the dark side and was redeemed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attempted rescue of Shmi Skywalker Lars was part of the 2002 film Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy, written and directed by Star Wars creator George Lucas."}, {"tag": "p", "text": "The concept of Anakin Skywalker mercilessly slaughtering the Tusken Raiders for killing his mother was repurposed from an unused idea from the 1980 film Star Wars: Episode V The Empire Strikes Back. The film originally was going to include a sequence in which upon arriving at Cloud City, Luke Skywalker was to massacre a group of stormtroopers to build tension with the audience about Luke potentially falling into the dark side of the Force while suggesting too that he could potentially beat Darth Vader in their duel, which would have made his defeat much more shocking."}, {"tag": "p", "text": "In the audio commentary of the 2005 film Star Wars Episode III: Revenge of the Sith, George Lucas commented the importance of Anakin's nightmares prior to his failed attempt to rescue Shmi, mentioning that the pain of losing his mother after being taken by the Jedi would continue on in his Jedi life until her death in Attack of the Clones in spite of having matured much since then, with his attachment problems only worsening with his dreams of Padmé's death during childbirth in Revenge of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}