{"url": "Mission_to_rescue_Lando_Calrissian_and_Chewbacca", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to rescue Lando Calrissian and Chewbacca"}, {"tag": "p", "text": "In 4 ABY, the Freemakers undertook a mission to rescue the Rebel Alliance agents Lando Calrissian and Chewbacca. The Freemakers were initially intercepted by an Imperial Gozanti-class cruiser commanded by Durpin and Plumestriker. Despite being captured, the Freemakers managed to escape with the help of Roger, steal the ship's fuel intermixer, and escape aboard the StarScavenger. They then rendezvoused with Lando and Chewbacca and returned with them to the rebel flagship Home One."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After stealing and destroying the Kyber Saber, the Freemakers joined the Rebel Alliance and found work as repair crew. Following a stint, the Freemakers volunteered to help their benefactor Admiral Ackbar to rescue the rebel agents Lando Calrissian and Chewbacca, who were stranded because their ship, the Millennium Falcon, lacked a fuel intermixer."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The Freemakers traveled to the system in the StarScavenger where Lando and Chewbacca were stranded in but were intercepted by an Imperial Gozanti-class cruiser. The StarScavenger was boarded by a stormtrooper boarding party led by the Imperial officers Durpin and Plumestriker. The Freemakers tried to fool the Imperials into believing they had the Gamorrean flu. Durpin was fooled but Plumestriker saw through their deception and ordered his men to arrest the rebels and confiscate their cargo."}, {"tag": "p", "text": "The Freemakers were imprisoned aboard the Gozanti cruiser's brig. Inside, the Freemakers embarked with the second stage of their plan. Rowan used the Force to summon the B1-series battle droid out of the cargo box and reassemble him. Roger then knocked out the two stormtrooper sentries guarding the cell with one of his legs. Roger then freed the other Freemakers. Before escaping on their ship, Rowan used his lightsaber to cut a hole through the ship's hull and steal its fuel intermixer. Since Durpin was panicking about contracting Gamorrean flu, he and Plumestriker were not able to stop the Freemakers from escaping."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After reuniting with Lando and Chewbacca, the Freemakers handed the fuel intermixer to them. They then returned to the rebel flagship Home One in their starships. Lando thanked the Freemakers for helping him twice and Admiral Ackbar for recruiting them. While the Freemakers were grateful, their celebration was interrupted when Roger informed that he had misplaced one of his legs aboard the Gozanti cruiser."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to rescue Lando Calrissian and Chewbacca serves as the plot for the short film \"Beware, the Gamorrean Flu!\", which was released on the LEGO Star Wars website on May 4, 2017 to promote LEGO Star Wars: The Freemaker Adventures Season Two."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}