{"url": "Mission_to_recover_Imperial_codes", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Missions of the Galactic Civil War", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Mission to recover Imperial codes"}, {"tag": "p", "text": "In the year 2 BBY, Phoenix Cell dispatched Phoenix Leader Hera Syndulla and her Spectres crew on a mission to recover Imperial codes from the Imperial Security Bureau station on Killun 71 for the Alliance to Restore the Republic's attack on Lothal. The first battle of the Galactic Civil War saw Wedge Antilles, disguised as an Imperial pilot, fly a stolen Sentinel-class landing craft to Killun Station carrying the droids AP-5 and Chopper, who entered the base to steal the codes. AP-5, as a former Imperial droid, passed through the security and successfully acquired the codes without any problems. Chopper, however, was unlicensed, and had come to Grand Admiral Thrawn's attention as a rebel infiltrator after several of his past missions. Due to this, LT-319, a controller for the Imperial Information Office, detected the astromech droid from his listener ship and took Chopper over when he tried to steal the clearance codes from a port in the base. LT-319 decided not to alert Killun Station's personnel, as he wished to use Chopper to discover the location of Phoenix Squadron's base. AP-5 quickly noticed that something was wrong with Chopper, and attempted to inform Wedge on route to their rendezvous with the Ghost. However, the inventory droid's excessive pushiness, including following Wedge into the refresher, coupled with the controlled Chopper acting nice to Wedge, led the Lieutenant to assume that the droids were \"playing some kind of spy game.\""}, {"tag": "p", "text": "Upon their return to the Ghost, however, Hera quickly realized that something was wrong with her droid. LT-319 swiftly used Chopper to lure the Rebels into the freighter's cargo hold and trap them there, before installing a data spike to try and steal the base's coordinates from the ship's navicomputer. An attempt to blow the Spectres, AP-5 and Wedge into the vacuum of space was thwarted, and Hera sent AP-5 onto the Ghost's hull to access some controls that would open the hatch to the cockpit. He accomplished this, but was witnessed by the controlled Chopper, who was sent outside to finish the protocol droid off, and knocked him off the Ghost's hull, setting him adrift in space. Upon returning, Chopper was ambushed by the Spectres, and Hera used the spike to reverse the control feed, remotely blowing up LT-319's surveillance ship. Afterwards, they went back to retrieve AP-5. As the controller had not informed any other Imperial authorities of the theft, the Rebels' mission was successful."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The C1-series astromech droid known as Chopper was a member of the rebel cell known as the Spectres, which was part of the Alliance to Restore the Republic. He was a friend of the former Imperial RA-7 inventory droid AP-5, who had joined the rebellion after helping the rebels to locate a safe base on the planet Atollon. Together, the two droids undertook several missions on behalf of the rebellion, and even helped foil an Imperial operation to locate Chopper Base."}, {"tag": "p", "text": "As part of the rebellion, Chopper undertook numerous undercover missions into Imperial installations and starships. On these occasions, he was painted in black and red colors to mimic Imperial astromech droids. During a mission to infiltrate the Imperial Armory Complex on Lothal, Chopper was detected by the Imperial tactician Grand Admiral Thrawn, who identified him as an unregistered C1 astromech droid. Thrawn kept a catalogue of the rebel droid's sightings for Imperial forces."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Killun Station"}, {"tag": "p", "text": "While preparing for Phoenix Cell's attack on Lothal, Phoenix Leader Hera Syndulla dispatched AP-5, Chopper and Lieutenant Wedge Antilles on a mission to steal a set of clearance codes from the Imperial Security Bureau's base on Killun 71. Hera placed AP-5 in charge, and he and Chopper were tasked with downloading the codes from the station's central computer. The Rebels managed to obtain permission to land at the base under the pretext of delivering two service droids."}, {"tag": "p", "text": "AP-5 managed to pass through the base's sensors without any problems. However, Chopper caused an alert when he passed through the scanner, which went unnoticed by the stormtroopers on guard but was detected by the crew of an Imperial Information Office IGV-55 surveillance vessel in deep space. The ship's controller, LT-319, recognized Chopper as the unregistered rebel droid that Thrawn had referenced in his manual on Phoenix Squadron. While one of his subordinates, 3-9, wanted to inform the ISB station, the Imperial controller decided to use Chopper to find Phoenix Squadron's hidden base."}, {"tag": "p", "text": "Chopper attempted to acquire the codes by plugging a network terminal, despite AP-5 informing him that the most current codes would not be accessible there. The protocol droid, exasperated, headed for the main control room to get the codes by himself, leaving Chopper at the terminal. LT-319 and his crew took the opportunity to hijack the rebel astromech droid, searching for the base coordinates. After discovering that they were not in Chopper's memory, the controller had Chopper taken over so he could lead them to the rebel base. Outside the control room, AP-5 encountered an ISB droid, PZ-7, but was able to get rid of her by claiming that he was her replacement and she had been reassigned to the cargo platform. After AP-5 stole the clearance codes, he found the Imperial-controlled Chopper still at the terminal, and taunted him about how much more effective he was before departing for the shuttle."}, {"tag": "p", "text": "Boarding the shuttle, AP-5 told Wedge they had to leave at once. When Wedge asked where Chopper was, the hijacked droid boarded their stolen Sentinel-class landing craft. While AP-5 was suspicious about Chopper's change in behavior, Wedge did not notice anything untoward, and even welcomed Chopper's more respectful attitude. AP-5 attempted to warn Wedge, and even followed him into the shuttle's refresher so they could talk without Chopper overhearing. The controller watched through Chopper as Wedge kicked AP-5 out of the refresher, and believed that the inventory droid had undermined his own credibility."}, {"tag": "h3", "text": "Spy games"}, {"tag": "p", "text": "The shuttle docked with the Ghost, and AP-5 gave Hera the disc with the clearance codes. Wedge told her about the droids' behavior on the flight, which amused Ezra Bridger and Garazeb Orrelios. The Imperial-hijacked Chopper then made his way to the Ghost's cockpit and proceeded to download the ship's hyperspace logs. By that time, AP-5 had managed to warn Hera about Chopper's suspicious behavior. Hera managed to stop Chopper, who claimed that he had had files wiped on Killun, and reminded the droid that she cleared his data after every hyperspace jump for security reasons. After she went to speak with the rest of the crew, Chopper dropped the ship out of hyperspace and hid away. When Hera contacted him, demanding to know what happened, Chopper claimed that he was in the engine room and that there was something wrong with the hyperdrive. Hera roused the other crew, all of whom were now certain that there was something wrong with Chopper, in order to find him. The hijacked droid then locked the rebels in the Ghost's cargo hold and jettisoned the stolen Imperial shuttle, flying away."}, {"tag": "p", "text": "After recovering the stolen Imperial clearance codes, Chopper began to install a data spike into the Ghost's navigation computer. This enabled the Imperials to begin remotely downloading the ship's travel logs. In an attempt to kill the rebels, the controller ordered Chopper to open the cargo hold to space. However, Hera managed to manually shut the door. Unable to open the cockpit hatch from the inside, she sent AP-5 to open it from the outside. While walking on the ship's hull, AP-5 was seen by Chopper and the controller through the cockpit window."}, {"tag": "p", "text": "Determined to eliminate the rogue RA-7 droid, the Imperial controller sent Chopper to fight off AP-5. Chopper managed to push AP-5 into space, just after the inventory droid had unlocked the hatch. After Chopper returned, Zeb stunned him with his bo-rifle. Hera then linked Chopper to the Ghost's systems and decided to send a strong message to the Imperial slicers. Using Chopper's visual processor, Hera issued a threat to LT-319 and transmitted a data overload that disabled the Gozanti cruiser's systems, causing it to explode and killing all of the Imperial crew."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After eliminating the Imperial threat, Hera reprogrammed Chopper. After the Spectres reconciled with Chopper, they rescued AP-5 from space. Despite the hijacking and reprogramming of Chopper, the Spectres managed to keep the clearance codes they had stolen from Killun 71. The destruction of the Imperial communications cruiser also concealed word of the rebel theft and allowed Phoenix Squadron to continue making preparations for their strike on Lothal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to Killun Station first appeared in the Star Wars Rebels season three episode \"Double Agent Droid,\" which premiered on Disney XD on March 11, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}