{"url": "Mission_to_save_Kessel", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles of Kessel", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to save Kessel"}, {"tag": "p", "text": "A mission to the planet Kessel took place in 43 ABY when Han and Leia Solo endeavored to save the world from destruction."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 43.5 ABY, Lando Calrissian contacted ex-smuggler Han Solo and Jedi Knight Leia Organa Solo with news of sudden devastating quakes on the planet of Kessel, where he co-owned a profitable mining company, Calrissian-Nunb Mines, with the Sullustan Nien Nunb. The Solos agreed to travel to Kessel with their granddaughter, Allana, and the family's protocol droid, C-3PO, to help Calrissian out. Upon their arrival on Kessel, they were briefed on the mines' history. The quakes had started around 41 ABY, during the height of the Second Galactic Civil War. The Solos agreed to scout out the caves, and see if Leia's Force skills could figure out what the scientific teams Calrissian had sent down earlier could not."}, {"tag": "p", "text": "Journeying into dark caverns in an armed speeder, the Solos were accidentally stranded in a deep gorge when their speeder crashed. Upon landing, they discovered several strange machines that were somehow connected to a large population of bogeys—creatures that disabled machinery if they came into contact. The machinery itself was emitting huge amounts of power, and would destroy the planet if left to function."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Diagnosing the machinery as a threat, Calrissian called in several veteran pilots, including Wedge Antilles, Drathan and Inyri Forge, Cheriss ke Hanadi, Derek Klivian, Koyi Komad, Maarek Stele, Kell Tainer, Nrin Vakil, and Rhysati Ynr to neutralize the installations. Equipped with various fighters, including an Eta-5 fighter and a TIE bomber along with several X-wing fighters, and led by the Millennium Falcon, the team descended into the depths of the caves."}, {"tag": "p", "text": "Despite a close encounter with various strange lifeforms and some setbacks, the team was able to successfully find and disable all of the generators, thus saving Kessel and the Calrissian-Nunb Mines."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Celebrations followed on the surface. Despite the success of the expedition, the true purpose of the strange machinery was never actually determined."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}