{"url": "Mission_to_the_Arc_Hammer", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Dark Trooper Project", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mission to the Arc Hammer"}, {"tag": "p", "text": "The Mission to the Arc Hammer was an event during the Galactic Civil War in which the Dark Trooper Project was shut down by mercenary Kyle Katarn."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Tak Base was destroyed in moments by the dark troopers, the Galactic Empire's next-generation super-troopers, Mon Mothma hired Kyle Katarn to take action."}, {"tag": "p", "text": "He gathered clues throughout the galaxy as to what the troopers were, and how to stop them. After stealing a nava card from Nar Shaddaa and learning the Arc Hammer's location, Katarn ventured to the Imperial Fuel Station Ergo, through which he boarded the Executor, and then the Hammer."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Setting the charges"}, {"tag": "p", "text": "Katarn boarded the Arc Hammer through an automated cargo container. From the cargo bay, he ripped through the inner defenses. His objective was to plant three sequencer charges in 3 exhaust ports to destroy the ship and escape in a Lambda-class T-4a shuttle. He made his way through the inner mazes of the factory ship and planted the three charges. Kyle cleared the hangar bay of dark troopers and opened the shuttle hangar bay door."}, {"tag": "p", "text": "He was greeted by an enormous dark mechanical figure."}, {"tag": "h3", "text": "The final battle"}, {"tag": "p", "text": "General Rom Mohc, creator of the dark troopers, confronted Katarn in his Phase III dark trooper exosuit, the greatest of the super-trooper phases; 1 of only 3 built. The two clashed in the hangar bays, both sustaining critical wounds."}, {"tag": "p", "text": "In a last desperate attempt to penetrate the armor of the exosuit, Katarn fired volleys of beams and mortars into the thick armor. Mohc's powersuit malfunctioned and exploded, leaving his body in pieces."}, {"tag": "p", "text": "The genius behind the dark trooper project was bested in battle."}, {"tag": "h3", "text": "The escape"}, {"tag": "p", "text": "With Mohc dead, Kyle found his way to the hangar and hijacked an evacuation Lambda-class T-4a shuttle and fled the burning ship."}, {"tag": "p", "text": "The ship's launch bays exploded, igniting the gas tanks and engulfing the entire ship in flames. Kyle had successfully shut down the dark trooper project."}, {"tag": "p", "text": "Darth Vader, who witnessed the mercenary's escape from a distance, was the first who recognized the presence of the Force within Katarn."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Mon Mothma awarded Katarn the Star of Alderaan for his bravery and support for the Rebel Alliance."}, {"tag": "p", "text": "Still furious over the loss of the first Death Star, Emperor Palpatine was so infuriated with the loss of the Arc Hammer that he ceased all funding for the dark troopers. Though much of the dark trooper project was shut down, some less-powerful dark troopers remained in operation throughout the rest of the Galactic Civil War."}, {"tag": "p", "text": "The TIE Experimental Project as well as the TIE/ph phantom project were the Empire's next response to the Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}