{"url": "Mission_to_the_Chaykin_Cluster", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles in the Chaykin sector", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to the Chaykin Cluster"}, {"tag": "p", "text": "The Mission to the Chaykin Cluster was a two-part conflict in the Clone Wars. The objective of the first part, Operation Ghost Ship, was to retrieve the Prosecutor's data cores. This involved the clone commandos of Delta Squad splitting up. After coming under attack from Trandoshan slavers, it involved the squad regrouping and converging on the ship's bridge. The second part, Operation Vengeance, involved the removal of the Trandoshans and defense of the ship from a Separatist Lucrehulk-class Droid Control Ship."}, {"tag": "h2", "text": "Operation Ghost Ship"}, {"tag": "p", "text": "The commandos of Delta Squad were assigned to investigate and recover the Acclamator-class assault ship Prosecutor which had been recently discovered intact in the Chaykin Cluster. The commandos entered the ship at four different locations, each making their way for one of the ship's four data cores. Shortly after their arrival, the commandos lost contact with their Advisor, but continued onward with their mission, with Boss heading to the Aft Data Core to retrieve the flight recorder data, Sev proceeding to the Starboard Data Core to retrieve the sensor logs, Fixer making his way to the port data core, to retrieve the weapon and vehicle inventory manifest, and Scorch heading for the Forward Data Core. (presumably to retrieve the crew bio metric logs) Within moments, the commandos began to experience static with their systems. The team soon lost contact with Scorch after he was attacked and incapacitated by a scavenger droid. Shortly thereafter, Boss encountered one of the ship's troopers and watched helplessly as the trooper was attacked and killed by a scavenger droid. In minutes, he himself was under attack from the droids, the first evidence of intruders aboard the ship."}, {"tag": "p", "text": "It was soon clear to Boss, however, that there were more than scavenger droids onboard, as he witnessed several troopers killed by unknown assailants. Sev and Boss rendezvoused at the Starboard Data Core, but before Boss could reach him, Sev was attacked and incapacitated by a Trandoshan slaver. The Trandoshan was one of a large group that had boarded to hijack the ship."}, {"tag": "p", "text": "Boss and Fixer, now the only two Deltas not incapacitated, made their separate ways to Delta Squad's original rendezvous point. Boss retrieved sensor logs from the Starboard data core and the flight recorder data Aft Data Core, battling Trandoshan slavers, Elites, and the ship's own automated defense turrets which had been sliced by the Trandoshans. He also aided surviving troopers he encountered. Fixer and Boss reunited at the rendezvous point and proceeded together to locate and rescue Sev from the Trandoshans. After recovering Sev, the commandos made their way to the detention block to rescue Scorch. Finally a full unit again, Delta Squad headed for the bridge, fighting its way through Trandoshan, droid, and auto turret resistance along the way. Once at the bridge, the Deltas destroyed a jamming device placed there by the Trandoshans, allowing them to once again establish contact with their Advisor."}, {"tag": "h2", "text": "Operation Vengeance"}, {"tag": "p", "text": "After scanning the vessel, the Advisor discovered a Trandoshan dropship in Hangar A. Realizing that the Trandoshans were planning to sell the ship to the Confederacy of Independent Systems in order to buy battle droids, he ordered the Deltas to destroy the dropship and end the Trandoshan threat. The Deltas fought their way back to the elevator and made for the hangar. On the way there, the elevator, which had been booby trapped by the Trandoshans, took them to an ambush in the detention area. Delta Squad fought its way through the ambush and eventually managed to repair the cell block's damaged systems, causing it to go into lockdown and flood the area with poison gas, suffocating the Trandoshans on the level. After joking that they knew how long Trandoshans could hold their breath, the Deltas then moved on to Hangar A, using the Trandoshan's own rocket turrets to destroy their ship."}, {"tag": "p", "text": "Within moments of the Trandoshan ship's destruction, a CIS Droid Control Ship arrived to claim the Prosecutor. Realizing that they would need help, the Advisor sent a distress signal, getting a response from the Republic starship Arrestor. As the Arrestor was en route, the commandos were tasked with sealing the Prosecutor's three remaining hangars and stopping the CIS boarders. Delta managed to seal off all three, repelling the boarding parties. The final hangar was heavily defended by droid forces and Delta squad made use of a AT-TE walker to destroy the last of the resistance within the hangar. In response, the CIS ship opened fire on the Prosecutor, planning to destroy it before reinforcements could arrive. Hoping to buy more time, Delta Squad fought its way to one of the Prosecutor's turbolaser turrets. As they worked to make it operational, the Arrestor arrived, engaging the CIS vessel. The squad's position was under assault by droid forces while the three command consoles were being sliced to open fire on the CIS ship. In moments, the commandos were able to activate the turrets, adding their fire to the Arrestor's and easily destroying the CIS vessel. With the CIS ship destroyed the droids powered down and the Arrestor was able to aid in recovering the Prosecutor, thus winning the conflict."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Trandoshans and CIS forces destroyed the Republic was able to successfully recover the Prosecutor. Though much of the crew had been killed and the ship itself heavily damaged, its recovery prevented the Republic's enemies from gaining crucial intelligence on their ships. In addition a great deal of intelligence was also gained. The Prosecutor's security systems recorded the entire siege of the ship, and all that happened after. This would help prevent such a thing from happening again, but would be even more useful to the Wookiees, who had long been at war with Trandoshan slavers. After receiving the recordings the Wookiees were able to gain valuable insight into the Trandoshan's tactics, giving them a great advantage and putting them and the Republic on very good terms. For their actions Delta Squad was commended by General Mace Windu."}, {"tag": "p", "text": "Shortly after capturing the ship, Delta Squad would respond to a Red Zero distress signal sent out by Omega Squad after a TIOPS mission left them stranded in a scuttled freighter. Using a captured Neimoidian shuttle found aboard the Prosecutor, they rescued their fellow commandos and the three terrorists they had captured."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}