{"url": "Mission_to_the_Corellian-Perlemian_Intersection", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with conjectural titles", "Category:Battles in the Tynna sector", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to the Corellian-Perlemian Intersection"}, {"tag": "p", "text": "The mission to the Corellian-Perlemian Hyperspace Intersection took place in 21 BBY, 367 standard days after the First Battle of Geonosis. The mission was conducted under the authority of the Grand Army of the Republic special operations command, who were responsible for Traffic Interdiction Operations. Clone commandos from Omega Squad were tasked to interdict and detain the occupants of a Gizer L-6 freighter. Intelligence indicated that the suspect vessel had left Cularin bound for Denon and would be reverting to realspace at the Corellian-Perlemian hyperspace intersection, in the Tynna sector."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The target, a Gizer L-6 freighter was one of three vessels in a civilian convoy. Unbeknownst to Omega Squad, it was accompanied by another Gizer L-6 being used as a decoy. Omega Squad, aboard TIV Z590/1 lay in wait for the Gizer L-6. When the first vessel arrived the TIV moved to interdict and board but aborted the operation when it was realized that the vessel was in fact a decoy civilian Gizer L-6. The target vessel arrived second and the TIV attached to the hull after a brief exchange of fire. Omega Squad breached the hull and boarded the freighter."}, {"tag": "p", "text": "Once aboard, the commandos secured the cabin and captured two prisoners. However, the TIV was then attacked by the civilian freighter, Nova Crystal, which had mistakenly identified it as a pirate craft. The TIV was destroyed with the loss of its clone trooper pilot, Sicko. The loss of the TIV caused the decompression of the L-6's hold also resulting in the loss of the two captured prisoners. The remaining three crew had besieged themselves in the ship's cockpit."}, {"tag": "p", "text": "This left Omega Squad in a predicament whereby they were unequipped to survive for long in hard vacuum in their Mark III Katarn Armor. However, they were able to take the cockpit of the freighter and capture the remaining crew in the process without causing further hull breaches. The prisoners were two Nikto, M'truli and Gysk, and one Human, Farr Orjul. Due to damage to the freighters environment systems, the commandos had to be evacuated quickly, resulting in a Red Zero distress call for an immediate emergency extraction."}, {"tag": "p", "text": "Both the Acclamator-class assault ship Fearless and Delta Squad responded to the Red Zero call and came to evacuate Omega Squad. Delta Squad was the first to arrive and dock with the crippled craft, evacuating Omega Squad while the Fearless destroyed an attacking Neimoidian starship that had also responded."}, {"tag": "p", "text": "Due to the secrecy of the mission, the true nature of the TIVs activity was not released and the skipper of the Nova Crystal was regarded as a hero for his actions by the Perlemian Traffic Control. The wreckage of TIV Z590/1 and remains of CT-1127/549 were retrieved by the Majestic later the same day."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}