{"url": "Mission_to_the_Bright_Jewel_Cluster", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to the Bright Jewel Cluster"}, {"tag": "p", "text": "Qui-Gon Jinn and Obi-Wan Kenobi undertook a mission to the Bright Jewel Cluster in 37 BBY to search for Sando, the son of Baroness Omnino. Omnino had arrived on Coruscant prior to the mission. The Jedi had foiled an assassination attempt when she arrived to meet Supreme Chancellor Finis Valorum. Shortly afterward she received word that her son's ship was attacked, and asked Jinn and Kenobi to save him. Jinn and Kenobi found Sando's ship floating in space. They boarded the ship and discovered that Sando and the crew were killed by Mantellian Savrips, which had been imprisoned on the ship. One Savrip was still alive, and the Jedi killed it. The Jedi went to Ord Mantell to investigate why the ship was transporting Savrips."}, {"tag": "p", "text": "On Ord Mantell the Jedi learned that Sando's ship went to the Bold moisture plant, run by Orin Bold and his daughter Nella Bold. However, the Bolds knew nothing of Sando, and told the Jedi of their own problem with the crime lord Taxer Sundown. Sundown was a Jedi impersonator who apparently had mind control powers. The Jedi went with Nella to Ten Mile Plateau to investigate Sundown. Sundown sent lightsaber-wielding thugs after them, who he controlled using his mind control. Nella was captured in the battle."}, {"tag": "p", "text": "The Jedi pursued Nella's captors, but discovered that they were attacked by Savrips. They interrogated a surviving scout, and learned that Sundown was going to the Bold moisture plant. The Jedi split up, with Kenobi returning to the Bold plant while Jinn followed the Savrip tribe. Jinn found that the Savrips had rescued Nella and were in fact sentient. Sundown had blamed many of his killings, including that of Nella Bold's mother, on the Savrips. Meanwhile, Kenobi spied on Sundown meeting with Orin Bold. Sundown revealed that he had used his mind control to make Orin an unwilling agent of his, even making him kill his own wife when she found out. Kenobi attacked Sundown, who escaped in his ship. He flew back to Ten Mile Plateau, where he saw the tribe of Savrips. He attacked the Savrips, but Kenobi caught up to him and destroyed his ship. Sundown died in the crash, and the Jedi discovered that he was wearing a Mind control device on his head."}, {"tag": "p", "text": "Soon, Omnino arrived with Chancellor Valorum. Jinn deduced that Omnino was the mastermind behind the entire plot. She admited it, considering herself untouchable now that she had taken control of Valorum with her own mind control device. She also explained that they were capturing Savrips to use as food, since they were considered delicious by Venans. Jinn pretended to join her momentarily, but only to get close enough to lop off her head. Shortly afterward Mantellian citizens arrived to slaughter the Savrips, but Jinn stopped them and explained Omnino and Sundown's deception."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}