{"url": "Mission_to_the_Ando_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Lambda sector", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Mission to the Ando system"}, {"tag": "p", "text": "This mission took place in the Ando system during the Clone Wars."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Confederacy of Independent Systems established a base on a planetoid in the Ando system, which they used as a temporary stopover point. The Galactic Republic learned of it and decided to send Strike Force Cularin, a force made up of Republic, Cularin Militia and Thaereian military units, to destroy it. The strikeforce assembled in the Cularin system an then traveled to the Ando system."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The task force arrived in the Ando system and they attacked and captured a Separatist CR90 corvette. The Heroes of Cularin boarded it and found that most of the crew were dead. Among the survivors was the ship's second officer, Lieutenant Rame Cartroll, who they captured. However, they were attacked by Solenoid, Sheel, four other Wyrd members and Gura Tran. Tran was a representative of the Thaereian military who was secretly meeting with the CIS. Rast'tul was worried that the heroes might discover this, so he had a Z-95 Headhunter attack the corvette. It was destroyed and Rast'tul claimed that the pilot was acting alone. A number of starfighters were recovered from the corvette and fitted with Republic transponder codes."}, {"tag": "p", "text": "The Republic soon after landed their Clone troopers onto the planetoid and began to attack the Separatists. They fought against CIS B1-Series battle droids and organic troopers. During the fighting, Rast'tul was attacked, but was saved by the Heroes of Cularin. He was enraged that it was they who had saved him and in his anger, he accidentally admitted sending the Headhunter to kill. Lazlo Ardine overhead and had some clones arrest him. The clones pushed on with the attack, until the base was captured."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Strike Force Cularin withdrew and returned to the Cularin system, where it was disbanded. A datacard that they heroes had recovered from the Separatist corvette was later decrypted and it proved the treachery of the Thaereians, as it showed that they had allied themselves with the CIS."}, {"tag": "h2", "text": "Appearances"}]}