{"url": "Mission_to_the_Dassal_system", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Battles in the Unknown Regions", "Category:Missions of the Cold War"], "nodes": [{"tag": "h1", "text": "Mission to the Dassal system"}, {"tag": "p", "text": "In 34 ABY, Commander Poe Dameron and Kazuda Xiono undertook a mission to the Dassal system, a star system Xiono had identified during his mission on the Colossus, which the First Order had apparently been active in. With their droids, BB-8 and CB-23, they discovered that the Dassal system's sun was missing, and all of its planets had been cored out. On a formerly inhabited moon of the only perfectly-cored planet, Dameron and Xiono discovered an abandoned village, which they deduced had been the site of a massacre of some kind. The Resistance members were spotted by a probe droid, and its destruction drew in Major Elrik Vonreg and his squadron of TIE fighters. Dameron and Xiono escaped their pursuers by luring them into the gravity well in the centre of the cored-out planet, destroying Vonreg's squadron, and departed believing they had killed Vonreg himself as well. Dameron and Xiono swapped out their droids, with BB-8 returning to Dameron, before Xiono returned to the Colossus platform and Dameron departed on a mission to Jakku."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 34 ABY,[source?] Kazuda Xiono was recruited by the Resistance and sent on a mission to the Colossus platform on Castilon as a spy. He was accompanied by Commander Poe Dameron's astromech droid, BB-8. Over the course of the next several months, Xiono discovered that the First Order had a definite interest in the platform, and that they were making an offer to Captain Imanuel Doza, the Colossus' owner, to install a garrison on the platform to protect it from the pirates that were frequently attacking. Unbeknownst to Xiono, the pirates had been hired by the First Order, which wanted control of the Colossus as a staging area. Eventually, the First Order succeeded in gaining a permanent presence on the Colossus by having Doza's daughter Torra kidnapped, allowing them to occupy the platform. Xiono continued to spy on the First Order, and gather intelligence, but was unable to contact the Resistance due to a communications blackout the First Order had imposed on the Colossus."}, {"tag": "p", "text": "Xiono and BB-8 recovered intel suggesting First Order activity in a star system in the Unknown Regions, which Castilon was on the edge of. Growing desperate to contact the Resistance, Xiono constructed a makeshift transmitter to try and break through the First Order's jamming, although Jarek Yeager, who he worked for as a mechanic, was skeptical that the device would work. Unbeknownst to Xiono, BB-8 and Yeager, Dameron had returned to Castilon to pick up BB-8, as General Leia Organa had assigned them a mission to Jakku. Dameron snuck onto the platform and arrived in Yeager's repair shop just as Xiono was attempting to use the transmitter. Xiono, BB-8 and Yeager were all surprised to see him, and BB-8 was eager to go back to the main Resistance when told. Dameron told Xiono he'd brought along CB-23 as a replacement droid, but she was in his T-70 X-wing starfighter, and getting off the Colossus would be more difficult than getting onto it. Xiono told Dameron he had some intelligence to show him, and in Yeager's office, showed him a holomap he had stolen with the locations of First Order fleets, as well as the recent intelligence concerning that star system, the Dassal system. Dameron, stating that General Organa disliked surprises, suggested that they go investigate, as he had enough time to do so before he had to leave for Jakku."}, {"tag": "p", "text": "Dameron, Xiono and BB-8 snuck off the Colossus by means of a Widowmaker maneuver. Xiono, flying the Fireball as he was more familiar with the ship, landed it on top of a departing freighter with BB-8 in the droid socket and Dameron hanging on to the outside as the racer didn't have room for a passenger. Dameron was concerned that the Fireball's gaudy paint job would make the TIE fighter patrols more likely to spot them, but they weren't noticed. When the freighter was far enough away from the Colossus, Xiono detached the Fireball. However, the ramshackle ship's engines had trouble starting afterward, and the ship nearly crashed into the ocean before Xiono and BB-8 were able to get the engines started again. The Fireball rendezvoused with CB-23 in the clouds, and Dameron boarded his X-wing. Xiono was concerned that the Fireball would be trouble, but agreed to still go on the mission."}, {"tag": "h2", "text": "Mission"}, {"tag": "p", "text": "When Dameron and Xiono arrived in the Dassal system, Dameron immediately noticed via his instruments that they appeared to be in a star system without a star, and confirmed with CB-23 that the system's sun had somehow vanished. Xiono was shocked, and, upon flying past two shattered planetoids, wondered what could have done such a thing. Dameron pointed out that the planetoids were strangely intact, and Xiono deduced that they had been \"cored out\". Suspecting the First Order to be responsible, Xiono surmised that they had been after resources, but Dameron countered that the planetoids' cores had been left behind."}, {"tag": "p", "text": "Xiono and Dameron came upon another planet, Najra-Va, which had been cored out but was otherwise intact. The two pilots decided to investigate by flying down the bore. Xiono was confused as to why someone would do anything like this, and Dameron pointed out they were going to find out why. Approaching some floating debris, Dameron's scanners alerted him to a gravity well, and he told Xiono to fire up his thrusters and turn around. However, when Xiono tried, it was already too late, and as the two ships were sucked into the gravity well, Dameron advised Xiono to try and ride out the well. While Dameron stayed somewhat in control of his fighter, Xiono had more trouble until he finally took Dameron's advice, ordering BB-8 to route the Fireball's power to the thrusters. The pilots rode the currents out the other end of the bore and out of the inside of Najra-Va."}, {"tag": "p", "text": "Shortly, Xiono picked up a signal from a nearby moon, and Dameron agreed it would be a good idea to investigate, noting that the atmosphere was still breathable. The two landed their fighters in an abandoned village, Xiono noting the cold as he disembarked. The Resistance members were spotted by a Spider probe droid which had been stationed in the village, which spied on them from within the ruins. Dameron gave Xiono a blaster, warning him not to accidentally shoot himself with it, and ordered CB-23 to stay with the ships and keep them ready in case a quick getaway was needed. Xiono noted that the village was old, wondering who had lived there, and Dameron responded that the inhabitants were gone, but it was hard to say for how long. In the dark, Xiono slipped on some ice and accidentally fired his blaster, prompting him to comment that the exploration would be easier in daylight."}, {"tag": "p", "text": "As the probe droid followed them, Xiono, Dameron and BB-8 arrived at the largest structure in the village, a temple that Dameron described as a relic of a bygone age. Xiono, noticing the marks of blaster fire, remarked that the village must have been under attack. Finding an abandoned tooka doll, Dameron surmised that there had been a massacre, and the perpetrators had wanted the villagers eradicated. He gave the doll to Xiono, before hearing the probe droid's movements and deducing they were being watched. Xiono was initially distracted by the doll and the atrocity it represented, before he and BB-8 joined Dameron in confronting the droid. When the pilots reached the droid, it hovered over them until Dameron fired at it, whereupon it swooped down and knocked down Xiono, so Dameron fired at it again. The droid deployed several smaller remotes, which Dameron referred to as its \"kids\". He ordered BB-8 to prevent the \"mother\" droid from escaping while he dealt with the remotes, so BB-8 fired one of his grappling lines at the droid. Xiono, recovering, offered to help, but was hit in the head again when BB-8 was yanked into the air by the probe droid. The astromech anchored himself to a pillar with another grappling line, leaving him suspended in the air."}, {"tag": "p", "text": "Dameron led the remotes among the pillars and shot a couple down while telling BB-8 to hang on. Xiono attempted to fire at the probe droid, but missed, nearly hitting BB-8, so he told the astromech to hold the probe droid still. Dameron asked Xiono which droid he was shooting at, at which point Xiono managed to shoot the probe droid's visual processor, sending it crashing to the ground. Xiono cheered while Dameron destroyed the final remote. Dameron complimented Xiono on being eventually able to hit the correct droid before the three went to examine the probe droid. Xiono wondered what it was and what it was doing on the abandoned moon, but Dameron didn't know. At this point, TIE fighters summoned by the probe droid, led by Major Elrik Vonreg, arrived, causing Xiono to state it was almost certainly a First Order droid."}, {"tag": "p", "text": "Dameron realized the droid had sent a distress signal, as Vonreg's strafing of the area caused him, Xiono and BB-8 to take cover. He ordered CB-23 to ready the ships for takeoff. CB-23, piloting Dameron's X-wing, shot down a TIE fighter, causing Xiono to cheer as Dameron ordered him to move. Xiono and BB-8 climbed aboard the Fireball while Dameron hopped into his X-wing. Before taking off, Xiono promised to swap BB-8 with Dameron later. The two ships flew into space, and Dameron told Xiono to follow him into Najra-Va's core. Xiono was initially hesitant before realizing it was an excellent opportunity to shake their pursuers. As they entered the gravity well, Xiono and Dameron rode the current while the TIEs had trouble, two of them colliding with debris. Dameron turned back into the gravity well to take out the remaining TIEs, shooting down two more. The loss of his escort caused Vonreg to retreat, making Dameron assume the pilot had been killed when he returned to Xiono."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "On the other side of Najra-Va, at a safe distance from the planet, Dameron ordered Xiono to pull around so they could do a droid swap, which Xiono had briefly forgotten about in the excitement. Xiono said goodbye to BB-8, thanking him for his help, before Xiono and Dameron angled the tops of their fighters toward each other. Dameron told CB-23 that he would see her again soon, and asked her to look after Xiono. BB-8 and CB-23 exited the droid sockets and swapped ships, waving to each other as they passed. Dameron welcomed BB-8 back and told Xiono that, as he had that mission for General Organa to go on, he would have quite the report for her when he was done. Xiono was concerned about how he would sneak back onto the Colossus, but Dameron reassured him that CB-23 would tell him. The two pilots bid farewell to each other before jumping into hyperspace."}, {"tag": "p", "text": "It was evening on the Colossus when Xiono returned, surprising his coworkers Tamara Ryvora and Neeku Vozo as they worked on a starship. When Ryvora inquired as to the whereabouts of the Fireball, Xiono told her it was docked below and that he had taken the ship out for a spin, which made her suspicious as the Colossus had been locked down by the First Order. Taken aside by Yeager, Xiono told him that he'd discovered the First Order was capable of much worse than anything he'd imagined before. When Ryvora and Vozo noticed Xiono's new droid, he claimed that BB-8's absence was due to him having left him on Takodana for repairs, and that CB-23 was a temporary replacement. Vozo was saddened, saying he was going to miss his friend, but Ryvora was made even more suspicious. After Xiono left saying he was going to show CB-23 around, Ryvora asked Yeager what was going on, and was not pleased when told it was none of her concern, complaining about being kept in the dark when Xiono was allowed to sneak out and get a new droid. Privately, Xiono suspected that what he'd seen in the Dassal system was an indication that they might be in big trouble."}, {"tag": "p", "text": "While repairing damage the Fireball had sustained on the mission, Ryvora, who was unaware of Xiono's status as a spy, noted carbon scoring and, suspicious, asked Xiono outright if he had been in a battle on his last trip off the Colossus. Xiono's unconvincing denial only added to her suspicions that there was something odd going on with him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}