{"url": "Mission_to_the_Prism", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Mission to the Prism"}, {"tag": "p", "text": "The mission to the Prism occurred in 19 BBY after the rise of the New Order and the subsequent coup by General Gentis. The coup was an attempt to assassinate Emperor Palpatine, Darth Vader, and many other Imperials in an attempt to end the tide of senseless deaths. Gentis managed to take over Coruscant by faking terrorist attacks, one of which used the poisonous gas Aorth-6. This gas wiped out dozens of loyal Imperials and soldiers, and it was only through the dark side of the Force that Palpatine managed to survive. Severely weakened, Palpatine was taken by Darth Vader, Moff Trachta, and Lieutenant Laurita Tohm to the hidden prison known as The Prism in the Diab system, where they believed they could revive the Emperor. Once there, Tohm devised a plan for retaking the capital by freeing the prisoners of the Prism."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "In 19 BBY, a few weeks after the rise of the Galactic Empire, General Gentis attended a military meeting on Imperial Center. While seeking to escape the droning of the various Moffs, he discovered the Imperial Crematorium, and watched hundreds of dead Imperials be incinerated every minute. Realizing that even though the war had ended, the Emperor's warmongering ways would never cease, and he quickly set about seeking a way to end the senseless killing."}, {"tag": "p", "text": "A few months later, the cadets of six different academies from around the galaxy came to the capital in order to be part of the first graduating class of Imperial officers. Gentis, a hero of the Clone Wars, presided over the ceremonies. Laurita Tohm was the valedictorian of the Raithal Academy, and thus was given the rank of lieutenant by Gentis himself. Tohm was soon selected to be a part of Grand Moff Wilhuff Tarkin's fleet, but Gentis had other plans for the young officer. He ordered Ensigns Caul Gentis and Shens to keep Tohm \"out of harm's way\". Tohm's friends locked him inside a prototype TIE/LN starfighter, and for a time, he assumed it was a practical joke. In reality, this was the first small step in Gentis's coup, as he believed that the promising officer would draw too much attention due to his prominence and deformities."}, {"tag": "p", "text": "Later that night, explosions rocked the cityscape for kilometers around, eliminating seventy-two Imperial targets within minutes. The officer's club, various Stormtrooper garrisons, the Comm Towers, and a supply depot were all destroyed. Imperial Plaza became ground zero in the battle that erupted, as \"terrorist\" forces swarmed through the city streets, fighting with the Empire's clone forces. The stormtroopers were losing the battle until Darth Vader appeared, rallying the troops and driving the enemy forces back. In the madness, Tohm had escaped from the prototype starfighter by engaging its ejector seat and landing in the midst of the battle."}, {"tag": "p", "text": "During the battle, Tohm came upon his wounded friend Shens. Shens begged him to kill Vader, but Tohm told his friend that he should have included him earlier, and shot Shens in the head. Tohm then bowed to Vader, who instantly respected his bravery and loyalty. As the pair made their way from the plaza, another explosion tore through the nearby buildings, unleashing a powerful necrotic virus known as Aorth-6. Dozens of Imperials, including Royal Guardsmen, were killed by the aerosolized virus, which liquified them from the inside out. Tohm donned a breathing device that he had taken from the TIE fighter when he ejected and followed Vader inside. There they found a mortally infected Palpatine and Moff Trachta. Palpatine was using the dark side of the Force to keep the virus at bay, but was losing the battle even with his formidable powers. Vader accused Trachta of being in league with the conspiracy, but the Moff vehemently denied it, saying they needed to get the Emperor into hiding; fear of his power was the only thing keeping the Empire together. The trio escorted Palpatine to secret hangar below the Imperial Palace, where they loaded him aboard a stealth transport."}, {"tag": "h3", "text": "The Ghost Prison"}, {"tag": "p", "text": "Once safe, Trachta revealed that Gentis had pretended to want to meet the Emperor in order to present his most prized students, but instead unleashed the virus. He then attempted to kill Tohm, saying he didn't trust him, but Vader knocked the blaster from his hand. The three discussed where they could possibly go to hide the Emperor, and Tohm stated that Gentis's influence would likely have overtaken all three Rims. Vader then remembered of a place he had once heard of, but he needed more information, and took Lieutenant Tohm to the Jedi Temple in order to get it. While they were gone, Gentis's engineers sent a command to every droid within five kilometers to kill any Imperial officer they saw. Aboard the Emperor's shuttle, Trachta was attacked by a 2-1B surgical droid, while Vader and Tohm were attacked by lightsaber-wielding Jedi training droids."}, {"tag": "p", "text": "All three Imperials were victorious, however, and Vader led Tohm into the High Council Chamber and called up a holorecording of a Jedi Council meeting that Anakin Skywalker had attended. Skywalker demanded to know what happened to the myriad prisoners he had captured over the course of the war, but the Council told him that he was chasing rumors and nothing more. Skywalker persisted, saying that he would get the truth from Supreme Chancellor Palpatine, but Obi-Wan Kenobi calmed him, though Skywalker still left angry. The Jedi Masters further discussed the topic after Skywalker left, revealing that the secret prison was a tightly-kept secret, even from the Chancellor and the GAR. The Jedi believed that the Republic Security Force couldn't contain the Force-users, cyborgs, shape shifters and others that they had captured, and that once the war was over, they would then receive fair and open trials. Kenobi was displeased, but obeyed the Council's wishes, still asking that he be allowed to visit the prison himself. Master of the Order Mace Windu revealed the prison's location and urged Kenobi not to take Anakin. When Kenobi agreed, Vader flew into a rage, destroying the Council chambers and shouting that the Emperor had been right, that they had been plotting against the two of them from the beginning. He then urged Tohm to remember that the Jedi believed in too many ambiguities, when there was only the Empire, and everyone else."}, {"tag": "p", "text": "With their new information, the Imperials left for the Diab system, where the Prism was hidden. Over the course of the three day journey, Tohm attempted to connect with the Force, but Trachta discovered this and told him it would be unwise to discover any Force-sensitivity at that point. The two then recounted the tales of their mutual disfigurations to one another; Trachta had been attacked by a Dark Jedi Padawan while Tohm was the victim of a Separatist attack that killed his family and maimed him. Trachta then remarked that traitors are only thus if they fail in their mission."}, {"tag": "p", "text": "Though the Imperials were confronted with a bewildered Jedi Master and a force of security droids, Vader cut down the Jedi and all three quickly dealt with the droids. They brought Palpatine to the prison's medical center, where they were able to staunch the disintegration of his body. Tohm then accessed the prison's databank, learning that there were two-hundred and eight prisoners held there, with over half for them arrested by Anakin Skywalker. Vader told Tohm that Skywalker was an impressive Jedi, but that he had killed him, and told Tohm to wipe the system clean. Trachta, however, wanted to find a particular prisoner, and had Tohm help him locate the individual. It turned out that the Padawan who had so terribly disfigured Trachta was imprisoned there, and the cyborg decided to spend several hours beating and torturing him to death."}, {"tag": "p", "text": "Knowing that there was no one they could trust to contact, Tohm devised a plan and asked Lord Vader for permission to undertake it: He wished to release all the prisoners of the Prism in order to form an army to take on Gentis."}, {"tag": "h3", "text": "Prism riot"}, {"tag": "p", "text": "Lacking loyal or trustworthy soldiers, Tohm suggested to Vader that the prisoners of the Prism be released and allowed to fight for them, which would allow them to retake Coruscant from General Gentis. Vader amended Tohm's idea, and rather than simply releasing the prisoners, he forced 207 of them to fight one another, as well as Tohm and himself, for the right to serve the Galactic Empire. The battle was vicious and wild, with casualties mounting quickly. Separatist sniper Shonn Volta allied herself with Tohm after saving his life from General Ur'Loach, while Vader defeated Nax Cirvan, a fallen Jedi, who then submitted to the Dark Lord."}, {"tag": "p", "text": "In the end, only thirty-three prisoners survived in fighting condition, including Volta and Cirvan. Vader ordered Trachta to tell the survivors what it meant to serve the Empire. Trachta told the survivors that their crimes were now forgotten, but their reasons for committing them were not—they would now serve an institution not beholden to the \"selfish\" senators of the Republic, nor the Jedi Order. The prisoners knelt before Trachta and the others, becoming Imperials through their submission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}