{"url": "Mission_to_the_Maw", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles in the Maw", "Category:Duels", "Category:Lost Tribe of Sith emergence", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Mission to the Maw"}, {"tag": "p", "text": "A mission to the Maw was undertaken by a joint alliance of Jedi and Sith in 44 ABY. The Jedi hoped to stop the dark side being Abeloth from continuing to cause a mysterious psychosis among several of the Jedi Order's Jedi Knights, while the Sith, who pretended to have the goal of protecting their apprentices from the psychosis, secretly planned to force Abeloth to join them and then kill the Jedi. Shortly after the alliance was formed, Jedi Grand Master Luke Skywalker suggested that the allied forces wait for the help of his friend, Lando Calrissian, who owned an asteroid tug which they could use for navigation in the Maw. The Sith agreed, and the fleet decided to wait at Klatooine, where the Sith's leader, High Lord Sarasu Taalon, discovered the sacred Fountain of Ancients and became obsessed with it. During the stopover, the Force-sensitive Dyon Stadd, who had accompanied the Jedi, succumbed to the psychosis. Luke's son, Ben, along with the Sith Vestara Khai, managed to help capture Stadd, who was sedated and placed aboard the Skywalkers' ship."}, {"tag": "p", "text": "The allies left Klatooine to await Calrissian just outside the Maw, and Taalon left two frigates behind to wait for Calrissian in case something went wrong, although their actual intent was to take wintrium samples from the Fountain. Their raid went poorly, however, and one frigate was captured. Its crew was put on trial by the recently arrived Calrissian and Jedi Knight Jaina Solo and condemned to death. Calrissian, Solo, and the other frigate then met up with the rest of the fleet and entered the Maw. After they discovered that the space station Sinkhole Station had been destroyed, the allies traveled to Abeloth's planet, where Taalon, Luke, Sith Saber Gavar Khai, and Captain Leeha Faal walked beyond shadows. They failed to locate Abeloth, but Vestara placed a homing beacon on Stadd—who, being under Abeloth's influence, knew where to find her—and set him free, allowing the allies to track him to Abeloth. She attempted in vain to convince Luke that she was his former lover, Callista, and the strike team attacked her."}, {"tag": "p", "text": "In orbit, Solo found the Meditation Sphere Ship—who was also under Abeloth's control—and attacked the Sphere in her StealthX. Shortly into the battle the Sith betrayed the Jedi—Gavar attacked Luke, and the rest of the Sith created a control web to capture Abeloth. Ben intervened and dueled Gavar, which allowed Luke to fight Abeloth while the other Sith tried to capture her. Abeloth suddenly scattered them with a Force blast and fled; the Jedi and Sith recovered quickly and ran after her. Luke found her first and, despite another attempt of hers to trick him, stabbed her in the chest, which apparently resulted in her death. Ship suddenly fled the planet, and the psychosis that had affected Jedi throughout the galaxy was terminated. The Jedi and Sith then agreed to repair their alliance, ordering Calrissian, Solo, and the entire Sith armada to leave while Taalon, the Skywalkers, and the Khais remained to investigate further into Abeloth. They soon discovered that Abeloth had actually switched bodies with Stadd, and was still alive. Although their alliance was dissolved, the Sith and Jedi chased Abeloth to the moon Pydyr, and again confronted her."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 43.5 ABY, several Jedi Knights who had lived at Shelter in the Maw during the Yuuzhan Vong War began to suffer from a mysterious psychosis that caused them to believe that everyone they knew had been replaced by impostors. As a result, tensions arose between the Jedi Order and the Galactic Federation of Free Alliances, as the Alliance decided to encase the afflicted Jedi in carbonite, while the Jedi Order desired to have the affected Knights available for study in the Jedi Temple. Meanwhile, Jedi Grand Master Luke Skywalker was tried and exiled from Coruscant and the Jedi Order for dereliction of duty for failing to prevent his nephew Jacen Solo's fall to the dark side during the recent Second Galactic Civil War; he then embarked on a quest with his son, Ben, to find the cause of Solo's fall. Their journey eventually led them to the Mind Walkers—beings who used a Force technique called Mind Walking to separate their minds from their bodies in order to enter the realm that they called beyond shadows—at the Sinkhole space station in the Maw."}, {"tag": "p", "text": "Meanwhile, the Lost Tribe of Sith, descendants of a group of Sith who had been stranded on the remote planet Kesh thousands of years previously, dispatched a strike team to recover the Sith Meditation Sphere Ship—who had helped the Tribe build an armada over the past past two years, before suddenly deserting the Sith—as well as to kill the Skywalkers in order to pave the way for an invasion of the galaxy. The strike team's mission took them first to a planet in the Maw, where they encountered a powerful being known as Abeloth, who was able to control the world's deadly plants and had also compelled Ship into her service. Meanwhile, the Skywalkers saw Abeloth beyond shadows, and they later speculated that she might be the cause of the psychosis that plagued the Jedi Order. After she discovered that the Skywalkers were on Sinkhole Station, Abeloth finally allowed Ship to return to the Sith, who had suffered several losses to the planet's carnivorous plants. The Meditation Sphere then flew the surviving Sith to Sinkhole Station, where the strike team ambushed the Skywalkers. However, only one of the strike team's members, the Sith apprentice Vestara Khai, survived their battle with the Jedi."}, {"tag": "p", "text": "The Skywalkers tracked Khai to the planet Dathomir, where they found her under the protection of the Raining Leaves, a clan of Dathomiri Witches. Khai, meanwhile, had contacted the Tribe and alerted them to her location. The Sith sent a large fleet of ships to Dathomir to retrieve Khai and capture a group of Nightsisters, a faction of dark side witches. The Sith Lord Viun Gaalan led a group of Sith to the surface and captured the Nightsisters, but while Khai went to retrieve one last witch, Gaalan was confronted by the Skywalkers and their Force-sensitive friend, Dyon Stadd. The Jedi dueled and defeated the Sith, although Gaalan managed to escape. The Skywalkers took Khai hostage, and with Stadd prepared to leave Dathomir, but were confronted in orbit by the Sith fleet, which consisted of eleven ChaseMaster frigates under the command of High Lord Sarasu Taalon."}, {"tag": "p", "text": "To the Skywalkers' surprise, however, the Sith did not attack; rather, Taalon offered to form a joint alliance between them in order to eliminate Abeloth. Taalon lied that the Lost Tribe's own apprentices had begun suffering from the same psychosis that was afflicting the Jedi Knights, and Luke Skywalker, although dubious and reluctant at first, accepted Taalon's offer. In reality, the Sith planned to force Abeloth into their service, before they betrayed and killed the Jedi. Also with the Sith fleet was Khai's father, the Sith Saber Gavar, whom the Skywalkers allowed to come aboard their ship, the Jade Shadow, for a private conversation with his daughter. Gavar spoke in the Keshiri language and urged Vestara to use her attraction to Ben—and his to her—to see if she could get any information from him or even turn him to the dark side; he also informed her that the Sith's alliance was a ploy, although he did not tell her their actual plans. The Jedi recorded the conversation, and Luke later transmitted the recording to the protocol droid C-3PO for translation."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Stopover at Klatooine"}, {"tag": "p", "text": "Luke Skywalker contacted his old friend, the businessman Lando Calrissian, for help in navigating the Maw. Although he and his son had successfully navigated the Maw in the Jade Shadow during their previous trip to Sinkhole Station, Luke was concerned that not all of the frigates would be able to survive the treacherous journey. Calrissian responded that he could supply a Colossus I Beta Series asteroid tug, the Rockhound, although he added that he would need approximately two weeks to prepare the vessel. Luke urged Calrissian to move as quickly as possible, as he did not want to remain in the company of the Sith any longer than he had to. The allied group then agreed to travel to the planet Klatooine in the Si'Klaata Cluster, where the Skywalkers planned to restock the depleted supplies of the Jade Shadow while they awaited Calrissian's arrival."}, {"tag": "p", "text": "Shortly after their arrival at the planet, Taalon's second-in-command, the Keshiri Leeha Faal, informed him of the existence of the Fountain of the Hutt Ancients—a sacred natural outcropping of wintrium located in the Derelkoos Desert on Klatooine—and he became obsessed with a desire to possess it. Meanwhile, Ben and Vestara descended to the surface with Stadd to restock their supplies, where Stadd succumbed to the psychosis, stole a speeder bike, and fled toward the Fountain. Ben and Vestara stopped him from entering the Fountain's technology-forbidden surrounding area, but all three were apprehended by Klatooinian guards and were brought to the Detention Area in Treema, Klatooine's capital city. Because of their juvenile status, Ben and Vestara were detained until their parents, Luke and Gavar, arrived to free them. The Skywalkers also took possession of Stadd and placed him under heavy sedatives aboard the Jade Shadow."}, {"tag": "p", "text": "Soon after, Luke received a transcript of the Khais' conversation on the Jade Shadow from C-3PO, which revealed elements of their treachery. Luke quickly showed the script to Ben, who was deeply upset by it. Luke felt that the Sith were too dangerous—Vestara in particular with regard to her and Ben's relationship—to remain waiting with them at Klatooine, and decided that they should move the fleet to await Calrissian just outside the Maw. After Luke informed Calrissian of the decision, Taalon convinced the Grand Master to allow him to leave two frigates behind, the Starstalker and the Winged Dagger, under the premise that they were to wait at Klatooine in case any problems arose. Taalon then promoted Faal to the position of Captain of the Winged Dagger, replacing Captain Syndor, and secretly gave her orders to retrieve a wintrium sample from the Fountain of the Hutt Ancients."}, {"tag": "h4", "text": "Incident at the Fountain"}, {"tag": "p", "text": "The Sith and Jedi fleet, minus the Starstalker and the Winged Dagger, left Klatooinian orbit and headed toward the Maw. Faal related Taalon's orders to Vyn Holpur, captain of the Starstalker, who along with his crew, carried out their mission and managed to retrieve wintrium samples. However, they were attacked by Klatooinian guards who were armed with primitive weapons such as swords and arrows. Despite the loss of one Sith Saber to an acid weapon, the Sith managed to hold off the Klatooinian guards. Meanwhile, Calrissian arrived at the planet with the Rockhound and spoke with Faal, who informed him that they could continue their mission as soon as her crew finished their pre-flight check."}, {"tag": "p", "text": "Suddenly, however, the Hutts—who had entered into a treaty with the Klatooinians thousands of years previously which promised protection over the Fountain in exchange for the Klatooinian species' permanent servitude—arrived in-system with several ships. The Hutt forces apprehended the Starstalker as well as the Winged Dagger just as Jedi Knight Jaina Solo arrived in her StealthX starfighter. Solo, who had hoped to aid the Skywalkers, had originally intended to bring a full Jedi strike team with her, but the rest of the Jedi had been trapped when Alliance Chief of State Natasi Daala had authorized a Mandalorian siege of the Temple. Solo was hailed by Calrissian and came aboard the Rockhound, and the two were shortly thereafter requested by Klatooinian Chancellor Darima Kedari to mediate the situation between the Hutts, Klatooinians, and Sith."}, {"tag": "p", "text": "During the hearing, it was determined that the wintrium samples that the Sith had taken were missing. Faal blamed Holpur and his crew for acting independently during the raid, and although Solo and Calrissian knew that she was lying, they were unable to prove it, as Holpur himself upheld her lie. After considering the issue and hearing from each side, Solo and Calrissian declared Holpur and his crew guilty of violating the Fountain; the entire crew of the Starstalker was thus condemned to death by Klatooinian law. The mediators went on to announce that although the Hutts had failed to prevent the violation of the Fountain, they had done everything within their ability to protect it, thus upholding the treaty. The ruling came too late, however—Klatooinains across the planet had already begun to riot and revolt against their Hutt rulers, which resulted in a violent planetwide uprising. Solo and Calrissian then left the planet with Faal and the Winged Dagger and rendezvoused with the Skywalkers and the rest of the Sith fleet just outside the Maw."}, {"tag": "h3", "text": "Into the Maw"}, {"tag": "p", "text": "Upon the Rockhound's arrival just outside the Maw, Luke Skywalker met with Solo and Calrissian aboard the tug. There, they informed him of the incident on Klatooine as well as the increasing tensions between the Jedi and the Galactic Alliance, including Daala's recent siege of the Jedi Temple. Solo also offered Luke her assistance on the mission; he accepted, even though such cooperation with another Jedi bordered on violating the terms of his exile. Upon his return to the Jade Shadow, Luke contacted Taalon, informing him that he was aware of the incident at the Fountain and blaming the High Lord for instigating the resultant uprising, although Taalon insisted that Holpur had acted on his own. Luke then requested that the fleet stop at Sinkhole Station before continuing on to Abeloth's homeworld, as he hoped that they could find helpful information there."}, {"tag": "p", "text": "After arranging the formation in which the ships were to travel under the protection of the Rockhound, the fleet entered the Maw, passing safely through Stable Zone One between two black holes. However, as the procession neared Sinkhole Station, the Skywalkers began to discover that they could no longer sense the Mind Walkers. After nearly colliding with a piece of debris, the Skywalkers realized that the Station had been completely destroyed."}, {"tag": "p", "text": "While most of the fleet kept away from the debris field, two ChaseMaster frigates moved forward into the remnants of the station. The Rockhound used its tractor beams to attempt to catch the frigates, successfully stopping one of them. However, it was unable to stop the other ChaseMaster from colliding with the debris and being obliterated immediately. As the Rockhound moved the frigate that it had saved away from the debris field, Vestara and the Skywalkers deduced that Sinkhole Station had been created to contain Abeloth, but that she had grown so powerful that she had been able to destroy it. The allied fleet then decided to go straight to Abeloth's planet."}, {"tag": "h3", "text": "Arrival at Abeloth's planet"}, {"tag": "p", "text": "Upon their arrival, Vestara and Ben felt and recognized the presence of the Sith Meditation Sphere Ship. The Skywalkers, concerned that Abeloth might try to free Stadd, sent Vestara back to check on the psychotic Force-sensitive. Meanwhile, Abeloth had indeed been calling to Stadd, urging him to find her. However, when Khai arrived she began to trick Stadd—she lied to him that they were all impostors, but reasoned that that meant that she was not really a Sith. She told him that she was opposing those who had replaced the Jedi, claiming that everyone who had chosen to serve as an impostor for a Sith was doing so. Stadd still didn't believe her, but she insisted that—since the Sith were associated with Ship, and Ship was serving Abeloth—it made sense that the Sith were serving her as well. Khai then asked if Stadd would lead the Sith to Abeloth, and he replied that he would. She gave him an antidote to his sedative and used the Force to scramble the machine that had been monitoring him so that it would appear on the monitor that she had given him an extra dose of the sedative. Khai then told him to pretend to be unconscious if the Skywalkers came in to check on him, promising that she would come back to unlock his stun cuffs when the time was right."}, {"tag": "p", "text": "Meanwhile, as the Jade Shadow entered the planet's atmosphere, they passed the Eternal Crusader, the deserted ship of the Sith strike team originally sent to kill the Skywalkers, still in orbit. As they landed the Jade Shadow, the Skywalkers realized that every location they had seen while beyond shadows at Sinkhole Station corresponded to an actual location on Abeloth's planet. Vestara and the Jedi then met with Gavar, Taalon, and Faal, and Luke suggested that they try Mind Walking to locate Abeloth. Taalon agreed to the proposal and ordered Gavar and Faal to accompany him beyond shadows with Luke. Ben, meanwhile, remained behind to monitor his father's body and keep watch over Vestara. However, upon returning to the Jade Shadow, Vestara again spoke with Stadd, letting him know that Luke was going to Mind Walk to try and find Abeloth. She told him that he should try to escape while Ben was busy monitoring his father's body."}, {"tag": "p", "text": "Beyond shadows, Luke met with Gavar, Taalon, and Faal at the Lake of Apparitions, a lake where deceased beings could be viewed in the water's surface. After Luke warned the Sith of the dangers of taking a misstep in the lake—which would lead to a fall into the Depths of Eternity, from where one could be neither saved nor retrieved—the four set course for the Mists of Forgetfulness, a misty area across the lake where Luke had seen Abeloth during his previous trip beyond shadows. While walking in the lake, Luke began to stumble, but he was steadied by Gavar. Soon after, however, Faal slipped and fell. Quickly recovering, she began to stand, but was suddenly grasped by the hands of her many deceased enemies and was dragged down into the Depths of Eternity. Back on the Winged Dagger, Faal's body spasmed and her brain activity ceased, causing the ship's command to be handed back over to Syndor."}, {"tag": "p", "text": "Taalon was furious at Faal's death, but he decided they should press on. Luke, however, was hesitant to continue into the mists, as the last time he had been beyond shadows, the spirit of his wife, Mara Jade Skywalker, had warned him against doing so. He had yet to see her in the lake on this trip, but after calling sofly for her, she arrived. Luke spoke briefly with Mara, revealing to her that he had felt her presence aboard the Jade Shadow throughout the mission thus far, confiding in her his comfort that she had been with him. However, Mara replied that she had not been with him; whomever he had felt had been someone else. Luke was shocked, realizing that the presence he had felt had been a trick of Abeloth's. Mara warned him that Abeloth was never what she seemed to be, and as she disappeared back into the lake, Luke told Taalon that they needed to leave the realm immediately."}, {"tag": "h3", "text": "Searching for Abeloth"}, {"tag": "p", "text": "Back aboard the Jade Shadow, while Ben conversed with Vestara, Stadd suddenly jumped up and charged for the door. Ben quickly shouted for Vestara to stop Stadd, but instead she simply stepped aside, letting him go free. Luke then returned to his body and woke up, and Ben told him what had just happened. As the Skywalkers confronted Vestara, she revealed that she had convinced Stadd that she was on his side, and that he had told her that he knew where to find Abeloth. While she had been reassuring Stadd that the Sith were supporters of Abeloth, she had placed a tracking device on him, so that they could follow him to Abeloth. When Ben questioned why she hadn't told them her plan, she replied that she hadn't thought that the Jedi would trust her. Vestara and the Skywalkers then went to meet up with Taalon and the other Sith so that they could follow Stadd."}, {"tag": "p", "text": "Meanwhile, Stadd himself found that the planet's deadly flora were refraining from attacking him, allowing him to move freely across the terrain. He sensed Abeloth in a volcano near the beach where the Sith and Jedi convoy had landed. Upon finding Abeloth inside a cave on the volcano, he was overcome by her desire for him, as well as his desire for her. They spoke briefly, moving closer together, and Stadd told her that he wanted to be with her. Abeloth responded that he would be with her as long as she lived, which would be forever. She began to draw upon Stadd's life energy, causing him extreme pain and finally making him realize that she was not what she seemed to be. Stadd felt himself wither up, and as Abeloth continued to drain his energy, she told him that he had served her well and that they would soon be one. However, Abeloth then sensed the Sith and Jedi coming and fled, leaving Stadd for dead."}, {"tag": "p", "text": "The Skywalkers and twenty-two of the Sith—including Taalon and the Khais—followed the tracking device to the cave, although two of the Sith were killed by some of the world's plants en route. Taalon doubted that Abeloth was in the cave; since Vestara had first encountered her there, he thought it was too obvious a place for Abeloth to be. Still, the allies decided to go to the cave and find out if she was there. Upon their entry, they found only Stadd on the cave floor, barely clinging to his life. Awakening, Stadd apologized to Ben for his actions, revealing that now that he was aware of Abeloth's treachery, he was able to resist her influence on his mind. Stadd told them what had happened to him, and that Abeloth had sensed them coming and had fled down a tunnel in the back of the cave. Stadd and two Sith stayed behind at the cave entrance while the rest of the allied forces entered the tunnel."}, {"tag": "h3", "text": "Battle in the courtyard"}, {"tag": "p", "text": "Luke ordered the group to pause for a moment as they reached the end of the tunnel, before they ignited their lightsabers and rushed out into the ruins of a courtyard surrounded by large walls. Luke sensed Abeloth, but could not see her. After calling out to her, however, she announced her presence and appeared behind him. She then tricked Luke into believing that she was his former lover, Callista, taking on Callista's appearance and asserting her love for him. He was shocked, but quickly decided that he wanted to help her separate herself from the dark side; however, she responded with a desire to instead make Luke become like she was. Remembering then his wife's claim that Abeloth was never what she appeared to be, Luke recognized that Abeloth was not, in fact, Callista. He realized that Abeloth had completely consumed Callista—just as she had attempted to do with Stadd—and he refused to help her. Infuriated that he would not join her, Abeloth prepared to attack Luke. However, while the two had been focused only on each other, the Sith had begun weaving a control web—a Force technique that they had learned from their captured Nightsisters."}, {"tag": "p", "text": "Meanwhile, Jaina Solo had felt the presence of the Sith Meditation Sphere Ship—recognizing it from when she had encountered it at the asteroid known as the Home during the Second Galactic Civil War. From Luke, Solo had learned that Ship had helped the Lost Tribe of Sith until Abeloth's influence had taken over and forced the Meditation Sphere to serve her. Either way, Solo believed Ship to be an enemy of the Jedi and decided to attack the vessel. Piloting her StealthX, Solo found Ship in orbit and began communicating with the Meditation Sphere through the Force. Ship confirmed to her that it was indeed working with Abeloth, having been programmed to obey whoever's will was the strongest. Solo then launched a shadow bomb and used the Force to direct it toward Ship. However, Ship used the Force to tear the bomb from her grasp and redirect it aside, before bringing its weapons to bear on her."}, {"tag": "p", "text": "Back on the surface, Taalon, the Skywalkers, and the Khais charged at Abeloth, who used the Force to grab Vestara by the throat and raise her off the ground, shaking her violently. Vestara attempted to shoot Force lightning at her assailant, but Abeloth simply used the Force to fold the lightning back toward the Sith apprentice; simultaneously, large, white roots covered in spikes shot out of the ground and stabbed Vestara multiple times. Ben quickly came to her rescue, slashing through the roots with his lightsaber before taking Vestara in his arms and carrying her to safety, away from the battle. After examining her wounds and determining that none of them had hit anything vital, he began to leave her to return to the battle. However, Vestara grabbed him, managing to communicate to him that the spikes had been poisonous, and Ben began to search through his possessions for something that could help the injured Sith."}, {"tag": "h4", "text": "The Sith's betrayal"}, {"tag": "p", "text": "Meanwhile, Abeloth was holding her assailants—Luke, Taalon, Gavar, and two other Sith—at bay with Force lightning and her telekinetic powers. Suddenly, however, Abeloth disappeared, leaving her five assailants unintentionally battling each other—one of Gavar's strikes accidentally sliced through a fellow Sith, and Luke had to use the Force to leap out of the way of the lightsaber's follow-through. Hearing Abeloth's laughter, the survivors quickly sprang apart, finding their quarry at the far end of the courtyard. She continued laughing as the four attackers raced toward her, but as they encircled her and pressed their onslaught, they began to wear her down. Suddenly, however, Gavar feinted a strike at Abeloth and then redirected the blow toward Luke, even as the other Sith present—who had been weaving the control web—tightened the web and dropped it down on Abeloth."}, {"tag": "p", "text": "In orbit over the planet, Solo continued to duel Ship. It had taken Solo two tries before she had managed to prevent the Meditation Sphere from redirecting her shadow bombs, and she was now resorting to using her laser cannons, successfully scoring several hits on Ship. However, Ship's return-fire was effective, forcing Solo to dodge in her StealthX. The Jedi Knight sent her starfighter into a roll and maneuvered underneath the Meditation Sphere, where the Sith vessel had not yet sprouted any weapons. Solo launched a volley of torpedoes, but the Sith Meditation Sphere suddenly burgeoned cannons along its bottom, firing heavily upon Solo's craft. Her StealthX began to spiral wildly, and Solo struggled to bring it back under control."}, {"tag": "p", "text": "Back on the surface, Ben noticed the Sith's betrayal and shouted a warning to his father, who barely managed to block Gavar's attack. Vestara began to insist that she needed Ben's help, but he leapt away and attacked Gavar from behind, knocking him off balance. Ben quickly pressed the attack on Gavar, furious at the Sith's betrayal, but Gavar's counterattack slashed through his tunic, grazing the flesh beneath. As Gavar continued his onslaught, Luke turned back to fight Abeloth, who was struggling to resist the attempts of the other Sith to trap her in the control web. Ben allowed his anger to make him reckless, and he was again forced to leap away from Gavar's stroke. Gavar urged the young Jedi to use his anger and hate against him, but this had an adverse effect, serving only to calm Ben."}, {"tag": "p", "text": "As the two continued to duel, the Sith Tribe's web was successfully stifling Abeloth's powers. Luke, however, was using his own Force powers to attempt to destroy Abeloth, and, watching the battle transpire out of the corner of his eye, Ben found that his father was winning. His spirits heightened, Ben renewed his attack on Gavar, pressing the Sith Saber back and causing Gavar to worry that he might not win their duel. Suddenly, however, Abeloth released a giant shock wave, hurling aside all of the Jedi and Sith present and heading for the tunnel. Luke recovered first, charging back up through the tunnel, with Ben and the Sith following shortly behind him and Vestara behind them."}, {"tag": "h3", "text": "Abeloth's \"death\" and immediate aftereffects"}, {"tag": "p", "text": "Abeloth returned to the cave at the tunnel's entrance, finding Stadd and the Sith there. She quickly dispatched the Sith, consuming their life energy and leaving the corpses behind undamaged. Abeloth then turned to Stadd and began to finish the task of draining his life energy, but Luke then arrived, causing Abeloth to project the appearance of Callista and move the phantom projection out toward Luke. She pled with him to understand that she was, in fact, Callista, and that she still loved him, but Luke suddenly realized that the projection was neither Callista nor Abeloth. Skywalker quickly thrust his lightsaber down into what appeared to be Stadd's body. The projection of Callista recoiled, and what appeared to be Stadd's body writhed, its voice crying out as Ben and the Sith arrived on the scene. Luke ignored Ben's protest and the Sith's shouts, watching what had appeared to be Stadd's body as it morphed into that of Abeloth's true form. Abeloth began drawing her power for one final assault of dark side energy, but Luke felt her die halfway through it."}, {"tag": "p", "text": "In orbit above the planet, Solo's StealthX suffered a direct hit on one of its engines, although she managed to bring the spinning starfighter under control in time to avoid the next round of torpedoes fired by Ship. She ordered her astromech droid, Rowdy, to target Ship, but the droid responded that the targeting array was damaged—and after taking another hit, Rowdy added that the targeting display was offline. As Ship got the StealthX target locked, however, the Sith Meditation Sphere suddenly turned and fled—with Abeloth's death, her power no longer commanded Ship to do her will. Confused by Ship's sudden flight, Solo decided to return to the Rockhound to learn of any news."}, {"tag": "p", "text": "Meanwhile, on Coruscant, Jedi Master and healer Cilghal—who was taking care of the psychotic Jedi Sothais Saar, Turi Altamik, and Kunor Bann—discovered along with her Twi'lek aide, Jedi Knight Shul Vaal, that all three of the Jedi suddenly appeared to be devoid of the psychosis. Cilghal and Vaal were wary that the three might be attempting to trick them, but Cilghal decided that it was worth the risk to find out if they were cured. She entered Saar's cell, as he had been ill the longest of the three, and spoke with him; he revealed that he remembered his actions after succumbing to the psychosis and was embarrassed by them, and that he no longer believed that the unaffected Jedi were impostors. After running several tests on each of the three recovered Jedi, Cilghal reported the finding to Jedi Master Kenth Hamner, who was serving as acting Grand Master in Luke's absence."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Back on Abeloth's planet, Luke ordered Ben to take Stadd—whom they found lying unconscious off to the side of the cave—back to the Jade Shadow for medical attention right away. When Gavar began to say that he would take Vestara with him to his ship, Taalon cut him off, pointing out that they still needed to examine Abeloth's body. Luke added that they should also examine Abeloth's cave and the locations that he had seen beyond shadows, as well as find out exactly what Abeloth was. Luke then suggested that they send Calrissian, Solo, and the Sith fleet off-planet, leaving just Taalon, the Khais, and the Skywalkers to continue the investigation into Abeloth. Taalon agreed to the terms, and Ben took Stadd and Vestara back to the Jade Shadow. Ben later contacted Solo and let her know of Luke's decision. Although Solo was initially hesitant to leave, she realized that she and Calrissian needed to spread the news about the Lost Tribe of Sith and Abeloth. After Solo and Calrissian exited the Maw in the Rockhound, they found that they had come out of their hyperspace jump far off-course. Solo and Calrissian soon discovered that a sabotage droid, through impersonation of Calrissian himself, had been giving orders to the ship's droid crew. Solo suspected that the Sith Tribe had sneaked the sabotage droid aboard in an attempt to prevent them from revealing anything more about the Sith to the galaxy, although further evidence suggested they had fallen prey to simple piracy. Solo flew out in her StealthX to confront their assailants, and found that they were indeed Sith. After escaping with Calrissian and reporting to the Jedi Council, they found that the Sith Tribe had been ambushing vehicles all over the galaxy for use in their Sith armada, and deducted that the Sith were preparing to begin their campaign for galactic domination."}, {"tag": "p", "text": "Meanwhile, the Sith and Jedi allies soon discovered that Abeloth had somehow switched bodies with Stadd—and thus still lived, while Stadd had been killed. Abeloth called Ship back to the world, and the vessel, which pretended to instead serve the Tribe, took the allies to the Pool of Knowledge—a place that Luke had visited while beyond shadows at Sinkhole Station—to look for Abeloth. There, Ben realized that Ship had taken them there so that Abeloth could steal one of their ships and flee. Meanwhile, Taalon saw the Throne of Balance in the pool upon which sat an unknown Jedi queen. He demanded to know who she was, as feared that she might prevent the Sith from taking their place as rulers of the galaxy. When the Jedi neglected to reply, Taalon decided to dive into the pool himself. The scene quickly erupted into violence, and Luke collapsed the grotto upon the Sith and fled. The Sith survived, and Taalon beat Vestara before he sent her to catch up with the Skywalkers to spy on them, in an attempt to make it appear as though she had been attacked by the High Lord and her father, but had escaped. Back at the beach where they had landed their vessels, the Jedi found that Abeloth had stolen the Jade Shadow. When Vestara arrived, Luke did not fall for her ploy—even when Taalon arrived and attacked her. He fired on Taalon and Gavar Khai with his blaster before further slowing down their advance with a thermal detonator, and allowed Vestara to come along as the Jedi left the planet in Taalon's shuttle, the Emiax. Their journey led them to the Force-sensitive faction known as the Fallanassi on the moon Pydyr. Meanwhile, Taalon, having been immersed in the Pool of Knowledge, began to morph into the same kind of entity that Abeloth was. The Sith and Jedi eventually found Abeloth in hiding on Pydyr and again confronted her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to the Maw served as one of the primary plotlines in the fifth novel of the nine-part Fate of the Jedi series, Fate of the Jedi: Allies, written by Christie Golden and released on May 25, 2010. The mission's events also served as a resolution to the issue of the Jedi falling prey to the mysterious psychosis caused by Abeloth, which had been a major plotline in each of the first four novels of the series. There is one inconsistency of information on the battle—on page 305 of Allies, shortly before the Sith and Jedi enter the tunnel in the back of Abeloth's cave, Taalon nods to two Sith, indicating for them to stay behind with Stadd. However, on page 319, the prose mentions three Sith who had stayed behind with Stadd. The final battle of the mission was later pictured in The Essential Guide to Warfare, a sourcebook published April 3, 2012. Later in the same year, the battle received a mention in The Essential Reader's Companion, another sourcebook published in October 2."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}