{"url": "Mission_to_the_Star_Chamber", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Mission stubs", "Category:Events during the Galactic War"], "nodes": [{"tag": "h1", "text": "Mission to the Star Chamber"}, {"tag": "p", "text": "During the Galactic War between the Galactic Republic and the Sith Empire, the former Imperial Intelligence operative Cipher Nine undertook a mission to the Star Chamber, the headquarters of the secret conspiracy known as the Star Cabal."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Cold War, the Imperial Agent, codename Cipher Nine, was assigned to infiltrate Ardun Kothe's SIS team as a supposed defector. However, Kothe wasn't convinced and used a brainwashing code on Nine to force the agent to do his bidding. Curiously, the code was Imperial not Republic. With help from Watcher X, Nine was able to break free before killing Kothe and obtain the Shadow Arsenal the former Jedi was seeking to use against the Sith Empire. However, a member of Kothe's team, codename Hunter, revealed himself to be working for a third party and had sent an Imperial bombing squadron to destroy the facility where the arsenal was being held, though the agent escaped."}, {"tag": "p", "text": "Nine returned to Dromund Kaas to meet with the Minister of Intelligence, who was curious as to how Kothe and Hunter knew the agent's brainwashing code. Thus, the agent took up the task of discovering the identity of the third party, eventually discovered to be called the Star Cabal. The agent's search went to Belsavis and Voss. The conspiracy retaliated by first leaking Nine's identity to any who had an axe to grind with the agent, hide a virus in a holomessage to incapacitate Imperial Intelligence's genetically enhanced Watchers before using their influence to dissolve the organization entirely."}, {"tag": "p", "text": "Using the last of his influence, the Minister of Intelligence secretly assembled the loyal members of Intelligence to track down the Star Cabal. He arranged for Cipher Nine to transfer under Lord Razer, who was leading the battle for Corellia, where most of the Star Cabal's resources were focused on. The conspiracy intended for both Republic and Empire to annihilate each other, thereby destroying both Jedi and Sith, allowing the \"ordinary\" people to rule once more. Nine allowed themselves to be captured by the conspirators and fed false information under torture that Imperial reinforcements were en route to Corellia led by a Sith Lord, greatly upsetting the conspiracy's plan. The agent then escaped before faking their death."}, {"tag": "p", "text": "Nine rendezvous with the Intelligence flagship, Tenebrous, where the operatives have traced the Star Cabal's headquarters in the Null Zone. The Minister personally ordered the Cipher agent to infiltrate the station, kill any conspirators and obtain their secrets so the Empire can hunt down their remaining membership not onboard the station."}, {"tag": "h2", "text": "Skirmish aboard the Star Chamber"}, {"tag": "p", "text": "Nine managed to infiltrate the Star Chamber without alerting suspicion. Finding a hiding spot overlooking the conspiracy's meeting room, the agent spotted any present conspirators, including Hunter and the Prince, the conspiracy's leader, in holoconference with unidentified holograms, discussing the upheaval of their thousand-year plan. As Keeper worked to identify the holograms, Nine decided to take the initiative to wipe out the conspirators, first opening fire on the Prince. Hunter ran off to arm the station defenses while the rest of the conspirators were slaughtered. Once the fighting had subsided, the dying Prince tells Nine that the galaxy will always be ruled by the Jedi and Sith."}, {"tag": "p", "text": "Keeper then tells the agent that she's identified several of the holograms and has constructed a cover story for each target and has exposed them to the Imperial Military, Korriban and the bounty hunter guild. She promises that she'd have the Republic after them too in hour. Keeper then instructed Nine to find the Star Cabal's database so they can uncover the surviving conspirators before her signal is jammed by Hunter. The conspiracy enforcer tells the agent that killing the inner circle does not grant the Imperials access to their files and taunts his nemesis to chase him. And so Nine gives chase, evading the station's booby traps and fighting through its guards. Eventually reaching the station core, where the conspiracy's Black Codex was stored. Hunter declared that he will make his last stand and remarked that he never though an Imperial Cipher could threaten a thousand-year old conspiracy. Nine coldly called Hunter \"a sick man with sick dreams\", but the latter refused to believe it. Both spies then entered into a firefight, which Nine ultimately won. Mortally wounded, Hunter acknowledged defeat and requested Nine for one last thing, as \"he\" is revealed to be a she. Nine then executes Hunter before accessing the Black Codex. Suddenly, two Dark Council agents appear, stating that the Dark Council has been aware of the Minister of Intelligence acting without authorization and will be dealt with. However, they acknowledge Nine's loyalty and request the Black Codex for the Empire's glory. Nine complied and handed over the data to them."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Cipher Nine then reported back to the Minister on Tenebrous. The latter expressed disappointment that his agent gave the Black Codex to the Sith, fearing that the information would be abused. He acknowledged that people like Nine will be put in charge of the new Sith Intelligence, whilst he, with luck, may retire gracefully, or else be executed."}, {"tag": "p", "text": "Either way, the Star Cabal is hunted down and eliminated, their dreams of a \"finer age\" dying with them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mission to the Star Chamber is a mission in the Star Wars: The Old Republic MMORPG for the Imperial Agent's Chapter III story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}