{"url": "Mission_to_the_hyperwave_relay_station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in Wild Space", "Category:Battles of the war against Zakuul", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Mission to the hyperwave relay station"}, {"tag": "p", "text": "In 3630 BBY, the Alliance send Aric Jorgan's Havoc Squad and Kaliyo Djannis on a mission to the hyperwave relay station hidden ten thousand meters beneath the Spire, the capital city of the Eternal Empire of Zakuul. The station was the only source of the GEMINI frequency, allowing Emperor Arcann to control the Eternal Fleet from the Eternal Throne. However, the mission did not go as planned, when first the Alliance Commander was unable to join them, and then the infiltration team was cornered by enemy. The contact with them was lost, and the diversion team attempted a rescue, before the entire Spire went into full lockdown, making any outside assistance impossible. While fighting their way out, four Havoc Squad members were killed, though Kaliyo and Jorgan were eventually able to escape and return to the Alliance base on Odessen with a data archive on the GEMINI droids, making the mission not a total loss."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3630 BBY, the Alliance that opposed the Eternal Empire recruited the anarchist Kaliyo Djannis following the raid on the Overwatch and the Republic Special Forces Division Havoc Squad, led by Major Aric Jorgan, after the joint mission to Zakuul listening post. Comparing the data from two sources led SCORPIO to reveal the existence of the GEMINI frequency, by the means of which Emperor Arcann controlled the Eternal Fleet. The frequency originated from the hyperwave relay station hidden ten kilometers beneath the Spire, the capital city of Zakuul. Powered by two hundred reactors, the station transmitted signals to and from the Eternal Throne to thousands of Eternal Fleet warships across the galaxy, presenting the Alliance with a unique opportunity to rid Arcann of his advantage. The Alliance planned an attack on the station and send Kaliyo and Jorgan's Havoc Squad to Zakuul so that they could clear the Alliance Commander a path directly to the relay station. However, the Alliance leadership was divided on what to do when they reach it; Lana Beniko desired to slice the GEMINI frequency to learn about Arcann's plans; Kaliyo wanted to take control of it; and Jorgan wanted to destroy it to sever Arcann's control of the Fleet. To draw Arcann's attention from their objective, the Alliance required a diversion and the Commander had to choose between Kaliyo and Havoc Squad to lead the main attack, while the other party would focus on the diversion. Before the Commander could depart to lead them, Beniko suggested to contact Valkorion on how to best infiltrate the facility he had build, but unfortunately the Commander decided to do so in a secluded spot in Odessen wilderness, where Valkorion tested them for a prolonged period of time before the Commander could return to the Alliance base. Unable to wait for the Commander return, with their intel turning stale every minute, the Alliance had no choice but to proceed with the mission regardless."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Having successfully executed the diversion, the support team moved in position to assist the main infiltration team, which by the time the Commander made it back was only a few levels away from the objective. At that point, the infiltration team was about to be cornered by a superior force, before a contact with them was lost. The diversion team then went to attempt a rescue, regardless of the Commander's orders. At that point, the Spire went into full lockdown with no transmissions coming in or out, making any assistance from Odessen all but impossible. A tense firefight erupted, in which four of six Havoc Squad members were killed and the rest were forced to retreat. Kaliyo managed to grab a datacore from a security console right outside the relay station, making the mission not a total loss, before returning to Odessen along with Jorgan and the bodies of his fallen men."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Safely home on Odessen, Jorgan and Kaliyo started arguing, with the Major blaming Kaliyo for the deaths of his men. The Alliance Commander, Lana Beniko and Theron Shan then arrived to greet them, learning the details of the mission. Kaliyo presented the data archive that she grabbed, and Beniko ordered SCORPIO to analyze it, hoping to salvage the fiasco. In light of their failure, Theron Shan suggested the Commander to confine both Kaliyo and Jorgan to the Alliance base for the time being. The analysis of the data core allowed SCOPRIO to determine that the GEMINI droids were all created from a single template, GEMINI Prime, in a factory on the Eternal Empire vassal world of Darvannis. To retrieve it, Theron Shan recruited the Mandalorians led by Mandalore the Avenger, who attacked the factory in a raid on Darvannis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While the ultimate outcome is identical, the mission can go two different ways depending on the player's choice. If the player chooses Kaliyo, she reaches sublevel four ahead of schedule and with acceptable collateral casualties, before running into a group of skytroopers three levels away from the relay station. Kalyio gets surrounded only thirty meters from the frequency computer, at which point Havoc Squad arrives blasting, forcing Kaliyo to implement her backup escape route by detonating a hospital. If the player chooses Havoc Squad, they proceed towards the station while hiding their tracks, until they get flanked by a dozen of Knights of Zakuul. Havoc manages to corner the Knights, at which point Kaliyo arrives and begins tossing thermal detonators, leading to the deaths of four Havoc members. If the player forbids Kaliyo or Jorgan from going to assist the other side, they later get an option to either kill or permanently exile the guilty party for disobeying a direct order, or forgive them, allowing them to remain with the Alliance."}, {"tag": "p", "text": "Only four coffins are shown in the Alliance base, and Jorgan explicitly mentions losing four men, leading to the uncertainty regarding the identity of the other surviving Havoc Squad member. \"Chapter XI: Disavowed\" establishes that Jorgan's squad consists of Kanner, Dengril, Xaban, Abbeth and Torg. Only Kanner and Torg are explicitly shown alongside Jorgan in the cinematic, and none of the five appear or get mention by name following Jorgan's return to Odessen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}