{"url": "Mission_to_the_frozen_moon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battle stubs", "Category:Battles in the Unknown Regions", "Category:Duels", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Mission to the frozen moon"}, {"tag": "p", "text": "A mission was undertaken by Jedi Knight Jaden Korr in 41 ABY, when he traveled to a frozen moon with a cloning laboratory."}, {"tag": "h2", "text": "Battle on the moon"}, {"tag": "p", "text": "After the end of the Second Galactic Civil War, Korr experienced a Force vision which led him to a frozen moon in the Unknown Regions, where he found a cloning facility where Imperial Grand Admiral Thrawn had experimented with creating Force-sensitive clones decades previously. However, the clones had rebelled and killed all of the scientists at the facility. While exploring the facility, Korr encountered Alpha, a clone who bore resemblance to Jedi Master Kam Solusar."}, {"tag": "p", "text": "Alpha attempted to kill Korr and feed him to \"Mother,\" a Spaarti cloning cylinder. Korr, however, dueled and defeated Alpha, killing him. In the duel, Korr lost three of the fingers on his right hand as well as the green-bladed lightsaber he created upon becoming a Jedi Knight. Jaden concluded the duel with the purple-bladed lightsaber he had crafted as a boy, before formal training. During the conclusion of their duel, Alpha's lightsaber shorted out, which left the clone open to Jaden's deathblow. After the deadly confrontation, Jaden considered discarding Alpha's unstable, red-bladed lightsaber, but instead he chose to keep it."}, {"tag": "p", "text": "Moments after Jaden had left the cloning facility, he was ambushed by the Anzat Kell Douro. Douro had tracked Korr down in hopes of drinking his soup—of receiving a revelation—and had incapacitated Korr's newfound friend, Khedryn Faal before finding and attacking the battle-weakened Korr. Douro overwhelmed the weary Korr and managed to achieve his epiphany just as a recovered Faal arrived. Faal shot the Anzat in the head, killing Douro and saving Korr's life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}