{"url": "Mitth%27raw%27nuruodo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with elements from unlicensed sources", "Category:Pages needing citation", "Category:Chiss", "Category:Chiss Expansionary Defense Force officers", "Category:Collectors", "Category:Csillans", "Category:Empire of the Hand personnel", "Category:Galactic Empire Supreme Commanders", "Category:Grand Admirals of the Galactic Empire", "Category:Heads of state of the Empire of the Hand", "Category:Heads of state of the Galactic Empire", "Category:Impersonators", "Category:Males", "Category:Mitth family", "Category:Nirauan residents", "Category:Space explorers", "Category:Thrawn's fleet"], "nodes": [{"tag": "h1", "text": "Mitth'raw'nuruodo"}, {"tag": "p", "text": "Mitth'raw'nuruodo, better known by his core name Thrawn (pronounced /Thräwn/), and misinterpreted as Mitthrawdo by Vicelord Siv Kav, was a male Chiss who served in the naval forces of the Galactic Empire and became the only alien Grand Admiral. Regarded by many as the best military strategist in the navy, he rose to a position of power despite the Empire's strict speciesist policies."}, {"tag": "p", "text": "Thrawn hailed from Csilla, and began his career as an officer in the Defense Force of the Chiss Ascendancy in the Unknown Regions, where he demonstrated his ruthless commitment to eradicating threats to the Ascendancy. These early threats included an advance force of scouts of the extra-galactic Yuuzhan Vong species, though at that point the Chiss knew them only as the \"Far Outsiders\". However, many of Thrawn's ways were contrary to that of Chiss society, which rejected offensive and preventive strikes. In 27 BBY, he first met the Sith Lord Darth Sidious, who held a secret double identity as Supreme Chancellor Palpatine of the Galactic Republic, after having destroyed part of Sidious's private task force. However, they both agreed with the threat posed by the Unknown Regions, most notably by the Far Outsiders. The two sealed their informal agreement when Thrawn destroyed the Republic exploration ship Outbound Flight lest it draw the Far Outsiders toward the Republic, killing many members of the Jedi Order in the process."}, {"tag": "p", "text": "Thrawn's continued preventive strikes led the Chiss to exile him on an uninhabited world far in the fringes of the Chiss Ascendancy. In 19 BBY, soon after Palpatine reformed the Republic into the Galactic Empire, Imperial Navy officer Voss Parck encountered Thrawn in the Unknown Regions and brought him to Emperor Palpatine. Already aware of Thrawn's command skills, Palpatine approved his admission to the Imperial Navy. Over time, Thrawn climbed the Imperial ladder, believing that he could better defend against the threat of the oncoming Yuuzhan Vong as an Imperial officer than if he returned to the Chiss, and circa 2 ABY became the thirteenth Grand Admiral in the Imperial Navy. The Chiss officer fought both the Rebel Alliance and rogue Imperial officers. Simultaneously, he pacified the Unknown Regions and established a secret empire of his own, believing that only a strong military government could protect the galaxy's diverse species from annihilating each other, and to serve as a bulwark against the Yuuzhan Vong."}, {"tag": "p", "text": "The Grand Admiral remained in the Unknown Regions around the time of the Battle of Endor, which saw the death of Palpatine and the subsequent breakdown of the Empire under rival warlords. He returned in 8 ABY to take control of the remaining Imperial forces and crush the New Republic, the successor state to the Alliance. Although the Grand Admiral was able to deal the New Republic several mighty blows in a massive campaign the following year, his unexpected death prevented him from destroying the fledgling government. Thrawn perished in the Battle of Bilbringi at the hand of Rukh, his Noghri bodyguard, who had recently learned that the Empire had betrayed his people. Even though his death led to the further fragmentation of the Empire, Thrawn left behind several clones of himself and an empire still unknown to the New Republic in preparation for yet-unknown threats to the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "h4", "text": "Early life"}, {"tag": "p", "text": "Mitth'raw'nuruodo was born on the planet Csilla during the final decades of the Galactic Republic. His species, the Chiss, controlled an area of space in the part of the galaxy known to those in the Republic as the Unknown Regions. He and his brother, Mitth'ras'safis, were born as commoners but, after joining the Chiss Expansionary Defense Force, Mitth'raw'nuruodo was taken as a merit adoptive in the Eighth Ruling Family of Chiss society. Mitth'ras'safis also joined the Eight Ruling Family, eventually becoming a Syndic within the family."}, {"tag": "p", "text": "Though the practice of military officers becoming merit adoptives in the Ruling Families, and taking on the colors of their adoptive family, was common, they usually ceased belonging to the family upon leaving the military. Mitth'raw'nuruodo, however, soon reached the rank of commander—the youngest Chiss ever to achieve the rank—and impressed the Eighth Ruling Family enough during his early career to be considered a trial-born, with the possibility of becoming a permanent member of the family. His work with the Expansionary Defense Force gave him the opportunity to learn to speak several languages used throughout the Unknown Regions, including the trade languages Sy Bisti and Minnisiat, in addition to his native Cheunh."}, {"tag": "h4", "text": "First contact"}, {"tag": "p", "text": "By 27 BBY, Mitth'raw'nuruodo was the commanding officer of Picket Force Two, a small border patrol fleet based out of an asteroid in the Crustai system on the Chiss Ascendancy's frontier. He was tasked with overseeing the surveying of the system and anticipated that the second planet would be home to a Chiss colony within a few years. While out on patrol, his picket force came across a skirmish between two unknown ships. Deciding to intervene, Mitth'raw'nuruodo ordered his forces to fire Conner nets at both ships to disable them. While the first, a Corellian light freighter called the Bargain Hunter, was disabled easily, its pursuer, a vessel under the command of Progga the Hutt, opened fire on the Chiss vessels. Within six minutes the Hutt vessel was destroyed and Mitth'raw'nuruodo had his starfighters escort the Corellian ship to his flagship, the Springhawk, while his forces began examining the wreckage."}, {"tag": "p", "text": "After landing on the Springhawk, the crew of the Bargain Hunter, the Humans Captain Dubrak Qennto, Maris Ferasi and Jorj Car'das, were taken to Mitth'raw'nuruodo. With no previous recorded contact between the Chiss and Humans, neither group could understand the other's native language, but soon discovered a common ability to speak Sy Bisti—switching to the trade language, Mitth'raw'nuruodo began questioning the Humans as to their purpose in that region. The group explained that they were traders from Corellia, who were delivering a cargo of luxury clothing when they were pursued into the Unknown Regions by pirates, and thanked Mitth'raw'nuruodo for rescuing them. However, the commander explained that, before he could release them, he needed to examine their ship and confirm that they were telling the truth and not scouts for a potential threat to the Chiss. Until he was satisfied, he was taking them back to Crustai. He then dismissed the group, having them escorted to guest quarters for the duration of the journey back to his base."}, {"tag": "p", "text": "During their initial meeting, Mitth'raw'nuruodo was intrigued by Car'das. The young Corellian spent his time looking around him, curious about his surroundings—a trait that Mitth'raw'nuruodo prized in others. When analysis of the Bargain Hunter suggested it was too small to cover the running costs by simply delivering cargo and too poorly armed to be a pirate vessel, Mitth'raw'nuruodo concluded that the Humans were smugglers. His suspicions were confirmed by the firegems hidden in their shipment of clothing but the commander decided to question Car'das on their true mission to determine whether he could trust the group. He summoned Car'das alone to meet with him and questioned him further. After Car'das admitted that they were smuggling the gems to avoid the customs fees associated with them, Mitth'raw'nuruodo explained that he was curious about the Humans and wanted their company for a while to learn more of their language and culture. In exchange for teaching him Galactic Basic Standard, Mitth'raw'nuruodo would satisfy Car'das's own curiosity by teaching him and Maris Cheunh. Most of the time the three studied together, but later on Car'das found out that Maris had secret separate lessons with the Commander as well. Since Thrawn had noticed that the Humans struggled to pronounce his name, he would also teach them the easier Minnisiat and suggested that they call him by his core name, Thrawn. As a prolonged stay at Crustai would delay delivery of their cargo, Thrawn also agreed to give them some valuables to offset any lateness penalties."}, {"tag": "h4", "text": "The Vagaari"}, {"tag": "p", "text": "The Springhawk arrived back at Crustai base three days later, but as it was preparing to dock, the ship received a warning from a sentry vessel about a small group of Vagaari starships not far from the Chiss base. The Vagaari were pirates and slavers who had been moving through the region for ten years, raiding the weaker species they encountered. Since they'd never moved against the Chiss, Thrawn had not previously had any reason to engage them. With the Vagaari so close to Crustai, however, Thrawn ordered a micro-jump, taking the Springhawk into hyperspace and emerging near the intruders; two starfighters escorting a larger Vagaari vessel whose hyperdrive had already been disabled by the Chiss sentry. The Vagaari vessel turned to run, while its fighter escort moved against the Springhawk. When the fighters were quickly destroyed, the Vagaari opened fire on their Chiss pursuers. Their attacks followed a consistent pattern, which Thrawn was easily able to counteract, and the commander concluded that they were undermanned and not prepared for a fight—he decided that he would personally lead a boarding party to the Vagaari ship. Guided through the enemy ship by the Springhawk's sensors, Thrawn's boarding party secured the vessel within half an hour and he ordered the ship taken back to his base for study."}, {"tag": "p", "text": "Thrawn returned to Crustai base during a routine survey by Aristocra Chaf'orm'bintrano of the Chiss's Fifth Ruling Family. Thrawn went to greet the Aristocra, taking the Humans with him, but having them escorted to guest quarters when the other Chiss showed no interest in talking to the aliens. Chaf'orm'bintrano was uneasy with the presence of the Humans, who he considered a potential threat, and also expressed his displeasure with Thrawn's attack on the Vagaari ship. The Chiss believed that preemptive strikes were immoral and that the Vagaari should be left alone until they actually moved against the Chiss. Thrawn, however, was unwilling to sit idly by while the Vagaari preyed on others. Emphasizing his point, he informed the Aristocra of the treasure his troops had found on the Vagaari vessel, items looted from worlds throughout the region. This was not enough to sway the other Chiss and Chaf'orm'bintrano left, still displeased with Thrawn's actions."}, {"tag": "p", "text": "Thrawn later returned to the Vagaari ship, taking the Humans with him. He was curious whether they might recognize any of the artifacts aboard as coming from Republic space and wanted Qennto to pick some items for them to take as compensation for the delay, in turn establishing which artifacts were valuable. The group quickly identified some Frunchettan-sai art from the Outer Rim Territories, along with some Pashv art from Wild Space, and were impressed when Thrawn was able to describe both species, simply by observing their artwork. Thrawn continued to learn more of the Republic from the Humans, including knowledge of droids and the Jedi, both concepts previously unheard of by the Chiss. In language lessons with both Car'das and Ferasi, who, by now, had developed a serious crush on the Commander, Thrawn quickly took to Basic and, in turn, was impressed by the pair's progress with Minnisiat and Cheunh."}, {"tag": "p", "text": "In time, Crustai received more visitors—Admiral Ar'alani of the Defense Hierarchy arrived to take possession of the captured Vagaari vessel, bringing Mitth'ras'safis along as a favor to the Eigth Ruling Family. Thrawn went to meet the admiral and his brother as they arrived, taking Car'das and Ferasi with him. Ar'alani was uncomfortable with the Humans in Crustai base, but Thrawn assured her that they were kept under constant surveillance and that he was learning much about them. He was soon given a report of a Vagaari attack in progress and needed to distract Ar'alani while he investigated. He took the visitors on a tour of the captured Vagaari ship, eventually reaching the treasure room where Qennto was working. Ar'alani was suspicious of Qennto and insisted that she and Mitth'ras'safis take their own inventory of the treasure, providing Thrawn with the distraction he needed. He made his excuses and departed with the Humans, though he expected to be disciplined upon his return."}, {"tag": "p", "text": "Thrawn's intention was simply to observe the Vagaari and to only attack if he deemed them a sufficient threat to the Chiss. He therefore took Car'das and Ferasi along as independent witnesses. The Springhawk emerged from hyperspace in a safe area outside the battlezone. They soon observed around 200 ships of varying size involved in the battle, with a further 100 Vagaari vessels waiting on the other side of the nearby planet. Thrawn realized that the waiting ships were civilian, indicating that the Vagaari were a nomadic species and not simple pirates—unless they were all destroyed at once, they would simply escape into hyperspace and regroup. As he continued to observe the battle, Thrawn realized that the Vagaari were using a number of gravity well projectors to prevent their victims escaping and decided to capture one of the vessels. He ordered his starfighters to jump to hyperspace on a course that took them through the target's gravity well, bringing them back to normal space near their objective. The Chiss fighters cleared the immediate area of any enemy vessels before Thrawn took the Springhawk to join them. An assault team was sent to the projector to neutralize the crew, before Thrawn charged an engineering team with finding a way to secure it for transport."}, {"tag": "p", "text": "While the engineers worked, Thrawn's forces moved to engage the approaching Vagaari defenders. A close look at the Vagaari warships revealed bubbles located around the hull—'living shields'—each containing a prisoner to discourage their enemies from attacking the ship. Knowing that the prisoners were already effectively dead, Thrawn ordered his forces to continue their attack but vowed to find a way to stop the Vagaari before more sentients could suffer the same fate. During the battle, the Springhawk's bridge was struck by Vagaari fire, causing a hull breach. Though the crew were already wearing enviro-suits, Thrawn's sustained a tear and the commander was knocked unconscious in the explosion. Maris Ferasi attempted unsuccessfully to patch the hole, before lying across him to prevent the air escaping. Chiss medics soon arrived and patched the suit, before taking Thrawn to the medical bay as the Springhawk fled to hyperspace. The Chiss engineers had succeeded in capturing the gravity well projector, which was later installed in the cruiser Whirlwind. Thrawn spent two hours undergoing medical treatment before he summoned the Humans to see him and thanked them for their efforts. He also told the pair that he hoped the Vagaari would be angry enough to attack the Chiss in retribution, giving his people the excuse to eliminate the Vagaari threat."}, {"tag": "p", "text": "The Springhawk returned to Crustai to find that Ar'alani had confiscated the treasure and taken Qennto into custody before leaving. Thrawn released Qennto but informed the Humans that he would be unable to release the treasure until Ar'alani returned to present her case against him. While he spoke to the Humans and expressed his gratitude to Maris for saving his life, Thrawn was also visited by his brother, who had remained at Crustai. With four dead in the recent engagement, Mitth'ras'safis had no choice but to report the incident to the Ruling Families. He would try to portray it as a reconnaissance mission to protect his brother, but warned that the Eighth Ruling Family would disown the commander before they let him damage their reputation. Thrawn, however, was unwilling to turn his back while others suffered, though he would do everything he could to prevent his brother from sharing his fate."}, {"tag": "h4", "text": "Outbound Flight"}, {"tag": "p", "text": "Several days later, Thrawn's scouts reported a fleet of unknown vessels nearby and the commander took a group of twelve Chiss ships to investigate. Since the ships were unfamiliar to the Chiss, he also took Car'das in the hopes that the Human could identify them. Upon seeing the unknown fleet, Thrawn noticed hull markings similar to those on the Bargain Hunter, and Car'das confirmed that the ships belonged to the Trade Federation, but was unable to shed any light on their presence. Thrawn hailed the Trade Federation fleet in Basic, hoping to gauge their reactions—there was no response and Thrawn repeated his message for ten minutes before he was contacted by the task force's commander, who introduced himself as Commander Stratis. Stratis assured Thrawn that his forces meant the Chiss no harm, but was unwilling to reveal the nature of their mission. While the two commanders talked, the Trade Federation's Lucrehulk-class battleship Keeper launched droid starfighters to engage the Chiss. Car'das informed Thrawn that the incoming ships were remotely controlled, so Thrawn had his communications officer locate their control frequency before pulling his ships back to just outside the signal's maximum range. While the Whirlwind stayed at a safe distance, using its gravity well projector to keep the enemy from escaping, Thrawn sent a single starfighter to probe the enemy lines, observing the control signals sent to the enemy starfighters as they responded. After spotting a pattern, he was able to replicate the signal, drawing many droid fighters away from the Trade Federation fleet and moving the Springhawk into the resulting gap in the enemy formation."}, {"tag": "p", "text": "As more droid fighters moved to attack, Thrawn had his fighters launch a single missile each, followed by a Conner net. The droids reacted to the incoming missiles, shooting them down only to be disabled by the shock nets. Vicelord Siv Kav, overseeing the battle from the Lucrehulk-class battleship Darkvenge responded by launching yet more fighters, only for Thrawn to initiate full spectrum jamming to disrupt the control signal. Thrawn's forces were able to cut through the fighters and the thirteen smaller capital ships of the fleet and soon only the Darkvenge and the Keeper remained. When the signal disruption to the droid starfighters still in the Keeper's hangar caused them to auto destruct, destroying the vessel, Dorianna ordered Kav to power down the Darkvenge and surrendered to Thrawn. Despite being outnumbered and outgunned, Thrawn's fleet had emerged victorious without any casualties."}, {"tag": "p", "text": "Thrawn boarded the captured Darkvenge, escorted by Car'das and two of his soldiers, and was met by Kav and Stratis on the bridge. Kav threatened the Chiss commander with a pair of droidekas but Thrawn responded calmly, thanking him for the demonstration and ordering him to send the droids away. After Kav reluctantly obeyed, Stratis explained that they were waiting to destroy Outbound Flight, six Dreadnaught-class heavy cruisers mounted around a central fuselage, which were carrying, among others, a group of Jedi Masters on a mission to explore beyond the edge of the galaxy. He claimed that the Jedi were troublemakers who not only posed a threat to the Republic, but would also attempt to impose their will on the Chiss. Thrawn listened to Stratis's claims, aware that the Human was hoping to persuade him to destroy Outbound Flight for them, then returned to his ship."}, {"tag": "p", "text": "Leaving the Keeper to guard the Darkvenge, Thrawn took the Springhawk back to Crustai to meet the returning Admiral Ar'alani. The admiral had recently led Chiss forces to victory in battles at Vun'Hanna and the Twilight Void against a small alien force at the edge of Chiss space. Unknown to the Chiss, this was in fact an advance reconnaissance force of the extra-galactic Yuuzhan Vong species. Despite outnumbering the invaders, the battle had been extremely costly for the Chiss, and Ar'alani had come to investigate whether the Trade Federation forces belonged to the same group. Though it was soon clear that the groups were unconnected, the admiral was concerned about the prospect of fighting wars on multiple fronts and agreed to look the other way while Thrawn quickly eliminated the Vagaari threat. She dispatched him on a security sweep of nearby systems while she conducted an apparent investigation into his latest act of aggression. Thrawn took the Springhawk to rendezvous with the Darkvenge two days after its capture. He had devised a plan to use the Trade Federation forces against the Vagaari and to deal with Outbound Flight at the same time, but would only implement it if Stratis told him the full story of their mission."}, {"tag": "p", "text": "With little alternative, Stratis told Thrawn that he was really Kinman Doriana, an adviser to Palpatine, who was both Supreme Chancellor of the Galactic Republic and secretly the Dark Lord of the Sith Darth Sidious. He claimed that Sidious had information that a group known only as the \"Far Outsiders\" were massing an invasion force at the edge of the galaxy and was trying to strengthen the Republic against the threat. If Outbound Flight were intercepted by the Far Outsiders, it could lead them back to the Republic, so Sidious had reached the conclusion that Outbound Flight must be destroyed. To confirm his story, he contacted Darth Sidious by hologram, explaining the situation and introducing Thrawn to the Sith Lord. Sidious was impressed by Thrawn's destruction of his task force and told Doriana to provide Thrawn with their reports on the Far-Outsiders and the technical date on Outbound Flight. He also warned Thrawn to be aware of the Jedi's ability to use the Force against him, though he informed the commander that a high loss of life would dull their senses. Thrawn, realizing that the Far Outsiders were the same force that Ar'alani had encountered and aware of the damage their biotechnology weapons could do, agreed to review the data and to stop Outbound Flight. He immediately put his plan into motion, ordering the Darkvenge's crew to begin unloading their droid starfighters to a nearby asteroid and to assist his forces in reprogramming them for close-approach attacks. Twenty of the starfighters were linked into pairs with a spare fuel tank between them, in which explosives were placed. With the preparations under way, Thrawn departed, taking two droidekas, and four battle droids with him."}, {"tag": "p", "text": "Around this time, Thrawn approached Car'das to assist in his plan. Thrawn told Car'das to steal the shuttle holding the battle droids and to contact the Vagaari to offer them a deal—the battle droids and Thrawn's location, in exchange for their freedom and some treasure to take back to the Republic. When the Vagaari came after Thrawn, he would be provided with the justification to destroy them. To ensure that Car'das's actions looked like those of a desperate man, Thrawn publicly accused him of being a traitor, leading Ar'alani to confine him to quarters. After Car'das set out on his mission, Thrawn took his forces to a point intersecting Outbound Flight's course and the course the Vagaari would take between their last known location and Thrawn's base. There, he had the Whirlwind activate its gravity well projector and waited."}, {"tag": "h4", "text": "Destruction of Outbound Flight"}, {"tag": "p", "text": "Outbound Flight eventually arrived, later than expected. Kav, present with Doriana on the bridge of the Springhawk, was eager to attack but Thrawn still hoped to resolve the situation peacefully. He hailed Outbound Flight every five minutes for half an hour, finally getting a response from Jedi Master Jorus C'baoth, the leader of the expedition, who agreed to let Thrawn board his ship to talk. Aboard Outbound Flight, Thrawn was met by C'baoth and his former Padawan Lorana Jinzler. Thrawn was forthcoming, informing the pair about Darth Sidious and the Far-Outsiders. When C'baoth refused to either turn back to the Republic or adjust his course to bypass Chiss space, Thrawn gave him one hour to reconsider, or he would be forced to destroy Outbound Flight. Thrawn was escorted back to his shuttle by Jinzler. When several of Outbound Flight's colonists attempted to approach the commander, to voice their concerns about C'baoth's leadership, C'baoth used the Force to prevent them talking to him, and Thrawn left unaware of the internal conflict aboard the ship."}, {"tag": "p", "text": "While Thrawn waited for C'baoth's final decision, a Vagaari fleet of over 200 ships was pulled out of hyperspace by the Whirlwind. As Thrawn had hoped, the Vagaari decided to capture Outbound Flight on Car'das's assurance that it was carrying thousands of droids. The Jedi aboard Outbound Flight moved to defend themselves against the new threat, using the Force to numb the minds of their enemies while they moved close enough to shoot without hitting the slave bubbles. The distraction provided Thrawn with the opportunity he needed. He ordered the launch of the droid starfighters, their modified programming making them attack from close range to avoid killing the slaves. At the same time, he activated the battle droids Car'das had presented to the Vagaari and the droids began to kill the Vagaari leaders from within their flagship."}, {"tag": "p", "text": "The Vagaari were quickly decimated and the Jedi, taken unawares by the sudden loss of life they sensed, became disoriented. Thrawn moved his forces towards Outbound Flight and initiated a surgical strike at their weapons and shield generators. Once the vessel was defenseless, Thrawn withdrew and offered them one more chance to withdraw. He was soon contacted by C'baoth, but the Jedi Master refused to surrender and, instead, used the Force to choke him. The Springhawk's bridge crew rushed to their commander's side but were unable to halt the unseen attack. Doriana, however, acted quickly, using Thrawn's control board to redirect the droid starfighters to attack Outbound Flight. The droids followed Thrawn's programmed battle plan, striking at specific points to open the ship's hull. Those which had been modified to work in pairs then flew into the hull breaches and detonated the contents of their extra fuel tanks, unleashing a wave of radiation that killed all those aboard the six outer Dreadnaughts. With C'baoth dead, his grip on Thrawn was released."}, {"tag": "p", "text": "However, Thrawn was not happy with the outcome of the battle. Not only had he hoped to spare Outbound Flight, but the droid starfighters had been intended for use against the Vagaari and their reassignment had allowed the surviving Vagaari to flee beyond the gravity well and into hyperspace, allowing them to regroup and eventually return to once more threaten the Chiss. Nevertheless, he accompanied his forces as they began boarding the damaged Vagaari vessels to free the slaves, retrieving Car'das in the process. Ar'alani and Mitth'ras'safis soon arrived with more ships to take the freed slaves to their homeworlds, and the new arrivals joined Thrawn during an inspection of Outbound Flight. Thrawn's brother was annoyed at being manipulated, but agreed that the galaxy was better off without the Vagaari. However, he warned that Chaf'orm'bintrano was on his way with vessels of the Fifth Ruling Family and may see things differently. Thrawn suspected that the Fifth Family were attempting to take control of the remains of the Vagaari fleet and was concerned that they may also seize Outbound Flight. Though any such claim to the ship would be contested, the Fifth Ruling Family would be able to learn from its technology and threaten the delicate balance of power between the Ruling Families. To prevent this, he and Ar'alani decided to take the ship to a military base and declare it Defense Fleet property."}, {"tag": "p", "text": "Before they could act, however, the Fifth Family ships arrived and Chaf'orm'bintrano ordered Thrawn to report to him on the Chaf Exalted. When Thrawn didn't respond, the Aristocra ordered Ar'alani to place him in custody. Though Ar'alani had to obey, neither Car'das or Mitth'ras'safis was bound by the order; the two volunteered to remain aboard Outbound Flight and take the ship to a military base. The two military officers agreed, instructing them to head to the nearest Defense Fleet base at Pesfavri before leaving. Thrawn and Ar'alani reported to Chaf'orm'bintrano on the Chaf Exalted's bridge, where they were joined by Doriana. Thrawn translated while the Aristocra accused the Human of bringing weapons to use against the Chiss. Catching on quickly to the power struggle between the Chiss, Doriana claimed salvage rights as a representative of the Republic, distracting the Aristocra long enough for Outbound Flight to jump to hyperspace. Before it left, a shuttle carrying Car'das launched from the ship. Lorana Jinzler had survived the attack, along with 57 others in the Central Storage Core. In light of this, Mitth'ras'safis had decided to take the ship to the secluded area of Chiss space known as the Redoubt, where the survivors could wait while he negotiated for their safe passage, and had sent Car'das back to inform his brother."}, {"tag": "p", "text": "Chaf'orm'bintrano was furious with Outbound Flight's escape and confronted Thrawn, Ar'alani, Doriana and Car'das. Records of the battle had shown that Thrawn fired first and he did not believe that the Vagaari's presence had provided sufficient cause to do so. He therefore revoked Thrawn's military position pending a trial. All four Humans would also be charged unless Thrawn was prepared to resign and renounce his status as a trial-born, never again returning to a high position in Chiss society. Thrawn responded that the Eighth Ruling Family would stand by him if he presented the gravity well projector to them, giving them an advantage over the other Ruling Families. If, however, he were to remain an active Defense Fleet officer, he would present the gravity well projector to them instead. Knowing that he was defeated, the Aristocra departed."}, {"tag": "p", "text": "Ar'alani released the Humans into Thrawn's custody and dispatched him back to Crustai. Before he let them go, however, Thrawn joined Doriana and Kav back on the Darkvenge. The commander knew that the two would need to be certain that nobody ever learned of their mission and that killing him would achieve their aim. While his reading of Doriana suggested that the other would not do so, he carried a small deflector shield generator from one of the droidekas to protect him from Kav. When Kav drew his blaster and fired at Thrawn, the shot ricocheted from the shield and struck him, killing the Neimoidian. Certain that he could trust Doriana, Thrawn told him that his people had encountered the Far-Outsiders and agreed to an exchange of information. The Darkvenge departed soon after. Before the Bargain Hunter returned to the Republic, Thrawn informed Car'das that Doriana had been impressed by him and wanted to recruit the young Human to build an information network. Knowing that the Chiss and the Republic may one day need to work together, and seeing Car'das as a potential contact for the future, Thrawn encouraged him to take the job and he made him promise not to tell Maris what had happened to the Outbound Flight. After Thrawn gave the them a share of the Vagaari treasure, the Corellians returned to the Republic."}, {"tag": "h4", "text": "Exile"}, {"tag": "p", "text": "Thrawn did not fully escape the consequences of his actions. Mitth'ras'safis did not return from Outbound Flight and it would be over forty years before the Chiss learned what had happened to the ship. On top of losing his brother, many in the Ruling Families still saw Thrawn's actions as tantamount to murder and from that point on, his actions were watched carefully. Palpatine, meanwhile, was impressed with Thrawn's abilities and, over the coming years, attempted on at least two occasions to contact the Chiss and secure the commander's services to assist him in carrying out his ambitions of galactic domination. Not coincidentally, the destruction of Outbound Flight had killed eighteen of the Jedi Order's most prominent Knights and Masters, furthering the Sith Lord's plans for the extermination of the Order."}, {"tag": "p", "text": "For his part, Thrawn was intrigued by the idea of working for Palpatine, but knew that he could not honorably accept the offer and turn his back on the Expansionary Defense Force and his people. Instead, he remained in service to the Chiss and decided to engineer his own downfall by continuing to press for pre-emptive strikes. Some time before the end of the Clone Wars, his actions in dealing with the Chiss's enemies pushed the Ruling Families too far. After attacking an enemy ground installation that was manufacturing weapons for an upcoming attack, Thrawn was judged to have acted against everything his people believed and was brought up on charges. Found guilty, he was stripped of all rank and exiled to a world in the Unknown Regions, just beyond the edge of the Outer Rim Territories."}, {"tag": "p", "text": "Thrawn's new home had a breathable atmosphere and was located close enough to the system's star to provide adequate warmth. However, life on the remote planet would be difficult. In a clearing in the planet's equatorial forest, Thrawn constructed a small dwelling out of local materials. He was forced to improvise often, making clothes out of the skins and furs of the planet's indigenous animals. Among Thrawn's few possessions from offworld were two small-base power generators, though over time one started to run empty and Thrawn began stripping it for parts to keep the second functioning. Throughout his time in exile, Thrawn sought a way to return to his people and defend them from the many dangers he perceived in the galaxy, not least of which was the burgeoning threat of the Far Outsiders."}, {"tag": "h3", "text": "Early Imperial service"}, {"tag": "h4", "text": "Discovery"}, {"tag": "p", "text": "Thrawn's opportunity to escape came in 19 BBY, barely a week after Palpatine's Declaration of a New Order marked the birth of the Galactic Empire. The Victory-class Star Destroyer Strikefast, in pursuit of the smuggler Booster Terrik, followed his ship on a desperate attempt to flee into uncharted space. Emerging from hyperspace to find the Star Destroyer still in pursuit, Terrik decided to try and hide on a nearby planet—the same world to which Thrawn was exiled. Captain Voss Parck, in command of the Strikefast, ordered TIE fighters to follow the smuggler and, while Terrik was able to land safely after the ensuing dogfight, one of the Imperial starfighters crashed in the forest near Thrawn's encampment."}, {"tag": "p", "text": "Parck dispatched Colonel Mosh Barris to lead the Imperial forces in a search for the smuggler vessel. Landing at Thrawn's encampment and finding it deserted, the Imperials followed their Unknown Alien Encounters Orders by remaining to examine the settlement, and potentially make first contact. Thrawn, meanwhile, realized that the alien visitors presented his chance to escape and initiated a scheme to leave the planet. Arriving at the crashed TIE fighter, Thrawn had sufficient time to examine it before the Imperial troops arrived. After removing the pilot's body from his flight suit, Thrawn hid the body and stole the comlink from the helmet in order to eavesdrop on the visitors. Knowing that the Imperials would notice the missing comlink, Thrawn filled the suit with grass and fermented pyussh berries. This, he believed, would have the effect of convincing the Imperials that primitive natives had removed the body, distracting them from the missing comlink. More importantly, his plan relied on the Imperial troops being intrigued enough to take the flight suit back to their base. Before leaving the crash site, Thrawn also took the blaster, power packs and concussion grenades from the pilot's survival pack."}, {"tag": "p", "text": "As expected, the Imperials returned the flight suit to their camp and, believing that they were dealing with savages, established a security perimeter for the night. Thrawn, however, had allowed for this. The pyussh berries attracted some of the planet's nocturnal creatures, to which Thrawn strapped the stolen power packs, after first removing the overload sturm dowels. The creatures were able to penetrate the Imperial perimeter before their charges exploded. Though the damage caused was minor, it had the desired effect of causing Parck to send TIE fighters to conduct a flyover of the surrounding area, looking for the Imperials' assailant. A monofilament, strung between two tall trees, caused one of the fighters to crash and Thrawn was again the first to the crash site. Ignoring the ruined fighter, Thrawn again removed the pilot's comlink, replacing it with the one from the first crash to make the pilot look untouched, before again ransacking the pilot's survival pack. Shortly after retrieving the body of the second pilot, the Imperials noticed the missing comlink which had allowed Thrawn to listen to their communications since their arrival. Parck quickly ordered the first comlink's circuit shut down, unaware that Thrawn had the second, still functional comlink. Even so, the nature of events so far began to make the Imperials discount primitives, though they now assumed their smuggler quarry to be the cause."}, {"tag": "p", "text": "Thrawn did not rest during the night. In order to infiltrate the Imperial camp, Thrawn would need a disguise that hid his non-Human features. The Imperials currently on the planet did not have their faces obscured, so Thrawn needed to draw out more heavily armored troops. He, therefore, began attacking the sentry guards, using a sling to throw pyussh berries onto their armor and draw in charged animals for the kill. Five Imperial troops died during the night, three as the result of concussion grenade explosions, and two due to friendly fire from their nervous comrades. By the morning, Barris wanted to withdraw commence orbital bombardment, but Parck wanted the smugglers alive and ordered the search to continue, dispatching stormtroopers to assist. When the heavily armored troops began their search of the forest, Thrawn struck once more. Using his stolen comlink to initiate communications jamming to mask the sound of his attack, Thrawn used explosives to kill a stormtrooper in order to study his armor. After finding a way to kill the soldier within, without noticeable damage to the armor, Thrawn struck again and donned the armor of the dead trooper. The communications jamming, meanwhile, had convinced Barris that it was time to leave and the Imperials were preparing to depart as Thrawn entered their camp. Thrawn removed the armor and left it propped up by branches outside, while he entered the Imperial transport. An explosive charge within the armor soon ensured that the Imperials would not notice the missing trooper. With their orders to examine Thrawn's encampment still standing, the Imperials had loaded the structure into their ship for further study and the nearly empty power generator casing made an ideal hiding place for Thrawn on the journey to the Strikefast."}, {"tag": "p", "text": "Thrawn remained hidden in the power generator casing for almost two hours after arriving at the Star Destroyer. When he was certain that the Imperial troops had all disembarked, Thrawn emerged into the darkened hangar and moved towards a group of three Kappa-class shuttles, entering the middle shuttle in a bid to make his escape and return home. It was not to be, however, as Parck had suspected that somebody may have infiltrated the Imperial transport and had kept the hangar under surveillance. As a squad of stormtroopers entered the hangar, Thrawn surrendered without resistance. Parck realized that the intruder was responsible for the events on the planet and, together with Barris, went to confront the alien. Thrawn explained that he was attempting to get home to protect his people but Parck, impressed by Thrawn's obvious abilities, suggested that by offering his service to the Empire, he may be better equipped to do so. He even hinted that Palpatine may one day send Thrawn back to the Unknown Regions with the advanced technology and capabilities of the Empire, since any threat to Thrawn's people may also threaten the Empire itself. Convinced, Thrawn agreed to join them and, in order to better integrate himself, suggested that they call him by his core name. Parck was certain that Thrawn would make up for the inability to capture Terrik and decided to abandon the search and return to the Empire. During the journey, he would begin Thrawn's Imperial orientation."}, {"tag": "h4", "text": "Early missions"}, {"tag": "p", "text": "After returning to Coruscant, Parck presented Thrawn to the Emperor. Though many in the Imperial Court thought Parck should have been disciplined for bringing Thrawn back, Palpatine was most pleased to have the commander responsible for Outbound Flight's destruction before him. In their initial meeting, the Emperor attempted to provoke a reaction from Thrawn by demonstrating his distaste at the alien's presence. Thrawn's lack of reaction to Palpatine's behavior, together with his intelligence, intrigued the Emperor, who agreed to Parck's request to train him though the Empire's political situation led him to hide his enthusiasm. With Parck initially acting as his mentor, Thrawn was given private training at the Imperial Academy of Carida and rose quickly through the ranks though, as one of the few non-Human officers in the Imperial Navy, he was forced to constantly prove his abilities to other officers. Even after reaching the rank of colonel, Thrawn was assigned to command other undesirable officers including Uwlla Iillor. Thrawn later taught at the Academy, where his most promising cadet was Tyber Zann. However, Thrawn soon suspected Zann of stealing weapons and expelled him from the Academy, since there was no concrete evidence to connect him to the crime and indict him. Tyber Zann considered this exclusion as an indignity and kept strong resentment against the Empire and Thrawn."}, {"tag": "p", "text": "Thrawn did not spend all his time around the Core Worlds and made substantial efforts to explore the Unknown Regions. On the planet Nirauan in the Gradilis sector, on the boundary between Wild Space and the Unknown Regions, Thrawn located an abandoned fortress constructed of a resilient stone, similar to that used in the fortress on Hijarna. Due to the fortress's ability to resist attack, Thrawn selected it to serve as his personal base and, as a result of its five towers which resembled a hand, the base came to be known as the Hand of Thrawn. Though Imperial forces did not occupy the facility until the Galactic Civil War, the native Qom Jha later recalled that a species of sluglike predators residing in the caves beneath the fortress were not seen before 11 BBY, and it is possible that they were installed as a natural defense against the indigenous creatures, suggesting that Thrawn's mission may have been planned for some time. As well as a hologram of the galaxy, which allowed him to monitor the sectors falling under his control, Thrawn also had one of the galaxy's most extensive databases installed in the fortress."}, {"tag": "p", "text": "Believing that only a unified galaxy could resist the numerous threats in the Unknown Regions, such as the Far Outsiders whom the Chiss had already encountered, Thrawn forged a network of alliances with native species and colonies in the area. Thrawn soon established the Empire of the Hand, named for its center of operations at the Hand of Thrawn. The government was more of a confederation than a true empire, however, with many different species retaining their autonomy inside it. The nominal connection with the Galactic Empire was kept for historical and psychological value only, as the Empire of the Hand did not adopt the speciesist policies or rule by terror of Palpatine's Empire."}, {"tag": "p", "text": "While the Empire of the Hand remained unknown to the Galactic Empire and much of the galaxy, Thrawn's actions did not go unnoticed by his people. Though the Ruling Families refused to acknowledge his presence, many other Chiss did not and there was soon a flow of young Chiss rallying to his cause, most notably the warriors of his personal guard, the Household Phalanx. Among the Chiss who served under him, Thrawn came to hold the title of Syndic. A collaboration between Thrawn's forces and the Chiss led to the development of the Nssis-class Clawcraft, a starfighter that incorporated Chiss weapons with the ball cockpit and engines of the Empire's TIE series."}, {"tag": "p", "text": "Sometime before the Battle of Yavin, Thrawn would spearhead a major campaign against the Kaleesh species. He would study their art, and would bombard the planet Oben with his Star Destroyers in orbit. This would see the surrender of warlord Bentilais san Sk'ar, who would go on to become a rising star within the Imperial Army."}, {"tag": "p", "text": "By 1 BBY, Thrawn had achieved more victories and earned more promotions than most officers who had served for twice as long. He had also reached the rank of captain and was given command of the Imperial-class Star Destroyer Vengeance under the Inquisitor Jerec. The appointment was made by Palpatine himself, who trusted Thrawn to keep the ambitious Dark Jedi in check. Jerec led the Vengeance on a mission to Sulon to eliminate the Rebel presence there. Among the Rebels on the moon was the Force-sensitive Morgan Katarn, who Jerec wanted captured alive. After Thrawn passed on Jerec's instructions, a commando team, disguised as Rebels, raided Katarn's home. When they were unable to locate Katarn, Thrawn had to inform Jerec that the Rebel had escaped, but Jerec soon came up with another plan—to lure the Rebels out by attacking Sulon's geothermal energy spring. The Rebels fought better than either Jerec or Thrawn expected but were ultimately defeated. Katarn was captured during the battle and was executed by Jerec."}, {"tag": "p", "text": "Two weeks after the Rebel victory at the Battle of Yavin, Thrawn was one of ten Imperial officers summoned to the Emperor's throne room in the Imperial Palace on Coruscant. The Emperor informed them of the Death Star's destruction and that the Sith Lord Darth Vader was on his way to Coruscant to plan the Empire's revenge. Thrawn argued that they should strike at the main Rebel base quickly, but the Emperor preferred to bide his time rather than risk generating sympathy for the Rebels. In the meantime, he ordered Thrawn and the others assembled to identify the Rebel leaders and the identity of the Rebel pilot who had caused the Death Star's destruction, in the hopes of eliminating them and causing the Alliance to fall apart from within."}, {"tag": "h4", "text": "Fighting Nuso Esva"}, {"tag": "p", "text": "Eight months after the Battle of Yavin, Thrawn held the rank of Senior Captain and was commanding the Task Force Admonitor, located to the edges of the known galaxy. During that time Thrawn was locked in combat against an alien Warlord known as Nuso Esva, whose tactical brilliance rivaled that of Thrawn's. At first Thrawn had tried to ally himself with Esva—around the time he was forming alliances with multiple alien species he had discovered in the Unknown Regions, among them the Troukree—but the other had turned him down."}, {"tag": "p", "text": "Thrawn contacted his old accomplice Jorj Car'das, who had left his smuggling organization behind in attempt to improve his failing health, and with the human set out in attempt to turn Esva's plans against the warlord. Thrawn met with Emperor Palpatine on board Car'das's freighter, the Lost Reef, over Endor, and after advising the Emperor in the defenses of the construction site for the second Death Star the Chiss in turn requested Imperial help in dealing with Esva. Esva's fleet vastly outnumbered Thrawn's task force and the senior captain needed at least six more Star Destroyers to combat the Firekilns Esva used as the capital ships of his navy. The Emperor was unable to provide the necessary resources, but advised Thrawn to present his request to Darth Vader, which he did coming to an agreement with the Sith Lord about the arrangement: Vader would provide the additional firepower and in return Thrawn would help the sith to locate the Rebel leadership. After the meeting with Vader, Thrawn and Car'das shadowed the Star Destroyer Chimaera, on board which Esva had taken residence under the false name of \"Lord Odo\", to the Unknown Regions."}, {"tag": "p", "text": "Through a complicated plot, which included a plan to assassinate Governor Bidor Ferrouz of Candoras sector, creating a phony alliance with the Rebellion and then framing the Rebels for the governor's murder, Esva lured Thrawn's forces into Poln system. There the warlord sabotaged Chimaera's systems and had the large ship set on a collision course with the Golan station protecting the capital planet Poln Major. Esva wanted to force Thrawn to choose if he would sacrifice the Chimaera or the Golan station to save the other, in which case the destruction of valuable military equipment would have discredited Thrawn in the Imperial military. Esva also brought in his Eastern Fleet to do battle against Thrawn's forces hoping to humiliate the Chiss officer even further and completely ruin his career. Using the Lost Reef and Chimaera's remaining tractor beam systems Thrawn was able to steer the Star Destroyer away from its predetermined course releasing not only the capital ship, as damaged as it was, but also the Golan to join the battle against Esva's fleet. When Esva called his remaining backup to Poln system, Thrawn also brought out his reinforcements: Darth Vader and Death Squadron, which was spearheaded by nothing less than the Super Star Destroyer Executor."}, {"tag": "p", "text": "With the Sith Lord's help, Esva's Eastern Fleet was utterly destroyed, but in the confusion of the battle the Rebel team, which had been on Poln Minor evacuated with a selection of equipment Ferrouz had set up for them on the smaller planet, as per Esva's earlier instructions. From the list of items the Rebels had taken, Thrawn was able to construct a profile of the planet where Vader would find the Rebel headquarters, and thus was able to fulfill his end of the deal with the Sith Lord. With Esva's power considerably lessened Thrawn was in a hurry to return to the Unknown Regions to seize the advantage and he bid farewell to Car'das, advising his friend to visit Wroona, where the human might help people that Esva had held hostage to coerce help from a man named Sorro."}, {"tag": "p", "text": "In addition to his resounding victory over part of Esva's fleet there was other gains Thrawn made from the events of Poln system. His agent, Vaantaar, who had participated in Governor Ferrouz's protection on Poln Major, returned to Admonitor with one of Esva's Whisperlike-class starfighters and a group of five stormtrooper deserters, known as the Hand of Judgment. The Whisperlike gave Thrawn new insights into Esva's philosophy and starship designs, which he intended to exploit against Esva's remaining troops. The five stormtroopers—Daric LaRone, Korlo Brightwater, Taxtro Grave, Saberan Marcross and Joak Quiller—who had been on the run from the Empire since their leader, LaRone, had killed an ISB major, had proved themselves to be capable warriors and, what was more important to Thrawn, open minded toward alien species. Instead of handing them over to ISB, Thrawn offered them a job in his fledgling Empire, asking them to train him a new strain of stormtroopers, who would be willing to accept other species among their ranks as well as humans. Having seen how Esva worked and what kinds of threats Thrawn fought against in the Unknown Regions, the Hand of Judgment accepted the offered job and decided to name their new unit as the 501st Legion after the decorated Imperial legion. The new unit was dedicated to protect the Empire of the Hand and included aliens as well as humans."}, {"tag": "h4", "text": "The S'krrr incident"}, {"tag": "p", "text": "During his time on the Vengeance, Thrawn continued to pursue his interest in art. When the Vengeance visited S'krrr nine months after the Battle of Yavin, Thrawn took the opportunity to study S'krrr art and, accompanied by Lieutenants Wolver and Tier, took the shuttle Tessera to the planet's Sikadian Garden. The first day of his visit was uneventful but early the following morning, as Thrawn studied one of the garden's many flowerbeds while waiting for Lieutenant Wolver to join him, he encountered Zak and Tash Arranda. The two children were visiting the garden with Mammon Hoole and, unknown to Thrawn, were fugitives sought by Darth Vader after helping the Rebel Alliance several months earlier. The Arrandas were suspicious of Thrawn, fearing that his presence might precipitate an Imperial occupation of S'krrr, and had decided to learn all they could. However, while Thrawn conversed with the children, the group came across the body of Lieutenant Wolver, swarming with the garden's indigenous drog beetles."}, {"tag": "p", "text": "Thrawn wasted no time in organizing an investigation into the death of his officer. Calling the Vengeance, he had his forces seal the garden and begin searching nearby ships while investigators examined the body and the surrounding area. The investigation soon brought Thrawn into conflict with Vroon, the garden's caretaker, who was concerned about the damage being caused to the garden as the Imperials conducted their search. Thrawn, however, was determined to uncover the cause of Wolver's death and had the caretaker escorted away. Eventually, the medical team revealed the likely cause of death—several large wounds on the body, most likely caused by a vibropike and enlarged after death by the beetles. Thrawn ordered all planetary transmissions monitored in case the apparent murder was the work of Rebel insurgents and, after the body was removed, began interviewing suspects. As most of the Imperials returned to the Vengeance in the evening, Thrawn and Tier remained on the planet to continue the investigation the next day."}, {"tag": "p", "text": "A breakthrough in the case came the next day with the discovery of a vibropike hidden in the bushes. Though there was nothing to link the weapon to Lieutenant Wolver, scans for fibre and skin samples showed it to belong to Sh'shak, a well-known Sk'rrr Wing-song poet and warrior. Thrawn and Tier found Sh'shak with Hoole and the Arrandas and placed the S'krrr under arrest. Though Sh'shak admitted the weapon was his, and that he had been practicing with it in the garden around the time of the murder, he denied killing Lieutenant Wolver. Sh'shak's story was confirmed by the children, who had been talking to the S'krrr before they encountered Thrawn. Though Thrawn was beginning to grow suspicious of Hoole and the children, and planned to take them back to the Vengeance for a background check afterwards, he did agree to examine the area where Sh'shak had been practicing. Meanwhile, he ordered Lieutenant Tier to pick up Vroon, the only suspect not yet present, from his workshop."}, {"tag": "p", "text": "As Thrawn examined the area where Sh'shak had been training, Lieutenant Tier came running to the group, his clothes and hair covered with drog beetles and choking on the insects that had flown into his mouth—he died before the group could do anything to help him. Thrawn realized that Sh'shak was innocent and that the wounds on Lieutenant Wolver were made by the beetles as they ate him alive. The drog beetles were known to be aggressive in large numbers, but their population was supposed to be kept strictly under control by the predatory shreevs. For the drogs to have started killing people, the natural balance must have been disturbed. Zak Arranda thought that it was his fault as, on his first day in the garden, he had accidentally killed a shreev that he thought was attacking him. Thrawn, however, dismissed the child's concerns, realizing that the garden was far too large for the death of a single shreev to have caused such a dramatic rise in the drog population. With Sh'shak cleared as a suspect, Thrawn decided it was time to confront Vroon and find out exactly what was happening."}, {"tag": "p", "text": "Accompanied by the others, Thrawn went to Vroon's workshop and inquired how to stop the beetles. Vroon, however, refused to let them harm the beetles and, when Thrawn attempted to arrest him, ran into the forest. The group gave chase but the caretaker's knowledge of the garden allowed him to escape. Eventually, the group came across a pit filled with the carcasses of shreevs and surrounded by trees covered in drog beetles. The situation was now clear. Long ago, a S'krrr cult worshiped the drog beetles, who they were believed to have evolved from, and encouraged the drog population to grow. Although the cult was forbidden when the drogs almost overran the planet, some continued to worship the beetles. Vroon was one such individual and had been killing shreevs for some time to allow the drogs to thrive."}, {"tag": "p", "text": "With the scale of the problem now clear, Thrawn decided to call for reinforcements from the Vengeance, only to discover that he had lost his comlink during the chase. The drogs soon took notice of the group's presence and began to form into a swarm and Thrawn and the others were forced to flee to the safety of the Tessera. As the beetles closed in on their prey, Hoole was able to buy the group some time by using his Shi'ido shape-shifting ability to transform into a shreev and attack the swarm. However, the beetles proved too numerous and Hoole was eventually forced to retreat, having given the others the time they needed to reach the shuttle. Thrawn sealed the ramp moments before the swarm reached the vessel."}, {"tag": "p", "text": "Proceeding to the cockpit, Thrawn attempted to take off but discovered the ship's systems were offline. When he went to check on the main generator, he discovered that drog beetles had entered the ship's systems and short-circuited the generator. Thrawn knew that it was only a matter of time until the Vengeance realized they'd lost contact and sent reinforcements. However, time was running out—the ship's air vents were open and beetles soon started to pour through. Realizing that his ship had become a death trap, Thrawn suggested they retreat to Vroon's workshop. As the group fled the ship, the swarm once more gave chase but was soon stopped by a flock of shreevs roused by Hoole. Hoole returned to his normal form and rejoined the group but their time was limited—the shreevs would only eat until full then sleep off their meal, leaving thousands of beetles remaining. Thrawn wanted to use the distraction to conduct repairs to the Tessera. His companions, however, decided to search Vroon's workshop for anything that might help them. Outnumbered, Thrawn decided to remain with the group."}, {"tag": "p", "text": "Upon reaching the workshop, the group discovered the body of Vroon, eaten by his own beetles. After barricading the door and windows, they began their search but were unable to find anything that might help. As the roof began to weaken under the weight of drogs, Zak remembered that Vroon had mentioned that he had attempted to communicate with the beetles through wing-song and suggested that Sh'shak might be able to temporarily calm the swarm. Thrawn's studies of S'krrr art had shown that they favored patterns similar to those of drog swarms, suggesting that the two species thought alike and agreed that it might be possible to communicate with them, though he thought it unlikely that a single S'krrr could calm the swarm. Hoole agreed and transformed into a S'krrr to assist Sh'shak, telling the children to use the distraction to return to their ship, the Shroud, and fly it back to rescue him and Sh'shak. Thrawn, however, decided to use the distraction to return to the Tessera and attempt to repair the comlink to call for help. The plan worked and Thrawn was able to reach his shuttle and left the planet safely. Hoole and the Arrandas, meanwhile, used their ship to escape the planet before Thrawn could uncover their true identities."}, {"tag": "h4", "text": "Rising through the ranks"}, {"tag": "p", "text": "In 1.5 ABY, Captain Thrawn was stationed at the Emperor's Retreat on the planet Naboo. Upon learning that Imperial Captain Dolman's shuttle had crashed on Naboo, Thrawn promised to send help immediately and tasked an experienced spacer with escorting the captain back to the safety of the Emperor's Retreat. After this, he sent the spacer to retrieve the black box from the downed shuttle. However, the spacer soon discovered that it had already been taken by a thug. After killing the thug, the individual retrieved the box."}, {"tag": "p", "text": "Because of the information retrieved from the black box, it was discovered that there was in fact a Rebel base nearby which had a weapon capable of shooting down shuttles. The spacer was tasked with delivering the holodiscs recovered from the black box to an Imperial officer by the name of Geg Winthazen. Thrawn next enlisted the spacer to kill an adult fambaa and retrieve a vial of blood for him, followed by asking the individual to recover a paintbrush from a woman on Naboo. Soon after this, Thrawn hired the spacer once more to infiltrate and eradicate the Rebel cell which had been responsible for shooting down Captain Dolman's shuttle."}, {"tag": "p", "text": "Around this time, Thrawn learned of a manufacturing shop in Kor Vella on Corellia, where Rebel starships were being prepared. He recruited the spacer again, dispatching the individual to Kor Vella to infiltrate the repair shop and access its database to locate the Rebel facility and place homing beacons on the ships docked there. When the spacer returned after completing the mission, Thrawn dispatched the individual to Rori to investigate another crashed Imperial transport. After retrieving a datapad and the ship's transponder from the crash site, the spacer delivered them to Winthazen before assisting with retrieving a prototype rocket."}, {"tag": "p", "text": "Thrawn continued to impress Palpatine and eventually achieved promotion to Vice Admiral. At some point, Thrawn also received a promotion to Grand Admiral in a small ceremony on Coruscant, following the public dedication of the Imperial Palace's Assemblage wing, with few present to witness. It was later speculated that the secret promotion accompanied his official promotion to Vice Admiral. Despite achieving the position of Grand Admiral, Thrawn's importance to the Empire was known only to a few—Palpatine had declared that there could only be twelve Grand Admirals at one time so Thrawn's promotion remained off the record. Likewise, Thrawn was one of the few Palpatine trusted with knowledge the Emperor's Hands, revealing Mara Jade's true purpose during his promotion ceremony. Despite this, he risked the Emperor's displeasure on no fewer than four occasions by refusing to waste resources attacking an enemy he was unprepared for. The first time, Palpatine declared Thrawn a traitor and assigned the mission to another commander—after the resulting attack proved unsuccessful, Palpatine developed a greater respect for Thrawn's opinion. So great did Palpatine's trust in the Grand Admiral become that Thrawn selected his finest pilots to form the Emperor's Shield, who would later accompany Palpatine on his inspection of the Death Star II. Thrawn's successful career also earned him the Imperial title of Warlord."}, {"tag": "p", "text": "Many high-ranking members of the Imperial Court still had not accepted Thrawn and, following his promotion, Thrawn became increasingly involved in the frequent infighting within the Imperial Palace. Thrawn initially seemed to have an ally in Grand Admiral Rufaan Tigellinus, but the Humanocentric Imperial had befriended Thrawn only to betray him. Thrawn's enemies eventually put aside their differences and united against him and he soon appeared to find himself on the wrong side of the internal politics when, together with his allies, he was banished from the Imperial Court. Whereas Thrawn's allies were demoted and reassigned to the Outer Rim, this was felt to be too good for the alien and Thrawn's enemies persuaded Palpatine to effectively exile him on a cartography mission to the Unknown Regions."}, {"tag": "p", "text": "In truth, Thrawn had long wanted to take an Imperial presence to the Unknown Regions and, together with Palpatine, had planned his apparent defeat and exile to provide a convenient cover for his true purpose—to bring the untamed area under Imperial control and to seek out and eliminate potential threats to the Empire, as well as to fulfill his long term goal of protecting his own people."}, {"tag": "p", "text": "Over the following years, Thrawn spent much of his time operating outside the borders of the Empire and Palpatine steadily sent additional ships to assist his ultimate goal of establishing Imperial bases and even colonies. Those who were unable to accept Thrawn's leadership were quickly dismissed—when Delak Krennel disobeyed Thrawn to carry out a ruthless strike on an enemy, Thrawn had Krennel sent back to the Core Worlds to be punished by Palpatine."}, {"tag": "p", "text": "His campaign in the Unknown Regions met with great success and, in time, Thrawn's forces established bases and garrisons throughout the region. Many border worlds, such as Baros, surrendered to Thrawn, while worlds which defied Thrawn suffered severe consequences—when the inhabitants of the planet UR41-284 initially refused to submit to the Empire's rule, Thrawn ordered the Victory-class Star Destroyer Iron Fist to destroy everything within a seventy kilometer radius of the major village cluster's museum district, leaving the planet's artwork intact. Only once did he fail to bring a world under Imperial control—when he found himself unable to subjugate the inhabitants, Thrawn destroyed their planet. Thrawn's forces also operated to a lesser degree in Wild Space but were overstretched and, despite his best efforts, the area remained largely untamed, with outlying worlds often left to defend themselves against those who still defied the Empire. Even so, Thrawn brought the main settled worlds under the control of the Empire, discovering and subjugating many species in the process."}, {"tag": "h4", "text": "Commanding the Admonitor"}, {"tag": "p", "text": "Thrawn was initially given only one ship to assist in his goal—the Imperial I-class Star Destroyer Admonitor, under the command of Captain Dagon Niriz. Many of Thrawn's senior officers, including Niriz and the ship's infantry commander, General Larr Haverel, were unhappy with what they perceived as a dead-end assignment but Thrawn would have one ally onboard—Voss Parck, who had recently been serving as Thrawn's aide, had been demoted to commander by Thrawn's enemies and assigned as the Admonitor's executive officer."}, {"tag": "p", "text": "The long journey to the Unknown Regions took the Admonitor through the Outer Rim and Wild Space, and Thrawn took the opportunity to ensure the ships's pilots and crew were familiar with its hyperdrive-equipped TIE scouts. Upon reaching the Unknown Regions, the Admonitor began scouting systems. It was not until reaching the fifteenth system that they encountered intelligent life. Upon seeing the three unknown ships approaching, Niriz ordered TIEs to intercept but Thrawn countermanded the order and had the fighters take escort positions ahead of the Admonitor. Thrawn hailed the aliens, hiding their true purpose by identifying the Admonitor as an Alderaanian colony ship, and received a response from the Ebruchi Creysis, who claimed to be the ruler of the system. When thirty-eight more Ebruchi ships appeared from behind a small moon, Thrawn had the TIEs pull back into a tight escort formation, dismissing Niriz's concerns that the aliens might attack by pointing out that they would want to determine the Admonitor's capabilities first. To Creysis, Thrawn offered an apology for intruding and explained that they were seeking a home for the ship's 40,000 colonists. When Creysis offered his assistance in finding a suitable world, Thrawn suggested that they meet aboard the Admonitor. Leaving the ship at battle readiness, Thrawn and Niriz went to greet Creysis in the hangar, offering the Ebruchi a gift of a golden sculpture and agreeing to send the Council of Colonists to Creysis's ship with a list of parameters for a suitable world and to discuss a deal."}, {"tag": "p", "text": "Niriz was suspicious of the aliens and thought sending men to Creysis's ship was an unnecessary risk. Unknown to the captain, as well as General Haverel, Thrawn too held suspicions and was already planning to ascertain the Ebruchi's true intentions, as well as ascertain the loyalty of his senior officers. Thrawn suspected that, despite his claims, Creysis was not the true Ebruchi leader as no genuine commander would have agreed to visit an unknown and potentially hostile ship. As a result, Thrawn had had a transponder hidden in the sculpture presented to Creysis. This, he hoped would eventually lead them to the true Ebruchi leader. The Council of Colonists would consist of Commander Parck and six of Haverel's best troops. To escort their shuttle, Thrawn asked Niriz to select three TIE pilots who could remain calm under fire. After personally briefing the selected men, Thrawn had technicians work on the shuttle and one of the TIEs selected for the mission. The TIE was modified to remove key components and hide the fighter's true capabilities while the shuttle's starboard fuel tank was emptied to allow a dozen stormtroopers to hide inside. He also arranged for sensor-stealthed shuttles to monitor the proceedings. Four hours after Creysis left the Admonitor, the mission was ready to launch."}, {"tag": "p", "text": "The Zeta-class shuttle and its TIE escorts approached the Ebruchi vessels with the Admonitor several minutes away. The shuttle soon landed and, as the TIEs began to return to the Admonitor they came under fire from the Ebruchi starfighters. The modified TIE was soon surrounded and caught by grappling lines while the remaining two, acting on Thrawn's orders, returned to the Admonitor without engaging. As the Ebruchi moved away with the captured vessels, Niriz ordered the Admonitor to engage at full speed but Thrawn suspected that Creysis was attempting to ascertain the Star Destroyer's abilities so maintained his deception by having the ship pursue at a low speed. Thrawn had concluded that the Ebruchi were in fact pirates. The golden sculpture was intended to establish the Admonitor as a lucrative target and Thrawn was now certain that Creysis would not harm the prisoners or attempt to escape until his people had examined the captured vessels to determine the Imperials' level of technology. However, his apparent lack of a response concerned Niriz and Haverel who thought that, at best, Thrawn was incompetent and, at worst, in league with Creysis."}, {"tag": "p", "text": "Haverel voiced his concerns to Niriz and suggested that they relieve Thrawn of command. Niriz, however, was not prepared to mutiny against his commander, regardless of his personal concerns, and decided to warn Thrawn. His warning proved too late as, moments after speaking to Thrawn, Haverel arrived on the bridge with six troopers to take him into custody. While the confrontation continued on the bridge, eight of the Ebruchi fighters broke formation and jumped to hyperspace on different vectors to summon the rest of the pirates for the kill. This was what Thrawn had been waiting for and, after confirming that the stealth shuttles had ascertained the hyperspace vectors, he gave the order to attack. On Thrawn's command, the hidden stormtroopers emerged from the shuttle and opened fire on the Ebruci troops holding their comrades captive. Meanwhile, the Admonitor went to full speed and Thrawn launched a squadron of TIEs which quickly cut through the unprepared enemy fighter screen. The Ebruchi fighters were soon destroyed and their command ship captured—the Imperial forces sustained no casualties. The sculpture had been placed aboard one of the eight Ebruchi fighters and taken to Creysis's commander to demonstrate the Admonitor's worth. With the hyperspace vectors obtained by the stealth shuttles, Thrawn now knew the location of the Ebruchi base. He also knew that they would soon be preparing to attack the Admonitor, so took the ship to hyperspace quickly to destroy the enemy base before they launched."}, {"tag": "p", "text": "Once the Ebruchi threat was eliminated, Thrawn had Haverel sent back to Coruscant for his attempted mutiny. Niriz too offered his resignation but Thrawn refused to accept it as, unlike Haverel, Niriz had proved that he could overcome his personal feelings and remain loyal to his commander. As a result, the captain was finally told the true nature of their mission."}, {"tag": "h3", "text": "Counter-insurgency"}, {"tag": "h4", "text": "Recall"}, {"tag": "p", "text": "On 2:9:13 ABY, Cynabar's InfoNet reported that the Grand Admiral had been recalled to Coruscant after several years commanding an armada in border systems on the Outer Rim, presumably a cover for his true mission to the Unknown Regions. The NewsNet also identified him as a Grand Admiral, although his promotion was not believed to be public knowledge. After his return, Thrawn attended the official commissioning ceremony for the Super Star Destroyer Executor at the Imperial Transfer Post near the Kuat system on 2:10:23 ABY. Back on Coruscant, Thrawn was invited to join the elite Order of the Canted Circle on Palpatine's behest and in recognition of his recent successes. The invitation surprised many due to Thrawn's alien origins and particularly Grand Admiral Rufaan Tigellinus, who saw Thrawn's return as a threat to the powerful faction he had assembled within the Imperial Court. Nevertheless, on 2:11:13 ABY, he was inducted into the Order in a ceremony at the Skydome Botanical Gardens. That same year, Thrawn became intrigued by a reference to Myrkr, a world which had been inhabited for three centuries, yet left largely untouched by the Galactic Republic and the Jedi. When his original assumption that it was a frontier world of little interest proved incorrect, Thrawn investigated further, eventually learning that the indigenous ysalamiri had the ability to repel the Force using a Force-neutral bubble. Thrawn kept the discovery in mind until he found a use for the creatures several years later."}, {"tag": "p", "text": "Before Thrawn returned to the Unknown Regions, he assisted Darth Vader in his campaign against Prince Xizor and Black Sun. The Dark Lord of the Sith saw Xizor as a threat but, since Palpatine had an arrangement with the Falleen crime lord to let Black Sun operate without Imperial interference, was unable to eliminate him directly. Instead, he sought a means of distracting Xizor. Thrawn agreed to provide such a distraction and, at the same time, to determine the location of a Rebel stronghold. In exchange for his help, Vader agreed to give Thrawn command of the Noghri. The Dark Lord had once come to the aid of the Noghri, whose homeworld was devastated by a nearby space battle. In exchange for the Empire's help in repairing the damage to their world, the Noghri had pledged their allegiance to the Empire, acting as Palpatine and Vader's private commandos."}, {"tag": "p", "text": "Thrawn's target would be Zekka Thyne, the vigo in charge of Black Sun's operation on Corellia. Knowing that either a major Imperial attack or the use of Vader's mercenary connections would draw Xizor's suspicion to the Dark Lord, Thrawn decided to use a small attack by the local garrison that could not be traced to Vader. However, he would need to provide just cause for such an attack. He therefore anonymously alerted Colonel Maximilian Veers that a Rebel force was gathering in the forest near Thyne's fortress. All that remained was to ensure that Thyne's forces opened fire, thereby providing an excuse for the Imperials to storm the fortress. Unwilling to trust the assignment to anybody else, Thrawn decided to infiltrate Thyne's fortress in person, disguised in the Mandalorian armor of the bounty hunter Jodo Kast. As well as providing cause for the Imperial attack, Thrawn would personally eliminate Thyne."}, {"tag": "p", "text": "However, even as Kast, Thrawn needed a rationale for his visit to the fortress. To this end, he had the Admonitor intercept the freighter Hopskip and the crew taken before Captain Niriz. Thrawn intended to present the group to Thyne as assassins sent to kill him, thereby earning his trust. Niriz, however, told them that he needed a civilian ship to transport a cargo of 200 sleight boxes to Corellia and intended to hold their current cargo until they completed the delivery. With little choice, the Hopskip's crew agreed to make the delivery and were introduced to Thrawn, already disguised as Kast, who Niriz explained would accompany them on the delivery. The group traveled to Coronet City where Thrawn directed them to a curio shop in Treasure Ship Row for instructions on how to make contact with Borbor Crisk the cargo's apparent recipient and a rival of Thyne's. They soon returned, having been informed by the shop's owner, Sajsh, that he didn't know how to contact Crisk, but that they should speak to the owner of the adjacent shop when he returned that evening."}, {"tag": "p", "text": "As Thrawn led the group away from the shop, they oversaw a disturbance at a nearby tapcafe where a group of Brommstaad Mercenaries were harassing the owner. Despite Thrawn's objections, Riij Winward and Rathe Palror decided to intervene. Thrawn casually pulled up a seat and watched the ensuing fight—only when the mercenaries produced weapons did he act, shooting the holster of one mercenary and telling the group to leave. By this time the rest of Thrawn's group, Haber Trell and Maranne Darmic had arrived an pulled their weapons, as had two other onlookers, Hal and Corran Horn. Seeing that they were outnumbered, the mercenaries left. The newcomers introduced themselves and explained that they were seeking jobs with Crisk and, having overheard Trell talking about him, were hoping to accompany the group to make contact with him. However, Thrawn quickly realized that the two were undercover CorSec agents looking to arrest Thyne and decided to modify his plans to ensure that they were the ones to deal with the crime lord, further serving to exonerate Vader. Therefore, Thrawn agreed to let Hal accompany Trell and Palror to the shop that evening. While Thrawn went to the meeting to act as a rearguard, Corran would accompany Winward and Darmic to load the Hopskip's cargo onto the ship's landspeeder."}, {"tag": "p", "text": "Thrawn was actually well aware that Sajsh worked for Zekka Thyne and that news of a group looking for one of his rivals would have reached the crime lord. The Grand Admiral looked on as Horn, Trell and Palror walked into a trap and were taken to Thyne's fortress before returning to the Hopskip. He explained that he had been heavily outnumbered and unable to prevent their capture but, while the others delivered the cargo to a new meeting with Crisk, he intended to infiltrate the fortress and secure their release. After Horn persuaded Thrawn to let him accompany him, Thrawn left once more to acquire a landspeeder. In his absence, Corran suggested that they find out what was in the sleight boxes. The group looked for any that weren't properly sealed, opening two to discover a low-grade spice compound and some durindfire gems. Resealing the boxes, Horn instructed the others to take only those two to Crisk and hide the rest in the Dewback Storage Warehouse outside Coronet City—if he and \"Kast\" failed to return, they could use them as leverage to make Crisk mount a rescue, or ransom the prisoners from Thyne. What none of them realized was that Thrawn had left the two boxes improperly sealed so that they might discover the contents and that all the remaining boxes were empty."}, {"tag": "p", "text": "After Thrawn returned with an X-34 landspeeder, he and Horn set off for Thyne's fortress. On the way, Thrawn caught Horn glancing towards the Dewback Storage Warehouse and, realizing that they must have opened the sleight boxes, concluded that they were being taken to the facility. Upon arriving near the fortress, the two were met by a pair of guards who escorted them to Thyne's office, where the crime lord was interrogating the prisoners. It was then that Thrawn revealed his deception, pulling a blaster on Horn and explaining that he, along with the others, had been sent by Crisk to kill Thyne. Their accomplices, he informed the crime lord, would be meeting with Crisk at the Mynock's Haven cantina to finalize their payment, which would then be delivered to the Dewback Storage Yard. The deception was intended to lure some of Thyne's men away from the fortress before the Imperial attack and paid off when Thyne agreed to send his minions to both locations. Until \"Kast's\" story was verified, the prisoners would be held in the fortress's wine cellar and Thrawn, along with three of Thyne's men, locked the prisoners in the cellar. However, Thrawn was able to slip Corran Horn a molecular stiletto and subtly told the Horns to find him after using it to escape."}, {"tag": "p", "text": "Thrawn and the guards returned to Thyne's office where the presence of Imperial troops outside had just come to the crime lord's attention. After the Horns escaped and told the others to flee the fortress, they made their way to Thyne's office, having now realized that \"Kast\" was working against Thyne. The fortress's security system detected their approach and Thyne mistook them for Imperial stormtroopers who had already infiltrated the fortress. Thrawn suggested that the two Bromstaad Mercenary guards take positions on either side of the door to cut down the intruders in a cross fire. However, his true intention was to place them both in his line of fire. When the Horns broke through the door, Thrawn fired on the one guard while Corran Horn stunned the other. Seeing the situation turn against him, Thyne fled down an escape tunnel, pursued by the CorSec agents, while Thrawn remained in the fortress to complete his mission. Thyne was soon apprehended and the Horns rendezvoused with Colonel Veers outside the fortress. Meanwhile, the Imperials had found no evidence of Rebel activity and, still having no reason to enter the fortress, a standoff had developed."}, {"tag": "p", "text": "Thrawn moved to a position where he could fire on the Imperials outside and, since the shot appeared to have come from Thyne's forces, Veers gave the order for the stormtroopers to commence their attack on the fortress. Thrawn remained to observe the battle long enough to ensure that Trell and Palror escaped before likewise fleeing the fortress. While Trell and Palror rescued their associates at the Mynock's Haven, Thrawn returned to the Hopskip and left a datacard congratulating the crew and telling them to return to the Admonitor to collect their cargo. After making his way back to the Admonitor, six hours later than intended but having completed his objectives, Thrawn was visited by Darth Vader. The Dark Lord was pleased with the outcome of the mission but one thing remained. The Hopskip had not been chosen at random, but rather because it was smuggling blasters to the Rebel Alliance. While the crew had been away, Niriz had ensured that homing beacons were secured amongst the cargo. As the Hopskip departed after retrieving its cargo, the Imperials traced its hyperspace vector and determined that it was bound for the Shibric system, though Thrawn suspected it would ultimately head for the Derra system."}, {"tag": "p", "text": "True to his word, Vader later accompanied Thrawn to Honoghr, where the Dark Lord of the Sith explained that his duties in the war against the Empire's enemies required his full attention and named Thrawn as his heir. The news was initially greeted with sadness by the Noghri, for whom Vader had provided hope and a purpose, but they continued their loyal service to their new master and, in time, came to find these things in Thrawn's leadership. Thrawn initially made little use of the Noghri, as they were not required for his mission to the Unknown Regions, but hoped to make greater use of them upon his eventual long-term return to the Empire. One of Thrawn's earliest Noghri recruits was Rukh, who impressed the Grand Admiral by not appearing intimidated by the Empire's technology. Thrawn would eventually choose Rukh to serve as his bodyguard and the Noghri would rarely stray far from his master thereafter."}, {"tag": "h4", "text": "Hunting the Alliance"}, {"tag": "p", "text": "Thereafter, Thrawn developed a plan to uncover the location of the Rebel Alliance's newest base: the Empire would disrupt the Alliance's supply network by displacing or capturing the free traders and smugglers who ran most of the Alliance's cargo. Tracking and interrogating smugglers would uncover Rebel bases, including, it was hoped, the Alliance Fleet. Darth Vader led a personal task force—Death Squadron—aboard his flagship Executor, moving from Centares down the Triellus Trade Route, obliterating shadowports and smugglers' nests. Imperial slicers and strategists pored over interrogation transcripts, hints, and rumors, with Thrawn's ability to discern patterns proving vital in sifting through the evidence. A battle in the Ulkantha asteroids tipped Death Squadron off to a Rebel-affiliated Sakiyan smuggling ring operating out of the Syvris shadowport. Death Squadron obliterated Syvris, destroying the Sakiyan ring, which operated from Corellia all the way to Terminus."}, {"tag": "p", "text": "Meanwhile, as Thrawn had suspected, the Hopskip had indeed been bound for the Derra system, specifically to a Rebel stronghold on Derra IV. Before returning to the Unknown Regions, and shortly before the Battle of Hoth in 3 ABY, Thrawn worked with Darth Vader in planning an Imperial strike on Derra IV. Though it was Thrawn who devised the strategy, Vader presented it to the pilots of the 181st Imperial Fighter Group while Thrawn stood to the side as his subordinate. The Battle of Derra IV saw the destruction of a critical Rebel supply convoy, whose cargo had been ticketed for Echo Base on the planet Hoth. The Derra convoy did not uncover Echo Base's location, but gave Death Squadron enough of a lead to blanket the Western Reaches of the Outer Rim Territories with probe droids. One probe finally uncovered the Rebel base on Hoth, which Death Squadron promptly overran in a massive ground assault. Derra IV was thus a resounding tactical and strategic victory both for the Empire and Thrawn's planning, and several pilots from the 181st were hailed as heroes. The battle saw promotions for Evir Derricote, Soontir Fel and Turr Phennir, but Thrawn, the architect of the victory, went uncredited."}, {"tag": "p", "text": "Thrawn would again return to the Empire shortly after its victory at Hoth scattered the Rebel Alliance throughout the Outer Rim Territories. Palpatine sought to capitalize on their momentum by calling for the Imperial Navy to complete the destruction of the Alliance. To this end, while Palpatine addressed naval commanders on Coruscant, Thrawn accompanied a fleet under the command of Darth Vader in an assault on a Rebel space station near a planet in the Outer Rim. On Vader's signal, Thrawn launched his TIE squadrons and, catching the Rebels unprepared, the Imperial forces soon destroyed the base and the fleeing Rebel starfighters."}, {"tag": "h4", "text": "Pacifying pirates"}, {"tag": "p", "text": "Shortly after, Thrawn received an envoy from the Emperor who briefed him on the growing pirate activity in the Pakuuni system. Thrawn was tasked with eliminating the pirates and establishing a permanent Imperial presence in the system to ensure the safety of nearby trade routes. Thrawn, aboard the Victory-class Star Destroyer Stalwart, traveled to a cargo area near Argoon to retrieve the material needed for the construction of a new Imperial space station. Finding the base abandoned, the Imperials suspected an imminent Rebel attack and, sure enough, Rebel forces soon arrived. However, Thrawn launched TIEs to cover the loading operation and the Rebels were quickly defeated."}, {"tag": "p", "text": "Thrawn gave the task of pacifying the system to Commander Buckeye of the Nebulon-B2 frigate Ludwick, holding the Stalwart ready until needed. Buckeye proceeded to the Pakuuni system and quickly destroyed the pirate base. With the pirate's main staging area neutralized, Thrawn took the Stalwart to the system, escorting the convoy carrying the equipment for the new installation. The system, however, was not yet pacified and Thrawn's convoy arrived during a combined attack from pirate and Rebel forces. Although the Ludwick took major damage, the remaining enemy forces fled upon the arrival of the Stalwart and its convoy. Work on the station NL-1 proceeded quickly and Thrawn left the Ludwick to oversee construction. The Rebels made an attempt to prevent the station's completion, but were defeated by the Ludwick and its fighters before Thrawn returned in the Stalwart. The station sustained minor damage in the attack but repairs proceeded quickly and it was soon almost operational."}, {"tag": "p", "text": "Despite all the Ludwick's TIE fighters and TIE interceptors being repaired and refurbished, Thrawn was eager to inspect the new facility and ensure it would suit the Emperor's purposes, forcing the Ludwick to deploy TIE bombers as a defensive shield. Thrawn left the Stalwart in a Delta-class DX-9 stormtrooper transport and headed to the station but soon became the target of a Rebel starfighter attack. His bomber escorts made short work of the Rebels and was able to land on the station to conduct his inspection. After approving of the construction effort, Thrawn returned to the Stalwart—again coming under attack, this time from pirate shuttles. After returning safely, due to the efforts of his escorts, Thrawn sent his personal compliments to the pilots for their ability to improvise in using the TIE bomber in a defensive role."}, {"tag": "p", "text": "Thrawn kept the Stalwart nearby during the final stages of NL-1's construction, leaving briefly to oversee the delivered of two IPV-1 System Patrol Craft, and again to escort the final convoy to the station—an Imperial relief force. The Rebels made one final attempt to destroy the station but were again defeated and the Stalwart returned with the relief force to find the battle almost over. With the station fully staffed, Thrawn remained to oversee repairs from the final Rebel attack before his forces were relieved."}, {"tag": "p", "text": "Thrawn later found himself facing his former student from the Imperial Academy, Tyber Zann, who had created a powerful crime syndicate. During the Imperial occupation of the planet Bespin, the Zann Consortium raided the planet and stole large quantities of tibanna gas. Zann planted evidences in the computer systems pointing to Black Sun. This affair increased tensions between Darth Vader and Prince Xizor, but Grand Admiral Thrawn suspected a manipulation.Soon after Xizor's death at the hands of Vader's forces, Thrawn traveled to the Carida system to raid a Sith holocron from Tyber Zann. However, Zann expected a trap and brought a fleet with him. Thrawn was able to surprise Zann by firing a hidden hypervelocity gun at his ships. The battle ended with one of Zann's bounty hunters, the Trandoshan Bossk, stealing the holocron and bringing it to the Grand Admiral. The Admonitor then fled the system with the valuable artifact, and left his fleet behind to finish Zann and his forces off. However, Tyber and his fleet managed to destroy Thrawn's forces thanks to the use of the newest Aggressor-class Star Destroyers. Zann escaped knowing that his lieutenant Urai Fen had placed a homing device on the holocron which he later used to lead him to one of the Emperor's storehouses on Coruscant."}, {"tag": "h4", "text": "Arms race"}, {"tag": "p", "text": "The Empire found itself in a period of instability for the Empire following the defection of Admiral Harkov to the Rebel Alliance. Though Harkov was swiftly brought to justice, while Darth Vader was tracking down the remnants of his fleet, Grand Admiral Demetrius Zaarin, head of new starfighter technology, launched a coup d'état against the Emperor. Crippling Vader's Star Destroyer, Zaarin moved to Coruscant in his flagship, the Glory, and attempted to abduct Palpatine. Vader followed, flying a new TIE/D Defender, ironically designed under Zaarin's supervision, in a group led by Colonel Maarek Stele. Thrawn too rushed to the Emperor's aid in the Imperial-class Star Destroyer Vanguard. Zaarin caused severe damage to the Emperor's Star Destroyer, Majestic and his forces boarded the ship and escaped with Palpatine aboard an escort shuttle. By the time Thrawn arrived, Stele had successfully disabled Palpatine's shuttle, and the Assassin-class corvette Mescue was conducting a rescue operation. Thrawn launched the Vanguard's TIE bombers to assist the battle against Zaarin's forces but, when the Emperor was safely aboard the Mescue, the Glory fled to hyperspace with the Vanguard in pursuit."}, {"tag": "p", "text": "Though Zaarin eluded the Vanguard, Thrawn, having transferred his flag to the the Victory-class Star Destroyer Sceltor, put the ship on red alert. Zaarin's coup put the Empire on the defensive and, using his knowledge of their facilities, Zaarin began a campaign to weaken the Empire's starfighter manufacturing capabilities, while simultaneously attempting to gather supplies to begin his own TIE Advanced and TIE Defender production. After losing several facilities to Zaarin's attacks, Thrawn was charged with preventing Zaarin from inflicting any further damage to Imperial facilities."}, {"tag": "p", "text": "Although three facilities in the Omar system were destroyed by Zaarin, Imperial forces were able to secure Deep Space Manufacturing Facility ZA-13. However, Rebel forces, attempting to take advantage of the Zaarin situation, attacked the facility. Although the attack was defeated, the Rebels' use of new magnetic pulse warheads led Imperial Intelligence to begin a search for their base of operations. After the search revealed the Rebel station RS-32, an attack was soon planned. TIE Defenders would be sent in first, to disable the station and eliminate enemy fighters. Once the station was disabled, boarding craft would deliver troops to capture it, after which Thrawn would arrive on the Sceltor to retrieve the fighters and the magnetic pulse warheads for use in the developing arms race against Zaarin. The operation went well and, by the time Thrawn arrived, only a handful of Rebel fighters remained."}, {"tag": "p", "text": "However, an information leak allowed Zaarin to strike. While the Sceltor moved against RS-32, Zaarin's forces attacked and destroyed ZA-13. Furthermore, Zaarin attempted to ambush Thrawn near RS-32, dispatching the Immobilizer 418 cruiser Grappler to prevent his escape, while the Nebulon-B2 frigate Shadow and Strike-class medium cruiser Serpent attacked the Sceltor. With reinforcements unable to arrive in time, Thrawn was forced to make the most of what was available. With only three TIE bombers available, Thrawn held them in reserve, first launching the Sceltor's two operational TIE Defenders, armed with magnetic pulse warheads, to disable the weapons systems on the Grappler, while the ship's single TIE Advanced fought enemy fighters. Maarek Stele, flying one of the TIE Defenders, quickly delivered a magnetic pulse warhead to the Grappler, as well as the two attacking capital ships. Thrawn launched his TIE bombers which moved against the Grappler while Stele held off enemy fighters. Eventually, the Grappler was destroyed and, though the Sceltor sustained damage during the battle, Thrawn was able to escape to hyperspace."}, {"tag": "p", "text": "The loss of ZA-13 left the Empire without most of its ability to produce TIE Advanced fighters. The Emperor wanted retribution against Zaarin and commanded Thrawn to track him down and destroy his forces. Palpatine officially promoted Thrawn to admiral and made the best resources in the Imperial Navy available to him, among them Maarek Stele who had greatly impressed Thrawn. Zaarin, meanwhile, moved his forces to the Outer Rim to prepare for further attacks against the Empire."}, {"tag": "p", "text": "Some time later, Zaarin's forces began looting the facility where he oversaw development of the TIE Defender. Imperial forces were able to briefly regain control of the space station but, a subsequent attack by Zaarin forced them to evacuate. Three TIE Defenders were loaded onto the BFF-1 bulk freighter Mharsup, while the key members of the design team fled in the shuttle G'nabgib. The unarmed freighter soon transferred its cargo to corvette group Hashim, who were under instructions to deliver them to Thrawn who, on orders from Palpatine, was to see them to a secret location on Coruscant for safekeeping. The journey, however, proved hazardous with multiple attacks from Zaarin, Rebel and pirate forces. Although the convoy's escorts were able to eliminate the Rebel and treacherous Imperial forces, Rneekii pirates were able to use the distraction to capture the scientists and data from the G'nabgib, while Nami pirates captured one of the corvettes—both of which presented the risk of the proliferation of TIE Defender technology. The attacks also forced the remaining prototypes to be moved once more, this time to cargo ferry group Mssan. Mssan group finally reached Thrawn and transferred the prototypes to his Star Destroyer—Thrawn took them directly to Coruscant."}, {"tag": "p", "text": "Since being charged with eliminating Zaarin, Thrawn had studied the former Grand Admiral's strategy and had found a weakness in his dependence on technology. Working with Cygnus Spaceworks, Thrawn began secretly developing the Missile Boat as a countermeasure to the TIE Defender. Thrawn believed that the Empire's latest starfighter would provide them with the technological advantage needed to defeat Zaarin and prevent TIE Defender technology from spreading to other factions."}, {"tag": "p", "text": "Meanwhile, the Rneekii attempted to ransom the lead TIE Defender scientist. The Empire, as the highest bidders, met with the Rneekii representatives to make the exchange but planned a double cross—the Interdictor Red Claw would prevent the Rneekii from escaping while Imperial forces recovered both the scientist and ransom money. Thrawn suspected that the Nami may attempt to interfere with the exchange in an effort to capture the scientist themselves. He therefore gave the Red Claw instructions to capture and Nami ships and take the pirate leader into custody. Thrawn's suspicion was proved correct but, though a Nami vessel was captured during the exchange, Tarrak was not aboard. Furthermore, the unsuccessful Nami attack did leave the Red Claw damaged and stranded in the system pending hyperdrive repairs and, in a subsequent attack, Zaarin was able to capture the scientist."}, {"tag": "p", "text": "The situation deteriorated further with the news that Tarrak's forces were attacking an Imperial cargo transfer area in the Yrrna system. The Nami were using TIE Defenders in the attack, which was being observed by the Alliance, indicating that not only had they managed to begin production of the fighters, but were negotiating to supply them to the Rebels. Thrawn was determined to prevent TIE Defenders from falling into Rebel hands so planned an assault on a Nami Strike cruiser delivering a shipment of the fighters. The attack on the Nuance saw the debut of the newly completed Missile Boat, escorting Assault Gunboats while they disabled the Strike cruiser. With the Nuance disabled, Thrawn arrived in his new flagship, the Imperial-class Star Destroyer Grey Wolf, to oversee its capture, along with its cargo—simultaneously depriving the Rebels of the TIE Defenders while boosting the Empire's own supply. Along with eight TIE Defenders, the attack resulted in the capture of several prisoners and led the Empire to the location of Tarrak's TIE Defender manufacturing facility."}, {"tag": "p", "text": "Before Thrawn could attack, however, the Rebels attempted to retrieve the TIE Defenders. Thrawn decided to make a stand and defeat the coming attack on the Grey Wolf. Thrawn led the attack against three Carrack-class light cruisers while Stele, flying a Missile Boat, intercepted proton torpedoes headed for the Grey Wolf. Even so, the Rebel bombers succeeded in taking out the Grey Wolf's shields before the Rebel assault was ultimately defeated, ensuring that they would not acquire TIE Defenders. With no time to waste, Thrawn recalled the Imperial fighters and took the Grey Wolf to engage Tarrak's manufacturing facility. Thrawn sought the destruction of the facility but also intended to capture Ali Tarrak—the pirate leader reminded him of himself and he had convinced Palpatine to offer her the chance to serve the Empire. The factory was protected by numerous starfighters which moved to engage the Grey Wolf. Thrawn launched TIE interceptors to engage incoming fighters while Stele's Missile Boat cleared the way for a TIE bomber attack on the factory. As Tarrak fled the doomed facility, her transport was disabled and the Nami was taken into custody for delivery to Palpatine. The destruction of the Nami facility left Zaarin's forces as the only other faction in possession of the TIE Defender. Thrawn, however, was convinced that the Missile Boat would prove decisive."}, {"tag": "p", "text": "Thrawn was soon called to meet with the Emperor on Coruscant. Palpatine was pleased with Thrawn's performance during the Nami crisis and his continued loyalty to the Empire. He, therefore decided to make his promotion to Grand Admiral official, with Thrawn formally taking Zaarin's place among the twelve. Palpatine's prejudice against aliens was well known and Thrawn was the only non-Human to ever achieve the rank. Now, with the Nami threat eliminated, Palpatine ordered Thrawn to resume his hunt for the renegade Imperial and bring about the destruction of Zaarin's forces."}, {"tag": "h4", "text": "Hunting Zaarin"}, {"tag": "p", "text": "Zaarin was attempting to flee to the Unknown Regions to gather his forces and Thrawn soon learned of a supply convoy headed for a rendezvous with Zaarin's forces to deliver critical supplies. Thrawn dispatched one of his most promising commanders, Captain Kuuztin, on the Star Destroyer Courageous to intercept the rendezvous. Kuuztin's orders were to capture any military equipment but Thrawn also hoped that the captured ships might reveal Zaarin's location to hasten his defeat. The attack went smoothly and, though Zaarin's location remained unknown, the loss of the vital supplies would force him to alter his plans and delay his retreat. Thrawn hoped that Zaarin would soon become desperate and make a mistake on which he could capitalize. Zaarin, however, went back on the offensive, preparing to ambush Imperial forces. Kuuztin learned of Zaarin's plans and, hoping to gain a major victory which would lead to his promotion, decided to launch a preemptive strike on Zaarin's staging location. Thrawn was not informed of Kuuztin's plan as the ambitious captain was ultimately hoping to replace the Grand Admiral. However, Kuuztin was leading his forces into a trap and he was killed when the Courageous was ambushed and destroyed by two Star Destroyers."}, {"tag": "p", "text": "Thrawn soon planned his own trap for Zaarin, taking advantage of his weakness for technology by leaking news of a convoy which was supposedly carrying Missile Boats. In fact, Stele's Missile Boat would be the only one present and was charged with protecting the convoy until it escaped. Once the convoy was safe and, with Zaarin's forces fully committed, Thrawn would arrive with a task force to wipe out the renegade's fleet. Zaarin, however, was alerted to the deception and only committed five corvettes to the attack. Thrawn was suspicious that a spy within the Empire had informed Zaarin of the attack but was certain that the principle was sound and resolved to try again with more tempting bait—a second convoy transporting an entire squadron of Missile Boats."}, {"tag": "p", "text": "Thrawn's plan was for a task force led by the Interdictor Whirlwind to move against Zaarin's forces after they engaged the convoy and prevent the renegade's escape. Thrawn would then arrive with his own task force to ensure Zaarin's destruction. However, Zaarin again discovered Thrawn's plan and sent a strike force to attack the Whirlwind. Though the attack was defeated, the Whirlwind suffered damage and was forced to undergo repairs, making it unable to assist the convoy. With Zaarin's attack on the convoy already underway, only Stele's Missile Boat could intervene in time and attempt to prevent it's loss before Thrawn could arrive. Although Thrawn's plan had been thrown into disarray, Stele was able to hold off Zaarin's forces until the Grey Wolf and Resolution arrived. However, despite destroying several of Zaarin's ships and saving the convoy, without the Interdictor, Thrawn was unable to prevent the Glory from fleeing to hyperspace and Zaarin once again evaded capture."}, {"tag": "p", "text": "Zaarin soon resumed his assaults on Imperial research facilities. During his time with the Empire, Zaarin had been aware of the Vorknkx Project, an attempt to create a cloaking device for small starships, and when his source within the Empire revealed news of sudden progress, Zaarin moved against the testbed ship, the CR90 corvette Vorknkx. Thrawn moved quickly to defend the project, dispatching several Assault Gunboats, two System Patrol Craft and Stele's Missile Boat to stop Zaarin's attack. Though the assault was defeated, the project's security was compromised and the Imperials were forced to evacuate. The project was transferred to a new location and work resumed on the almost completed cloaking device. However, Thrawn was made aware of an instability caused by using the device in combination with a hyperdrive and began to formulate a plan to use the device against Zaarin."}, {"tag": "h4", "text": "Zaarin's defeat"}, {"tag": "p", "text": "The Vorknkx was relocated to To-phalion Base, a former mining facility converted to serve as a research station. However, it was not long before Zaarin's spy led him to the new location and the renegade initiated a new attack to capture the cloaking device. Thrawn had anticipated Zaarin's assault and made plans to trap him—first Zaarin would need to be drawn to To-phalion Base in person, then the Grey Wolf was to lead a task force consisting of two Strike cruisers and the Interdictor Corvus to prevent his escape. However, Thrawn still needed time to position his forces when the battle commenced."}, {"tag": "p", "text": "The first wave of the attack consisted of TIE Defenders and Muurian transports, which quickly overwhelmed the base's starfighters and moved against its static defenses. Knowing that Zaarin must be delayed until he could arrive, Thrawn dispatched TIE Advanced fighters to aid in the defense of the base. Despite heavy opposition, the Imperial forces successfully defeated the first wave and finally eliminated Zaarin's spy, but not before he sabotaged the defensive weapon systems. With a second attack wave approaching the base, Thrawn still needed to buy time for his forces, so he transferred to the EF76 Nebulon-B escort frigate Maru Ki and moved to To-phalion Base to personally lead the counterattack."}, {"tag": "p", "text": "Thrawn arrived after the defeat of the second wave and, as he expected, Zaarin soon arrived in person on the Glory to lead the third wave. Zaarin was where Thrawn wanted him but, with To-phalion Base now vulnerable, it was uncertain if the loyalist forces would arrive in time to spring the trap. However, Thrawn had studied Zaarin and was counting on the renegade's hatred of him to provide them with the time they needed—while Zaarin was distracted attempting to kill Thrawn, the Grey Wolf would have time to arrive and prevent the capture of the Vorknkx. As expected, the Glory first targeted the Maru Ki in an attempt to eliminate Thrawn. Eventually, the frigate took heavy damage and was forced to flee into hyperspace, though Thrawn first launched on a shuttle to continue commanding the battle. The Grey Wolf's arrival was imminent but Zaarin still had more supporters within To-phalion Base and the traitors were able to capture the Vorknkx and fly it to safety aboard the Glory. Zaarin destroyed the base before retreating into hyperspace, moments before Thrawn's forces arrived to spring the trap."}, {"tag": "p", "text": "However, Thrawn had allowed for this eventuality and placed a homing beacon aboard the Vorknkx, allowing him to track Zaarin's decimated forces to their regrouping point deep in the Unknown Regions. Thrawn was quick to move after Zaarin, taking command of the Grey Wolf once more and leading his task force to Zaarin's location. The Grand Admiral's plan was to use the Corvus to prevent Zaarin's escape. While the Grey Wolf protected the Interdictor, both Strike cruisers would move against the Glory. Once Zaarin's fighter screen was eliminated, all Imperial fighters would converge on his flagship and destroy it. With so many losses in the previous battle, Zaarin found himself outgunned and it wasn't long before the Glory was destroyed and he was forced to evacuate. To best enable him to slip away, Zaarin chose to make his escape in the Vorknkx, using its cloaking device to evade the Imperials. However, Thrawn had anticipated this and reports showing the cloaking device as functional had been altered by Thrawn to hide its hyperspace instability. From the bridge of the Grey Wolf, Thrawn looked on with satisfaction as Zaarin attempted to take the cloaked corvette into hyperspace and was killed when the unstable device caused the vessel to explode, musing that such was the fate for anyone who opposed the Empire."}, {"tag": "h3", "text": "Heir to the Empire"}, {"tag": "h4", "text": "Fragmentation of an empire, pinnacle of another"}, {"tag": "p", "text": "After Zaarin's death, Palpatine sent Thrawn back into the Unknown Regions one more time to continue his mapping mission. Yet shortly after his departure in 4 ABY, the Rebel Alliance scored a major victory over the Empire at the Battle of Endor when they destroyed the second Death Star. Vader and the Emperor were both killed in the battle, and the loss of Palpatine's Sith battle meditation technique caused the battered Imperial fleet to scatter. Palpatine's spirit survived, and it made its way to Byss in the Deep Core where the Emperor was reborn in a clone body. However, it would be nearly six years before Palpatine was strong enough to re-emerge openly, and meanwhile the New Order quickly spiralled into chaos. The Empire's leadership fragmented as warlords such as Grand Vizier Sate Pestage, Director of Imperial Intelligence Ysanne Isard, and Admiral Zsinj fought for personal power. The Empire soon found itself pushed back from the Core Worlds, as the Rebellion transformed into the New Republic. The new government's establishment of a capital on the captured Coruscant led many of the galaxy's denizens to see it as the legitimate galactic authority."}, {"tag": "p", "text": "The confusion that surrounded these events prevented the New Republic from learning that Thrawn had replaced Zaarin as the twelth Grand Admiral, leading them to conclude that all twelve had been accounted for. The Chiss Grand Admiral returned to his Hand of Thrawn base on Nirauan. He dealt with the Ssi-ruuk, a species from the Unknown Regions who launched a series of incursions into Chiss Space and other areas of the galaxy. Thrawn responded with preventive strikes on the Ssi-ruuvi Imperium. Following the defeat of the Ssi-ruuk at the hands of Imperial and Rebel forces at Bakura, the Chiss Ascendancy and Thrawn's Empire of the Hand decimated the Ssi-ruuvi Imperium at Lwhekk. Thrawn later established strongholds against other more dire threats. At its greatest extent, the Empire of the Hand stretched across the equivalent of 250 sectors."}, {"tag": "p", "text": "However, the Grand Admiral was not completely isolated from the Empire and remained in contact with Isard, who rose to fill the power vacuum left by Palpatine's death, though he had little trust for the woman and arranged for many officers he trusted, such as Baron Soontir Fel, to join him in the Unknown Regions. Six months after the Battle of Endor, Soontir Fel defected to the New Republic and joined Rogue Squadron. An enraged Isard was determined to locate the traitor but Thrawn, recognizing the need for skilled officers such as Fel, devised a plan to capture the pilot. Isard had Thrawn's plan put into action and, Fel was captured and sent to Thrawn on Nirauan. There, Thrawn showed Fel the dangers they faced in the Unknown Regions and that even the combined forces of the Empire and the New Republic might not guarantee victory. Convinced of the threat, Fel agreed to join Thrawn. Fel's view that the Admiral was an unprejudiced, non-oppressive leader, in contrast to Palpatine and Isard, facilitated his allegiance to Thrawn. Around 6.5 ABY, Isard, realizing that the Empire could no longer afford to waste its personnel, had Major Wortin transferred to the Star Destroyer Inexorable to serve under Thrawn, after his failure to capture Bror Jace. However, ultimately, the Empire's decline began to impact on Thrawn's mission, and he found his forces in the Unknown Regions dwindling as ships were recalled to the Empire."}, {"tag": "p", "text": "In 7 ABY, Admiral Betl Oxtroe of the Imperial Navy had begun sending ambassadors in order to propose peace talks with the New Republic. She believed, that Ederlathh Pallopides, who was the Emperor's niece, to led the Empire as Empress. This, never would occur when Oxtroe was killed by a Noghri assassin. Years later after her death, New Republic historian Voren Na'al believed Thrawn played a role within Oxtroe's death, because of Thrawn's command over the Noghri."}, {"tag": "p", "text": "In 8 ABY, Thrawn finally defeated and killed the warlord Nuso Esva at the Battle of Quethold. Nuso Esva had allied himself with the queen of Quethold, the Queen of the Red. Grand Admiral Thrawn planned an assault against them with the help of the Stromma, the inhabitant species of the planet Oristrom. But the Stromma were doubtful of the Empire's ability to win and eventually withdrew. Intelligence gathered from Quethold, particularly imagery of the artwork with which Esva had decorated his quarters, gave Thrawn what he needed to elaborate a strategy. Although Esva had purposely arranged the art on display to trick Thrawn, the Chiss managed to understand this ploy. Meanwhile, Nuso Esva's action on Quethold made the alliance with the queen untrustworthy. At the end, the Empire of the Hand attacked the planet and when the battle began to turn against him, Esva killed the queen out of suspicion of betrayal. He was in turn shot down by the queen's soldiers."}, {"tag": "p", "text": "Sometime in the same year, Thrawn made a brief return from the Unknown Regions when he traveled on the Vaathkree with his Noghri bodyguard Ovruk to the shipyard system of Sluis Van, then cautiously neutral in the ongoing Galactic Civil War. Thrawn arrived shortly after a senatorial delegation from the New Republic, led by Baron Jonas Stern and the Bothan Borsk Fey'lya, as the New Republic looked to gain the support of the Sluissi Council. Thrawn, however, had analyzed the situation and concluded that Sluis Van was already lost to the Empire in diplomatic terms and the purpose of the Grand Admiral's visit was to acquire a Star Destroyer under construction in the docks, against the New Republic's objections, and to gather intelligence in anticipation of a future military reconquest of the system. As a result, he showed little interest in the diplomatic negotiations, refusing on several occasions to meet with Slui-Koronar of the pro-Imperial United Party."}, {"tag": "p", "text": "During his visit, Thrawn attended a diplomatic function hosted by the New Republic delegation. At the reception, the Grand Admiral found himself drawn to Stern's collection of statues, particularly a Rodian statuette, which he inquired about purchasing. Baron Stern, however, had only just bought the statuette and was reluctant to sell it, though he promised to provide Thrawn with details of his supplier. However, the conversation was overheard by Slui-Koronar, who saw an opportunity to sabotage the New Republic negotiations and gain favor with the Grand Admiral. Later that night, a Defel, hired by Slui-Koronar, murdered Stern as he slept and stole the statuette as a gift for Thrawn. The New Republic attempted to hide the truth while they conducted an investigation, with Fey'lya taking over negotiations until a replacement for Stern could arrive. However, it was not long before Thrawn's network of informants revealed Stern's fate to the Grand Admiral and, realizing that he would be the prime suspect, he decided to conduct his own investigation."}, {"tag": "p", "text": "Thrawn soon uncovered Slui-Koronar's involvement in Stern's death. Furthermore, he learned that the New Republic investigators were to interview the Sluissi. Two hours before they arrived, Thrawn dispatched Ovruk to kill Slui-Koronar and had recording equipment hidden in his home. When the New Republic agents arrived later and discovered the Sluissi's body, they retrieved the statuette and fled the premises. Thrawn quickly had the holographic footage edited to implicate the Rebels in Slui-Koronar's murder and had 15,000 credits deposited in Stern's account, supposedly from the Sluissi. When Dogh Staya arrived to take charge of the New Republic delegation, Thrawn presented his evidence and used it to force a settlement to the diplomatic stand-off. Later that day, Thrawn announced that he would leave it to the Sluissi to decide their world's future—in exchange Dogh announced that the New Republic was withdrawing its objection to letting the Empire take the Star Destroyer. His mission completed, Thrawn returned to the Unknown Regions."}, {"tag": "h4", "text": "Reemergence"}, {"tag": "p", "text": "Within four years of the Battle of Endor, the Empire was in control of barely a quarter of its former systems, and most of the main Imperial leaders such as Ysanne Isard and Grand Moff Zsinj were dead or in hiding. Imperial Space was nominally controlled by the surviving Ruling Council, led by Ars Dangor on Orinda, codenamed Bastion. However, the Imperial Moffs squabbled endlessly, and paid little attention to Dangor's council."}, {"tag": "p", "text": "Finally, in 8 ABY, with the threats in the Unknown Region seemingly quiet, the Grand Admiral decided the time had come to return to the Empire. Why Thrawn chose to return then remained unclear to the galaxy's historians. In 55 ABY, the Imperial partisan Lenang O'Pali suggested in Mitth'raw'nuruodo Reconsidered: A Patriot's Perspective that Emperor Palpatine's clone, still convalescing on Byss, had called him back to restore the Empire. O'Pali also suggested that Thrawn believed the New Republic would be incapable of resisting the invasion of the Far Outsiders that he knew were coming, as it would succumb to the same inefficiency and corruption that had destroyed the Old Republic. O'Pali concluded that Thrawn felt the galaxy's only hope for surviving the Yuuzhan Vong was to be rebuilt into a militarized society, and thus he attacked the New Republic rather than offer his services to it."}, {"tag": "p", "text": "Thrawn left his forces to guard the Hand of Thrawn and sent an encrypted holographic transmission to the Imperial II-class Star Destroyer Chimaera on the Emperor's private channel. When the message was received by the ship's commanding officer, Captain Gilad Pellaeon, Thrawn announced his return and gave the captain coordinates at which he was to rendezvous with the Grand Admiral's shuttle. After boarding the Chimaera, Thrawn transferred his flag to the ship and named Pellaeon as his second-in-command. With the New Order on the verge of collapse, Thrawn began the process of rebuilding the Empire by uniting its fragmented elements and assuming command of the Imperial Military. One of his first acts upon taking command of the Chimaera was to convert the former commander's luxury entertainment suite into a private command room which could effectively function as a secondary bridge. After the refitting was complete, the Grand Admiral would spend much of his time meditating there."}, {"tag": "p", "text": "Thrawn took Chimaera as his flagship and declared himself to the Ruling Council. Though he was nominally appointed as Supreme Commander, Thrawn was starved of resources: the Moffs hoarded military assets as much in fear of each other as the New Republic while Grand Moff Ardus Kaine's Pentastar Alignment and Prince-Admiral Delak Krennel's Ciutric Hegemony remained resolutely isolationist. The force truly available to Thrawn consisted only of the dozen Star Destroyers still remaining in Death Squadron after the defeat at Endor, of which only six ships were judged truly loyal to Bastion. Thrawn took these—Chimaera, Death's Head, Judicator, Inexorable, Nemesis and Stormhawk—as his personal fleet, while the remainder formed a second force led by Captain Dorja aboard the Relentless. The armada also included a number of Strike-class and Carrack-class cruisers, along with the starfighter complements of each. With the Empire's resources severely handicapped they were forced to use inexperienced crews, many conscripted by threat of force. Despite this, Thrawn made every effort to reinstate training programs and ensure that rookies were teamed with older officers with academy training. He also had the most promising personnel transferred to ships within his armada and, by the time he launched his campaign, all personnel were trained to such a high level that even unconventional and typically difficult maneuvers like hyperspace micro-jumps became almost routine. The Imperial Army also received attention from the Grand Admiral with a revitalization program aimed at recruiting and preparing troops for the campaign ahead."}, {"tag": "p", "text": "Along with the focus on augmenting the Empire's personnel, Thrawn ordered the construction of new weapons and ships. Although the Empire's industrial capability had been seriously reduced, resulting in a lower production level than Thrawn wanted, the production effort soon led to new ships entering service and the introduction of the Scimitar assault bomber. Thrawn rallied the Empire's Moffs with his determination to defeat the Rebellion, his reorganization of the fleet, and a series of impressive raids to destroy troublesome pirate nests. As Thrawn drew more ships to his fleet, Imperial fortress worlds complained that they were left unprotected, so Thrawn had the fleet's aging Dreadnaught-class heavy cruisers assigned to defend Imperial territory and, in order not to tie up experienced naval personnel, had Imperial Army troops trained to operate them. Thrawn's reorganization of the Imperial forces left the Moffs with adequate defenses and reinforced Orinda as the seat of Imperial power, but his personal force remained limited to his six Star Destroyers and their support lines. Nevertheless, Thrawn confidently assured Captain Pellaeon that the first phase of his campaign against the Republic would require relatively few warships."}, {"tag": "p", "text": "At some point at this time, Thrawn learned of Delta Source, an audio intelligence source built into twin rows of ch'hala trees in the Grand Corridor of the Imperial Palace on Coruscant. These trees were part of a sophisticated spying device left over from Palpatine's time that relied on the unique pressure-sensitive properties of ch'hala trees to collect sound, and Thrawn would go on to use it to gain valuable intelligence from the New Republic in his coming campaigns."}, {"tag": "h4", "text": "The search for Killik Twilight"}, {"tag": "p", "text": "Shortly after taking command of the Empire, Thrawn learned that Killik Twilight, a moss painting by the Alderaanian artist Ob Khaddor which had once belonged to the Alderaanian royal family and had been presumed lost during the destruction of Alderaan eight years earlier, had survived in the possession of the Alderaanian Threkin Horm and was to be auctioned on the Outer Rim world of Tatooine. Hoping to add the painting to his personal collection, Thrawn took the Chimaera to Tatooine and dispatched the Chimaera's Commander Quenton to attend the auction on his behalf. However, the Grand Admiral was not the only party seeking to purchase the moss painting. Unknown to Thrawn, the painting contained a code key to the Rebel Alliance's Shadowcast communications network hidden in its moisture-control circuitry; in an effort to retrieve the code key before Shadowcast could be compromised, the New Republic had dispatched Councilor Leia Organa Solo, along with her husband Han Solo and his Wookiee copilot Chewbacca, to purchase the painting. After Horm decided to sell to the New Republic, Quenton tried to take the painting by force. The Rebels attempted to destroy it to keep it out of Imperial hands and a firefight broke out between the two groups. In the resulting confusion, the painting was stolen by Kitster Banai, one of the locals in attendance."}, {"tag": "p", "text": "Following the auction, both Banai and the Rebels fled into the surrounding desert. Thrawn was curious about the Rebels' elaborate disguises and willingness to destroy the painting rather than let it fall into his hands and ordered that they be captured so he could learn their true identities and the painting's significance. His forces established check points and TIE fighter patrols in an effort to retrieve the painting and take the Rebels into custody. Despite a thorough search, the Imperials were unable to locate Banai, but reports placed a group of Squibs who had been seen with Organa Solo at the Sidi Driss Inn in Anchorhead. A squad of stormtroopers was dispatched to the inn to investigate and Thrawn, disguised in stormtrooper armor, decided to accompany them and observe his new crew in action."}, {"tag": "p", "text": "Arriving in the lobby of the Sidi Driss Inn, the stormtrooper sergeant began to question Keesa, the inn's Pa'lowick night clerk, as to the whereabouts of the Rebels. When she did not give him access to the inn's day records, he grabbed her proboscis in frustration. The Pa'lowick maintained that she did not have access to the records and offered to fetch the owner, Dama Brunk. After Keesa left with two stormtroopers, Thrawn admonished the sergeant with a blow from the butt of his assault rifle for his unnecessarily violent interrogation style, which the Grand Admiral maintained would cause the Pa'lowick to do nothing more than the bare minimum to assist them. The sergeant agreed to use a more efficient interrogation style in future and Thrawn inquired as to the purpose of their mission. Satisfied that the trooper understood the importance of the mission, Thrawn suggested that he may be promoted to platoon leader if he handled the rest of the mission well."}, {"tag": "p", "text": "Keesa soon returned with Brunk and the sergeant asked about the Squibs. Brunk claimed there were none staying and that their informant must have mistaken a group of Ranat guests for Squibs. Two of the squad went with Brunk to verify her claim but Thrawn and the others remained in the lobby where the sergeant once more questioned Keesa, saying that he knew Brunk was lying and that Keesa could keep her employer from getting hurt by helping them. When Keesa claimed not to know anything, the trooper became angry, but Thrawn intervened and promised that no harm would come to either of them is Keesa told him where, hypothetically, she would hide somebody in the inn. Keesa replied that the Hutt wing was generally deserted and Thrawn ordered two men to accompany Keesa to the wing's secret exit while he, the sergeant and the two remaining troopers went to investigate. Upon reaching the Hutt wing, the Imperials came under fire from the waiting Rebels, who caught the sergeant and troopers in a crossfire and forced Thrawn to take cover. Despite being outnumbered, Thrawn managed to keep the Rebels pinned down until Han Solo threw a bag into the corridor, causing Thrawn to fire at it and distracting him enough for Chewbacca to charge him. The Wookiee overpowered the Grand Admiral, knocking his helmet off before Thrawn managed to get away and flee down the corridor. The Rebels escaped the inn and fled once more into the desert."}, {"tag": "p", "text": "Armed with the identities of the Rebels, Thrawn's forces resumed their search and eventually tracked them to a Sand People encampment where Banai was being held captive by the nomadic natives. Under heavy Imperial fire, the Solos were able to rescue Banai and Killik Twilight and the group escaped aboard the Millennium Falcon after removing the Shadowcast code key from the painting, which they left with the Squibs Emala, Grees and Sligh who planned to sell it to the Imperials and it eventually ended up in Thrawn's possession."}, {"tag": "h3", "text": "Final campaign"}, {"tag": "h4", "text": "The Emperor's storehouse"}, {"tag": "p", "text": "Thrawn soon began to execute his grand strategy to defeat the New Republic and restore Imperial control, based on detailed campaigns he had prepared for the past five years. Thrawn considered his forces in the Unknown Regions to be the key to the Empire's ultimate victory. The first part of the Grand Admiral's strategy required locating a secret storehouse where the Emperor had kept various technologies acquired by the Empire. Two items of technology contained in the storehouse particular interested Thrawn—the schematics to a practical cloaking device developed as part of the Vorknkx Project and at least 20,000 Spaarti cloning cylinders. With the cloning cylinders, Thrawn could quickly produce the personnel required for a major campaign against the New Republic. The effects of the Force on a clone that was grown too quickly could result in clone madness, but Thrawn's earlier discovery that ysalamiri could repel the Force provided him a way to overcome this—Thrawn planned to use the creatures to push back the Force from the cloning tanks and avoid clone madness."}, {"tag": "p", "text": "Thrawn spent over a year searching for the location of the storehouse. During this time Thrawn ordered a series of tactical surveys conducted in systems near Imperial space and hit-and-fade attacks in nearby systems, with targets including Draukyze, Paonnid. and Saarn. Thrawn's forces also fought against those of former Republic Senator Garm Bel Iblis, achieving a victory at Linuri which put a temporary end to Bel Iblis's guerrilla attacks against the Empire. Word eventually reached the New Republic that a new leader had emerged in the Empire, but Thrawn's identity remained illusive. Six months of strikes along the Republic border served to impress the moffs and other political leaders within the Empire, and earned him the loyalty and support of the influential D'Asta family. Thinking that Thrawn would make a suitable puppet leader for the Empire, and fearing coups, Grand Moff Ardus Kaine of the Pentastar Alignment and Prince-Admiral Delak Krennel of the Ciutric Hegemony gave Thrawn command of a temporary military confederation. The Imperial Ruling Council under Ars Dangor put Thrawn officially in charge of the Imperial armed forces, making him effectively Supreme Commander of the Imperial Forces, and even considered naming him Emperor if he proved successful. The Council mistakenly believed that they could easily control an alien, who would not be well established in the Imperial political sphere and would remain beholden to them. While Deep Core warlords such as Treuten Teradoc and Blitzer Harrsk refused to join the confederation, Thrawn grew very popular among his subordinates and the Imperial populace. Only when Thrawn effectively controlled the Empire did they realize that their decision had backfired."}, {"tag": "p", "text": "The location of the storehouse finally came to light following a scan raid to the Obroa-skai system. A download from Obroa-skai's central library system revealed the location of the Emperor's storehouse in Mount Tantiss on Wayland. However, the raid did not run entirely as planned and the Imperial scoutships returned to the Chimaera pursued by New Republic forces. Although the Chimeara was outgunned by four incoming Assault Frigates, Thrawn chose not to retreat or call for reinforcements and risk revealing the strength of his forces. Instead he dispatched three sentry ships towards the incoming vessels and observed the enemy shift to respond—the pattern of their response was enough for Thrawn to identify the New Republic commander as an Elom. This was all the information Thrawn needed and he promptly ordered a Marg Sabl maneuver, knowing that the Elom commander would struggle to cope with the unstructured attack. The New Republic forces were defeated within the hour."}, {"tag": "p", "text": "With the location of the Emperor's storehouse in his grasp it was time for Thrawn to put his plan into action. Breaking the Chimaera from the rest of the fleet, Thrawn set course for Myrkr where he dispatched shuttles to begin harvesting ysalamiri. From Myrkr, Thrawn traveled to Wayland. During the five day journey he had the Chimaera's engineers develop portable frames to support and nourish the harvested ysalamiri. Thrawn was aware that Palpatine had left a guardian to watch over the storehouse and, working under the assumption that the guardian would be a Dark Jedi, intended to use the ysalamiri to provide protection. Upon arriving at Wayland, Thrawn, Pellaeon and Rukh took a shuttle down to the surface to locate the guardian. Thrawn had long suspected that Palpatine used battle meditation to coordinate the Imperial fleet in battle, and had reached the conclusion that the shock defeat at the Battle of Endor was prompted by death of Palpatine and the sudden absence of his controlling influence—as well as retrieving the technology within Mount Tantiss, Thrawn also hoped to recruit the guardian to enhance the coordination of the Imperial forces during their campaign against the New Republic."}, {"tag": "p", "text": "However, instead of the guardian, they were met by Joruus C'baoth, a clone of the Jedi Master Jorus C'baoth who had perished in Thrawn's destruction of Outbound Flight. C'baoth claimed to have killed the original guardian and taken his place as ruler of Wayland before launching an attack on the Imperials, though his Force lightning proved useless against the ysalamiri. Despite C'baoth's clearly unstable personality—a result of clone madness—Thrawn attempted to persuade him to join them. C'baoth was initially reluctant but Thrawn made an offer that convinced him—in exchange for fighting for Thrawn, the Empire would capture Luke Skywalker, Leia Organa Solo and her unborn twins so that he could take them as his apprentices."}, {"tag": "p", "text": "Thrawn quickly began transforming Mount Tantiss into an active Imperial facility, ordering the power and defense systems restored to full power. Nearly eighty percent of the Spaarti cylinders were either functional or could be restored and Thrawn ordered that they too be brought into use as quickly as possible. Soon after he enacted a policy of having field commanders recommend the best performing personnel for immediate transfer to Wayland to serve as clone templates. Conventional wisdom dictated that clones needed to be grown for a year to be mentally stable but, by using the ysalamiri to repel the Force, Thrawn found that stable clones could be produced in a cycle of just fifteen to twenty days. With the cloning operation underway, Thrawn had the Imperial shipyards at Bilbringi, Ord Trasi and Yaga Minor increase production to provide ships for the newly created clones, some of whom would boost the depleted ranks of the stormtroopers under Thrawn's control."}, {"tag": "p", "text": "Though most clones were straight copies of their templates, Thrawn also experimented with creating a new class of warrior. By mixing some of his own knowledge into the flash training matrix, Thrawn hoped to produce soldiers who combined the combat strength of a stormtrooper with his tactical ability. The template chosen for the prototype was former Royal Guard Grodin Tierce but the resulting clone was little more than a tactically brilliant stormtrooper without the long-term vision Thrawn had sought. With the prototype having resulted in a failure, Thrawn abandoned the project."}, {"tag": "p", "text": "In addition to cloning Tierce and himself, Thrawn also experimented with cloning several Force-users, whose DNA had been obtained and safeguarded during Emperor Palpatine's reign. Created in secret on a frozen moon in the Unknown Region, the Force-sensitive clones were developed and raised by Imperial scientists that served under Thrawn's Empire of the Hand until they rebelled against their creators."}, {"tag": "h4", "text": "Preliminary strikes"}, {"tag": "p", "text": "Thrawn wasted no time in attempting to deliver on his promise to C'baoth. From his source in the Imperial Palace he learned that Luke Skywalker and Leia Organa Solo would be making a diplomatic trip to Bimmisaari and dispatched a Noghri commando team to capture them. However, the Noghri proved unprepared for Skywalker's abilities and the pair were able to escape. Thrawn was disappointed with the Noghri's failure but ordered a second team to begin preparing for a mission. C'baoth, however, was already growing impatient and declared that if Thrawn could deliver Leia to him, he would take care of Luke himself. With the Empire preparing for a major attack on the shipyards at Sluis Van and unable to spare C'baoth, Thrawn was reluctant to let him go and agreed only to Pellaeon's suggestion of starting a rumor that C'baoth had been spotted on Jomark in order to lure Skywalker into coming to him."}, {"tag": "p", "text": "The attack on Sluis Van was prompted by the Empire's ability to produce cloned crews for ships quicker than the ships themselves—rather than decimating the New Republic forces, he planned to capture as many ships as possible. To this end, he planned a series of raids throughout the Sluis sector, aimed at forcing the New Republic to send reinforcements to protect Sluis Van and stretching their forces out to leave each ship undermanned and vulnerable. This process began with a three-prong hit-and-fade attack in which Thrawn led a five-ship task force in an attack on Bpfassh while C'baoth used battle meditation to coordinate simultaneous attacks on two other systems. Thrawn's objective was simply to inflict damage and to frighten the enemy and, after destroying the orbital defense platform and several enemy ships, he ordered all three Imperial task forces to withdraw to the rendezvous point, leaving a few hundred dead in the Bpfassh system alone and the New Republic to waste resources sending reinforcements. It was during a visit to reassure the Bpfasshi following the attack that Leia Organa Solo again came under attack from Thrawn's Noghri. To Thrawn's displeasure, the Noghri failed once again."}, {"tag": "p", "text": "Part of Thrawn's plan for Sluis Van involved stealing a number of plasma-jet mole miners from Lando Calrissian's mining operation on Nkllon. The planet's unusually high level of sunlight intensity would pose a problem to most ships, but Thrawn knew that a Star Destroyer would be able to handle the direct sunlight for a few minutes and, although they would need to reinforce the viewports and remove external communications equipment—effectively leaving the ship blind and deaf—C'baoth would be able to ensure that the ship's performance was not hampered. The Judicator's raid went as planned and the Empire relieved Calrissian of fifty-one mole miners from Nomad City. Thrawn, observing the raid from the Chimaera at the outskirts of the Athega system, was interested to learn that C'baoth had made contact with Luke Skywalker during the battle. C'baoth insisted on being taken to Jomark to wait for Skywalker, to which Thrawn agreed. However, Thrawn actually planned to capture Skywalker himself and had probes left at the edge of the system, to watch for his departure. Thrawn planned to deliver C'baoth to Jomark then backtrack at least twenty light-years to intercept Skywalker on his way there and take him into custody. In addition, he suspected that, with Skywalker on Nkllon, the Millennium Falcon might not be far away, and hoped that the probes would also lead the Imperials to Leia Organa Solo. Thrawn's hunch proved correct when a probe detected not only Skywalker's T-65 X-wing starfighter departing on a course for Jomark, but also the departure of the Millennium Falcon and Calrissian's Personal Luxury Yacht 3000, the Lady Luck, bound for Kashyyyk. Concluding that Leia was on the Lady Luck and seeking refuge with the Wookiees, Thrawn dispatched a Noghri team to Kashyyyk."}, {"tag": "p", "text": "After dropping off C'baoth, Thrawn took the Chimaera to set a trap for Skywalker. In order to hide his deception from C'baoth, Thrawn planned to make the ambush look like an accident and summoned an expendable light freighter and an Immobilizer 418 cruiser to the ambush point—when Skywalker emerged from hyperspace prematurely due to the Interdictor's artificial gravity well, he would see what appeared to be an Imperial attack on the freighter and assume that snaring him was merely a coincidence. Thrawn's plan worked and Skywalker's X-wing was caught in the Interdictor's gravity well. However, after the Chimaera locked a tractor beam on the starfighter, Skywalker acted quickly to reverse-trigger his acceleration compensator, bringing the ship to a stop, and simultaneously fire a proton torpedo which was instead snared by the tractor beam. Skywalker was able to escape as the tractor beam pulled the torpedo towards it, causing minor damage to the Chimaera. Thrawn had Rukh promptly execute the responsible crewman, Cris Pieterson, for his inability to adapt to the situation and unwillingness to admit his error, then had his ensign, Colclazure, find him a replacement officer. However, Thrawn was aware that Skywalker's maneuver would have damaged his hyperdrive and he was unlikely to get further than one light year before becoming stranded. With the fleet too busy preparing for Sluis Van to conduct a search, Thrawn offered a bounty of 30,000 credits for Skywalker's capture."}, {"tag": "p", "text": "Some time later Thrawn headed back to Myrkr to meet with the smuggler and information broker Talon Karrde, who had declined the Empire's request for assistance with the search for Skywalker. As his shuttle descended to the surface, Thrawn witnessed a chase involving two GAT-12 Skipray Blastboats which resulted in both crashing in the forest. During his meeting with Karrde he inquired about the Blastboats and was told that a former employee had stolen one and that another employee had pursued. The truth was that Karrde had already found Skywalker but had yet to decide whether to turn him over to the Empire and it was the young Jedi who was attempting to flee in the stolen Blastboat. Although unaware of this, the lack of communication from the pursuing Blastboat was enough for Thrawn to conclude that Karrde's people didn't want him to know what was happening. Furthermore, when Karrde sounded surprised that the search for Skywalker was still proceeding, Thrawn began to suspect the truth. Though he admitted it was unlikely, Thrawn felt that it was worth pursuing and, after stormtroopers found the crash site deserted, he dispatched ground forces to Hyllyard City, the most likely destination for for the survivors."}, {"tag": "p", "text": "Meanwhile, Thrawn left to oversee the final stage of preparations for the attack on Sluis Van. The battle plan would take full advantage of the cloaking device constructed from the schematics found in Mount Tantiss. Instead of cloaking an entire ship, Thrawn's plan involved cloaking only the contents of the cargo hold on a PCL 27 freighter. Any New Republic defenses that scanned the ship on its way in to Sluis Van would see only an empty freighter, allowing it to deliver its true contents, the stolen mole miners and forty escorting TIE fighters, to the heart of the shipyards. While the New Republic defenses were occupied with Thrawn's task force, the mole miners would be free to steal any of the 112 warships in the system, using their plasma jets to cut through bridge emergency escape hatches and deliver stormtroopers to take control of the ships' command centers."}, {"tag": "p", "text": "With typically precise timing, Thrawn brought the Imperial fleet into the system moments after the TIE fighters and mole miners launched from the freighter. The battle seemed to be going as planned and, before long, 39 ships were under Imperial control and heading for the perimeter. However, the unexpected presence of Lando Calrissian on the Millennium Falcon provided the New Republic with a way to foil Thrawn's plan. Calrissian used remote control codes to make the mole miners activate their plasma jets, burning through vital equipment on the captured ships and leaving them dead in space. Realizing that his plan had failed, Thrawn ordered the Imperial forces to withdraw, having successfully captured just a single ship."}, {"tag": "h4", "text": "Unfinished business"}, {"tag": "p", "text": "The defeat at Sluis Van was a setback, but it had resulted in severe damage to many New Republic vessels and Thrawn remained confident that the Empire would be victorious. However, with the cloning operation firmly under way, the Empire still required ships and Thrawn authorized Pellaeon to contact fifteen underworld groups for assistance in acquiring them, offering a bounty of twenty percent above market value for any armed ships over 100 thousand tons. The bounty soon started to yield results with several ships delivered to the Empire, though nothing larger than a Star Galleon."}, {"tag": "p", "text": "There was also one other matter to attend to—Karrde had assisted in Skywalker's escape from the Imperial forces in Hyllyard City and Thrawn planned to deal with the smuggler. Though he knew that Karrde would already have evacuated his base on Myrkr, he ordered ground forces to begin a search, suspecting that the smuggler would be watching. Spotting a nearby asteroid, Thrawn reasoned that this was the most likely hiding place for Karrde and called for the Interdictor Constrainer to trap them. However, the plan was foiled by Karrde's second-in-command, former Emperor's Hand Mara Jade, who sensed the trap through the Force and took the Wild Karrde to safety moments before the arriving Interdictor could intervene. Still determined to deal with Karrde, Thrawn offered a bounty of 20,000 credits for the smuggler."}, {"tag": "p", "text": "Meanwhile, Thrawn continued to undermine the New Republic. A series of raids against New Republic convoys along major trade routes were designed to force the Republic to commit additional forces to escort duty or risk abandoning cargo shipments. Thrawn also devised a plan to destabilize the New Republic by targeting its Supreme Commander, Admiral Gial Ackbar. On the same day as the Sluis Van attack, Imperial Intelligence conducted an electronic break-in at the central clearing bank on Coruscant and placed a large deposit in Ackbar's account. Though hardly conclusive proof, it was enough for Ackbar to be relieved of duty and placed under house arrest. Thrawn knew that vacuum-tight evidence would have led to Ackbar being replaced quickly and hoped that the ambiguous evidence would cause uncertainty within the New Republic. His gamble paid off when Councilor Borsk Fey'lya took the opportunity to attempt to seize Ackbar's position, leading to divisions within the New Republic Defense Fleet."}, {"tag": "p", "text": "The Noghri had once again failed to apprehend Leia on Kashyyyk and the displeased Grand Admiral planned to visit Honoghr personally to call a convocate of the clan dynasts and remind them of their duty—there he would remain until the Noghri succeeded in capturing Leia. The Chimaera arrived at Honoghr shortly before Khabarakh, the only surviving member of the failed Kashyyyk mission. When news of this reached Thrawn, he broke off the convocate to visit Khabarakh's village and find out personally why it took him a month to return home. When Thrawn confronted Khabarakh in his clan's dukha, the young Noghri explained that he had spent the month meditating on his failure and had now returned to discuss it with the clan maitrakh, but Thrawn was convinced that he was hiding something. The truth was that the Noghri had identified Leia as the daughter of his former master and had now brought her, along with the Wookiee Chewbacca, to Honoghr to see for herself the plight of his people. Thrawn's suspicions were enough for him to order a thorough search of Khabarakh's shuttle, revealing Wookiee hairs above the ship. Jumping to the wrong conclusion, Thrawn assumed that Khabarakh was captured and interrogated on Kashyyyk before being released. The logical reason for his release being that he revealed information to the New Republic, Thrawn had Khabarakh arrested as a traitor and sent to the dynasts in Nystao for punishment and to serve as an example to his people. However, with news that the Millennium Falcon had been found in orbit of Endor, Thrawn was concerned that the New Republic may be seeking the location of the Emperor's storehouse and searching for clues, so decided to cut short his stay on Honoghr and proceed to Endor."}, {"tag": "h4", "text": "Resurrecting the Dark Force"}, {"tag": "p", "text": "Thrawn arrived to find the Millennium Falcon deserted—the ship had been left there when Leia Organa and Chewbacca rendezvoused with Khabarakh—but ordered it brought aboard for closer examination. While at Endor, Thrawn had an unexpected reunion. Mara Jade had been captured by the Adamant in the Abregado system and, identifying herself as the Emperor's Hand, demanded to speak to the Grand Admiral. Jade proposed a deal—in exchange for Thrawn canceling the bounty on Karrde, Jade would provide the location of the legendary Katana fleet. The fleet disappeared before the Clone Wars but their location had become known to Karrde early in his career. The two hundred slave-rigged Dreadnaughts would solve the Empire's ship shortages so Thrawn agreed to Jade's deal. However, he was aware that Karrde might not be so cooperative and made arrangements to ensure the deal went through. To this end, he had a homing beacon placed aboard Jade's ship, the Etherway, and followed her back to Karrde's base where they captured the smuggler and his associates. A furious Jade was brought before Thrawn and, drawing on her rudimentary training in the Force, attempted to choke him. Thrawn remained calm as Rukh leaped on the threat and, eventually Jade released her grip. Thrawn offered her the chance to return to Imperial service, as executive officer on a Katana Dreadnaught, but warned that any further outbursts would result in her being turned over to C'baoth. In exchange for her service, he would uphold his end of the deal, releasing Karrde's people immediately and Karrde himself after the smuggler provided the location of the Katana fleet."}, {"tag": "p", "text": "Though Jade appeared to agree, Thrawn's casual betrayal convinced her that the Empire she once loved was dead and she resolved to find Skywalker and enlist his help in rescuing Karrde. Skywalker had finally made his way to Jomark to find C'baoth and it was here that Jade caught up with him. Jade warned Skywalker that the Jedi Master was working for the Empire and, after escaping from C'baoth, the two headed for Wistril where they stole and Imperial shuttle to board the Chimaera. When Pellaeon later reported that an Imperial patrol has discovered Jade's abandoned Skipray Blastboat on Wistril, Thrawn quickly realized what was happening and sent troops to check on Karrde, as well as ordering the ship's main computer shut down to prevent Jade using using her access codes to gain entry. However, by the time the Imperials checked Karrde's cell, he was already gone. Thrawn ordered a search of the ship and, when one of the search teams was killed by a lightsaber, concluded that Skywalker was assisting in the rescue. He therefore ordered ysalamiri taken to the hangar bays, along with extra troops. He also correctly assumed that Karrde would choose to bypass the main hangar bays and attempt to steal a ship from deep storage but Imperial troops were unable to arrive in time to prevent the fugitives from boarding the captured Millennium Falcon and, with the computer still offline, the Chimaera was powerless to prevent their escape."}, {"tag": "p", "text": "Skywalker's involvement in Karrde's rescue made it seem likely that Karrde would now supply the location of the Katana fleet to the New Republic. Fortunately, Thrawn had already taken steps to acquire the fleet by other means. The Star Destroyer Relentless had recently come under attack from Dreadnaughts under Garm Bel Iblis—Dreadnaughts which Thrawn had since realized were from the Katana fleet. With this information, Thrawn had already tasked the ship thief Niles Ferrier with finding Bel Iblis's supplier, starting with former shipmates of Talon Karrde. Ferrier led the Empire to Hoffner, Karrde's former captain, at the Coral Vanda casino on Pantolomin. The Chimaera arrived and fired on the submersible casino, forcing it to the surface and allowing them to capture Hoffner."}, {"tag": "p", "text": "Hoffner soon revealed the location of the Katana fleet and the Empire mounted a recovery operation. Meanwhile, Karrde had revealed the location to the New Republic but the turmoil caused by Fey'lya's power grab slowed their own recovery effort and, by the time New Republic forces reached the fleet, almost 180 of the 200 Dreadnaughts had been recovered by the Empire. When the Judicator reported encountering New Republic forces at what was left of the fleet, Thrawn decided to take the Chimaera to assist in the battle. However, just as they were preparing to leave, C'baoth arrived aboard a Lancer-class frigate and demanded to speak to Thrawn. The Grand Admiral told C'baoth to wait until he returned but C'baoth used the Force to take control of the Chimaera's navigator, forcing Thrawn to agree to meet and to send the Peremptory instead. However, in Thrawn's absence, the battle went against the Empire and resulted in the loss of the Peremptory before the Judicator withdrew—a loss Thrawn blamed on C'baoth for delaying him. C'baoth had become increasingly arrogant and had gone so far as to disobey orders while coordinating an attack at Taanab. Thrawn had not considered C'baoth a great threat, relying on the ysalamiri to keep the Jedi Master under control but now, following his failure to bend Skywalker to his will, C'baoth declared himself the ruler of the Empire. Although Thrawn still saw C'baoth as a valuable weapon in the campaign, it was becoming clear that he would soon have to put an end to the Jedi's desire for power. At around that time, Thrawn's forces also participated in raids on the planets New Cov, Sarka, and Corfai."}, {"tag": "h4", "text": "The campaign intensifies"}, {"tag": "p", "text": "The acquisition of the Katana fleet provided the ships needed for Thrawn's clone army and the Imperial forces began preparing for the campaign to begin in earnest. Despite this, Thrawn continued to allow for all contingencies and implemented backup plans in case his campaign proved unsuccessful. Returning at some point to Nirauan, Thrawn had a single Spaarti cloning cylinder installed in a hidden section of the Hand of Thrawn, known only to the Grand Admiral. Within the cloning cylinder, Thrawn planned to grow a single, unaltered clone of himself in case he should be killed. The cloning cylinder was located in an alcove off a large room, behind a transparisteel screen and powered by a Braxxon-Fipps 590 fusion generator. The room itself contained everything the clone would need to survive upon emerging, while it used the provided consoles to catch up on galactic events. In order to protect the clone, Thrawn installed a variety of security measures. Most were designed to prevent intrusion from the native Qom Jha, but the Grand Admiral's typical caution led him to utilize cortosis armored sentinel droids and to provide a pair of ysalamiri in case of a Jedi incursion. The cloning cylinder was set to a ten-year cycle and, while those who served under him were unaware of his clone's existence, Thrawn informed them that, should he ever be reported dead, they should continue their operations and wait for his return ten years later. Back in the known galaxy, Thrawn had a Chiss homing beacon installed in a dummy file in the central Imperial Records Library. Thrawn knew that, if he was killed, the Empire would likely move its seat of government, and the homing beacon would allow his forces in the Unknown Regions to keep track of its movements. Finally, Thrawn implemented his ultimate contingency plan—sleeper cells of cloned soldiers and pilots were scattered throughout the New Republic and the Empire to form the basis of resistance cells in the event that both governments fell to one of the threats in the Unknown Regions."}, {"tag": "p", "text": "After almost a month of preparation, the campaign was ready to proceed and the Grand Admiral launched a major attack aimed at capturing the food production facilities in the Ukio system. Thrawn dispatched elements of the Imperial fleet to attack Ando, Filve and Crondre simultaneously, with each raid designed to draw ships away from the New Republic base at Ord Pardron. When the Imperials subsequently hit the now lightly defended base, it would call for reinforcements and leave Thrawn's true target unprotected. As anticipated, by the time Thrawn took the Chimaera's task force to Ukio, only the planet's defense shield prevented its conquest. However, Thrawn had devised a method to overcome the shield without causing major damage to the planet below. Sending two freighters in advance, each towing two cloaked Dreadnaughts, Thrawn was able to infiltrate the Dreadnaughts under the shield. When the overliege of Ukio failed to acknowledge Thrawn's call for his surrender, the Grand Admiral had the Chimaera open fire on the planet. The shots were absorbed by the planetary shield but, using C'baoth's ability to coordinate with the cloaked ships, the Dreadnaughts, positioned under the shield at the exact points hit, opened fire and created the illusion that the Chimaera had fired through the shield. Believing that the Empire had a new superweapon, the Ukians promptly surrendered. The success at Ukio was echoed in numerous other Imperial victories as the Republic struggled to cope with the Empire's newfound manpower, combined with Thrawn's innovative tactics, such as using Interdictors to ensure Imperial ships emerged from hyperspace in precise locations, and Thrawn's enlarged fleet had soon attacked over twenty New Republic systems."}, {"tag": "p", "text": "The imminent birth of Organa Solo's twins led C'baoth to begin pushing for a direct assault on Coruscant but, although Thrawn had his own plans for the Republic capital, he felt the time was not yet right. Instead, Thrawn dispatched C'baoth on the Death's Head to repeat the technique in an assault on Woostri and, having lost faith in the Noghri, an Imperial Intelligence team to Coruscant to kidnap Leia and the children, promising them to C'baoth upon his return. Though the commandos were again unsuccessful in kidnapping Organa Solo, they were able to achieve Thrawn's secondary objective of implicating Mara Jade, now on Coruscant, as an Imperial agent, discrediting her in the eyes of the New Republic and ensuring that she would not reveal the location of Wayland."}, {"tag": "p", "text": "Although Mount Tantiss remained a secret, word of the cloning project had reached the New Republic. The Republic began to search for the clones' origin but the Empire planted clues to lead them to Poderis. When Skywalker himself traveled to Poderis to investigate, Thrawn took the Chimaera to Poderis to capture him. Despite Thrawn's warnings not to underestimate the Jedi, Skywalker was able to escape an Imperial Intelligence trap on the planet—for which Thrawn had his shadower demoted—forcing Thrawn to attempt to capture him as he fled the planet. As the Chimaera's tractor beam locked on to Skywalker's freighter, he activated the self-destruct mechanism, escaping in his X-wing as the freighter broke into pieces and the Covert Shroud Maneuver caused the tractor beam to lose its lock. However, Thrawn was unconcerned—Skywalker's narrow escape would only serve to convince the New Republic that they had discovered the Empire's clone conduit."}, {"tag": "p", "text": "The Republic, meanwhile, was maintaining pressure on the Imperial shipyard supply lines, in an effort to disrupt the Empire's ongoing shipbuilding—as a result the Bilbringi Shipyards were running low on raw materials including tibanna, hfredium, and kammris. In response, Thrawn ordered another raid on Calrissian's mining operation on Nkllon to acquire the needed supplies. In order to avoid the damage caused to the Judicator on the previous raid, this time he sent three Dreadnaughts under the cover of a shieldship to avoid direct sunlight. At the same time as the Nkllon raid, Thrawn led an assault on Ord Mantell aimed at creating fear in surrounding systems as well as drawing Republic ships away from other duties, relieving the pressure on the supply lines."}, {"tag": "p", "text": "Thrawn soon learned that Talon Karrde was meeting with several smuggling groups on Trogan in an attempt to persuade them to supply information to the New Republic. Knowing that the smugglers would not want to get involved and would reject Karrde, Thrawn ordered the local garrison not to interfere with the meeting. However, Niles Ferrier persuaded Lieutenant Reynol Kosk to lead an attack on the meeting, helping to defeat the Imperials and, therefore, earn the trust of the other smugglers. When Thrawn learned what had transpired he was furious. The apparent Imperial attack had only served to unite the smugglers and Thrawn did not take the deaths of Imperial personnel lightly. Forced to make the most of the situation, Thrawn summoned Ferrier and instructed him to attend the next meeting with the smugglers, taking with him a \"stolen\" Imperial shuttle to help earn their trust. He would then continue to report on Karrde's activities and await further orders. When the time was right, Thrawn would have Ferrier plant evidence to implicate Karrde in arranging the Imperial attack to gain the others' support, saving the Empire the trouble of tracking him down. Thrawn also made it clear to Ferrier that the cost of another failure would be severe. Despite this, Ferrier's actions soon had repercussions as Mazzic and Ellor launched a guerrilla attack on the Bilbringi Shipyards which destroyed a half-completed Star Destroyer. Thrawn visited Bilbringi in the aftermath of the attack and ordered an evaluation of the shipyards' security."}, {"tag": "h4", "text": "Siege of Coruscant"}, {"tag": "p", "text": "Despite such setbacks, the campaign proceeded swiftly and Thrawn soon looked to making strides towards the Core Worlds, first capturing the planet Mrisst for use as a forward base. Finally, the time came to launch an attack on Coruscant itself. Though Thrawn was not yet prepared for a lengthy blockade or invasion of the Republic capital, he developed a strategy that would essentially take the world out of the war, with minimal risk to Imperial forces. To this end, he had 22 midsize asteroids taken to Bilbringi and fitted with cloaking devices. While at Bilbringi, he also had one of the shipyard's Golan II defense platforms fitted with a cloaking device, though his plan for the station remained unclear even after the cloaked station was rediscovered several years later during the Yuuzhan Vong War."}, {"tag": "p", "text": "Once the work on the asteroids was completed, they were taken aboard Star Destroyers and the fleet prepared to leave for Coruscant. C'baoth misinterpreted Thrawn's intentions, believing that he was going to use the asteroids to destroy the planet and, therefore, kill Organa Solo and her newborn children. C'baoth reacted angrily, using the Force to take control of the Chimaera's crew and announcing his intention to proceed to Coruscant and kidnap Organa Solo but Thrawn, protected by a nearby ysalamir, pointed out that C'baoth could hardly control the entire fleet and lacked the tactical knowledge to defeat the Republic. C'baoth reluctantly released his control but Thrawn was forced to have 500 crewmen sent from the Relentless while his crew recovered, forcing a delay to the Coruscant operation. By the time the fleet was ready to launch, however, C'baoth had experienced an apparent change of heart and instead demanded to be taken to Wayland to take immediate control of Mount Tantiss. Thrawn was suspicious of C'baoth's reasoning and so agreed, but insisted on sending supplementary troops under the command of General Freja Covell. Once the Jedi Master departed, Thrawn took the Imperial fleet to Coruscant."}, {"tag": "p", "text": "Thrawn's fleet for the Siege of Coruscant comprised six Star Destroyers, together with Interdictors to pull ships out of hyperspace in position and Dreadnaught escorts. After arriving in the Coruscant system, the Imperials quickly destroyed a relay station to prevent the Republic calling for the Coruscant Sector Fleet. Although the charges against Admiral Ackbar had now been dropped and he had resumed command of Republic forces, the Mon Calamari was off-planet and the defense eventually fell to Bel Iblis. The Corellian presented Thrawn with a choice; either engage the well defended Golan III defense platforms or follow the Republic forces into range of the ground-based defenses. Thrawn, however, had another option in mind. The Star Destroyers began launching the cloaked asteroids, launching all 22, interspersed with dry firings to create the illusion of considerably more launches. When Bel Iblis realized what was happening and disabled one of the asteroid's cloaking device, making it visible, Thrawn allowed the enemy a clear view of what they were up against before destroying the asteroid and ordering the withdrawal of the fleet. The Republic were left with the impression that 286 asteroids lay in orbit of the planet, preventing them from lowering the planetary shield until all were destroyed and leaving Coruscant effectively blockaded. It was during this siege that slicer Zakarisz Ghent, Organa Solo, and Winter Celchu discovered Delta Source, ending one of Thrawn's ways of obtaining information."}, {"tag": "p", "text": "Shortly after the attack on Coruscant, Thrawn made his move against Karrde. Mazic was captured by Imperial forces near Joiol and taken to the Chimaera but, instead of punishing him for the attack on Bilbringi, Thrawn explained that he understood their desire for revenge after Trogan but that he had given orders not to attack and that Lieutenant Kosk appeared to have been bought off. Allowing Mazic to develop his own suspicions, Thrawn let him go and tasked Ferrier with planting incriminating evidence in the Wild Karrde. However, Ferrier's deception was ultimately discovered by the smugglers, further uniting them against the Empire."}, {"tag": "h4", "text": "Death at Bilbringi"}, {"tag": "p", "text": "Meanwhile, the New Republic's efforts to remove the asteroids from Coruscant were meeting with limited success. In an effort to speed up the process, Admiral Ackbar and General Crix Madine planned to acquire a crystal gravfield trap. With the only three available CGTs located in Imperial space, the Republic identified the one at Tangrene as the easiest target but, believing that it may be a trap, prepared a raid for the CGT at the Bilbringi Shipyards—providing the additional opportunity to hamper the Empire's shipbuilding capabilities. In order to cover their tracks, they began a misdirection campaign to make it appear that they were intent on hitting Tangrene. By the time Thrawn had completed the capture of Xa Fel, news had begun to reach the Imperials of New Republic movements near Tangrene but Thrawn saw through the deception and, despite Pellaeon's insistence that Tangrene was the target, began preparing the fleet to defend Bilbringi."}, {"tag": "p", "text": "However, before Thrawn could depart for Bilbringi, news reached him that General Covell had been found dead shortly after arriving on Wayland. Suspecting C'baoth's involvement in the general's death, Thrawn decided that the time had come to deal with the Jedi Master and ordered Colonel Kleyn Selid to place him under arrest. Thrawn still had one final use for the Dark Jedi and planned to have C'baoth cloned—away from the ysalamiri effect and slow enough to avoid clone madness. However, the opportunity to clone C'baoth was soon lost, as Leia Organa had believed Mara Jade was innocent in the Imperial attack and had helped to free her. In exchange, Jade led a Republic team to Wayland where C'baoth was killed in combat with Jade and Skywalker, before the Rebels destroyed Mount Tantiss itself."}, {"tag": "p", "text": "Thrawn, unaware of events on Wayland, arrived at Bilbringi where he had the fleet take positions to trap the New Republic fleet as their Interdictors forced it out of hyperspace. His gamble proved correct when the Republic fleet fell into the trap. While the Interdictors prevented the Republic ships from escaping, Thrawn had his forces engage. The battle quickly went in favor of the Imperials and Pellaeon suggested allowing one ship to survive to tell of the Imperial victory—Thrawn agreed and designated Ackbar's command ship to escape, knowing that the inevitable allegations of incompetence would finally ruin the Mon Calamari's career. However, the battle soon took an unexpected turn. Talon Karrde, believing the New Republic would be attacking Tangrene, had organized a smuggler raid for the CGT at Bilbringi for the same time. Despite the unexpected battle raging around them, the smugglers proceeded with the plan and, while making their escape, attacked one of the shipyard's Golan II platforms, allowing the New Republic forces to move in on the shipyard itself, and forcing Thrawn to divide his fleet. However, before the Grand Admiral could respond to the new threat, news of the attack on Wayland arrived—including the involvement of a group of Noghri aiding the Republic team. After Thrawn left Honoghr, Leia Organa had been able to prove that the Empire was deceiving the Noghri—making it appear that they were helping to clean their world, while actually ensuring their perpetual service—and the Noghri had pledged themselves to serve the Republic. News of the Noghri betrayal came too late and, as Thrawn sat in his command chair, Rukh turned on his master, stabbing him through the chest from behind before fleeing the bridge. As Thrawn died, Pellaeon was forced to admit defeat and ordered the Imperial forces to withdraw. In just six months since launching his campaign, Thrawn had extended the Empire's power to half the known galaxy but, with his death, the future of the Empire was once again uncertain and the infighting that had plagued it before his return soon resurfaced."}, {"tag": "h3", "text": "Attempted rebirth"}, {"tag": "p", "text": "Thrawn's movement against the New Republic galvanized the remnants of the Empire to action, and uniting their forces, they were able to seize Coruscant and force the New Republic from the Core Worlds in a lightning campaign. However, they soon lapsed back into infighting, and ultimately, not even the return of Emperor Palpatine in a clone body in 10 ABY was enough to restore the Empire. The Reborn Emperor died at Onderon and the New Republic rapidly regained much of its lost territory by 11 ABY."}, {"tag": "p", "text": "The Empire's decline continued over the next ten years until, in 19 ABY, the now Supreme Commander Gilad Pellaeon decided the time had come for a peace treaty with the New Republic. Pellaeon's plan met with opposition from many within the Council of Moffs, though all but one eventually accepted the need for peace. Only Moff Vilim Disra actively opposed peace, forming a triumvirate with a con artist called Flim and the clone of Major Grodin Tierce in a bid to prevent it. Disra would provide the political brains behind the scheme and Tierce, with his knowledge of Thrawn's own tactics, would oversee the military aspects. However, it was Flim who would serve as the focal point for the plot by impersonating Thrawn himself. Thrawn's apparent return undermined Pellaeon's position as Supreme Commander and Imperial forces soon began to rally around the Grand Admiral. Meanwhile, the triumvirate began a campaign to destabilize the New Republic by exploiting the crisis caused by the recent discovery of the Caamas Document in the rubble of Mount Tantiss. Rumors of the return of Thrawn reached the Empire of the Hand and prompted the Syndic Mitth'raw'nuruodo training academy on the planet Rhigar in the Rata Nebula to accelerate the training of their cadets in preparation for service with the Grand Admiral."}, {"tag": "p", "text": "Meanwhile, the single clone of Thrawn, which was being grown at the Hand of Thrawn complex, had remained undisturbed for almost ten years. Voss Parck, Soontir Fel, and many Chiss soldiers had spent the previous decade continuing Thrawn's fight against threats from the Unknown Regions, staying out of contact with the Imperial Remnant while waiting for his prophesied return. Upon hearing HoloNet rumors that the Grand Admiral had returned to lead the Imperial Remnant, they decided to investigate further. However, Thrawn's goal had always been to protect the galaxy from the dangers it faced. With the Empire's strength greatly diminished, Thrawn may have decided to work with the New Republic instead. Therefore, they were unwilling to reveal their operation to the Empire itself and instead chose to make contact with Mara Jade and acquire her knowledge and expertise of both sides before making a decision."}, {"tag": "p", "text": "Mara Jade was successfully lured to the Hand of Thrawn complex on Nirauan, with Luke Skywalker following after Karrde's people lost contact with her. With the help of the Qom Jha, the two infiltrated the Hand of Thrawn through the caves beneath, arriving in the hidden section which contained Thrawn's clone. After Jade rejected Parck's offer to join the Empire of the Hand and sabotaged their ships to prevent them contacting the Empire, she and Skywalker returned to explore the hidden section of the fortress. In the course of their investigation, the two discovered the cloning chamber and found a fully mature clone of Thrawn still in the cloning cylinder. The two were uncertain what to do with the clone—though he could represent a threat to the New Republic, since he was not actually Thrawn, he should not be held accountable for his predecessor's actions. However, while they decided what to do, they activated the room's security systems and came under attack from the sentinel droids. When their lightsabers proved ineffective against the droids' cortosis armor, Mara used her blade to cut through the cavern wall and flood it from the nearby lake, destroying the droids but cutting off their only escape route. Left with only one chance of escape, Mara cut through the transparisteel around the cloning alcove. When the water hit the generator, it exploded and blew a hole in the wall through which they escaped. However, Thrawn's clone was killed in the process. When the triumvirate's scam was revealed to Admiral Pellaeon by Talon Karrde and Shada D'ukal, using information they had received from Jorj Car'das, Parck had no further reason to contact the Empire, though the operation in the Unknown Regions would continue."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After his death, Thrawn would be remembered as the genius tactician, consummate strategist, and Imperial leader who nearly brought down the New Republic. Thrawn was viewed as a hero by some members of the Empire of the Hand, including one of Baron Fel's sons, the Chiss-raised Jagged Fel. However, most of his own people still intensely disliked him. During a battle between Chiss forces and a group of pirates at the Syndic Mitth'raw'nuruodo training academy on Rhigar, Lieutenant Jagged Fel used Thrawn's tactics as an inspiration as he and the surviving Chiss cadets defeated the pirates. Fel would go on to become the Galactic Emperor of a revived empire."}, {"tag": "p", "text": "Although the death of his clone had brought Thrawn's career to a close, when Aristocra Chaf'orm'bintrano used the remains of Outbound Flight to draw out the Vagaari in 22 ABY, giving the Chiss an excuse to attack them, Mara Jade Skywalker noted great changes in his behavior and wondered if Thrawn had somehow survived and was behind the recent events."}, {"tag": "p", "text": "Intense debates on the outcome of the Battle of Bilbringi if Rukh had not killed Thrawn raged among historians for decades after the event. Ackbar himself insisted until his death that he could have vanquished Thrawn, and that the best possible outcome for the Chiss admiral was a draw. Many historians, however, suggested that the New Republic was about to be defeated, and Pellaeon later remembered that he and his commander were about to summon additional reinforcements from nearby Imperial controlled areas when Rukh had betrayed them. Additionally, Grand Moff Kaine insisted that he had been preparing to send an Imperial fleet and the Star Dreadnought Reaper to destroy Ackbar's forces just before he learned of Thrawn's death."}, {"tag": "p", "text": "Many of Thrawn's tactics were later employed by Admiral Gial Ackbar, or General Garm Bel Ibilis. Notably, when Ackbar used the \"Thrawn Pincer\" during the battle of Ciutric against Prince-Admiral Delak Krennel."}, {"tag": "p", "text": "Although Thrawn was able to unite several splinter factions to fight against the New Republic, Admiral Natasi Daala noted that Thrawn proved that the rebels have not yet managed to consolidate their own meager resources, making them vulnerable to attack. Daala would later kill the thirteen Imperial warlords at Tsoss Beacon, starting the Imperial Reunification into the United Warlord Fleets."}, {"tag": "p", "text": "Before the Black Fleet Crisis, which involved a mysterious Imperial fleet that had resurfaced under the command of the Yevetha, Chief of State Leia Organa Solo and Han Solo wondered if Grand Admiral Thrawn knew of the long lost fleet, because of his high-ranking status in the Imperial Starfleet, and they both realize how terrifying it would have been if he used it against them, or the fact he may have kept the battlegroup in reserves. None of this is correct, as after the battle of Endor happened, the Yevethan Uprising had occurred, and the fleet was lost to the Yevetha, who kept the fleet for the near future."}, {"tag": "p", "text": "The Galactic Federation of Free Alliances created a Thrawn simulator, and the Bothan Nek Bwua'tu was the only one ever known to have beaten it."}, {"tag": "p", "text": "In 55 ABY, the Imperial partisan Lenang O'Pali published Mitth'raw'nuruodo Reconsidered: A Patriot's Perspective, which detailed an opinion of the Chiss leader. In it, O'Pali agreed with all of Thrawn's career, the moves he made and the motives he possessed. O'Pali believed that Thrawn broke with the Chiss because he saw Palpatine's vision of a militarized Galactic Empire as the only possibility of defeating the encroaching Yuuzhan Vong, which both had been aware of since before the Outbound Flight Project. Further, O'Pali considered that Thrawn had been recalled from the Unknown Regions in 9 ABY by Emperor Palpatine's clone on Byss, and had attacked the New Republic with the aim of restoring the Empire. In O'Pali's judgement, Thrawn believed that a democratic government would only repeat the flaws of the Old Republic and had to rebuilt into a militarized society to resist the Yuuzhan Vong. Because of this, O'Pali believed that if Thrawn had succeeded in recreating the Empire, it would have stood a much better chance against the Yuuzhan Vong invasion of the galaxy in 25 ABY, which soon destroyed the New Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Command style"}, {"tag": "p", "text": "Appalled by the punishing \"Vader style\" of command that so many of his contemporaries supported, Thrawn preferred to promote creativity in his crew, rather than merely punish their failures, and did not often kill off personnel for minor failures, as that could easily strain the resources of the Empire, which was unaffordable at the time. This was perhaps best exemplified in a pair of incidents surrounding the tractor beam control pit. During his campaign against the New Republic, a tractor beam operator, Cris Pieterson, aboard the Chimaera was responsible for allowing Luke Skywalker to escape capture. Thrawn investigated the incident and found a defiant Pieterson disrespectfully refusing to claim responsibility for the incident, referring Thrawn to his commanding ensign. Thrawn summarily had the man executed at his post in a rather brutal fashion by Rukh, and informed the ensign that he was free to train the next replacement. On the other hand, when Skywalker escaped a similar trap again, he rewarded the new tractor beam operator, Rejlii Mithel, with a promotion to Lieutenant because the man had employed creative thinking in his attempt to capture Skywalker and took responsibility for his failure to do so. In addition, Thrawn encouraged his senior officers to express their own ideas and gave them reasoned consideration rather than ignore any outside ideas, as many an Imperial commander had done during the height of the Empire. The sharp contrast between Thrawn's style and that of megalomaniac and sadistic Imperial leaders heightened Thrawn's ability to lead."}, {"tag": "p", "text": "Thrawn boosted the morale of his crew not only through victories, but also through his clear dedication to the Empire. Officers and crewmen serving under Thrawn admired his lack of concern for personal glory, wanting only the defeat of the Empire's enemies and the establishment of order. Indeed, Thrawn was able to unify the Empire's feuding Moffs prior to his final campaign in no small part owing to his single-minded determination to destroy the \"Rebellion\"."}, {"tag": "p", "text": "Finally, Thrawn was willing to admit defeat. Rather than stand proud and fight a losing battle, Thrawn knew when it was time to retreat, although those instances were few and far between. One such time was after the Battle of Sluis Van, when his attempt to capture a number of capital ships docked at the shipyards failed. Rather than cover his failure and waste lives and equipment in a vain attack, Thrawn decided to withdraw instead, and in those instances would adjust his plans in later attempts."}, {"tag": "p", "text": "Thrawn believed intelligence was a key factor in warfare, and thus he maintain a vast network of spies, that were scattered across the galaxy. These agents would often report what they found to Thrawn, which helped Thrawn gain more intelligence on his enemies. Thrawn also relied on Imperial Intelligence or later on, Delta Source."}, {"tag": "p", "text": "Thrawn was an excellent starship engineer, designing the Missile Boat, which proved to be a dangerous starfighter that could even dwarf the TIE/D Defender, designed by Grand Admiral Demetrius Zaarin."}, {"tag": "p", "text": "Many years after Thrawn's death, Sinister Triumvirate Major Grodin Tierce found a datacard named \"The Hand of Thrawn.\" Imperial Moff Vilim Disra believed that Thrawn had hidden a superweapon, such as a Sun Crusher or a another Death Star. However, Major Tierce theorized that superweapons were not part of Thrawn's tactical style in warfare."}, {"tag": "p", "text": "Thrawn shown a keen interest in cloning science. An example was when Thrawn attempted to make a super commando as a next generation of a soldier. Major Grodin Tierce was selected as a template. With Tierce's battle training, and Thrawn's tactical abilities, Thrawn expected for the project to be a success, but the results didn't satisfy him.  Thrawn also took liberty of having sleeper cells of clones established throughout the galaxy. This was a contingency plan if the New Republic or Imperial Remnant were to fall, these cells would be activated to act as resistance forces to the Yuuzhan Vong. Another example was when Thrawn attempted to  create a group of Force-users. However, these cloned Force wielders went rogue after his death."}, {"tag": "h3", "text": "Technique"}, {"tag": "p", "text": "While a master of military tactics, Thrawn was more than an adept commander. His use of knowledge and intelligence in conjunction with stunning tactics proved Thrawn to be one of the galaxy's most remarkable military commanders."}, {"tag": "p", "text": "The precise application of intelligence allowed Thrawn to win countless victories over numerically superior forces. Thrawn believed that one could understand the psychological and tactical limitations of one's adversaries through the examination of their art, and thus exploit their weaknesses. This conviction was often proven correct since his vast knowledge and obsession with the analytical study of art resulted in almost infallible strategic victories over nearly every opponent Thrawn engaged. Thrawn had a large holographic collection of art, although he also possessed a few real artifacts, including Killik Twilight, a set of Mandalorian armor which he wore on his mission to Corellia, and, according to rumor, General Grievous's mask. He also had a statue made by a certain species, which were totally wiped out by his forces—it was the only case when Thrawn had knowledge of a particular species' art and was not able to create a proper tactic to defeat them without total annihilation."}, {"tag": "p", "text": "An attention to small details also played a major role in Thrawn's technique. By scouring large collections of data and intelligence, Thrawn was able to piece together small details that alone were merely trivial, but together formed a powerful variable. Additionally, his collection of information and near-encyclopedic knowledge of topics gave Thrawn an eerie aura of omniscience. At least once, however, he made mistakes as a result of over-predicting his enemies, assuming they knew information that they did not, and Thrawn's final defeat came about because of his complete ignorance of Luke Skywalker and Leia Organa Solo's relationship to Darth Vader, which earned them the loyalty of the Noghri that superseded the Noghri's existing ties to Thrawn and allowed them to convince the Noghri to aid the Republic."}, {"tag": "p", "text": "Finally, Thrawn laid out complex campaigns in advance of his attacks. By following a carefully planned campaign, Thrawn was able to keep his enemies guessing. In the time it took his enemies to understand one phase of his plan, Thrawn had already moved on to the next. In this, Thrawn was always a step ahead of his foes."}, {"tag": "h3", "text": "Political views"}, {"tag": "p", "text": "The true extent of Thrawn's loyalty to the Empire is unclear: indeed, it was later postulated that Thrawn did not support the Empire per se, but rather wanted to establish order in the known galaxy in preparation to combat as-yet-unknown threats he had discovered during his time in the Unknown Regions of the galaxy. In the aftermath of the Yuuzhan Vong War, Lenang O'Pali suggested that Thrawn saw a militarized, orderly society as being the galaxy's only hope of defeating the Yuuzhan Vong, and that the New Republic would only succumb to the same division and inefficiency that had destroyed the Old Republic, hence his decision to attack the Republic rather than warn it of the Vong. For whatever reason, Thrawn did express loathing of the New Republic: he insisted on still referring to it as the \"Rebellion\", and considered its \"complete, total, and utter destruction\" to be \"the only puzzle worth solving\"."}, {"tag": "p", "text": "Thrawn did believe that a society of multiple species, with different viewpoints and philosophies, was inherently unstable. In this case, he believed in the necessity of a strong central government that was capable of listening to its people, but remained the \"dominant voice\". He felt that the only alternative was anarchy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grand Admiral Thrawn first appeared in Timothy Zahn's Heir to the Empire, the first book of The Thrawn Trilogy named for the Grand Admiral. The trilogy marked the dawn of a new era in the Star Wars Expanded Universe, and Thrawn's character is considered a contributing factor. Author Timothy Zahn has stated that Thrawn's character is a composite of various historical and fictional personalities, including Erwin Rommel, Robert E. Lee, Hannibal Barca, Alexander the Great and Sherlock Holmes, to name a few. Another loose inspiration for Thrawn was the character of General Maximilian Veers from the 1980 film Star Wars: Episode V The Empire Strikes Back, who had the distinction of being one of the few highly competent Imperial officers from the original trilogy."}, {"tag": "p", "text": "In a 2007 interview, Timothy Zahn explained that he could bring another clone of Thrawn to life if the Grand Admiral's ability is an absolute necessity to solve future galactic crisis. However, to escape the traditional archetypes of clones, Zahn stated that that clone would be aware that he was not Thrawn, and would be aware of immense pressure to live up to the original. Thrawn's possible return was hinted at in Zahn's novel Survivor's Quest, where great changes in the behavior of Chaf'orm'bintrano lead Mara Jade Skywalker to suspect that another clone of Thrawn existed and may be behind the events of the novel."}, {"tag": "p", "text": "Occasionally, Thrawn's Grand Admiral uniform is depicted without the gold epaulets, such as in the The Last Command comic series, Reflections II, The Essential Guide to Characters, The New Essential Guide to Characters, Imperial Entanglements or The Force Unleashed Campaign Guide."}, {"tag": "p", "text": "Thrawn was portrayed by various actors in audio-visual Star Wars materials. A CGI-based Thrawn was made using Timothy Zahn's likeness for Thrawn's depiction in the Reflections II: Expanding the Galaxy expansion for the CCG by Decipher. Thrawn is voiced by Tim Russell in the audio drama of Dark Forces: Soldier for the Empire and Tris King in Star Wars: TIE Fighter. Cutscenes of him in the bridge of the Star Destroyer show him wearing the Grand Admiral's white uniform before he publicly attained that rank. A mustached man to his left resembles Gilad Pellaeon, likely as a tribute to Zahn's novels."}, {"tag": "p", "text": "Thrawn was planned to have appeared in the original Star Wars: Battlefront, as indicated by images that depict a 3D model of the character appearing in alpha and beta builds of the game; he was ultimately cut from the final release, however.[source?] In Star Wars: Empire at War: Forces of Corruption, Thrawn appears as a playable space hero for the Empire as commander of Admonitor when the Empire reaches its penultimate tech level. Admonitor itself doesn't differ much from other Star Destroyers featured in the game apart from a bluish color theme and a few additional abilities. Thrawn boosts morale of ally units present and can also remove Tyber Zann's corruption from a planet. Thrawn is voiced by Robin Atkin Downes. Thrawn appears in the Galactic Conquest mode of Star Wars Battlefront: Renegade Squadron as a hirable Imperial Commander, alongside Emperor Palpatine, Darth Vader and Grand Moff Tarkin, though not as a playable character."}, {"tag": "p", "text": "Thrawn has been the subject of several figurines. Wizards of the Coast made a miniature in its \"Universe\" set, depicting him with an ysalamir draped over his shoulder. An action figure of Thrawn was made in 1998 as part of the Expanded Universe assortment of the Power of the Force II line. The figure came with a blaster pistol and an ysalamir. He was released yet again as a part of the 2008 Comic Two-Pack series. He again came with an ysalamir and is packaged alongside Talon Karrde and a reprint of Heir to the Empire 1. In 2010, Sideshow Collectibles released a 12\" figure of Thrawn in his white uniform with his insignia but no epaulettes, a blaster pistol, a ysalamir, and interchangeable grip-hands/fists."}, {"tag": "p", "text": "Thrawn received a War Portrait in 2012's The Essential Guide to Warfare, with author Jason Fry presenting a discussion of Thrawn's life and actions in the form of the in-universe historical revisionist article Mitth'raw'nuruodo Reconsidered: A Patriot's Perspective. It suggests that Thrawn's entire Imperial service was dedicated to preparing the galaxy for the upcoming Yuuzhan Vong invasion, which he had known about since the events of the novel Outbound Flight, and argues that his death and the Galactic Empire's defeat was a terrible mistake that left the galaxy defenseless. While Outbound Flight shows that both Thrawn and Palpatine were aware of the Yuuzhan Vong (as the \"Far Outsiders\") as early as 27 BBY, it is deliberately unclear how much of the article should be taken as fact and how much of it is the politically-motivated writing of an Imperial partisan."}, {"tag": "p", "text": "Thrawn appeared in the ambiguously canon article \"'Statue' quo à Sluis Van\" in the French roleplaying magazine Casus Belli 89 which describes Thrawn's brief visit to Sluis Van before his official return from the Unknown Regions. Though other sources state that Thrawn was unknown to the New Republic prior to launching his campaign, this article, set three years earlier in 6 ABY, shows him meeting several New Republic officials, including Borsk Fey'lya. Thrawn's depiction in the article also differs from other sources, showing him with long hair and an elaborate costume instead of his Imperial uniform."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}