{"url": "Mitth%27oor%27akiord", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Chiss", "Category:Males", "Category:Mitth family", "Category:Patriarchs of the Chiss Ascendancy"], "nodes": [{"tag": "h1", "text": "Mitth'oor'akiord"}, {"tag": "p", "text": "Mitth'oor'akiord, known as Thooraki, was a Chiss male who held the title of Patriarch of the Mitth family. Thooraki invested time in recruitment for the Mitth, seeking out and arranging for invitations to be offered to talented prospective family members."}, {"tag": "p", "text": "Patriarch Thooraki personally asked his friend General Ba'kif to point the Mitth family to recruit Kivu'raw'nuru, who would later become Senior Captain Mitth'raw'nuruodo \"Thrawn\" of the Chiss Expansionary Defense Fleet. He also personally made the decision to invite the former ozyly-esehembo Ali'astov, whose powers of Second Sight had faded, into the Mitth."}, {"tag": "p", "text": "Patriarch Thooraki was present when Mitth family merit adoptive Mitth'ali'astov (\"Thalias\") performed her family Trials. He considered her solutions to be highly elegant and congratulated her, welcoming her as a Trial-born of the Mitth. Thooraki considered Trial-born Mitth'raw'nuruodo to be extremely talented and have the potential to bring greatness to the Mitth family and the Chiss Ascendancy on the whole, but was cognizant that others thought Thrawn might bring them to ruin. He entrusted Thalias to watch over and protect Thrawn from his enemies, as Thrawn was always weak at politics."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As Mitth family Patriarch, Mitth'oor'akiord showed keen interest in attracting, recruiting and retaining talented Chiss individuals into the family. Thooraki personally arranged for Senior Captain Mitth'raw'nuruodo and Caregiver Mitth'ali'astov to be invited to the Mitth family, seeing their potential to benefit and benefit from the Mitth family."}, {"tag": "p", "text": "Patriarch Thooraki was very protective of Thrawn, knowing the officer was a brilliant tactician and strategist but also aware of Thrawn's fatal flaw of low political acumen. Thooraki correctly surmised that Thrawn had enemies within the upper echelons of not only the Ascendancy, but also the Mitth family itself. Thooraki knew he was old and close to death, and feared that members of the Mitth family who opposed Thrawn may seek to succeed him as Patriarch."}, {"tag": "p", "text": "Syndic (and later Syndic Prime) Mitth'urf'ianico was one such high-ranking anti-Thrawn official of the Mitth. After Thooraki's passing, Thurfian succeeded the elder as the Mitth family Patriarch; vindicating Thooraki's fears that a Patriarch determined to destroy Thrawn might succeed him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}