{"url": "Mitth%27ras%27safis", "categories": ["Category:Canon articles", "Category:Chiss", "Category:Males", "Category:Mitth family", "Category:Syndics of the Chiss Ascendancy"], "nodes": [{"tag": "h1", "text": "Mitth'ras'safis"}, {"tag": "p", "text": "Mitth'ras'safis, core name Thrass, was a Chiss male syndic of the Chiss Ascendancy's Syndicure and a member of the Mitth family. By 19 BBY, Thrass was involved in operations against Vagaari pirates, an unauthorized action taken by Senior Captain Mitth'raw'nuruodo. The incident resulted in the death of Syndic Thrass, subsequently becoming a political disaster. The Mitth family was saddened by the loss of a respected syndic, while both the Aristocra and the Defense Hierarchy Council were displeased with Thrawn due to the death of Thrass and the loss of a starship from Lesser Space."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Respected syndic"}, {"tag": "p", "text": "Mitth'ras'safis, known by his core name of Thrass, was a member of the Chiss Ascendancy's Mitth family. He was a respected syndic, representing his family in the Syndicure, the Ascendancy's main governmental body. He was close to Mitth'raw'nuruodo, an officer in the Chiss Expansionary Defense Fleet, though the two were not often seen together. Thrass worked directly under Speaker Mitth'ykl'omi; Syndic Mitth'urf'ianico, who at the time oversaw the transportation and commerce office, knew him in passing."}, {"tag": "p", "text": "By the year 19 BBY, Thrass was involved, alongside Thrawn, who at that point held the rank of Senior Captain aboard the heavy cruiser Springhawk, in operations against Vagaari pirates. The operations—an unauthorized action taken by Thrawn—saw Thrawn acquire a gravity-well generator from the Vagaari, but also led to the loss of an alien starship from Lesser Space, the term used by the Chiss to refer to the area of the galaxy outside of the Unknown Regions, as well as the death of Syndic Thrass. As a result, the operations became a political disaster for the Ascendancy, despite being successful in a military sense."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The death of Thrass, along with the loss of alien technology and the unauthorized nature of Thrawn's actions, led to the Aristocra's displeasure with Thrawn and the Defense Hierarchy Council's removal of his position as commander of the Springhawk. The Mitth family were saddened by the syndic's loss, with Thurfian believing that Thrawn had casually thrown away the life of Thrass and was responsible for his death. Even by the following year, the memory of Thrass was fresh in the minds of many of the Aristocra's members."}, {"tag": "p", "text": "When discussing rumors around the Vagaari with Thurfian, by then Syndic Prime, Syndic Irizi'stal'mustro mentioned the outcome of incident, though did not reference the death of Thrass. Thurfian reminded him of the syndic's death, and Zistalmu subsequently acknowledged the loss. Speaker Thyklo later compared Thurfian to Thrass when complimenting his ability to handle disputes."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Chiss male, Mitth'ras'safis was a respected syndic within the Mitth family. He was skilled at conveying the appearance of giving people what they desired while also doing what in reality needed to be done."}, {"tag": "p", "text": "Thrass was known to be close to Thrawn."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the new Star Wars canon, Mitth'ras'safis was first mentioned in the 2020 novel Thrawn Ascendancy: Chaos Rising, the first instalment of Star Wars: The Ascendancy Trilogy written by Timothy Zahn. The character's core name of Thrass was revealed in the second installment, Thrawn Ascendancy: Greater Good, released in 2021. In the Star Wars Legends continuity, the unidentified remains of Mitth'ras'safis appeared in Zahn's 2004 novel Survivor's Quest, while the 2006 novel Outbound Flight, also written by Zahn, identified and formally introduced the character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}