{"url": "Mitth%27raw%27nuruodo_Reconsidered:_A_Patriot%27s_Perspective", "categories": ["Category:Legends articles", "Category:Publications and journals"], "nodes": [{"tag": "h1", "text": "Mitth'raw'nuruodo Reconsidered: A Patriot's Perspective"}, {"tag": "p", "text": "Mitth'raw'nuruodo Reconsidered: A Patriot's Perspective was a publication written by the Imperial partisan Lenang O'Pali that was released in 55 ABY. The book discussed the role that the Chiss Mitth'raw'nuruodo, better known as Grand Admiral Thrawn, played in galactic history. A highly-revisionist and somewhat-polemical piece, O'Pali cast Thrawn as a principled being whose ultimate objective was to rebuild the Galactic Empire and establish a militarized society to resist the Yuuzhan Vong invasion. O'Pali further cast this as being the ultimate goal of Emperor Palpatine, and claimed that the death of both and the defeat of the Galactic Empire by the New Republic was not a victory for freedom but in fact a disaster that left the galaxy defenseless when the Yuuzhan Vong invaded."}, {"tag": "h2", "text": "Thesis"}, {"tag": "p", "text": "O'Pali began with a brief discussion of Thrawn's background, citing sources within the Chiss Ascendancy and the Empire of the Hand to describe Thrawn's rise from a commoner to a merit adoptive of the Eighth Ruling Family of Csilla for his impressive military service. O'Pali stressed that Thrawn decided to give up this good luck and his connections in Chiss society after he learned about the threat posed by the Yuuzhan Vong, then known only as the \"Far Outsiders\". As a Chiss officer, Thrawn had already defeated Yuuzhan Vong probes at Vun'Hanna and the Twilight Void, and O'Pali believed that this threat led him to ally with Darth Sidious after he was introduced to him via hologram by Kinman Doriana, and destroy the exploration ship Outbound Flight, which Sidious told him he feared might lead the Far Outsiders back to the Republic."}, {"tag": "p", "text": "With this established, O'Pali moved on to the main thesis, declaring that Thrawn was \"a brave and principled being who devoted his life to preparing for the Vong.\" O'Pali believed that he broke with his people and served the Galactic Empire, despite the cost to his own reputation and the New Order's institutionalised xenophobia, because he believed that only a militarized, orderly society could defeat the Yuuzhan Vong. O'Pali suggested that Thrawn's missions in the Unknown Regions and his establishment of the Empire of the Hand were to create a bulwark against the Yuuzhan Vong, and suggested that he was neutralizing other threats to the galaxy proper, citing his defeat of the Ssi-ruuvi Imperium at the First Battle of Lwhekk."}, {"tag": "p", "text": "O'Pali believed that Thrawn's knowledge of the Yuuzhan Vong explained why he attacked the New Republic following his return to the galaxy in 9 ABY: rather than serve the New Republic and alert them to the encroaching Yuuzhan Vong, Thrawn believed that the new government would succumb to the same inefficiency, corruption and separatism that had destroyed the Old Republic. O'Pali further believed that Emperor Palpatine – then thought dead after the Battle of Endor, but in fact recuperating in a clone body on Byss – had recalled Thrawn to the main galaxy to rebuild the Empire, which both men believed was the only type of society that could resist the Vong."}, {"tag": "p", "text": "O'Pali went on to attack his critics, accusing them of being disingenuous to accept Thrawn's account of his discussion with Darth Sidious about the Far Outsiders but not revise their opinions of the Galactic Empire. O'Pali believed that preparation to resist the Yuuzhan Vong invasion exonerated the Empire for its numerous atrocities, and declared that the Rebel Alliance, the Galactic Civil War, and the rise of the New Republic had only served to weaken the galaxy's defenses. O'Pali was contemptuous of the Noghri: Thrawn's Noghri bodyguard Rukh had turned against Thrawn for keeping his homeworld enslaved and had killed him at the Battle of Bilbringi. O'Pali held Han Solo, Luke Skywalker, and Mara Jade in similar disregard for their roles in killing Palpatine and Thrawn's last clones, at Onderon and Nirauan respectively. O'Pali described galactic history from 4 ABY as being \"a succession of unlucky events... and as a result we stood naked before the Yuuzhan Vong and the bleak destiny they sought for us.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}