{"url": "Mk_I_Katarn-class_Commando_Armor", "categories": ["Category:Canon articles", "Category:Clone trooper armor variants"], "nodes": [{"tag": "h1", "text": "Mk I Katarn-class Commando Armor"}, {"tag": "p", "text": "The Mk I Katarn-class Commando Armor was a type of Katarn-class Commando Armor designed for clone commandos of the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. It was named after the Katarn, a dangerous predator native to the planet Kashyyyk."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The Mk I Katarn-class Commando Armor was one of the most advanced suits of heavy combat armor produced. The type of clone trooper armor was named after the Katarn, a deadly predator that was native to the planet Kashyyyk. Each Katarn-class armor set was composed of a fully enclosed, environmentally sealed duraplast suit worn over an insulated and breathable, ballistic-fiber bodysuit."}, {"tag": "p", "text": "The armor set featured reinforcements at critical points of the body such as the neck, spine, and forearms, which protected the wearer against blasts and impacts. The helmet was equipped with an integrated combat scanner, encrypted communications suite, and an onboard combat computer that monitored the physical conditions of the user and nearby allies wearing Mk I Katarn-class Commando Armor. The armor set also included an integrated breath mask and onboard oxygen supply that lasted for six hours of heavy combat. Additionally, the body armor could be equipped with a modular backpack system that could be specified for various mission and combat roles. Such specifications included long-range communications, medpacs, extended oxygen supplies, and power generation. An attachment on the wrist also allowed the commando to generate a repulsorlift blast capable of knocking enemies off of their feet."}, {"tag": "p", "text": "The armor protected against most portably infantry weapons, light ordnance, shrapnel, as well as light vehicle-mounted weapons such as auto-blasters and light laser cannons. The armor was also resistant to heat, cold, toxins, and other hazardous environments."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}