{"url": "Arumorut/Legends", "categories": ["Category:Legends articles", "Category:Cities", "Category:Mandalorian enclaves", "Category:Vlemoth Port locations"], "nodes": [{"tag": "h1", "text": "Arumorut"}, {"tag": "p", "text": "Arumorut was a Mandalorian settlement on the Outer Rim world of Vlemoth Port. Founded by Clan Awaud after their chieftain chose to leave Mandalore and its struggles between the Death Watch and New Mandalorians behind, Arumorut became an enclave of traditional Mandalorians who wanted no part in either group's politics. Over the span of the next two decades, the settlement grew in size until more than eight hundred Mandalorians called Arumorut and its numerous vheh'yaime home. After settling Arumorut, the Mandalorians of Clan Awaud entered into an alliance with the Talz from the Gnaaz tribe, and the white-haired beings became a frequent sight around the enclave."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Arumorut was a small Mandalorian settlement on the planet Vlemoth Port, located in the Outer Rim Territories of the galaxy. Surrounded by sloping valleys and situated among the dense forests of the northern foothills, Arumorut's many buildings made use of the hard wood provided by the area's abundant conifer trees in their construction. At the settlement's heart was Clan Home, a fifty-meter-wide vheh'yaim that housed the senior members of Clan Awaud and its chieftain. A multitude of smaller vheh'yaime—called akaata'yaime—were scattered across the nearby hills, inhabited by small families, couples, and the occasional Mandalorian loner. The sixteen largest akaata'yaime were allocated as platoon barracks, and each was equipped with an underground tunnel leading back to Clan Home. Approximately a kilometer from the settlement's center was a clear mountain lake, and the Sheb Niktose cantina."}, {"tag": "p", "text": "Arumorut's name roughly equated to \"home away from home,\" when translated from Mando'a to Galactic Basic Standard. By the time of the Galactic Civil War, Arumorut was host to a population of over eight hundred Mandalorians. All of the Mandalorians who called Arumorut home prided themselves on their combat prowess, and many of the adults worked as mercenaries or bounty hunters, conducting business throughout the local region of space, including the Slice and the galaxy's Western Reaches. Friendly Talz from the Gnaaz tribe's nearby village could also be frequently found around Arumorut. With word from Clan Awaud's chieftain, the Mandalorians could mobilize a fighting force equivalent to a battalion, supported by at least two armed Aka'jor-class shuttles, though they lacked any starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the ravages wrought to the Mandalorian homeworld by the Great Clan Wars, Chieftain Nam Beroya and many of his brethren in Clan Awaud decided they no longer wanted any part of the intersocietal conflict between the pacifistic New Mandalorians and the radical Death Watch. Rather than get involved as the True Mandalorians had, Beroya and his clan left Mandalore and its politics behind. During the Clone Wars, Beroya's people worked security for the Confederacy of Independent Systems, in addition to doing several jobs for the Hutts. After a few years on the move, Beroya finally led his clan to Vlemoth Port, a sparsely populated backwater world in the Instrop sector. There, in the forested foothills of Vlemoth Port's north, the Mandalorians established the settlement of Arumorut. From their new home, Arumorut's soldiers secured mercenary and bounty hunting work throughout the nearby regions of space, and their numbers grew into the hundreds over the following decades."}, {"tag": "p", "text": "Not long after its foundation, Arumorut was approached by the Gnaaz tribe, a group of Talz from a nearby northern village. The tribes of Talz on Vlemoth Port had become a target for raiding parties of Zygerrian slavers, and overwhelmed by their foe's technological superiority, the Gnaaz tribe sought an alliance with the Mandalorians of Arumorut. Nam Beroya negotiated a mutual defense agreement between Arumorut and the Gnaaz people, wherein both groups pledged to protect the other from slaver attacks. Because of the agreement, the Mandalorians and the Gnaaz tribe developed strong ties: Talz were a frequent sight in Arumorut, and the two peoples met twice a year to share knowledge, train, and celebrate together. During a subsequent Zygerrian raid, Arumorut's warriors rallied to their allies' defense, but during the course of the battle, Nam Beroya was struck down by laserfire; though the Mandalorians believed him dead, Beroya had instead been wounded and taken captive by the Zygerrians, who delivered him into slavery on the planet Kowak. With their leader lost, Arumorut turned to Nam's daughter, Vera Beroya, who succeeded her father as the new chieftain of Clan Awaud."}, {"tag": "p", "text": "Two years later, amidst the Galactic Civil War between the reigning Galactic Empire and the rebellious Alliance to Restore the Republic, a group of rebel operatives arrived on Vlemoth Port seeking to enlist the local Mandalorians' aid in defending the foundries of Xorrn from Imperial forces. By that time, Arumorut had nearly eight hundred warriors, many of whom had recently been contracted to provide security for sensitive negotiations between rival kajidics in Hutt Space. Though the Alliance agents arrived in Arumorut to meet with Vera Beroya alongside their contact, the local Mandalorian youth Kad Solus, it would be several hours before Beroya was able to receive them, as the chieftain had prior business to complete first. While the rebels waited, they visited the Sheb Niktose cantina on the outskirts of Arumorut, where they drank tihaar shots with the local veteran Teroch. The rebels also took part in a search and rescue mission to recover a group of missing Mandalorian and Talz hunters, who had run into trouble with a hostile Talz tribe. When they could at last meet with Beroya, the Alliance operatives negotiated the assistance of a number of the clan's skilled mercenaries, and the assembled troops soon departed Arumorut."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arumorut was first introduced to the Star Wars universe in the roleplaying game adventure book Friends Like These, published on December 8, 2016 by Fantasy Flight Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}