{"url": "Moda_Maxa", "categories": ["Category:Canon articles", "Category:Cloud-Riders members", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Moda Maxa"}, {"tag": "p", "text": "Moda Maxa was a female human who served as a member of the Cloud-Riders during the reign of the Galactic Empire. She was the younger sister of Tayshin Maxa. Her older sister learned to survive on her own after the Droid Gotra caused a gang dispute on the planet Eshan and imparted her survival lessons to her younger sister. Maxa rode a Vulptereen Skysnipe-616D during shipjacking raids."}, {"tag": "p", "text": "While she was a member, the Cloud-Riders attempted to steal a shipment of coaxium from the Galactic Empire on the planet Vandor. Riding speeder bikes, they attacked a 20-T Railcrawler conveyex transport carrying the goods, but discovered that a group working for the criminal Crimson Dawn were already on the transport trying to steal the same shipment. The groups fought and ultimately neither managed to claim the coaxium as it was destroyed. During the raid, Maxa was killed when her swoop was caught by a cable, causing her to lose control and crash into a mountain."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The sisters Maxa"}, {"tag": "p", "text": "Moda Maxa was the sister of Tayshin Maxa and, along with her sibling, a member of the Cloud-Riders, a group opposed to the Galactic Empire and the criminal Five syndicates. She participated in shipjacking raids with the group while riding a Vulptereen Skysnipe-616D and during the raids was challenged to a race alongside her sister by their fellow swoop rider Callixido Ryss, whom Tayshin believed had romantic feelings for Moda."}, {"tag": "p", "text": "In 10 BBY, Moda, Tayshin and Ryss joined the leader of the Cloud-Riders, Enfys Nest, and fellow riders Weazel and Benthic in a mission on the planet Vandor where they aimed to steal a shipment of coaxium from the Empire. The coaxium was being transported in a 20-T Railcrawler conveyex transport, which the group approached on their swoops; however, they discovered that a group of criminals were already in the process of stealing their target using a Y-45 armored transport hauler. The Cloud-Riders attacked the criminals, who were led by the thief Tobias Beckett and associated with the Crimson Dawn syndicate, and during the fighting Ryss's swoop was shot down by Beckett."}, {"tag": "h3", "text": "Vanquished on Vandor"}, {"tag": "p", "text": "Nest then boarded the transport and fought with Beckett, attempting to disconnect a series of cables that the criminals had attached to the vehicle from their hauler. Moda and the other Cloud-Riders began attaching their own cables to the transport car carrying the coaxium. Beckett's wife Val then detonated a portion of the tracks ahead of the transport, forcing Nest to give up on attaching the cables in order to return to her swoop. As the transport reached the missing portion of track and fell, the car carrying the coaxium was kept aloft by both sets of cables, including those attached to Moda's swoop."}, {"tag": "p", "text": "The two groups then carried the car away from the tracks, each pulling in a separate direction as it approached a mountain. The criminals detached their cables at the last moment to avoid collision, leaving the Cloud-Riders to try and support the car alone. As they attempted to pull it around the mountain, Maxa's swoop was caught by one of the other cables, causing her to spiral out of control and crash into the mountain, where her vehicle exploded, killing her. The entire mountain was then vaporized when the Cloud-Riders' remaining cables broke, causing the shipment to plunge into the mountain and explode."}, {"tag": "h2", "text": "Personality and skills"}, {"tag": "p", "text": "Moda Maxa was skilled in the Echani martial arts and trained with her sister Tayshin to improve their combat skills. Although Tayshin was the more skilled martial artist, Moda was the superior pilot of the two. Moda possessed impeccable timing and coordination. During raids, she would race with Callixido Ryss, who frequently challeneged her thanks to his competitive streak. Her older sister was protective of Moda and uneasily suspected that Callixido Ryss's antics were a sign of his attraction towards her."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Moda Maxa wore brown and white robes, brown boots and a brown Thyrsian battle helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Moda Maxa first appeared in the 2018 Star Wars Anthology film, Solo: A Star Wars Story. She was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo. In both the comic book Solo: A Star Wars Story Adaptation 2 and the activity book Solo: A Star Wars Story Look and Find, Moda is depicted riding on her swoop backwards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}