{"url": "Aruteous_Gunnay", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Clerical workers and assistants", "Category:Confederacy of Independent Systems individuals", "Category:Males", "Category:Neimoidians", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Aruteous Gunnay"}, {"tag": "p", "text": "Aruteous \"Rute\" Gunnay was a male Neimoidian member of the Trade Federation, serving as an aide and adviser to Viceroy Nute Gunray and Settlement Officer Rune Haako during the final years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Neimoidian, Aruteous Gunnay was employed by the Trade Federation, rising through the ranks and becoming an adviser to Viceroy Nute Gunray, a leading member of the Separatist Council during the Clone Wars. Accompanying the Council and other members of Gunray's entourage to Mustafar after the death of Count Dooku, the Separatist leadership holed up inside an old mining facility and used it as a base of operations. Following General Grievous' death on Utapau the Confederacy's ally, Darth Sidious, contacted the Council and told them to accept his new apprentice, Darth Vader."}, {"tag": "p", "text": "Upon Vader's arrival, the Sith sealed off all access points within the main chamber and ignited his lightsaber; little did the Separatist leaders realize that Sidious was in fact Supreme Chancellor Palpatine of the Galactic Republic. Having played both sides against each other, Sidious' use of the Council had come to an end. Vader made short work of the guards, droids, Council members and their aides, striking down Gunnay with a slash across the chest that ended his life. His body was later seen when Nute Gunray was cut down as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aruteous Gunnay was portrayed by Colin Ware.[source?]"}, {"tag": "p", "text": "In the Revenge of the Sith video game, four Neimoidians look the same as Aruteous Gunnay in the \"Assassination to Mustafar\" level."}, {"tag": "p", "text": "Gunnay's name is a play on the name of Nute Gunray, and the origins seem to stem from the fact that the otherwise anonymous Neimoidian aide in tan robes is incorrectly referred to as Nute Gunray in Star Wars: Revenge of the Sith: The Visual Dictionary. This error is partially fixed in Star Wars: The Complete Visual Dictionary, where he is identified as \"Rute Gunray\". Whether or not this is meant to name him as a relative of Nute Gunray is unknown. In Dressing a Galaxy: The Costumes of Star Wars, he is properly referred to as 'Rute Gunnay'."}, {"tag": "p", "text": "Daultay Dofine's facemask was reused for Aruteous Gunnay."}, {"tag": "p", "text": "In 2014, the character's full name was revealed as Aruteous in Rogues Gallery: The Devious Neimoidians Revealed, an article written by Tim Veekhoven, Kevin Beentjes and Sander de Lange for the 147th issue of the Star Wars Insider magazine. The name was given under the request of Leland Chee, as he wanted an actual name and not an anagram for Nute Gunray."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}