{"url": "Model_CEC_Class-1", "categories": ["Category:Canon articles", "Category:Corellian Engineering Corporation products", "Category:Escape pod classes"], "nodes": [{"tag": "h1", "text": "Model CEC Class-1"}, {"tag": "p", "text": "The Model CEC Class-1 was a model of escape pod made by the Corellian Engineering Corporation. The modified YT-1300 light freighter known as the Millennium Falcon was equipped with five Model CEC Class-1s. Each pod was built for a single passenger."}, {"tag": "p", "text": "On one of the Model CEC Class-1's escape pods in the Millennium Falcon had it's Ingress/egress hatch inscribed in Clynese that read out \"PROPERTY OF HAN SOLO, PLEASE RETURN\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 34 ABY, during the Attack on the Resistance fleet, Rey would go on to infiltrate Snoke's flagship the Supremacy in an attempt to bring Kylo Ren back towards the light side of the force. Chewbacca performed a hyperspace jump close to the flagship, ejected the Model CEC-Class-1 Rey was in and jumped out. The escape pod used to board the Supremacy would be escorted by five First Order TIE fighters. She'd be held as a prisoner and be brought before Supreme Leader Snoke himself for interrogation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the making of Star Wars: Episode VIII The Last Jedi, Director and Writer Rian Johnson wanted to \"make it clear that this came from the Falcon\" (See Millennium Falcon). So Design Supervisor, James Clyne was assigned to making a new language that'd be inscribed onto a Model CEC escape pod that read out as  \"PROPERTY OF HAN SOLO, PLEASE RETURN\". Rian Johnson specifically said he wanted the language to be \"more like calligraphy\" and \"cursive, as opposed to something as a font.\""}, {"tag": "p", "text": "In the middle of a flight, Clyne looked at existing languages from Thailand and from the Middle East and came up with three variations. Rian Johnson would write back in a email encoded in the language that applauded Clyne's work for being \"Beautiful!!\" that'd go on to make Clyne's day."}, {"tag": "p", "text": "There was discussion that this new language, (now Clynese) could be Corellian."}, {"tag": "p", "text": "The Model-CEC Class-1 was designed specifically to be reminiscent of a coffin, borrowing inspiration from C.S Lewis's Perelandra whose \"main character travels across travels space to Venus in a coffin.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}