{"url": "Model_Q4_hold-out_blaster_pistol", "categories": ["Category:Legends articles", "Category:Hold-out blasters", "Category:Merr-Sonn Munitions, Inc. products"], "nodes": [{"tag": "h1", "text": "Model Q4 hold-out blaster pistol"}, {"tag": "p", "text": "The Merr-Sonn Model Q4 \"Quickfire\", also called the Quickfire-4, was an exceptionally powerful hold-out blaster."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Unlike most hold-out blasters, the Quickfire was not powered by energy cells; instead, the entire weapon was built around a rechargeable power pack. When it ran out of power the weapon would have to be hooked up to a power source using a special cable sold with the blaster. It took ten minutes to fully recharge."}, {"tag": "p", "text": "This unusual configuration meant that the Quickfire was more powerful than typical hold-out blasters. It could also fire ten shots before needing to be recharged while most hold-outs could fire only six. Unfortunately, the weapon had an effective range of only two meters, which was very short even for its small size."}, {"tag": "p", "text": "The Quickfire's front sight was unusually high, and could get caught on holsters and clothing. Since the blaster's range was extremely limited anyway, some users filed down or removed this sight in order to make it easier to draw the blaster quickly."}, {"tag": "p", "text": "Due to its short range but high power, the Quickfire was typically used in tight confines and surprise attacks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The first attempt to build a hold-out blaster entirely around a power pak was the BlasTech HSB-200, but this model was a failure; it was too large for a holdout and had too little power and range to be an effective blaster pistol. Despite this debacle, Merr-Sonn took the concept and used it to develop the Quickfire."}, {"tag": "p", "text": "Because the Quickfire was both powerful and easy to conceal, it was favored by many criminals. For this reason the weapon was more tightly regulated than most hold-outs; carrying one was illegal in some parts of the galaxy and restricted in others."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Quickfire first appeared in Gundark's Fantastic Technology: Personal Gear as the Merr-Sonn Quickfire-4 Hold-out Blaster. The weapon cost 300 credits, was illegal in most areas of the galaxy, and needed replacement power paks when drained. Its price, availability, and history were altered and expanded for the Arms & Equipment Guide, but the two pictures of the weapon were practically identical."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}