{"url": "Modified_Strike_Cruiser", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Cruiser classes", "Category:Interdictor starship classes", "Category:Strike-class medium cruisers"], "nodes": [{"tag": "h1", "text": "Modified Strike Cruiser"}, {"tag": "p", "text": "Modified Strike Cruisers were Loronar Corporation Strike-class medium cruisers modified by the Alliance to Restore the Republic to carry gravity well projectors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Rebel Alliance built stolen gravity well projectors into Loronar Strike-class cruisers, they called the result a \"Modified Strike Cruiser\" for lack of a better designation. The fuselage of this particular modified version of the Strike-class cruiser had been altered to carry gravity well projectors in a pair of bulbous external housings. With these, the ship could be used as an interdictor similar to the Imperial Immobilizer 418 cruiser."}, {"tag": "p", "text": "The first Modified Strike Cruiser was Peregrine, which was refitted by the Rebel Alliance and their Airam allies with gravity well projectors from the captured Interdictor cruiser Compellor. At least one other ship, Sagina, was built to this design at shipyard Calenz in the Nocto system, but it is unknown if it already carried operational gravity well projectors when the shipyard was destroyed."}, {"tag": "p", "text": "After the Airam campaign, there were no recorded sightings of this class. The Rebellion evidently lost the interest and/or capability to build such ships when their shipyard Calenz was destroyed. Instead, they eventually went on to use the CC-7700 frigate and growing numbers of captured Immobilizer 418 cruisers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The exact number of Modified Strike Cruisers constructed by the Rebel Alliance is not known. While the entry in the game's ship database calls it a \"Unique craft\", at least two existed although it is possible that only one ever reached fully operational status: Only the Peregrine was confirmed to mount functional Gravity Well Generators. When the Empire attacked Calenz, Imperial recon fighters discovered a Modified Strike Cruiser named Sagina within the shipyard, which was operable enough to quickly leave the shipyard and enter Hyperspace to flee. It already had the modified fuselage. Two regular Strike-class cruisers, named AGWS-03 and AGWS-04, were waiting in line behind it at the shipyard. Assuming that AGWS stands for \"Alliance Gravity Well (projector) Ship\", this suggests that Sagina was AGWS-02 prior to modification. It is unclear whether Peregrine was AGWS-01, however, because it was modified elsewhere (in the Mobetta system) and retained its name."}, {"tag": "p", "text": "The presence of the other two cruisers also implies that the Rebels did not build Modified Strike Cruisers from scratch at Calenz, but instead used the shipyard to modify existing ships in this way."}, {"tag": "p", "text": "The Rebel Alliance had only captured a single Interdictor Cruiser. Either each Modified Strike Cruiser was to mount only one of the four gravity well projectors stolen from Compellor, and therefore only four such ships were planned, or the Rebels had or expected to have some other source for Gravity Well Projectors to install them on further Strike-class cruisers that were to be modified in this way. The latter assumption is supported by the fact that Flight Group AGWS had two-digit numbers, suggesting more than 9 such ships were planned."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}