{"url": "Modon_Kira", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:House of Kira", "Category:Males"], "nodes": [{"tag": "h1", "text": "Modon Kira"}, {"tag": "p", "text": "Modon Kira was a Human male native of the planet Onderon and a respected and powerful Beast-Lord on his homeworld during the final years of the war between the Onderonian Beast Riders and the military of the walled city of Iziz. Modon was the son of Drokko Kira and in turn had a son, Oron Kira, who fell in love with Princess Galia, heiress to the throne of Iziz. The two arranged to be married at Fortress Kira, Modon Kira's forest stronghold, and the Beast-Lord attended their binding ceremony. The union was subsequently interrupted by the entrance of three Jedi Knights—brothers Ulic and Cay Qel-Droma, and the Twi'lek Tott Doneeta—who had been sent by Galia's mother, Queen Amanoa, to retrieve the princess. Instead, Kira convinced the Jedi to join his side, and they embarked on a peace mission to convince Amanoa to end the war."}, {"tag": "p", "text": "The peace mission failed, however, and Modon Kira was forced to lead his Beast Rider army against Iziz in a climactic battle. Although the Beast Riders took the upper hand, Amanoa turned the tide of the battle by invoking the power of the dark side against Kira's army. The momentum shifted, and Kira's forces were put on the defensive. The Beast Riders regained the advantage, however, when Jedi Master Arca Jeth arrived and employed his skill with battle meditation, which proved to be the deciding factor. After the battle, Modon's son, Oron, and Galia were married under the laws of the Galactic Republic, officially unifying the two warring civilizations of Onderon."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and son's marriage"}, {"tag": "p", "text": "Modon Kira, the son of Beast Rider Drokko Kira, was a Human male born on the Inner Rim planet of Onderon. Modon's father had been cast out of Onderon's capital, the walled city of Iziz, years before for challenging the dark side regime of Queen Amanoa and the worshipers of an ancient Dark Lord of the Sith named Freedon Nadd. Drokko promptly joined the exiled Beast Riders of Onderon's wilderness who were at war with Iziz's inhabitants. Modon grew to become a proud and ruthless man of formidable physical strength, and in time became a respected and powerful Beast-Lord. He also became a successful commander in the ongoing Beast Wars against the forces of Iziz."}, {"tag": "p", "text": "Modon eventually had a son, Oron Kira, who also became a respected Beast-Lord. As enemies of the Onderon Royal Family, Beast Riders were not allowed to enter the city. Nevertheless, Modon and his family traveled in and out of the city for years, trading secretly with the political underground. It was there that Oron fell in love with Princess Galia, heiress to the Onderonian throne, who returned his affections. The two made plans to marry, although it meant that she would be forced to forsake her crown and royal lineage. In 4000 BBY, Modon's son and a team of Beast Riders staged an attack on the Iziz Royal Palace, where they absconded with Galia."}, {"tag": "p", "text": "Galia was brought to Fortress Kira, Modon forest citadel, where the binding ceremony of the Beast-Lord's son and the Princess of Iziz commenced. Modon, his elderly father, Drokko, and hundreds of Beast Riders attended the festivities. However, the ceremony was interrupted by the arrival of three Jedi Knights—brothers Ulic and Cay Qel-Droma, and the Twi'lek Tott Doneeta—who had been sent by Galia's mother, Amanoa, to retrieve the princess. The Jedi swept into the fortress riding boma beasts and grabbed Galia, although they quickly unhanded her when she revealed that she was willingly marrying Oron."}, {"tag": "p", "text": "Modon, having previously been informed of the Jedi's approach, welcomed them and invited them to join the festivities. Oron informed the Jedi that the Onderonian monarchy was under the sway of the dark side, and Modon revealed that he had gathered the Beast Rider forces to launch one final assault on Iziz. The Beast-Lord asked the Jedi to join the attack, although Ulic Qel-Droma still wanted to attempt to peacefully resolve the conflict. The Beast Riders and the Jedi reached an agreement: the Jedi, along with Galia and Oron, would go to the Iziz Royal Palace and try to convince Amanoa to end the war, and Modon's army of Beast Riders would attack Iziz if they failed."}, {"tag": "h3", "text": "The Battle of Iziz"}, {"tag": "p", "text": "Modon's Beast Rider army trailed behind on their winged warbeasts while the Jedi, Oron, and Galia flew to the Iziz Royal Palace in the Nebulon Ranger starship. Modon believed in his heart that the peace mission would fail, and he appeared to be correct as the defense guns on the city walls targeted the Beast Riders on sight. In the royal palace, Amanoa rejected the plea for peace and gave herself over to the dark side, initiating battle in the throne room. Waiting outside of Iziz, Modon received a communication from Galia that the peace mission had failed."}, {"tag": "p", "text": "With war the only option, Kira rallied his Beast Rider army and laid siege to Iziz. Kira's Beast Riders pushed Amanoa's army back to the walls of the Royal Palace, forcing Amanoa to withdraw to the tomb of Amanoa's Sith Master, the deceased Dark Lord Freedon Nadd. There, Amanoa called the dark side down upon the Beast Riders. The Beast Riders' progress was halted by the pall of the dark side, and despite the tide being turned, Kira ordered his army to fight on. Their warbeasts had grown out of control, and the ground soldiers felt sick and confused."}, {"tag": "p", "text": "Although the Beast Rider force had been pushed into a steady retreat and destruction appeared imminent, defeat was averted when Jedi Master Arca Jeth, who had originally sent the three Jedi to resolve the conflict on Onderon, appeared in the Onderon skies in his starship. Jeth utilized the exotic Force power known as battle meditation, which boosted the confidence of Kira's army while demoralizing Amanoa's defenders. The usage of Jeth's battle meditation proved to be the tipping point of the battle, and Iziz fell to Modon Kira's Beast Rider army. After the Battle of Iziz, the marriage of Oron Kira and Princess Galia was consecrated under the laws of the Galactic Republic, officially unifying the two warring tribes of Onderon."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Thousands of years after the final battle of the Beast Wars, one of Modon Kira's descendants, also named Modon Kira, was the King of Onderon. During the Galactic Civil War, this man assisted Jedi Knights Luke Skywalker and Empatojayos Brand and their friend Han Solo attack Imperial forces on the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A powerful and respected Beast-Lord on Onderon, Modon Kira was a proud and ruthless man of great physical strength. Kira passionately hated the established government of Iziz, believing that the monarchy's worshiping of the dark side of the Force had corrupted Onderon. Additionally, his loathing for the monarchy was partly due to his father's banishment from Iziz for challenging the dark side. Nevertheless, Kira supported his son's love for Princess Galia, hoping a marriage between the two could end the Beast Wars and finally bring peace to Onderon."}, {"tag": "p", "text": "Kira was, however, first and foremost a warrior. All his life he had made war, and even though he assented to Ulic Qel-Droma's plan to try and end the war peacefully, Kira firmly believed that the Jedi would fail and eagerly looked forward to the battle to come. Kira took great pride in the Beast Rider force he had assembled for the Battle of Iziz, and when he was informed of the peace mission's failure he excitedly broke the news to his forces. After Queen Amanoa summoned the dark side down against the Beast Riders during the battle, despite the drastic situation they were in, Kira refused to give in, as he had committed everything to the attack."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Modon Kira first appears in Star Wars: Tales of the Jedi — Ulic Qel-Droma and the Beast Wars of Onderon, the first story arc in the Tales of the Jedi comic book series, written by Tom Veitch and released in 1993. Kira only appears in the second and final issue of the arc, wherein he plays a major role. In this appearance Kira is illustrated by Christian Gossett. Kira is later mentioned in both issues of Star Wars: Tales of the Jedi — The Freedon Nadd Uprising, a story arc of Tales of the Jedi released in 1994. Although Kira plays a relatively large part in Ulic Qel-Droma and the Beast Wars of Onderon, he is entirely absent from the Tales of the Jedi audio adaptation, which recounts the events of that story arc. Instead, all of Kira's lines are attributed to his son, Oron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}