{"url": "Mofference", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Galactic Empire", "Category:Meetings"], "nodes": [{"tag": "h1", "text": "Mofference"}, {"tag": "p", "text": "A Mofference was a secret conference held by the Imperial Central Committee of Grand Moffs in the secluded Mofference room of their Moffship. In 5 ABY, a Mofference was in session while the Moffship orbited the planet Tatooine. Grand Moff Bertroff Hissa chaired the meeting, during which the committee discussed the threat posed to them by a group masquerading as the Prophets of the Dark Side, a cult of the dark side of the Force. The Mofference was interrupted when the starship Zorba Express entered the system, as the Grand Moffs were eager to confront the ship's Hutt owner."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Mofference was a secret conference of the Central Committee of Grand Moffs, held in the Mofference room of their Moffship. The committee led a faction of the Galactic Empire that contested Director of Imperial Intelligence Ysanne Isard's claim to the Imperial throne, and the Moffship was their official space vehicle. The Mofference room was large and secluded."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 5 ABY, as the Moffship orbited the planet Tatooine, the Central Committee of Grand Moffs held a Mofference. It was led by Grand Moff Bertroff Hissa, the mastermind of the committee's plot to overthrow Isard. Hissa had recently lost his arms and legs in a pool of acid on the planet Duro after being betrayed by an Imperial Intelligence agent masquerading as Jedgar, High Prophet of a dark side cult known as the Prophets of the Dark Side. The Grand Moff accordingly led the meeting from his new hover chair."}, {"tag": "p", "text": "Another Intelligence agent, himself posing as Supreme Prophet Kadann, had recently made his own claim to the Imperial throne, and several of the Grand Moffs had heard rumors that he intended to disband their committee. During the Mofference, Hissa declared that any supposed Prophet of the Dark Side caught entering the Moffship would be taken hostage. Grand Moffs Dunhausen and Muzzer shared the rumors they had heard, and Grand Moff Thistleborn opined that \"Kadann\" hated the committee due to their apparent support of Trioculus, a puppet ruler who had claimed to be the son of former Galactic Emperor Palpatine. Trioculus was no longer in power, having recently been frozen in carbonite by one of his enemies, the crime lord Zorba the Hutt."}, {"tag": "p", "text": "The Mofference was interrupted by the droid MD-5, who entered the Mofference room and informed the Grand Moffs that Zorba's flagship, the Zorba Express, had been spotted in the Tatoo system. The Moffship trapped the Zorba Express in a tractor beam, and the committee adjourned the Mofference in order to confront the Hutt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The only appearance of a Mofference in a Star Wars story is in 1993's Queen of the Empire, a young readers' book written by Paul and Hollace Davids. The book is the fifth volume of an unnamed book series. The meeting in Queen of the Empire is not the only gathering of the Central Committee of Grand Moffs that occurs in the series, but it is the only one that the narrative deems a \"Mofference\"—a portmanteau of the words \"Moff\" and \"conference.\" It occurs in the book's sixth chapter, which is also called \"The Mofference.\""}, {"tag": "p", "text": "The events of the Davids' series have been perceived as juvenile and criticized by many Star Wars fans, and the term \"Mofference,\" viewed as awful wordplay, has been the recipient of especial mockery yet also celebrated for its silliness by fans and Star Wars authors alike. Author Adrick Tolliver maintained a blog on StarWars.com for several years titled \"The Mofference is now in session!\", and a StarWars.com article written by Pablo Hidalgo in 2007 that explored various superweapons of the Star Wars Expanded Universe humorously asserted that the Tarkin superweapon would be less effective were it named the \"Grand Mofference Center.\" Hidalgo later cited the Mofference as a whimsical and outlandish highlight of the Davids' series in 2012's The Essential Reader's Companion. However, Paul Davids revealed in a 2014 interview with Scum and Villainy Radio that the words \"Mofference\" and \"Moffship\" were intended to be humorous, in the same vein as Admiral Ackbar from being from the planet \"Calamari.\""}, {"tag": "p", "text": "Users of the online Star Wars wiki Wookieepedia have named the site's periodic Internet Relay Chat community meetings \"Mofferences.\" The gatherings are represented by an image of a non-Mofference meeting of the Central Committee of Grand Moffs that originally appeared in The Glove of Darth Vader—the first volume of the Davids' series—and traditionally open with a quotation of Hissa uttered during said meeting: \"I bid you all Dark Greetings!\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}