{"url": "Arvel_Crynyd/Legends", "categories": ["Category:Legends articles", "Category:Green Squadron personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Arvel Crynyd"}, {"tag": "p", "text": "Arvel Crynyd was a Human male who was the leader of the A-wing-filled Green Squadron that served the Rebellion during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the battle over Endor, Crynyd led his squadron into the fleet of Star Destroyers with the objective of disabling their ion cannons on three Star Destroyers, thereby allowing Home One and the Alliance Fleet through to the Star Dreadnought Executor."}, {"tag": "p", "text": "At the climax of the battle, he was leading a strafing run of key locations on the Executor where he attempted to perform a trench run and took out several turbolasers before point-blank fire struck the left side of his A-wing, sending it into a spin. Knowing that his fighter was critically damaged, Crynyd managed to regain enough control of his starfighter to sacrifice himself as he flew it into the unshielded bridge of Executor. The wedge shaped fighter penetrated the bridge and its large fuel reserve ignited in a fireball that annihilated the command tower, killing Crynyd, Admiral Piett and the entire bridge crew instantly. With control lost, and in the middle of a battle maneuver, the mighty warship crashed into the second Death Star, thus turning the tide of the battle."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "He was posthumously awarded the New Republic Medal of Bravery, which was one of the New Republic's most prestigious honors. In addition to this, a new award for acts of conspicuous bravery during space-to-space fighting was created to honor him, known as the Crynyd Award. An Imperial-class Star Destroyer captured at the planet Milagro was also renamed Crynyd in his memory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arvel Crynyd was played by Hilton McRae in an uncredited performance in Return of the Jedi. He should not be confused with Sila Kott, a similar-looking A-wing pilot who was played by a woman but whose lines were dubbed by a man. However, Crynyd's line \"Three of them coming in, twenty degrees!\" is attributed to \"Red Three\" in Star Wars: The Annotated Screenplays. His dying scream is simply attributed to a \"Rebel pilot.\" His nickname during the production of the film was \"Mad Maxx\" — an homage to the film Mad Max — as seen in storyboards for the film."}, {"tag": "p", "text": "Crynyd was incorrectly referred to as \"Rogue Leader\" in Star Wars: Rogue Squadron III: Rebel Strike, specifically the bonus mission to bring down the Executor, because the game reused sound clips of other wingmen in the game. In the same mission, Admiral Ackbar addresses him simply as \"Pilot\". In the Return of the Jedi novelization, Crynyd (as Green Leader) takes the place of Green Squadron pilot Jake Farrell, who follows Lando Calrissian into the Death Star before heading back to the surface in order to draw TIE fighters away."}, {"tag": "p", "text": "Crynyd's name was erroneously applied to an action figure actually based on Rebel pilot Telsij in 1999's The Power of the Force collection. In 2008 he received a proper figure, packaged with his A-wing as part of The Legacy Collection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}