{"url": "Mok", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Pilots", "Category:Smugglers", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Mok"}, {"tag": "p", "text": "Mok was a male Weequay smuggler who served as co-pilot aboard the freighter Far Ranger in 19 BBY with Drach Coven. The two were approached by the Empire to capture the Korun Nick Rostu, and the pair agreed to abduct him. Immediately after turning in Rostu and receiving the promised reward from the Empire's representative, Haninum Tyk Rhinann, Mok and Coven were arrested for smuggling illicit materials, and their reward was taken back. They were then executed by the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Weequay Mok worked with the Human Drach Coven as a smuggler, serving as Drach's co-pilot aboard the freighter Far Ranger. In 19 BBY, Mok and Coven were hired by the Empire to capture the Korun Nick Rostu, who had had dealings with the Jedi Jax Pavan, and was considered a fugitive from justice. Mok and Coven encountered him in a salon in the Coruscant underlevels, and catching him by surprise, they stunned him. They then took Rostu aboard the Far Ranger and headed for the Imperial Palace, where they would meet with Imperial representatives and collect the bounty on Rostu's head."}, {"tag": "p", "text": "On the flight to the palace, Rostu earned Mok's ire by vomiting on the Weequay's boots, which Mok valued very highly. However, Coven was able to restrain him, and they landed near the palace shortly after. There, they turned Rostu over to the Elomin Haninum Tyk Rhinann, who handed over the bounty to the duo. However, Rhinann then placed them under arrest for smuggling and crimes against the Mercantile Guild, and took back their reward. Coven attempted to protest, claiming that the two were authorized members of the Interstellar Trading League, but the Elomin ignored him. In a rage, Mok struck one of the stormtroopers, only to be stunned by several others. The two were taken away, and their ship was confiscated. Shortly after this, they were killed by the Empire, while the Far Ranger was given to Rostu to help him locate Pavan, as the Korun had been tasked by Dark Lord of the Sith Darth Vader to find the Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mok was described by Coven as being very quick to anger. He was greatly maddened when Rostu threw up on his boots, as he valued them quite highly. However, Coven was able to placate him. Mok later became enraged when placed under arrest, and attacked a stormtrooper, although he was quickly stunned. Coven considered Mok very bright, as well as an excellent pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mok's only appearance is in the novel Coruscant Nights I: Jedi Twilight by Michael Reaves. He plays a very minor role in the book."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}