{"url": "Arven_Wendik/Legends", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Alliance Starfighter Corps personnel", "Category:Humans", "Category:Males", "Category:Naboo", "Category:Pilots", "Category:Royal Naboo Security Force officers"], "nodes": [{"tag": "h1", "text": "Arven Wendik"}, {"tag": "p", "text": "Arven Wendik was a Human male from the planet Naboo who served in Bravo Flight as Bravo Three under the Royal Naboo Security Forces during the waning years of the Republic Classic era. In 32 BBY, he participated in the Naboo Space Battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Arven Wendik joined the Royal Naboo Security Forces and served as a Lieutenant in Bravo Flight in the years prior to and during the Invasion of Naboo."}, {"tag": "p", "text": "Arven Wendik was known as an expert in capital ship capabilities, and many anti-warship tactical strategies were credited to him. In 32 BBY, he flew as Bravo Three during the battle against the Droid Control Ship in orbit over Naboo, and ultimately survived the battle. During the battle, he flew the N-1 starfighter Bravo 3."}, {"tag": "p", "text": "During the time of the Galactic Civil War, sometime following the Battle of Yavin in 0 BBY, Wendik stayed at the city of Dee'ja Peak on Naboo. By then, he was a member of the Rebel Alliance and held the rank of captain."}, {"tag": "p", "text": "During his stay in Dee'ja Peak, Wendik employed the help of a spacer affiliated with the Rebellion to deliver forged Imperial permits to the female smuggler Alowi Fintz. Fintz, a well-paid friend of the Alliance, needed the forged permits in order to ship medical supplies off Naboo, and deliver them to where they were needed. Although Fintz lamented not getting paid on time by the Rebellion, and was fearful that the permits would not pass Imperial scrutiny, she nonetheless accepted the documents from the Rebel courier so that the medical supplies could be delivered. With the contract complete, Wendik paid the spacer 25, and asked the individual to speak with him again soon. Wendik soon learned that Imperial starfighters shot down a Rebel pilot over Naboo. As a seasoned pilot himself, Wendik was affected by the news and began to reminisce of his days in Bravo Flight and the Battle of Naboo. Eager to save the pilot, a man named Grel Rommo, Wendik asked his Rebel agent to locate Rommo, and bring him back safely. In the meantime, Wendik would make arrangements to send the pilot offworld. The agent obliged, but was attacked by three Imperial stormtroopers looking for the downed pilot during a patrol. Nonetheless, the Rebel had the upper hand, and managed to kill the three Imperials. Rommo, who had successfully bailed out of his starfighter, was located soon afterwards by the Rebel, and escorted safely back to the city. For completing the daring operation, Wendik awarded the Rebel-aligned spacer 50."}, {"tag": "p", "text": "Although he was grateful, Wendik had further assignments for the Rebel agent. In a worrisome turn of events, Wendik discovered that one of his informants, a female individual named Needia Solum, was captured by the Empire on her way to Dee'ja Peak. The Imperials were then in the process of delivering her to Imperial High Inquisitor Mal Sikander for questioning. Wendik was certain that the Inquisitor would make her talk, thus compromising the Alliance's cover in Dee'ja Peak. In the meantime, intelligence reports concluded that she was being held by several stormtroopers and an officer. Captain Wendik knew that a rescue operation would be extremely dangerous, so he informed his Rebel agent to form a small but skilled strike team. Grasping the severity of the situation, the agent agreed, and embarked on a mission with a strike team to secure Rebel informant. Despite the danger, the task was not impossible for Rebel operatives. Solum was rescued, and her captors, a Warrant Officer and three stormtroopers, were killed. With Solum safely back in Dee'ja Peak, Wendik paid out 75."}, {"tag": "p", "text": "It was later discovered that the Empire had set up a listening post in the wilderness to track the Rebel's ships as they landed nearby. Wendik was eager to have the listening post blasted into pieces. The Rebel agent thought Wendik was out of his mind to propose such a mission. Yet, Wendik asked the Rebel to calm down, assuring the individual that it was only a listening post, not a stormtrooper barracks. By Wendik's estimate, the post was staffed with three or four stormtroopers, and at least a couple technicians. A strike team would once again be required, but Wendik believed that the mission could be accomplished. For the last time, the loyal Rebel agreed to fulfill Wendik's contract. A strike team was assembled, and they set out towards the known location of the Imperial listening post. However, it unclear if the Rebels successfully managed to destroy the post, and kill the Imperial guards and technicians."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arven Wendik was portrayed by Clarence Smith in The Phantom Menace."}, {"tag": "p", "text": "Wendik later appeared as a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who performed a series of quests for Wendik, who now held the rank of captain, had to deliver forged permits to Alowi Fintz, and escort Grel Rommo and Needia Solum to Dee'ja Peak. The final mission, which involved destroying an Imperial listening post, was impossible to complete, as no enemies spawned at the assigned waypoint. The quests were eventually disabled by the developers as a result of this bugged mission. Nonetheless, Wendik remained standing in Dee'ja Peak. In the game, Wendik's appearance differed from that of his depiction in The Phantom Menace. The game depicted him with a lighter skin tone, and more amber-like eyes. Although the player could choose not to do Wendik's quests, this article assumes 100% game completion; except in the case of the final mission, which could not be completed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}