{"url": "Moldy_Crow/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Captured starships", "Category:Hutt Cartel starships", "Category:HWK-290 light freighters", "Category:New Republic starships", "Category:Smuggler starships"], "nodes": [{"tag": "h1", "text": "Moldy Crow"}, {"tag": "p", "text": "The Moldy Crow was a Corellian Engineering Corporation HWK-290 light freighter that was used by Kyle Katarn and Jan Ors on their missions. It was later replaced by the Raven's Claw."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Moldy Crow was a modified HWK-290 light freighter, built circa 10 BBY. It was part of the Corellian Engineering Corporation's Hawk series of transports."}, {"tag": "h3", "text": "Owners"}, {"tag": "p", "text": "One of the ship's earliest owners was the smuggler Roark Garnet, who used it until he inherited the Dorion Discus from his dead gunslinging sister, Neena. He used the Crow as payment for debts incurred to Grappa the Hutt."}, {"tag": "p", "text": "It was eventually stolen from Grappa by Dace Bonearm and IG-72. The Moldy Crow was subsequently abandoned on the planet Teth after the two hunters used it as a decoy to capture Rebel commander Winfrid Dagore and claim the Imperial bounty on her. The Crow then fell into the hands of Lieutenant Palob Godalhi, who gave up the beat-up freighter to the Rebel Dreadnaught New Hope."}, {"tag": "h4", "text": "Use under Kyle Katarn"}, {"tag": "p", "text": "In the hands of the Rebels, the Crow was refitted and acquired by Kyle Katarn for use during the Mission to Danuta. Kyle would grow attached to the ship, and would utilize it later in his mission to destroy the dark trooper project. More often than not, though, it was Jan Ors, Kyle's partner and mission coordinator, who piloted the ship for pick-up and drop-off."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "The Crow was later captured on Ruusan by Jerec's forces and held onboard the Sulon Star during Kyle's and Jan's mission on the planet. When the Star's support systems were damaged, Kyle managed to reach his ship in the hangar and escape the disaster. However, the shockwave of the larger ship's explosion was too strong, and the Crow crashed near the Valley of the Jedi. She was soon replaced by Kyle's new ship, the Raven's Claw."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In early production of the game, the ship was named simply Crow and was intended to be a Baudo-class star yacht. Also, it was not a 3-D polygonal object, but a two-dimensional bitmap sprite rendered from different view angles."}, {"tag": "p", "text": "In the alternate dark side ending of Star Wars: Jedi Knight: Dark Forces II, the Moldy Crow was not destroyed. Instead, Kyle managed to avoid the rocks and successfully landed the ship. It was last seen right before his rematch with Yun."}, {"tag": "p", "text": "The Moldy Crow was slated to appear in Star Wars: Empire at War; however, it does not. It does appear in Star Wars: Empire at War: Forces of Corruption as the dropship for the hero Kyle Katarn, but only in skirmish mode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}