{"url": "Moloch", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Grindalids", "Category:Males", "Category:White Worms"], "nodes": [{"tag": "h1", "text": "Moloch"}, {"tag": "p", "text": "Moloch was a male Grindalid who lived in the galaxy during the Imperial Era. As a member of the Corellia-based White Worms gang, he made sure none of Lady Proxima's scrumrats worked against the Grindalid matriarch."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Moloch was a member of the White Worms gang and was present in the White Worms' den when Han Solo was brought to Lady Proxima after a failed mission. Proxima was angered by Han's failure and ordered Rebolt to hit Han with a staff. Angered by this, Han grabbed the staff from Rebolt and said that he would hit back. Moloch then pulled out a blaster and pointed it at Han. Frightened for Han, Qi'ra ran in front of Moloch and pleaded with him to not shoot Han. Han then grabbed a rock and broke a window with it, exploiting the Grindalid weakness of sunlight. This caused Proxima to burn it up and retreat into the water. Han then took Qi'ra, pushed through the scrumrats, and ran outside the den. Moloch quickly covered his face with armor so he wouldn't burn, and started to pursue Han and Qi'ra. As Han and Qi'ra were escaping in a landspeeder, Moloch opened fire on them, but did not hit them or the speeder."}, {"tag": "p", "text": "Moloch then took Rebolt, Syke, and a pack of Corellian hounds with him in his A-A4B landspeeder to pursue the White Worm deserters. Moloch quickly caught up to Qi'ra and Han in his speeder, and started to knock their speeder with his much more sizable speeder. Moloch proceeded to chase the deserters through the streets of Coronet City. Han eventually took the chase into an industrial manufacturing plant. Han then slanted his speeder to try and fit through a small crevice so Moloch would not catch him. Han's speeder became wedged in the end of the crevice, so he and Qi'ra were forced to continue running on foot. Moloch's speeder was too big to go after them, so like Han and Qi'ra, he and his party were forced to chase the deserters on foot."}, {"tag": "p", "text": "Moloch tracked Han and Qi'ra to the Coronet Spaceport, but was momentarily stopped by a stormtrooper. Moloch informed the stormtrooper of the runaways, and the stormtroopers began to look for Han and Qi'ra as well. Han and Qi'ra were able to get to the gate to leave Corellia, but as they were walking out, one of Moloch's thugs grabbed Qi'ra and brought her to Moloch. The gate then closed so they couldn't get Han, thus allowing Han to escape Corellia and leave them behind."}, {"tag": "h2", "text": "Personality and Traits"}, {"tag": "p", "text": "Moloch was merciless and served as Lady Proxima's right-hand. although he harbored his own ambitions. He was both infamous and feared among the scrumrats as well.[source?]"}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like all Grindalids, Moloch was sensitive to sunlight. He was one of few members of the gang willing to leave the sewers, but had to wear specialized white armor to protect himself from solar radiation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Moloch is played by actor Harley Durst and voiced by British dialect coach Andrew Jack in the 2018 Star Wars Anthology film Solo: A Star Wars Story. The character of Moloch was first revealed in a Denny's-exclusive Topps trading card. Moloch's name was a nod to Allen Ginsberg's 1955 poem \"Howl.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}