{"url": "Arxeum", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Sith starship classes", "Category:Universities"], "nodes": [{"tag": "h1", "text": "Arxeum"}, {"tag": "p", "text": "An arxeum was a mobile university that was dedicated to the advancement of military sciences. Arxeums were produced during the Republic Dark Age by Industrial Heuristics—a corporation controlled by the Quermian Sith Lord Ayanos Bactra—and were used to develop new forms of combat-related technology. In 1032 BBY, Bactra agreed to provide an arxeum to the Sith Lord Daiman, and Daiman used the university as bait to lure the forces of his brother Odion into an ambush on the planet Gazzari. Daiman's arxeum was subsequently destroyed during the battle by an Odionite Death Spiral attack vehicle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "An arxeum was a large, mobile university ship dedicated to the study of war-related sciences where new forms of technology were developed for use by combat forces. The war colleges were expensive to construct; each arxeum was made up of nine inter-connected towers, each the size of a city block. The spires were fused together by a grid of giant crossbars, and each tower bore the arrow-shaped logo of Industrial Heuristics, the company that manufactured the universities."}, {"tag": "p", "text": "Although arxeums were often placed in semi-permanent moorings, they were designed to be moveable so that they could be relocated if conditions warranted it. Powered by nine sizable engines, an arxeum was capable of traveling in both space and in planetary atmospheres. Students for the universities were recruited while young and would often spend their entire working lives aboard a single arxeum designing new military wares."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Arxeums were designed and produced during the Republic Dark Age by Industrial Heuristics, a corporation that was owned by the Quermian Sith Lord Ayanos Bactra. The military universities were put into service across the Bactranate, Bactra's fiefdom in the Grumani sector, and by 1032 BBY there were arxeums in operation nearby the planets Alphoresis, Gazzari and Tergamenion. Industial Heuristics talent scouts were sent out across Bactra's holdings to search for students to serve aboard the arxeums, and an agreement was brokered with the Sith Lord Daiman, the ruler of the neighboring Daimanate state, to permit Industrial Heuristics to look for prospective arxeum-bound pupils within Daiman's territories."}, {"tag": "p", "text": "In 1032 BBY, a Daimanite military testing center on the planet Darkknell was destroyed by the Bothan Narsk Ka'hane, an agent of Daiman's elder brother and rival Sith Lord, Odion. In the aftermath of the attack, Daiman sought revenge against his sibling; after he was contacted by Bactra, the Human Sith requested that Bactra provide him with an arxeum to resolve a weakness in the Daimanite defenses that had been created by the loss of the Darkknell facility. Bactra agreed to give him the Gazzari-based arxeum, and in return Daiman was to provide the Quermian's forces with temporary right of passage across Daiman's holdings. Bactra then planned to utilize this access to allow his subjects to attack the gadolinium production facilities on the world Vellas Pavo, which were rivals of his own gadolinum extraction operation. In truth, Daiman planned to use the arxeum as a ploy to lure his brother into a trap, and he allowed Ka'hane to pass on to Odion details of his acquisition of the arxeum."}, {"tag": "p", "text": "Daiman arranged for the arxeum to be delivered to him on Gazzari, and the Sith Lord believed that, operating on Ka'hane's intelligence, Odion would strike against Gazzari to deny Daiman the vessel. Daiman correctly deduced that Odion's assault would come only after the university had been handed over to him, so that the attack on the arxeum would harm Daiman rather than Bactra. He sent thousands of mercenaries to the arxeum's scheduled arrival site to lie in wait and ambush the Odionite forces. Hundreds of new students recruited from across the Daimanate were also sent to the Gazarri to await the arxeum and become the university's first Daimanite pupils."}, {"tag": "p", "text": "The arxeum was escorted into the atmosphere of Gazzari by four Industrial Heuristics transports, and it landed in a crater on the planetary surface. However, as the students were led toward the vessel by their droid minders, Odion's forces arrived on the planet and engaged the Daimanites in battle. The arxeum came under fire from an Odionite Death Spiral attack vehicle, and the university was soon reduced to molten slag and destroyed. The outcome of the battle was ultimately inconclusive, and the prospective arxeum students were rescued from the battlefield by the Jedi Knight Kerra Holt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The arxeum was created by writer John Jackson Miller, being introduced in his 2012 novel Knight Errant, a tie-in to the Star Wars: Knight Errant comic series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}