{"url": "Aryn_Dro_Thul", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Business owners and executives", "Category:Females", "Category:House of Thul", "Category:Humans", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Aryn Dro Thul"}, {"tag": "p", "text": "Aryn Dro Thul was a Human female who was the wife of Bornan Thul and co-founder of Bornaryn Trading."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Aryn was dating Bornan some time around 11 BBY, when she sang in a restaurant on her home world of Alderaan. She caught the eye of a very young smuggler, Han Solo, who had just escaped an ambush and was repairing his ship. Bornan was behaving like a jealous boyfriend and Solo contemplated trying to steal Aryn away, but decided she was too much of a classy lady."}, {"tag": "p", "text": "After her husband's untimely death in 24 ABY, Aryn ran Bornaryn alone, but had some assistance from her brother-in-law Tyko."}, {"tag": "p", "text": "Her reaction to the disappearance of her son Raynar while on the Myrkr mission went unrecorded, as did her activities during the Yuuzhan Vong War. However, in 35 ABY, she was informed by Tesar Sebatyne that Raynar was alive, but fainted when she was told what had become of him. Nevertheless, she did send out the supply ships that Raynar had requested through Tesar."}, {"tag": "p", "text": "In 36 ABY, Aryn bought out the popular Coruscant restaurant Yuza Bre to spite Cal Omas. After an exchange with Luke Skywalker and Mara Jade Skywalker over Raynar's fate while dining at Yuza Bre, she provided them with a R-series prototype droid. The prototype was useful in that in had an OmniGate that could be used to override R2-D2's sequestered memory sectors."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Aryn Dro Thul had chestnut brown hair, blue eyes, and wore a blue robe with a sash made up of the colors of the House of Thul—purple, gold, and red."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}