{"url": "Aryx/Legends", "categories": ["Category:Legends articles", "Category:Creature stubs", "Category:Birds", "Category:Carnivorous creatures", "Category:Creatures of Cerea", "Category:Domesticated creatures", "Category:Endothermic species", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Aryx"}, {"tag": "p", "text": "Aryx were a species of non-sentient, warm-blooded avians that lived on the planet Cerea. The species was carnivorous, and when at full height, aryx were far taller than Cereans, the sentient species with which they shared their homeworld. Aryx possessed a large yellow beak and a pair of black eyes on their head as well as a large tuft of feathers at the back of their skull. Feathers also covered the rest of their bodies, including a pair of wings on either side of their torso, but excepting the aryx's pair of legs, which were yellow in color like their beak. Each leg ended in three digits, two at the front of the foot and one at the back, each of which had a black talon at its end. Aryx feathers could be white and blue in color, with some individuals having only white feathers and others having a mix of the two colors."}, {"tag": "p", "text": "Aryx were domesticated and ridden by the Cereans, who used them as individual transports when moving around on the vast grassy plains of their homeworld or within cities. Whilst being ridden, the birds wore saddles for their riders to sit on and had reins for the rider to control them with attached to their beaks. One Cerean who rode an aryx was the Jedi Knight Ki-Adi-Mundi whilst he was on Cerea. He rode it after returning to the planet shortly after reaching knighthood in the Jedi Order. During this visit, he was accused of murder but was acquitted and sent to capture the true culprit, another Cerean, named Maj-Odo-Nomor. Whilst attempting to track down Nomor, he rode his aryx to Outsider Citadel, a city built for off-worlders on Cerea, to meet an informant who might be able to help him with the case. Whilst he was there, a group of thugs attacked the Jedi, who used the Force to summon his aryx to defend him. The bird attacked the thugs and was able to wound several of them with its talons and throw others away from the combat. After the fight, Mundi calmed it again with the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}