{"url": "Mon_Cala_monarchy", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic-aligned governments", "Category:Galactic Empire-aligned governments", "Category:Galactic Republic-aligned governments", "Category:Outer Rim Territories governments", "Category:Resistance-aligned governments"], "nodes": [{"tag": "h1", "text": "Mon Cala monarchy"}, {"tag": "p", "text": "The Outer Rim planet of Mon Cala was governed by a monarchy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the 82nd King of Mon Cala, Yos Kolina, was assassinated, and the Quarren refused to support the coronation of his son, Prince Lee-Char. Instigated by the Separatist ambassador and commander Riff Tamson, the Quarren withdrew from the Galactic Republic and a civil war erupted. Eventually, the Quarren defected and returned to the Republic when it was revealed that the Separatists sought to supplant Tamson as the ruler of Mon Cala instead of Chieftain Nossor Ri, defeating the Separatist forces and killing Tamson. After the battle, Lee-Char was crowned as the 83rd King of Mon Cala."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "After the Republic was transformed into the Galactic Empire, Lee-Char refused to submit to the Empire's terms, saying it would only bring Mon Cala to ruin. Hoping to resolve matters peacefully, Moff Wilhuff Tarkin came to Mon Cala on the Sovereign and sent down Ambassador Telvar to speak to Lee-Char and negotiate terms. Despite Telvar's sugar coating, Lee-Char remained adamant and so Telvar decided to report back to Tarkin for further instruction. Meanwhile, Darth Vader had also been despatched to Mon Cala, along with three members of the Inquisitorius and a group of elite stormtroopers to deal with a Jedi insurgency on the planet. They were met by the King's Chief of Security Gial Ackbar, who asked them to leave, stating the Empire had no business being there. When they told him they were there to put down a threat to the Empire, Ackbar quickly dismissed the notion, reiterating the need for them to leave. It was at this time that Telvar's shuttle exploded shortly after take off. Once Tarkin was informed of the situation, he decided to deploy Imperial forces to subjugate Mon Cala."}, {"tag": "p", "text": "At some point, Mon Cala was subjugated and the king was kidnapped and imprisoned."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, Admiral Gial Ackbar, Princess Leia Organa and her team, journeyed to Mon Cala in an attempt to persuade Urtya, regent of Mon Cala, to rebel against the Empire. They had hoped to add the power of the Mon Cala Mercantile Fleet to the Rebel Alliance and retrofit them for combat use. However, Urtya denied their request, fearing for the lives of his people and his king. Organa then decided to contact the rebel spy Queen Trios for help in rescuing the king."}, {"tag": "h3", "text": "First Order-Resistance War"}, {"tag": "p", "text": "During the war between the First Order and the Resistance, General Leia Organa and her Resistance agents went on a mission to Mon Cala in order to recruit the people of Mon Cala to join the Resistance cause. King Ech-Char was initially reluctant to join the cause but decided to join once Chadkol Gee betrayed them to the First Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}