{"url": "Mon_Calamari", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Amphibian sentient species", "Category:Aquatic sentient species", "Category:Mon Calamari", "Category:Sentient species of Mon Cala"], "nodes": [{"tag": "h1", "text": "Mon Calamari"}, {"tag": "p", "text": "The Mon Calamari (also known as Mon Calamarians) were a humanoid, aquatic species native to the planet of Mon Cala. They shared their home planet with the Quarren."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Mon Calamari were a bipedal, amphibious species with high-domed heads, webbed hands and large, goggle-like eyes. In addition to being webbed, the Mon Calamari hand presented three suction-cup like holes on its palm, and featured five claw-tipped fingers: one opposable thumb, two long middle fingers, and two very short outer fingers. Although they were shaped like flippers, their feet could nevertheless fit into boots designed for humanoid feet. The females were distinguished from the males by their more prominent chest areas. The individuals that hailed from the colder polar extremes of their planet were noticeably less colorful than those who came from the tropical zones."}, {"tag": "p", "text": "The Mon Calamari were vigorous swimmers and were capable of living underwater for long periods."}, {"tag": "p", "text": "The Mon Calamari spawned many offspring. For example, Raddus's grandchildren numbered in the dozens. However, because not all spawns were expected to come of age, the Mon Calamari felt loss less keenly than humans, who reproduced comparatively rarely and fewer."}, {"tag": "p", "text": "The Mon Calamari were known to find it offensive to sneeze loudly."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mon Calamari originated on the planet Mon Cala, which they shared with the Quarren species. Both species were influential and most comfortable underwater, where they preferred to build their cities as they preferred to be immersed in liquid. During the High Republic Era in 232 BBY, Supreme Chancellor Lina Soh had a goal of negotiating a new treaty between the Mon Calamari and the Quarren. During the Clone Wars, the Mon Calamari remained loyal to the Galactic Republic while the Quarren sided with the Confederacy of Independent Systems. Taking advantage of the political crisis, the Karkarodon Separatist adviser Riff Tamson stirred up trouble between the two species and funneled Separatist military support to the Quarren chieftain Nossor Ri. Tensions between the two species reached a climax when the ruling Mon Calamari King Yos Kolina died under suspicious circumstances. The Quarren quickly contested his son Prince Lee-Char's claim to the throne and demanded to have a greater stake in ruling Mon Cala."}, {"tag": "p", "text": "In response to escalating tensions between the Mon Calamari and Quarren, the Republic dispatched a peace mission consisting of Senator Padmé Amidala and her Jedi protector Anakin Skywalker. Following the failure of mediation, both sides prepared for war. Prince Lee-Char and Captain Gial Ackbar prepared the Mon Calamari for war. The Republic also dispatched a company of Clone SCUBA troopers under Jedi General Kit Fisto and the Padawan Ahsoka Tano. Backed by Jedi and Republic reinforcements, the Mon Calamari managed to fight off a Quarren and Separatist assault on Mon Cala city. However, Prince Lee Char and his Jedi and Republic allies were forced to retreat when the Quarren counter-attacked with Hydroid Medusases, gigantic jellyfish with electrified tentacles."}, {"tag": "p", "text": "Under the orders of Count Dooku, the Separatist leader Tamson rounded up the Mon Calamari population in Mon Cala City and shipped them to internment camps. Meanwhile, Prince Lee Char, the surviving Mon Calamari forces and their Republic allies retreated to a few caves near the city. Following a failed attempt to smuggle Prince Lee-Char and Senator Meena Tills offworld, the Prince and his Republic and Jedi allies resolved to continue resisting the Separatist occupiers, who had begun enslaving the Mon Calamari population. Despite the arrival of Gungan reinforcements from Naboo, the Quarren and their Separatist allies succeeded in capturing most of the Mon Calamari and Republic/Jedi resistance with the exception of Prince Lee Char and Ahsoka."}, {"tag": "p", "text": "Prince Lee-Char decided to rally Mon Calamari prisoners and to win the Quarren over in order to drive out the Separatist invaders. While attempting to rally prisoners at a Mon Calamari prison camp, he was captured by Separatist forces but secured an audience with Riff Tamson. By this stage, Tamson had strained relations with his Quarren allies by planning to crown himself as the new ruler of Mon Cala. Tamson sentenced Prince Lee-Char to death but his plans were sabotaged by the Quarren chieftain Nossor Ri, who experienced a change in heart and ordered his followers to support Ackbar and the Mon Calamari. Together, the Mon Calamari, their former Quarren foes, the Republic, Jedi, and the Gungans succeeded in driving the Separatist forces out of Mon Cala. Following the battle, Lee-Char was crowned as the new king and restored peace between the Mon Calamari and Quarren."}, {"tag": "p", "text": "At the end of the Clone Wars, with the Jedi exterminated and Palpatine's rise to power as Emperor of the newly formed Galactic Empire, he subjugated and enslaved the Mon Calamari and occupied Mon Cala. In response, the Mon Calamari threw their weight behind the Alliance to Restore the Republic and played an important role in supplying warships to the Alliance Fleet."}, {"tag": "p", "text": "After years of peace a war broke out between the First Order and the Resistance. After the Battle of Crait, General Leia Organa led her depleted Resistance to Mon Cala to rally the Mon Calamari people to her cause and get much needed Mon Calamari cruisers. King Ech-Char was reluctant to offer the cruisers at first, but agreed after they were betrayed and the First Order took over. Following the lead of Aftab Ackbar, the Mon Cala fleet joined the rest of the Resistance and helped with the rebuilding of the Resistance navy."}, {"tag": "h2", "text": "Mon Calamari in the galaxy"}, {"tag": "p", "text": "Notable Mon Calamari included the Rebel Alliance Admirals Gial Ackbar and Raddus, Resistance Colonel Aftab Ackbar, Mon Calamari royals Yos Kolina and Lee-Char, and the engineer Quarrie, who built the first B-wing starfighters for the rebellion. The Mon Calamari also produced force sensitives including Ephru Shinn, Eekar Oki, and Nahdar Vebb. During the last days of the Clone Wars, several Mon Calamari musicians performed the Squid Lake at the Galaxies Opera House in Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}