{"url": "Mon_Calamari_Resistance", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic organizations", "Category:Mon Calamari military units", "Category:Rebel cells", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Mon Calamari Resistance"}, {"tag": "p", "text": "The Mon Calamari Resistance was an anti-Imperial resistance movement, led by Gial Ackbar and key members of the Mon Calamari Council on Mon Calamari during the early years of the New Order. It later became one of the key members of the Alliance to Restore the Republic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Foundation"}, {"tag": "p", "text": "Within months of the establishment of the Galactic Empire and its New Order, Imperial forces began subjugating key nonhuman worlds. First to fall was Kashyyyk, falling almost immediately in the aftermath of the end of the Clone Wars. The Empire viewed the technologically advanced world of Mon Calamari, with its massive shipyards and rich mineral deposits, as an ideal prize. This was further backed by a desire to turn the native Mon Calamari and Quarren into slave labor. The Imperial government hoped that control of the world and its shipyards would aid in maintaining a substantial military force to weaken the power of the Tion Cluster and limit any anti-Imperial worlds along the final stretch of the Perlemian Trade Route."}, {"tag": "p", "text": "Following the Mon Calamarian's failed attempt to negotiate a peaceful settlement with the Empire, a group disgruntled Quarren lowered the planet's defensive shield network when an Imperial fleet arrived. Caught off guard, the world fell to Imperial forces. Native Mon Cals and Quarren alike were enslaved and put to work, devoting their resources to the growth of the Imperial war machine."}, {"tag": "h3", "text": "Early resistance"}, {"tag": "p", "text": "The opening stages of Mon Calamari's resistance to the Empire were relatively passive. For almost two decades, the Mon Calamarians and Quarren sabotaged equipment, instigated industrial delays, and engaged in protests. Gial Ackbar, a Mon Cal naval officer and member of the Calamarian Council, planted the seeds of what would become the resistance. Unfortunately, Ackbar was captured and became the personal slave of Grand Moff Wilhuff Tarkin. The first response from the Empire included a major propaganda effort, during which sentientologist Obo Rin published works claiming that the world had been discovered by Imperial scouts. Such efforts were designed to reduce the worlds several hundred years of history with the Old Republic. When the Mon Calamarians and Quarren still resisted, the Empire chose a more aggressive method of cowing resistance. An Imperial fleet stationed in the Calamari Sector initiated an orbital bombardment, destroying three floating cities."}, {"tag": "h3", "text": "Revolt"}, {"tag": "p", "text": "Instead of extinguishing the resistance, it pushed the world's natives into open rebellion. Following plans first set down by Ackbar and other key resistance leaders, Mon Cals and Quarren put aside their longstanding differences and united to oppose the Empire. At first they had nothing more to fight with than kitchen equipment and tools. Soon after caches of weapons hidden over years of occupation came into use. Imperial warships using the shipyards for repairs were sabotaged. Secret shipbuilding facilities hidden throughout the Calamari system and under the planet's oceans began outfitting starships for combat. Mon Calamari privateers harried the sector's Imperial fleet. Faced with mounting losses and a major uprising, the Empire withdrew from the sector."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Mon Calamarian and Quarren victory over the Empire was a major boost to the worlds of the galaxy resisting the Empire. A few years before the Battle of Yavin the Alliance to Restore the Republic leader Mon Mothma negotiated a deal with the planet, gaining access to the famed shipyards. Yet, the Mon Calamari did not formally join the new Alliance. Fears over Quarren outrage over an alliance with Human resistance groups led the Calamarian Council to avoid becoming full members. However, many Mon Calamari ships and crews entered Alliance service. Warships from the Rebel Alliance Fleet were dispatched to protect the sector, while the famous Ackbar became an unofficial member of the Alliance High Command."}, {"tag": "h3", "text": "Soul of the Rebellion"}, {"tag": "p", "text": "Following the major Alliance victory at Yavin, the Calamarian Council decided to become full-fledged members of the Alliance. The world became one of the few openly Alliance worlds in the Galaxy. Ackbar rose to the rank of admiral and became the Supreme Commander of the Alliance Fleet Command. The world's massive starliners and exploration craft were converted into warships. These Mon Calamari Star Cruisers became the backbone of the Rebel fleet. The devotion of the Mon Cals in particular to the cause of the Rebellion earned them the nickname \"Soul of the Rebellion\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}