{"url": "Mon_Calamari_Star_Cruiser_(stocky)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Mon Calamari cruiser variants", "Category:Mon Calamari Shipyards products", "Category:New Republic starship classes", "Category:Unidentified cruisers"], "nodes": [{"tag": "h1", "text": "Mon Calamari Star Cruiser  (stocky)"}, {"tag": "p", "text": "This type of Mon Calamari Star Cruiser was a vessel used by the Rebel Alliance and the New Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was a type of stocky vessel with an almost cone-like prow. These vessels were almost twice as long as EF76 Nebulon-B escort frigates, but were much more massive than the skeletal frigate."}, {"tag": "p", "text": "The model was equipped with landing gear and could dock inside enclosed hangars. Although about the size of most non-Mon Calamari frigates, these vessels were referred to as \"cruisers\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ships of this design participated in the Battle of Endor, alongside other distinct classes such as the larger Liberty type and Home One type MC80 Star Cruisers."}, {"tag": "p", "text": "Shortly after the battle, some of these vessels were at the shipyards of Fondor, undergoing repairs and maintenance work."}, {"tag": "p", "text": "In 11 ABY, the Mon Calamari still utilized this ship type, as one was docked at the space city in the Nespis system when it was hit in the side by a missile dud shot from the Galaxy Gun."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This ship class was first drawn in concept art by Ralph McQuarrie during the pre-production of Return of the Jedi. A black and white version of the picture was used to depict Calamari cruisers in Galaxy Guide 5 and the design was also seen in the comic adaption of the film."}, {"tag": "p", "text": "Later on, it would again appear in Star Wars 98 and Star Wars: Empire's End."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}