{"url": "Arzid", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Calaron sector planets", "Category:Galactic Empire planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Arzid"}, {"tag": "p", "text": "Arzid was a planet in the Calaron sector of the Outer Rim Territories. It was inhabited by forests of giant macaab mushrooms, tentacle-bushes, and by the dangerous arachnor that feasted on the mushrooms as part of their diet."}, {"tag": "p", "text": "It was also the site of a small Imperial outpost. Death rates among sentries at this outpost, due to arachnors or tentacle bushes, were high enough that being sent there as a sentry was seen as a death sentence."}, {"tag": "p", "text": "In 16 ABY, a squad of E4 baron droids overthrew the administration of the only settlement on the planet, setting themselves up as warlords over its population."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Arzid was a hot, dense world, appearing gray from space. Located in the Arzid system in the Outer Rim's Calaron sector, the world orbited the star Tiki-hava, which was known for ejecting vast green fire storms that cast an eerie space-glow for thousands of miles and could prove a challenge to navigating the system. Arzid was covered by forests of macaab mushrooms, which varied in size from small ground cover comparable to flowers, to towering fungi that were as big as trees. Other flora on the world included the tentacle-bush, which evolved long, thin tentacles to capture small rodents that could also entangle the feet of any nearby humanoid."}, {"tag": "p", "text": "Arzid was also the home of the arachnor, a dangerous two-meter arachnid whose webbing was regarded as among the stickiest and most intractable of any arachnid species in the galaxy. Macaab mushrooms were a primary component of the Arachnor diet, and chemicals in the mushrooms, when digested by an arachnor, were the cause of this stickiness. Though nonsentient, they have an instinctive understanding of how to use fear to direct prey into their webs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Arzid was located in an area of space that was largely unexplored until after 15,000 BBY. This region fell within the influence of Hutt Space at several points in history, including during the Clone Wars. Following the rise of the Empire, Arzid was visited by Senior Anthropologist Mammon Hoole and his assistant, biologist Chlar Kotchmin. Kotchmin became trapped in an arachnor web, and the arachnor had him completely encased in webbing within seconds. Hoole nearly became caught himself, but was able to confuse the creature enough to cause it to wander away. Hoole lacked the tools to free Kotchmin, who suffocated within the shroud of webbing before Hoole could return with an energy slicer from their ship."}, {"tag": "p", "text": "In 5 ABY, Arzid had become the location of a small Imperial outpost. The life expectancy of a sentry at this outpost was so short that being sentenced to five years of sentry duty there was deemed a suitable punishment for Grand Moff Muzzer, who had plead guilty to treason and disloyalty in a show trial held by the Prophets of the Dark Side. Muzzer was sent from Scardia Station under stormtrooper guard to the outpost."}, {"tag": "p", "text": "At the same time, Senate Planetary Intelligence Network (SPIN) medical personnel determined that the only way to permanently disable an Imperial mind control implant in the tooth of Triclops, a prisoner they were holding, was by using a chemical derived from macaab mushrooms. SPIN agents Luke Skywalker, Chewbacca, C-3PO, R2-D2, and Ken traveled by modified Rendili StarDrive Y-wing to Arzid, the nearest source of the mushrooms to their headquarters on Yavin 4. There, Skywalker and Chewbacca were promptly ensnared by tentacle-bushes while Ken became stuck in an arachnor web. Skywalker was able to cut himself free with his lightsaber and rushed to assist Ken, only to himself be entangled by an arachnor. While he was able to kill the beast, his lightsaber slipped from his hand just as the sound of an Imperial command speeder heralded the arrival of Muzzer and his guards at the nearby sentry tower. The stormtroopers promptly investigated the commotion and discovered the ensnared Skywalker and Ken. They stunned the two, used a pulse-mass generator to melt the webbing away, and departed Arzid with the two prisoners. C-3PO and R2-D2 were subsequently able to free Chewbacca, and the trio pursued their abducted companions. Muzzer was subsequently executed by Imperial Intelligence Director Ysanne Isard."}, {"tag": "p", "text": "By 16 ABY, Arzid had developed a single settlement. The administrators of this settlement were overthrown by a squad of Baktoid E4 baron droids. These droids subsequently ruled the planet by force of arms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arzid first appeared in Prophets of the Dark Side, the sixth and final book of the Jedi Prince series by Paul and Hollace Davids, published in 1993."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}