{"url": "As_Long_As_We_Live...", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "As Long As We Live..."}, {"tag": "p", "text": "As Long As We Live... is a comic strip distributed by the Los Angeles Times Syndicate and published in U.S. and Canadian newspapers. The series was written by Don Christensen and drawn by Russ Manning. It was collected in Classic Star Wars: The Early Adventures 8, and was also available through Hyperspace."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke Skywalker and two other Rebel pilots visit Tun Wala, the largest city on Arda-2, to talk with Exec Temora about how the Galactic Empire TIE/LN starfighter's weapons were able to track X-wings by a device his company manufactures and sells to either side. Temora denies any wrongdoing as Arda-2 is neutral in the conflict. Luke finally threatens to bring Princess Leia in on the discussion, at which point Mag Doum, who was listening in on the conversation, decides he must act. He has been purchasing parts from Temora's factory and secretly selling them to the Empire. He sends Kiros Zorad and Zon Zorad to kidnap the Princess and keep her from visiting Tun Wala. The Zorads are so indebted to Mag that they have no choice. Luke reaches Qualo's place, where Leia was waiting, and the two tell him that she has been kidnapped. Luke sees a speeder and gives chase. Kiros had dropped Zon and Leia off at the Catacombs of Colla Di, then led Luke to the Great Torgur Falls, away from the Catacombs."}, {"tag": "p", "text": "Not too long later, Han Solo arrives at Tun Wala in the Millennium Falcon and soon realizes he must pursue Leia as well. Mag Doum lets Solo borrow his speeder—knowing it was a gesture that would alleviate criticism and deflect suspicion. Kiros loses his ship behind the falls, and Luke saves him. Kiros then takes Luke to the Catacombs, where they find evidence that Zon and Leia were attacked by a Kdak. They leave the catacombs convinced their friends were eaten and return to the city. Solo arrived at the Catacombs, and C-3PO saw two people exiting a cave. Zon had saved Leia from the Kdak, but was injured in the process, and now Leia was helping Zon to the road. Han is glad to see Leia, and they head back to the city to find Luke and Kiros challenging Mag Doum. Leia tells Zon to stay hidden. Mag Doum realizes he has been discovered and heads into the factory to reach his ship. Kiros figured out where Mag is heading and hurries to hide aboard Mag's ship. Mag blasts off from Arda-2 and contacts Darth Vader. Kiros was able to push aside Mag and send a message to Arda-2 warning of Vader's impending attack. The Arda-2 executives realize that neutrality is not an option and side with the Rebels—using their technology to ensure that the TIE fighter laser blasts miss the X-wings. Zon volunteers to fly an X-wing, and Leia encourages the Exec to forgive his crime and allow this. Kiros was still convinced his son is dead and sets Mag's ship on a collision course with the bridge of the Imperial Star Destroyer. Zon tries to contact Kiros, but is unable to; distracted, he is quickly shot down by the TIEs. Vader is forced to retreat… for now. Both Zon and Kiros's loss will always be remembered by the people of Arda-2."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "External links"}]}