{"url": "Mon_Mothma_(Imperial-class)", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Galactic Alliance starships", "Category:Imperial-class Star Destroyers", "Category:Interdictor starships", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Mon Mothma (Imperial-class)"}, {"tag": "p", "text": "Mon Mothma was an Imperial-class Star Destroyer of the New Republic Defense Fleet and later the Galactic Alliance, named for Rebel Alliance and New Republic leader Mon Mothma. It played a major role in a number of conflicts in the Yuuzhan Vong War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Mon Mothma was one of the first Imperial-class Star Destroyers to include gravity well projectors. These new projectors required less power and a streamlined form, removing the characteristic globes of the Interdictor cruiser."}, {"tag": "p", "text": "These vessels were distinct from earlier Interdictor Star Destroyers such as the Dominator, which used the basic Imperial-class hull, but had raised globes to contain their gravity well projectors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Completed at Coruscant in 27 ABY, Mon Mothma was one of a group of Star Destroyers named after important New Republic leaders."}, {"tag": "p", "text": "Shortly after completion, Mon Mothma formed the heavy line of a fleet commandeered by Garm Bel Iblis to defend the Jedi on Eclipse Station. Bel Iblis then took Mon Mothma and Elegos A'Kla to Talfaglio against the orders of New Republic Defense Force High Command to transport Talfaglion refugees. Their use was authorized by Chief of State Borsk Fey'lya, although this went unknown until after the fleet successfully saved thousands of refugees and protected Eclipse's secrecy."}, {"tag": "p", "text": "Following the rescue at Talfaglio, Mon Mothma returned to Coruscant to protect the capital against the impending Yuuzhan Vong assault. When the Battle of Coruscant came, Mon Mothma fought bravely against the extra-galactic fleet, but was forced to retreat when the enemy force proved overwhelming."}, {"tag": "p", "text": "The ship joined the New Republic forces regrouping at Borleias under the command of General Wedge Antilles, and participated in the liberation of the planet. Mon Mothmas heavy guns and gravity well projectors proved essential in staving off waves of Yuuzhan Vong assaults against Borleias until Operation Starlancer could begin, when it fell back to the edge of the Pyria system. When the battle had progressed long enough for the Inner Council members to escape, Mon Mothma micro-jumped back to the planet and engaged the Yuuzhan Vong matalok until the repaired Lusankya arrived to take over the counter attack."}, {"tag": "p", "text": "Antilles then moved his flag to Mon Mothma and led his fleet to engage the Yuuzhan Vong at Duro. Once again, Mon Mothma was the center of a ruse to fool the Yuuzhan Vong into over dedicating forces to the Duro system, which were then trapped with its gravity well projectors and destroyed. Mon Mothma took heavy damage, but was repaired just in time for the formulation of Operation Trinity. There, Mon Mothma took the lead in the point Alpha Fleet and was forced to take the brunt of the damage when the fleet was cut off from reinforcements. Once again, it underwent repairs at Mon Calamari, this time for the remainder of the war."}, {"tag": "p", "text": "Seven years later, Mon Mothma fell under the command of Commodore Gavin Darklighter, another former Rogue, before and during the Dark Nest Crisis. It was a part of the Fifth Fleet, under the command of Bothan Admiral Nek Bwua'tu. It participated in the blockade of the Utegetu Nebula in 36 ABY, just before the start of the Swarm War."}, {"tag": "p", "text": "In the engagement marking the beginning of the Swarm War, Admiral Bwua'tu used Mon Mothma as his flagship after his original flagship, the Victory-class Star Destroyer Admiral Ackbar, was commandeered by UnuThul's and Alema Rar's forces during the Fifth Fleet's attempt to destroy the oncoming Killik fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}