{"url": "Monarch_(Star_Destroyer)", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:New Republic starships", "Category:Victory-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Monarch (Star Destroyer)"}, {"tag": "p", "text": "The Monarch was an Imperial Star Destroyer, commanded by Captain Averen and serving under Director of Imperial Intelligence Ysanne Isard. It was one of two ships left to defend Imperial Center against the impending New Republic invasion. It surrendered and was eventually added to the New Republic fleet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Monarch's class was never specified, but well before the battle, Admiral Ackbar stated that approximately seven Victory-class star destroyers were on station defending Imperial Center. It was also stated that both sides' Star Destroyers traded missiles during the battle, something Imperial-class Star Destroyers did not have, lending more credibility to the ship being a Victory-class Star Destroyer."}, {"tag": "h3", "text": "Reputation"}, {"tag": "p", "text": "Although tasked with the defense of Imperial Center, the Monarch was not known for its illustrious reputation or crew. As a result, Isard chose it to defend the planet during the Seizure of Coruscant along with the Star Destroyer Triumph, which had a similarly unimpressive reputation."}, {"tag": "p", "text": "Isard wanted Coruscant to fall to the Rebel hands so that the New Republic would find its bacta resources devastated by an outbreak of the krytos virus. Therefore, it is likely Isard knew the Monarch and Triumph would be either captured or destroyed during the battle. She essentially left them for dead, choosing to instead relocate the superior Star Destroyers Emperor's Will and Imperator."}, {"tag": "h3", "text": "Capture during Coruscant battle"}, {"tag": "p", "text": "During the battle, the Monarch took heavy fire by the New Republic's Star Destroyers Emancipator and Liberator, and Mon Calamari Cruiser Home One. Although the Triumph sustained more damage, the assaults were nevertheless enough to destroy the Monarch's shields."}, {"tag": "p", "text": "Shortly following the power loss and capture of the Triumph, Captain Averen surrendered to the Home One. Admiral Ackbar accepted and Commander Sirlul negotiated the terms of the surrender, which were either unconditional or had insignificant conditions."}, {"tag": "p", "text": "Following the battle and surrender, the Monarch was added to the New Republic fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}