{"url": "Monarch_of_Naboo/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Stub", "Category:Articles needing additional sources", "Category:Monarchs of Naboo"], "nodes": [{"tag": "h1", "text": "Monarch of Naboo"}, {"tag": "p", "text": "The Monarch of Naboo was the king or queen ruling over the planet of Naboo. This monarch served as an elected official since a political restructuring circa 150 BBY and held the powers of Head of State, Head of Government and Commander-in-Chief."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "From the Galactic Republic's point of view, the monarchy of the Naboo people was their single most important institution, and its origins could be traced back to the earliest days of their society. Around 3900 BBY, the Republic explorer Kwilaan, discovered the planet Naboo with a fleet of three starships. Groups of Human refugees fleeing a civil war on Grizmallt, led by none other than Kwilaan, settled in the mountains and great grass plains of Naboo. The settlers established various city-states, which were in a constant struggle with each other. Additionnally, the colonists clashed with the amphibious Gungans, who were native to the planet. In that time of conflict, the Grizmalltian—who had become the Naboo—eventually appointed one woman their leader. She accepted the position and title of Queen, but refused to start a hereditary dynasty, decreeing that her people would elect the wisest among them after her death."}, {"tag": "p", "text": "Despite the early establishment of a meritocratic democracy, the Naboo did shift to a dynastic system. King Narmlé was the earliest known monarch of the line that would eventually be known as the line of kings, a hereditary monarchy solidified in history by King Jafan."}, {"tag": "p", "text": "Upon ending the Time of Suffering, Jafan established a unified kingdom at Theed and the Great Time of Peace ensued."}, {"tag": "h2", "text": "List of rulers of Naboo"}, {"tag": "h2", "text": "Timeline of known rulers"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}