{"url": "Mondo-Mod", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Business owners and executives", "Category:Hutts", "Category:Males"], "nodes": [{"tag": "h1", "text": "Mondo-Mod"}, {"tag": "p", "text": "A Hutt with a masculine personality, Mondo-Mod was the owner of the Arena of Doom, a gladiatorial fighting ring, in the last years of the Galactic Republic. During the Clone Wars, Mondo-Mod came into possession of the coordinates for a secret Confederate weapons factory on Diorda, and was subsequently approached by the Jedi Master Luminara Unduli for the coordinates. Mondo-Mod agreed to give Unduli the factory's location if she defeated three of his best gladiators in the Arena of Doom without using her lightsaber or Force powers, a task that the Hutt thought to be impossible. Despite Mondo-Mod's belief to the contrary, Unduli managed to best her three opponents—a wampa, a durkii, and the gladiator droid Evil Supreme—in three separate matches, forcing Mondo-Mod to reluctantly supply the Jedi with the information she requested. Mondo-Mod was additionally left with his credit accounts depleted, as Unduli's former Padawan, Barriss Offee, had won a hefty amount of credits from him by betting on the successful Unduli in the final match."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mondo-Mod was a wealthy Hutt business executive who lived during the waning years of the Galactic Republic. During that time, Mondo-Mod owned and operated the Arena of Doom, a gladiatorial fighting ring that became known for its extravagant matches. Dozens of spectators and fans came to watch Mondo-Mod's gladiatorial competitions, and the Hutt grew his fortune with the bets that onlookers placed on the matches."}, {"tag": "p", "text": "During the Clone Wars between the Republic and the Confederacy of Independent Systems, Mondo-Mod acquired the location of a secret Confederate weapons factory on the planet Diorda. He was soon approached by Jedi Master Luminara Unduli, who wished to purchase the location of the Confederate arms factory from him. Mondo-Mod agreed to supply the Jedi with the coordinates, but not until she completed a task for him: Unduli had to defeat three of the Hutt's greatest gladiators in the Arena of Doom, without benefit of her lightsaber or utilization of powers over the Force. Mondo-Mod was certain that the Jedi Master would lose one of the matches and be killed."}, {"tag": "p", "text": "Unduli accepted Mondo-Mod's challenge, and she was soon prepared to fight in the Arena of Doom against her first opponent, a wampa from the planet Hoth. With a crowd of spectators watching and betting on the match, Mondo-Mod—overlooking the fighting pit from a pedestal above the arena—ordered that the fight begin. When the wampa charged at her, Unduli grabbed the creature's horns and threw the beast into the arena's wall, immobilizing it. Despite Mondo-Mod's interjection that she had cheated by using her Force abilities against the wampa, Unduli assured him that she had used simple physics to turn the wampa's momentum and size against itself. Mondo-Mod grudgingly allowed her to continue with the challenge."}, {"tag": "p", "text": "The next opponent was a large durkii, which struck Unduli with its massive tail and seriously injured her. When Unduli ran between the durkii's legs, the creature attempted to follow her as she did so, subsequently rolling over and crashing heavily onto the ground. With the durkii bested, Unduli was allowed to move on to her third match, to Mondo-Mod's irritation. The Hutt did not believe, though, that Unduli could defeat her final opponent, as she was too tired and badly injured."}, {"tag": "p", "text": "Unduli's last competitor was a large, multi-limbed gladiator droid named Evil Supreme that towered over her. However, Unduli kicked a small pebble into the droid's faceplate, destroying its primary circuits and disabling the droid. Mondo-Mod was shocked that Unduli had completed his challenge, and he reluctantly provided her with the coordinates to the Confederate weapons factory. The Hutt had Unduli escorted out of the Arena of Doom and ordered that she never return."}, {"tag": "p", "text": "Unbeknownst to Mondo-Mod, Unduli's former Padawan, Barriss Offee, was at the Arena of Doom during the fights, disguised as an anonymous patron. For Unduli's match against Evil Supreme, Offee placed a bet of ten million credits on her former Master. After Unduli defeated Evil Supreme, Sniddly—one of Mondo-Mod's underlings—was forced to pay off Offee's wager, depleting Mondo-Mod's entire fortune. Sniddly later reported the loss to Mondo-Mod, and the Hutt was forced to close the Arena of Doom until he could recover his losses."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male Hutt, Mondo-Mod enjoyed watching Luminara Unduli fight in the Arena of Doom and was sure prior to Unduli's victory over her three opponents that the Jedi Master would die during his challenge. However, the Hutt believed that there was no dishonor in dying in the Arena of Doom, as many great warriors had fallen in the fighting pit. After he learned that all of his wealth had been lost due to Unduli's victory, Mondo-Mod expressed his hatred for Jedi. He had green eyes, brown skin, and lacked hair. Although he understood Basic, he mainly spoke a different language."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mondo-Mod first appeared in Versus, an eighteen-page comic in Star Wars: Clone Wars Adventures Volume 8, which was released on June 20, 2007. Mondo-Mod later received an entry in The Complete Star Wars Encyclopedia in December 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}