{"url": "Monnk/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles that are known by a nickname", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "Monnk"}, {"tag": "p", "text": "\"Monnk\" was the nickname of a clone trooper commander who served as a clone SCUBA trooper Commander in the Grand Army of the Republic during the Clone Wars. Under Jedi General Kit Fisto, he participated in the second defense of the planet Dac when the Quarrens launched a civil war on their homeworld against the Mon Calamari people."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle on Dac"}, {"tag": "p", "text": "After Mon Calamari King Yos Kolina was assassinated, the already shaky relationship between the Quarren and Mon Calamari on the planet Dac began to fall apart. Fearing that a civil war between the Quarren and Mon Calamari was imminent, the Jedi Council dispatched a company of Clone troopers to the planet, under the command of General Kit Fisto, Commander Ahsoka Tano and Commander Monnk."}, {"tag": "p", "text": "The Republic forces were deployed just as the Mon Calamari Capital came under attack from the joint Quarren/Separatist military, under the command of Separatist Commander Riff Tamson.\nThe arrival of Monnk and the Clone army swayed the battle in favor of the Republic, and the Separatist forces were forced to retreat."}, {"tag": "p", "text": "It wasn't long before the Separatist army regrouped and attacked the Republic forces again. This time the Separatist were aided by the monstrous Hydroid Medusa. The creatures were impervious to the Republic's weaponry, and the Jedi Generals, Mon Calamari, and Monnk and his SCUBA Trooper comrades were forced to retreat to the caves. Though Monnk fought bravely, he was apprehended by the Separatist and Quarren forces while fleeing and was to be sent to a prison camp."}, {"tag": "p", "text": "Fortunately for Monnk, as he and a fellow soldier were being taken to the prison camp, the Jedi Generals who had evaded capture along with the Prince Lee-Char, Gial Ackbar, and Meena Tills were prepared to return to the surface to board their cruiser and escape the planet. While looking for an easier way to get everyone to the surface, Kit Fisto noticed that Monnk and another soldier were being escorted by a caravan of Quarren soldiers on speeders. General Fisto easily dispatched Monnk's captors and sent the Quarren's speeders down to his comrades to hasten their escape, while he and Monnk created a diversion. Unfortunately, the ship the fugitives were planning to escape on was destroyed by Separatist air forces. Being completely exposed and taking fire from the Separatist forces, Monnk and the others latched onto the sinking debris of their destroyed vessel and rode it to the cover of the ocean floor."}, {"tag": "h3", "text": "Prison Camp and the Liberation of Dac"}, {"tag": "p", "text": "Realizing that they had no way off the planet, and no way to call for help, Monnk and the others decided their best course of action was to separate into different groups. Monnk, with a fellow clone trooper, went with Fisto, Tano and the Prince. While the Jedi and the Prince conversed in a cave, Monnk and the trooper hid in the weeds just outside and stood guard. The attentive Monnk soon noticed a large number of Mon Calamari and Clone Trooper prisoners and reported his finding to the rest of the group. The Prince was heart-broken upon seeing his people being forced into slavery, so he then decided, without clearance from the Jedi, to get their attention and boost their moral. This fool-hardy show of courage from the Prince caused a skirmish to outbreak. Monnk and the Jedi were heavily outnumbered until the arrival of the Gungan Grand Army that the Jedi Council had sent to reinforce the decimated Republic forces. Monnk fought side-by-side with the Gungan reinforcements and the tide of the battle appeared to be turning in the Republic's favor until Riff Tamson ordered two Tridents to churn the water around the battlefield in order to confuse the Republic and Gungan armies. Monnk again was captured by the Separatists, as were all the Republic-Allied forces on Dac, excluding Commander Tano and the Prince."}, {"tag": "p", "text": "A short while later, Prince Lee-Char and Commander Tano sneaked into the prison camp where Monnk was being held to deliver a message to the prisoners to be ready to fight. Monnk quickly noticed the duo and Ahsoka showed relief upon seeing him. Monnk returned her feelings and informed The Prince and her that they must follow him as he led them to where Ackbar and Senator Tills sat, believing that they would be happy to see the Prince. Unfortunately, the string of mis-fortune continued for the group, and Lee-Char was recognized and apprehended by the Separatist."}, {"tag": "p", "text": "Riff Tamson, wishing to make an example of Lee-Char, ordered a public execution of him and had several prisoners, including Monnk, brought from the camps to witness the event. Monnk was next to Ackbar when Quarren Chieftain Nossor Ri informed him that the Quarren had joined the Mon Calamari's cause to eliminate the Separatists from the planet. Monnk and the other prisoners were freed from their binders and given weapons. When Nossor Ri saved the Prince from his executors, the newly freed Republic, Gungan and Mon Calamari soldiers sprung into action alongside their new Quarren allies. Monnk and Ackbar bravely fought side-by-side throughout the ensuing battle and the joint forces easily outnumbered and overwhelmed the Separatist occupation and succeeded in finally liberating Dac."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Monnk was a SCUBA trooper who served under Jedi General Kit Fisto."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Battle of Mon Cala, Monnk wore clone trooper SCUBA armor and blasters that his company was equipped with. Monnk's armor sported olive-colored markings, as well as eel emblems on his helmet, shoulders and chest."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}