{"url": "Asajj_Ventress/Legends", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Assassins", "Category:Bounty hunters", "Category:Cyborgs", "Category:Dark Acolytes", "Category:Dathomirians", "Category:Females", "Category:Jedi hunters", "Category:Jedi trainees of the Jedi Order", "Category:Near-Human Hybrids", "Category:Nightsisters", "Category:Redeemed Jedi", "Category:Separatist officers", "Category:Slaves", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Asajj Ventress"}, {"tag": "p", "text": "Asajj Ventress was a female Dathomirian Dark Jedi and a valuable Dark Acolyte to Count Dooku. Originally a Nightsister from Dathomir, Ventress was taken as a slave to Rattatak and trained as a Jedi Padawan by Jedi Knight Ky Narec. However, after Narec was slain, Ventress gave into her anger and began walking the path of the dark side; taking up the lightsaber of her dead master, she trained herself in the Jar'Kai style of lightsaber combat, before slaying all the warlords on Rattatak and installing herself as its ruler."}, {"tag": "p", "text": "At the time of the Clone Wars, Ventress served as one of Count Dooku's loyal acolytes and served in the rank of commander in the Confederacy of Independent Systems. She had yearned to learn the ways of the Sith from Dooku and believed if she had proved herself worthy, she would become his apprentice. She even blamed Obi-Wan Kenobi for her failure and made it an obsession to hunt and kill him. Soon after her first encounter on the moon Ohma-D'un, she hunted him on missions on Christophsis, Teth, and Ord Cestus, but never gained the chance to defeat him. In addition, during her struggles with Kenobi, she was also confronted with Kenobi's apprentice Anakin Skywalker, who also defeated her several times, being seriously injured in a duel on Yavin IV. When she especially wanted to meet Skywalker by threatening his lover Padmé Amidala, he was almost killed in another duel on Coruscant and initially disappeared from the scene."}, {"tag": "p", "text": "While Ventress' power continued to grow, the Dark Lord of the Sith Darth Sidious ordered his Dooku to have Ventress terminated due to his great fear of her power. After an unsuccessful attempt to do so, Ventress sought revenge against Dooku for betraying her and received help from the Nightsisters, led by Talzin, to assassinate him. However, further attempts to kill Dooku failed and Ventress was forced to retreat back to her homeworld to recover and join the Nightsisters. When Count Dooku and General Grievous launched an attack on the planet and killed almost every member of the clan, Ventress lived in exile and altered her life in becoming a bounty hunter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the planet Dathomir during the final decades of the Galactic Republic, Asajj was a Dathomirian who was a member of a clan of Nightsisters led by Mother Talzin. While Ventress was still an infant, her clan came under a threat associated with the Siniteen criminal Hal'Sted. In order to ensure her clan's safety, Mother Talzin arranged for Asajj's mother to give her up to Hal'Sted, who took her away from Dathomir to be raised as a slave on the planet Rattatak. At the same time, Asajj was raised by the Ventresses, a powerful native Rattataki warlord family who had most likely given her the surname."}, {"tag": "p", "text": "By 39 BBY, when Ventress was still a toddler, Mandalorian Meltch Krakko, who knew of her origins, heard about her turning into \"quite the warrior.\" However, the young girl could not save Hal'Sted, who was killed during an assault by Weequay raiders, nor could she have rescued her foster parents. As she grieved over her loss, Asajj would have most likely died if it weren't for the arrival of a Jedi Knight named Ky Narec, who had been stranded on Rattatak after his starship crashed. Just when he was ambushed by a Weequay raider, Asajj used the Force to throw the raider into the air. Sensing Ventress's connection to the Force, Narec took the child into his care and decided to train her as his Padawan, despite being cut off from the rest of the Jedi Order."}, {"tag": "p", "text": "The Master and Padawan duo became heroes to the people, ending wars and uniting rival armies. But tales and rumors of Ventress's new powers—her ability to move things with her mind and influence the minds of others—concerned the other warlords. Under Osika Kirske's leadership, they banded together to kill Ventress and her mentor. The warlords managed to kill Narec, but the pain of his loss, combined with Ventress's own undisciplined skills, sent her spiraling down the path toward the dark side of the Force."}, {"tag": "p", "text": "When Narec died at the hands of a Weequay raider, Ventress tattooed her head and left her innocence behind. Her skull was striped with twelve marks, one for each of the twelve warlords she had killed after swearing their deaths. She then hunted down the warlords using a blood trail technique to track them. She developed a hatred of the Jedi, whom she believed had abandoned Narec."}, {"tag": "p", "text": "Shortly afterwards, Ventress became a bounty hunter in the hopes of testing her prowess against a Jedi. But such an opportunity never came to being. Around that time, she had learned of the Jedi's most ancient enemy, the Sith. One day, she vowed, she would become a Sith herself and make the Jedi pay for what they had done to her."}, {"tag": "h3", "text": "Clone Wars (22—19 BBY)"}, {"tag": "h4", "text": "Initiation on Rattatak"}, {"tag": "p", "text": "By the time Ventress established a stronghold on some part of Rattatak, the Clone Wars had begun. After Echuu Shen-Jon killed Sev'rance Tann on Krant, Count Dooku, alias Darth Tyranus, went in search of a new acolyte to serve as a commander in the Confederacy of Independent Systems. He traveled to Rattatak, where he was met by a waiting humanoid co-conspirator. As he sat beside the Count in a nearby observation chamber, this robed individual was silently and swiftly dispatched by a dark, cloaked figure who then took his seat. Dooku noted the presence of the killer, but initially voiced doubt about her combat abilities—until Ventress threw herself into a gladiatorial pit fight in the Cauldron and easily annihilated such foes as Blorga, Grunda Dolma, Nilo, L8-L9, Flalios, Jasper McKnives, Krutch, Anchor Blue, Swyy'm-Ee, and finally Giant Flog."}, {"tag": "p", "text": "Dooku applauded Ventress's talents, but she then went too far by declaring herself a Sith, and claimed that Dooku knew nothing of the dark side. Dooku decided to \"enlighten\" her. After rendering her unconscious with a blast of Force lightning and later defeating her in a duel, Dooku presented her to his Master, Darth Sidious, who approved his choice and ordered her to kill Anakin Skywalker. After her departure, Sidious told Tyranus that it was irrelevant whether or not Ventress succeeded. Either way, Sidious won. In fact, events turned out better than even he had planned. Not only did Skywalker draw on his rage, but Ventress survived and the Sith gained a valuable assassin."}, {"tag": "p", "text": "Before sending her on her way, Dooku gifted Ventress with the twin red blades of his former Padawan, Komari Vosa. The twin blades could be wielded separately or joined together to form a saberstaff, albeit one more difficult to handle than the traditional design, given the curved nature of the handles. Dooku, having taken the blades from Vosa after her fatal fight with the late bounty hunter Jango Fett, now intended that Ventress should use them—much as Komari Vosa had—to be a bane to the forces of the light."}, {"tag": "p", "text": "Shortly after gaining her new lightsabers, Ventress raised an army and took control of the land once held by the warlords who had murdered Ky Narec. She had a castle built on Rattatak, from where she controlled her new kingdom and kept Narec's lightsaber as a memento of the good times with her fallen mentor."}, {"tag": "h4", "text": "Ohma-D'un"}, {"tag": "p", "text": "Jedi Commander Anakin Skywalker and Jedi General Obi-Wan Kenobi were completely unprepared for this new enemy's swift attack on the Gungan colony on Ohma-D'un. Ventress released swamp gas on the Naboo moon, decimating the settlement, then waited with the bounty hunter Durge for Jedi to arrive."}, {"tag": "p", "text": "First off, Durge attacked the strike team, sent the new variations of B2 super battle droids, and released the swamp gas again for the kill. While the Jedi were being occupied by Durge and the droids, Ventress made her first appearance as she decapitated Jedi Master Glaive from behind. Then, she discarded her cloak on Glaive's corpse and engaged Kenobi."}, {"tag": "p", "text": "Ventress lunged at Kenobi and, while admiring his speed for dodging his attack, tried to cripple him in a Force Grip. Durge got a lock on Kenobi and was about to shoot his head off when the late Glaive's Padawan, Zule Xiss, attacked him, causing him only to hit Kenobi in the left shoulder and to have Ventress release her grip."}, {"tag": "p", "text": "As Ventress told Durge to go after Skywalker and ARC trooper Alpha-17 before they could sabotage the Separatist efforts of a Naboo invasion, she used the dark side to bring the dead Gungans to rise up as an army to back her up in taking on Kenobi and Xiss. The reanimated Gungans were destroyed, but the Jedi's strength were being depleted by the swamp gas. Ventress sliced off Xiss' left arm, though the Padawan had managed to hold on. She nearly killed Kenobi, only to be outnumbered by the enemy when the unaffected Skywalker and Alpha-17, who destroyed the Separatist fueling station, arrived."}, {"tag": "p", "text": "Seeing that Skywalker wasn't cowardly as she thought, Ventress vowed to her assigned target she would remember that at their next encounter. She jumped for a ride with Durge, who was using his jetpack to pick her up for the Separatist retreat—though now the Jedi would undoubtedly remember the new face of war. Also, while Durge said that Dooku would consider the mission a failure, Ventress begged to differ, for she knew Kenobi's face and heart."}, {"tag": "h4", "text": "Ruul"}, {"tag": "p", "text": "Ventress trained at Dooku's fortress. Three months after the Battle of Geonosis, she was sent to Ruul, where Mace Windu, Senior Member of the Jedi High Council, was to meet with the Jedi dissidents led by Sora Bulq. Bulq had secretly been converted to the dark side by Dooku after being captured on Bakura following the Battle of Geonosis, and was part of Dooku's plan. As Dooku revealed that Windu had been responsible for \"abandoning\" Ky Narec on Rattatak, Ventress looked forward to killing him. She was sent in as an assassin, whom the dissidents were led to believe had been hired by Windu."}, {"tag": "p", "text": "Windu eventually uncovered the truth, but not before Ventress killed Bulq's former Padawan Mira (to the Weequay's remorse). While Windu confronted Bulq, Ventress later ambushed Rhad Tarn, in whom she saw promise and persuaded him to no longer be a \"weak pawn of the Republic.\" Together, they dueled K'Kruhk and Sian Jeisel, who were too late to save Rhad from Ventress' lies. As Jeisel killed Rhad in self-defense, Ventress wounded K'Kruhk and was about to kill him when Jeisel (whose loyalty Ventress respected) blocked her attack. Then Windu, who had rendered Bulq unconscious in a lightsaber duel, arrived on the scene."}, {"tag": "p", "text": "Though Ventress briefly dueled Mace Windu, she realized she was no match for the Korun Master's skill in Vaapad—even using her deadly saberstaff—and fled Ruul with Bulq in a solar sailer."}, {"tag": "h4", "text": "Queyta"}, {"tag": "p", "text": "Kenobi and Ventress met again a standard month after the Mission to Ruul, on Queyta, where Ventress and Durge fought Kenobi, Nico Diath, Fay, Jon Antilles, and Knol Ven'nari for the antidote to the swamp gas chemical weapon. The Jedi strike team was depleted in moments: Ven'nari sacrificing herself to shield the others from the explosion made by Durge firing on the Skakoan engineers' pressure suits; Diath being knocked into the lava by falling rubble; and Antilles joined Diath seconds later while holding Durge off, long enough for Kenobi and Fay to apprehend Ventress."}, {"tag": "p", "text": "As Ventress ran from the two remaining Jedi, Fay used the Force to send scrap flying at her. One piece stabbed Ventress between the neck and left shoulder. As Fay reached out to Ventress's mind with the Force, stealing her memories and identity, the Dathomirian swore she would crush Fay's heart, right before briefly falling into unconsciousness."}, {"tag": "p", "text": "Kenobi quickly took the antidote from Ventress's hands, only to have Durge separate him and Fay in a lava eruption. Ventress woke up and found Fay laying beaten to the ground nearby, calling out to Kenobi. Fay, a Jedi Master, possibly had made the gravest mistake in her life by not carrying a lightsaber with her. She realized this too late; Ventress seized her chance and stabbed Fay in the back with both of her lightsabers, mortally wounding her. As Fay lay dying, Ventress saw Kenobi hanging on a cliff face. She offered for him to join the Separatists, but he refused. Disappointed, she vowed to kill him at their next meeting, even though Dooku had forbidden her from doing so, and left him to die. After Fay sacrificed the last of her strength to him, Kenobi eventually escaped with the antidote."}, {"tag": "h4", "text": "Duel with Jeht"}, {"tag": "p", "text": "Some time after her mission on Queyta, under orders of Count Dooku, Ventress was to bring Jedi Master Darrus Jeht close to the dark side. She engaged the Jedi in a dogfight and shot him down, causing his Delta-6 starfighter to crash in a jungle locale. She battled him in the woods, striking with such ferocity that she slashed her adversary across the chest, although it wasn't enough to kill him. Wounded, Jett was forced to run."}, {"tag": "p", "text": "Cloaking herself in the Force, Ventress searched for Jett through the mist. She found the Jedi Master hiding behind his wrecked fighter, approached it, and placed her lightsabers in the position that would have been the killing blow. However, Jeht had heard the lightsabers' activation and dodged the blades as they cut through the starfighter's metal plating. Ventress smiled and mockingly asked if Jeht was too exhausted to flee; Jeht took out his violet lightsaber and responded in kind that he wasn't. He used the Force to envelop Ventress in the swamp, giving him time to run. The Dathomirian was clearly angry, but hardly impressed by Jett's feat."}, {"tag": "p", "text": "Escaping from the muck, Ventress chased the tired Jeht and cut a tree, sending it down at him. Jeht managed to avoid being crushed in time. Ventress leaped onto the tree to face Jeht and taunted him on how the Jedi were falling because of their dwindling skill. Jett was already verging on the dark side, but that cutting remark had pushed him over the edge. He Force Gripped the tree Ventress was standing on and hurled it away, causing her to jump free. Ventress moved toward Jeht, expecting him to follow suit. However, she failed to see that Jeht turned the trunk in midair and was then slammed by it in full force, sending her flying and cursing sideways into the mire."}, {"tag": "p", "text": "Ventress got up and once more dampened her Force signature to follow Jeht. She spotted him meditating near a homing beacon he had dropped before his crash. The Dark Jedi went close enough to Jeht and waited for the right moment to strike; she had a plan. Igniting one of her lightsabers, Ventress feigned a decapitation stroke for Jeht to dodge, then lit her other weapon to stab him in the chest and side, penetrating the Jedi's ribs and lungs. In response, an angered Jeht used the Force to push Ventress away and send more mud onto her, before pulling his enemy's lightsaber from his chest. The Jedi levitated and brought a Force storm to bear on Ventress before she could escape. The Dathomirian was pinned to a tree and could only writhe in agony as she was shocked by the lightning. Jeht stopped the storm as soon as a LAAT/i gunship touched down to rescue him, giving Ventress a chance to slip away. The Dathomirian could sense the Jedi crying with guilt."}, {"tag": "p", "text": "Barely managing to survive, Ventress watched the Republic gunship take off. She contacted Dooku via wrist link and reported the mission a success, keeping herself from passing out from the excruciating pain. Jeht was alive, but he would never forget the day he touched the dark side. Satisfied, Dooku told his pupil that she had done well in her \"exercise\"; furthermore, Darth Sidious would pleased. Dooku rewarded Ventress with one day to recover before she was to move on to her \"primary target\" after that. Smiling, Ventress complied and cut the transmission, heading for her concealed Fanblade starfighter to exit the planet."}, {"tag": "h4", "text": "Muunilinst and Yavin 4"}, {"tag": "p", "text": "Four standard months after the Battle of Geonosis, Ventress traveled to Muunilinst, which was currently under siege, to carry out her first command: kill Anakin Skywalker. Flying her Fanblade starfighter, Ventress destroyed every fighter in Blue Squadron over Muunilinst. She then attacked Skywalker and then lured him to the jungle moon of Yavin 4."}, {"tag": "p", "text": "There, she destroyed his starfighter and the clone squad sent by Obi-Wan Kenobi to assist him, then battled the young Jedi through the moon's jungles and one of the ancient Sith Massassi Temples. The duel ended when Anakin gave in to his rage, hurt Ventress's left hand to grab one of her lightsabers after being disarmed, and knocked her from the pinnacle of the temple. Skywalker escaped in Ventress's fighter, leaving Ventress wounded but alive on the planet."}, {"tag": "p", "text": "At some point, Ventress became worshiped as a goddess on the planet Mauk. Although she had been tasked with eliminating Skywalker, Ventress slowly became obsessed not only with the boy, but also with his master—Kenobi. Somehow he was the center of Ventress's troubles, but she could not find any solution on how to dismiss it."}, {"tag": "p", "text": "During almost every mission, she would meet Kenobi and Skywalker, either together or separately. Though she would gladly obey Dooku's order and complete the objective, her hatred towards the two Jedi would get in the way, as fellow Dark Jedi Tol Skorr would point out."}, {"tag": "h4", "text": "Ord Cestus"}, {"tag": "h5", "text": "Arrival on Cestus"}, {"tag": "p", "text": "Ventress was sent in secret to Ord Cestus by Dooku to ensure that the JK-13 security droids, known as \"Jedi Killers,\" were to be kept in production under the Five Families of Cestus Cybernetics for their part in the Separatist cause. The Five Families were sent news by Dooku of sending a representative, but he never said who or when, which gave Ventress the opportunity to sneak in. In truth, however, Dooku planned to use the JK droid presence to have the Republic investigate the Five Families' business, expose their control on Cestus and Separatist allegiance, and force them to bombard the planet as example to seceding worlds, which would convince other systems to join the Separatist cause. Then, the Separatists would clone the tissue of Dashta eels for many JKs in the droid army and would no longer need Cestus."}, {"tag": "p", "text": "As Ventress arrived at the Tolmea Mountains, which held the secret base of X'Ting gang leader Trillot, she was led to him by his brother, Fizzik. She presented Trillot a gift from Dooku himself: salt, water, and windsnakes. As Trillot accepted the honor, his bodyguard Remlout, hearing that Ventress never turned down a challenge, offered her one of hand-to-hand combat. After noting Remlout had study the martial art of Tal-Gun on Xagobah by the looks of his body tattoos, she accepted. She also promised Trillot that she would spare Remlout's life, since it was \"hard to find a good bodyguard these days.\""}, {"tag": "p", "text": "Though Remlout was said to be Trillot's best bodyguard, he could not lay a finger on Ventress. She avoided his every charge and, through the Force, rendered him moribund and spasmodic."}, {"tag": "p", "text": "As Remlout was taken to a medic, Ventress and Trillot discussed the business at hand. However, once Trillot mentioned that Obi-Wan Kenobi had come to Cestus to negotiate with Regent G'Mai Duris, Ventress saw a chance to put an end to her obsession. She knew right away that Kenobi would try to stop the JK production line, so she claimed that she would first take him down, then speak with the Families."}, {"tag": "h5", "text": "Manipulations"}, {"tag": "p", "text": "Ventress lived in Trillot's guest room during her stay. When she heard that Kenobi and Barrister Doolb Snoil were invited by Regent Duris to a ball held in their honor, she decided to toy with Kenobi, using the Quy'Tek meditations that Dooku taught her during her dark side training to hide her presence. She attended the ball, disguising herself in a X'Ting mask, where the Jedi Knight almost sensed her, while Fizzik awaited her outside. This troubled Kenobi for a moment, much to Ventress's delight."}, {"tag": "p", "text": "The next day, at Trillot's base, Ventress sensed Kenobi's presence here, cloaked her own, and saw him asking Trillot, who was now in female form, to supply him with a Baktoid radiation suit so that he could infiltrate the Clandes Industrial factory and find information that would expose the Five Families' allegiance with the Separatists. When Kenobi left, Ventress told Trillot that in order for her trap to spring, the crime lord would have to give Kenobi what he needed so that he could trust her."}, {"tag": "p", "text": "Ventress followed Kenobi to the Cleft Head cantina in ChikatLik, which had plenty of crowds for her to blend in. She went on playing her dangerous game of masking her existence around the Jedi Knight and when she sensed that he and Regent Duris were beginning to form a trust, she was determined to break it."}, {"tag": "p", "text": "Master Kit Fisto, a member of the Jedi Council, devised a plan of his own to expose the Five Families-Separatist alignment. He captured the Five Families members, disguised as a Dark Acolyte named Nemonus sent by Dooku to \"execute\" them. Kenobi confronted him and in an orchestrated duel, Kenobi sent Fisto to run away and thus, with this, it appeared that Ord Cestus would shift its attention away from the Separatists. Unfortunately, they were unaware that Ventress had placed a hidden holocam in Kenobi and Fisto's \"fight.\" Ventress then delivered the camera footage to Caiza Quill, one of the Five Families members and a cousin of Regent Duris. When Quill presented this footage to Duris, the deal with the Republic was called off, thus forcing Kenobi and Barrister Snoil to seemingly leave together."}, {"tag": "p", "text": "However, Ventress knew that Kenobi would stay on Cestus and send Barrister Snoil to show evidence of the Five Families' counterfeiting as part of Cestus' economy, so she sent a drone fighter of probe droids to destroy the Republic Consular-class cruiser, with Snoil in it. However, Snoil managed to flee in an escape pod to the planet's surface, while Fisto's secret strike team mixed of a clone trooper squad, the Desert Wind anarchist movement, and Cestian miners prepared to wage a rebellion against the Five Families after the diplomacy options failed."}, {"tag": "p", "text": "Ventress met with the Five Families at their most private base in ChikatLit. She brought assurance that if the JK droids were used to conduct fair trade, the Five Families would be rewarded. She also warned them that any attempt to use as mere commerce would result in their execution. Furthermore, she discussed the matter of the Cestian resistance's three recent attacks and asked for Cestus' map data so she could find the resistance's hideout through the Force."}, {"tag": "p", "text": "Once she had found that the resistance were hiding at Desert Wind's base in the Dashta Mountains, Ventress ordered that the specially-made plastoid infiltration droids designed and ordered by Dooku be tested and later sent them, with the JKs, after the Jedi and their allies. The resistance's casualties were low, but among them was Barrister Snoil, who gave his life to save Kenobi."}, {"tag": "p", "text": "Shortly after, Ventress met with Regent Duris in person. She explained that if the information of Cestus Cybernetics' fraud were to be brought to the Senate, the consequences would be very simple, but severe: the Republic would bombard the planet to stop the droid foundries; the Hive Council would suffer dearly; and Duris would \"personally bear the full brunt of Count Dooku's wrath.\" Then, the Dathomirian assured Duris that if Cestus ever needed help, Dooku and the droid leader General Grievous would \"provide\" them with resources."}, {"tag": "p", "text": "Kenobi and Fisto traveled to Trillot's base, where they came to buy the Baktoid suit Trillot \"promised\" to supply earlier. When Trillot lured the two Jedi to a huge hive cavern beneath ChikatLik, Ventress sprung her trap as she activated a Xythan force shield to trap her opponents. Following her wake were a pair of young male X'Ting loyal to the Hive. She then ordered Trillot to leave and said that she would use the gang leader's protocol droid to translate her orders to the thugs."}, {"tag": "h5", "text": "Engaging the Jedi"}, {"tag": "p", "text": "After Ventress revealed Dooku's plan to the Jedi, she ordered the X'Ting thugs to attack them so that she may have enough time to study their movements before engaging them in combat. The two Jedi knew they couldn't slaughter the X'Ting for their loyalty to the Hive, so they fought them without their lightsabers. But even when unarmed, it did no good from preventing Ventress from learning their lightsaber technique."}, {"tag": "p", "text": "Fisto was able to break away from the pack, activated his lightsaber, and pursued Ventress. However, since he had never faced Ventress before, his one lightsaber was unable to block both of hers. She was able to wound Fisto in the arm. As she came in for the kill, Fisto rolled off a dock and into an underground river."}, {"tag": "p", "text": "Meanwhile, Kenobi broke free and told Ventress to tell the young X'Ting to leave, but she demanded to know why. Then, something in Kenobi's answer struck a nerve in Ventress that forced her to have the droid translate the X'Tings' order to leave."}, {"tag": "p", "text": "As he fought Ventress, Kenobi gained leverage initially. He blocked all the strikes, and pinned her lightsabers down. She freed her right hand nearly decapitating Kenobi. As he moved to the left, Ventress's spin-kick caught him and knocked him onto the dock. Sensing, through the Force, that Kenobi was in trouble, Fisto summed up some strength and severed the dock. It collapsed, sending Kenobi and Ventress into the river. Fisto then lost consciousness."}, {"tag": "p", "text": "Kenobi fitted a rebreather into his mouth, but since Ventress held two lightsabers, she could not. Obi-Wan pressed the sudden advantage until she dropped one of her lightsabers temporarily to grab her rebreather. In the murky water, Kenobi struck a blow against her ribs. Ventress headbutted Kenobi, causing them both to drop their rebreathers. Fighting underwater with no air, they realized that the first one to go up for air would be vulnerable. Seeing that she was stuck, Ventress released a black ink from her belt, and escaped."}, {"tag": "p", "text": "After the deaths of the Five Families and ARC trooper A-98, who sacrificed himself by giving the supercruiser Nexu the location of their hideout to bombard, Ventress resurfaced from the water and confronted Trillot at her bedchambers. She raised one of her lightsabers and executed the X'Ting gang leader not just for failing her, but for accidentally seeing her dreams of death and destruction. Then, she had broken two of Trillot's guards close to her ship when she prepared to leave Cestus to rendezvous with Dooku and General Grievous."}, {"tag": "p", "text": "During takeoff, as Ventress started wondering how Kenobi was able to remain firm back in their duel, her hands were shaking with either fear or anxiety. Seeing that this was not like her at all, she dismissed the feeling with the need and hunger for action, whatever the assignment."}, {"tag": "h4", "text": "Jabiim and afterward"}, {"tag": "p", "text": "Three months later, Ventress became one of the Separatist commanders in the Second Battle of Jabiim, aiding Alto Stratus, leader of the Jabiimi Nationalists, in an effort to have Jabiim break from the Republic. Eventually, they had succeeded."}, {"tag": "p", "text": "When Obi-Wan and Alpha-17 were caught in the explosion of a fallen All Terrain Armored Transport, Ventress finally managed to capture the two, and transported them to her castle on Rattatak for interrogation and torture. While there, she placed a Sith torture mask on Kenobi and lied to him that Skywalker had died on Jabiim with the rest of the Padawan Pack, in order to break him and, she hoped, show Dooku how worthless the Jedi Knight was. Everyone in the galaxy believed Kenobi was dead, even Dooku and she wanted to save the revelation of the Jedi's survival as a surprise for the Count. Then, she would at last be accepted as Darth Tyranus's official Sith apprentice and a Dark Lord of the Sith."}, {"tag": "p", "text": "However, one day, after Alpha-17 refused to tell Ventress the location of the Republic medical foundries under interrogation, she promised him a slow death. Afterwords, Aidus suggested to Ventress that Kenobi be shot so that they could meet up with Durge. But Ventress explained her reasons and went to spar with a couple of Bugnaughts. While at that, she was aware that Kenobi, Alpha-17, and Osika Kirske had caused a prison break and caught up with them. Though she managed to avenge her parents' deaths by slaying Kirske, Kenobi stole both Ky Narec's lightsaber and Ventress's own starfighter, using the latter to reach Riflor, and leaving Ventress broken and tearful on the landing platform."}, {"tag": "h4", "text": "Praesitlyn"}, {"tag": "p", "text": "During the Battle of Praesitlyn, Ventress ordered Muun Admiral Pors Tonith of the InterGalactic Banking Clan to give her a report on how he was faring. Tonith was rather fascinated by Ventress's looks and wished that she could aid him in the invasion, but Ventress was busy somewhere else at the moment."}, {"tag": "p", "text": "Later on, when Ventress contacted Tonith again, the Admiral boasted of the battle turning to his favor and said that he may not need the reinforcements that Dooku promised him after all. Ventress, hardly impressed, responded to Tonith that the next time the two would meet, she would be his executioner. The Admiral scoffed of her remark, but knew deep inside that she meant it."}, {"tag": "h4", "text": "Vjun"}, {"tag": "p", "text": "As the war continues, she killed Jedi Padawan Jang Li-Li in a space dogfight and brought the severed hand and damaged lightsaber to Dooku for the deed, though Dooku mourned for Jang's death in a way since he knew her as a child before leaving the Order."}, {"tag": "p", "text": "Ventress was with Dooku at Château Malreaux on Vjun, a planet strong with the dark side. She was told to bring Jedi Master Jai Maruk before Lord Tyranus alive so that his \"treaty\" between him and Yoda would be complete. However, after scarring Maruk, she believed that he should have been made \"number seventeen\" in her list of dead Jedi."}, {"tag": "p", "text": "Dooku's plan was set in stone. Ventress watched from her ship, Last Call, as what seemed to look like Yoda entered a starship. She then followed him to Ithor and destroyed the escort pilots. But after realizing through the Force that \"Yoda\" was actually an actor named Palleus Chuff, playing as a decoy, she then decided that it would be best to capture him and destroy the ship to make it look like Yoda had perished."}, {"tag": "p", "text": "The events on Ithor caused the Republic spirit to deteriorate, much to Ventress's liking. However, she was furious when news stated that she was known for killing eleven Jedi. Despite that, she continued her objective and hired a FIII Footman droid named Solis to give her the location of the real Yoda's whereabouts."}, {"tag": "p", "text": "Ventress took eighteen A-series assassin droids on the Last Call and unsuccessfully ambushed Grand Master Yoda on Phindar Station, but managed to slay Masters Maruk and Maks Leem. Unbeknownst to Ventress, Chuff escaped and helped Yoda destroy the Last Call."}, {"tag": "p", "text": "After Whie Malreaux watched his Master Leem die, he struck at Ventress, but she suspended him. Before leaving, she gave Whie a chance to turn to the dark side, since she could see that he was \"indoctrinated\" by the Jedi."}, {"tag": "p", "text": "Recalled to Château Malreaux on Dooku's orders, Ventress was given the liberty to toy with the Padawans Whie and Scout when they were captured. When Scout tried to reach her lightsaber, the Rattataki clawed her in the head, causing her to bleed, and later held her in a Force grip when she \"spoke out of term.\" She then ordered Whie's own Footman droid servant Fidelis, whom she thought was the one that gave her Yoda's location, to shoot himself with a Neural-Net eraser for his loyalty to the Malreaux family."}, {"tag": "p", "text": "After sensing Whie's feelings for Scout, Ventress decided to enjoy herself by telling the boy to give in to his dark nature and kiss the girl he adored. When the Padawan resisted, she was about to order the droids to kill the Padawans, when Solis came to the rescue and shot the droids down. Solis then held Ventress off while the Padawans managed to run. He sliced her on the left knee with a flechette, but was destroyed as she fired the Neural-Net eraser at him."}, {"tag": "p", "text": "After placing a piece of cloth from her shirt on her wounded knee, Ventress went after the Padawans. Unfortunately, she met up with both Skywalker and Kenobi, but turned tail when faced with the prospect of fighting them both at once in her condition."}, {"tag": "h4", "text": "Rendili"}, {"tag": "p", "text": "During the initial stages of the Battle of Rendili, Obi-Wan Kenobi, now a member of the Jedi Council, discovered his old friend, the renegade Quinlan Vos aboard the exploration vessel Titavian IV. Vos had betrayed Dooku's trust, and the Count had sent Ventress and Tol Skorr to eliminate him. Ventress and Kenobi battled yet again, though this time Ventress felt assured of victory and rode a ferocious rancor in pursuit of her nemesis. Kenobi and Vos escaped, but Ventress put a homing beacon on their ship's hull and followed them back to Coruscant. However, she had a little argument with General Grievous while on the way."}, {"tag": "p", "text": "Upon her arrival, Ventress was unable to get at either Kenobi or Vos, as both were within the Jedi Temple. Instead she tracked down Anakin Skywalker, ambushing and engaging him in a duel in the upper underlevels of one of Galactic City's industrial sectors. Ventress dueled Skywalker and preyed upon the young Jedi's fears, leaving a scar from her lightsaber down the side of Skywalker's face, though she claimed she could have taken his head. When she taunted Skywalker with threats to kill his wife, Skywalker again used his anger to defeat her. He entwined her body in thick electric cables, then sent her plummeting down into the murky lower levels. As on Yavin IV, Ventress barely survived her fall, but was this time too weak to continue fighting without assistance."}, {"tag": "h4", "text": "Christophsis"}, {"tag": "p", "text": "On the planet of Christophsis, Ventress led Separatist efforts to claim the important planet for the Confederacy. The Dark Jedi recruited the clone sergeant, Slick, to the Separatist cause and through him learned vital information regarding the Republic's defense of the planet. Asajj used this information and had her forces conduct a surprise attack on the secret location of Jedi Master Obi-Wan Kenobi and his troops; however, the timely intervention of Anakin Skywalker ensured that Kenobi and a portion of the clones with him escaped."}, {"tag": "p", "text": "Realizing that there was a traitor amongst their men, Kenobi and Skywalker traveled to the Separatist headquarters on the planet to learn if they could discover the spy's identity. En route, the Jedi became aware of numerous droids noting their position, and doing nothing to stop them. Their fears that they were falling into a trap were confirmed when they arrived at the Separatist stronghold, there being no guards or resistance. Within, Ventress confronted the pair and engaged them in a violent duel."}, {"tag": "p", "text": "The two Jedi constantly kept her on the defensive, forcing her to retreat. However, Asajj's main goal had truly been to delay the Jedi, so that Slick could safely destroy the weapons depot at their base; and while he succeeded at this, he was captured. Following the duel, Ventress ordered General Whorm Loathsom to march on the Republic forces, before leaving the planet to involve herself in Dooku's plan to ally with the Hutt clans."}, {"tag": "h4", "text": "Teth"}, {"tag": "p", "text": "Ventress took part in Dooku's plot to gain Jabba the Hutt's support against the Republic. She took custody of Jabba's son, Rotta from agents of his great-uncle Ziro, and held the Huttlet in an old B'omarr Monastery on the planet Teth. When Anakin Skywalker and his Padawan Ahsoka Tano arrived to rescue Rotta, Ventress arranged for the espionage droid 4A-7 to edit a recording of Skywalker and Tano to show that they were kidnapping the child. She sent the footage to Dooku so that Dooku would use the footage to convince Jabba of the Republic's treachery."}, {"tag": "p", "text": "Skywalker, Tano and Rotta made their way through the monastery to reach a landing pad, and then escaped from Ventress on a flying Can-cell and headed towards another mesa in the distance. As Skywalker, Tano, and R2-D2 escaped the planet with Rotta on a stolen ship, Ventress confronted Obi-Wan Kenobi, who had arrived with reinforcements. She dueled with him but fled the battle on a Vulture droid after she was disarmed of one of her sabers."}, {"tag": "p", "text": "As the Battle of Teth came close to Republic victory, Ventress contacted Dooku that Skywalker was on his way to Tatooine. Knowing that Jabba was watching, she also lied that the Jedi had killed Rotta. Dooku knew right away Skywalker was bringing the Huttlet back to his father, so he told Ventress that he would deal with her later."}, {"tag": "p", "text": "Immediately following her escape from Teth, Ventress visited the Kashyyyk system to meet with the Wookiee traitor Quaagan and take possession of Bitt Panith's secret Krossen project. Here she crossed paths—and blades—with Jedi Master Bant Eerin and her Padawan."}, {"tag": "h4", "text": "Rugosa"}, {"tag": "p", "text": "Some time after the Battle of Teth, Asajj Ventress challenged Grand Master Yoda on the coral moon, Rugosa, for the allegiance of Toydaria. It was decided that if her best troops could defeat Yoda, then King Katuunko would join the Separatists, if not he would join the Republic. She assured the King that she would give Yoda a fair fight, but when it came to darksiders, she wasn't bound to keep her word for long."}, {"tag": "p", "text": "After Yoda destroyed her droid army and Katuunko swore allegiance to the Republic, Dooku ordered Ventress to slay the Toydarian King. As loyal as she was, she was unsuccessful. Yoda showed up just in time to stop Ventress by momentarily freezing her mid-swing and disarming her of her lightsabers before quickly returning them to her, demonstrating his superior power and skill with the Force. After imploring her to surrender, Ventress, realizing she was outmatched, activated an explosive which sent a hill of boulders crashing down towards Yoda and Katuunko. While Yoda was occupied using the Force to stop the rocks from crushing them, Ventress was able to escape and fled the moon in Dooku's solar sailer, which the Sith Lord had loaned to her."}, {"tag": "h4", "text": "Kamino"}, {"tag": "p", "text": "After her mission on Rugosa, Ventress traveled to the clone troopers' homeworld of Kamino, acting as a spy and reporting directly to General Grievous. The cyborg general was preparing his fleet to take over a scout base to prevent the alert of the clone homeworld. Their ultimate goal was to capture Kamino and destroy the cloning facilities to halt the Republic's army production for good. The plan eventually failed as the rookie clones protecting the station managed to destroy it and all the droids assaulting it, alerting the Republic."}, {"tag": "p", "text": "Ventress later accompanied Dooku to Gwori, where Overseer Juhm had captured Kenobi and Skywalker, holding them in place for Dooku so that the Sith Lord may personally perform the execution. However, upon arrival, both master and student had learned that Juhm had failed to protect the shipyards from being destroyed by the Republic. Ventress was given the order to terminate the Overseer, which she gladly did. Dooku used this as a lesson to teach his young student on the importance of assistance from allies. The Dathomirian then stood silently as her mentor contacted Sidious of this development."}, {"tag": "h4", "text": "Mon Gazza"}, {"tag": "p", "text": "Ventress was sent to Coruscant to retrieve a data file holding imminent republic offensive timetables from a senator and his aide Messo. The Senator gave it to Ventress in exchange for the safety of his family. Ventress said that they would be safe as long as his cooperation continued; as a result, the Senator was betrayed Messo, who was in league with the Separatists. However, they were followed by Jedi General Ki-Adi-Mundi and a squad of clone troopers. Just as they were coming, Ventress mortally wounded the senator and Messo fled with the data file. Mundi and Ventress fought until she destroyed the clones' gunship and fled."}, {"tag": "p", "text": "After that, Count Dooku contacted San Maxus (alias, Agent 16) about the data file, Dooku sent Ventress to retrieve from him on Mon Gazza. Ventress went to during the podrace and retrieved. Ventress then fought Ahsoka Tano on Maxus's podracer in the Mon Gazza Speedway. Just as Ventress was about to finish Ahsoka, Anakin Skywalker used the Force to destroy the datafile. As Skywalker was coming she cut one of the pods of Maxus's podracer, jumped onto a vulture droid and left Maxus for dead."}, {"tag": "h4", "text": "Khorm"}, {"tag": "p", "text": "After a few failed missions, Ventress was finally allowed the chance to redeem herself by helping Unger Gout to defeat the Khormai resistance and the Jedi. She killed Jedi Knight Tauht and captured Captain Kendal Ozzel, whom she forced to give up information on the activities of Masters Plo Koon, whose left arm she injured while causing an avalanche, and Kit Fisto. However, she was forced to retreat when the Jedi destroyed the complex, allowing the Republic to land safely without any storm problems. On the way out, she sliced out the right eye of Clone Commander Wolffe, causing him to have a cybernetic replacement in his scarred socket afterword."}, {"tag": "h4", "text": "Rescuing Gunray"}, {"tag": "p", "text": "After being captured on Rodia by Senator Padmé Amidala, Trade Federation Viceroy Nute Gunray was escorted by Jedi Master Luminara Unduli and Ahsoka Tano, to be delivered into the custody of Captain Faro Argyus of the Senate Commandos so he can be taken to Coruscant for trial."}, {"tag": "p", "text": "Upon being informed by Darth Sidious of the matter, Dooku decided to dispatch Ventress to either rescue the Viceroy or silence him before he was to be interrogated by the Jedi. Though Sidious doubted Ventress's ability after having failed before, Dooku assured his master that Ventress would succeed and, after the hologram of Sidious faded away, told her to prove her worth of being his apprentice. Thus, she took a group of boarding ships that ambushed the Jedi cruiser Tranquility. Super battle droids were deployed to deal with the Clone troopers on the ship allowing Ventress to sneak aboard and plant explosives in the engine room."}, {"tag": "p", "text": "With her plans set, she made her way to the detention block of the ship where she encountered Ahsoka Tano and the guards who were protecting Gunray. She managed to kill a number of clones while dueling with Skywalker's Padawan until Luminara Unduli arrived. Trapped, but feigning surrender, she used her explosives to disable the ship and put her enemies off balance before escaping into the engine room. She was quickly followed by Luminara Unduli and using stealth, she managed to rupture a coolant pipe which temporarily blinded one of the Jedi general's eyes. Flying into a frenzied rage at Unduli's taunts that her fighting style was sloppy and amateurish, she managed to defeat Luminara and drop a series of pipes on her, trapping her and allowing Ventress to deal the killing blow. However, before she could accomplish this, she was Force pushed away by Ahsoka. Ventress then dueled with the two Jedi until she received a signal from Separatist spy Argyus who had managed to escape with Gunray into the Consular-class vessel."}, {"tag": "p", "text": "Her task complete, she used the Force to escape into the ventilation system and threw a remote bomb before her which knocked Ahsoka Tano for a loop. Ahsoka and Luminara attempted to follow the Dark Jedi. Ventress then managed to make her way into an escape pod and rendezvous with Argyus's ship. Once aboard, Argyus claimed that he would note Ventress as a \"contribution\" to the mission in his report to Count Dooku; enraged by the implied insult, Ventress ran him through with her lightsaber. Seeing the Senate guardsmen killed, Gunray stated that he always had a good feeling about Ventress."}, {"tag": "h4", "text": "Alzoc III"}, {"tag": "p", "text": "After the Battle of Ryloth, Ventress was sent to the remote ice world of Alzoc III to destroy any evidence of the new Separatist weapon. There, she destroyed the remains of a Munificent-class star frigate and faced Jedi Luminara Unduli and Aayla Secura."}, {"tag": "h4", "text": "Behpour"}, {"tag": "p", "text": "After her failure on Alzoc III, Ventress led the Battle of Behpour along with Dooku and Kul Teska. There, she successfully saved Dooku after he was wounded fighting Mace Windu and Obi-Wan Kenobi and escaped with him. However, Cad Bane took a power cell away from their ship, thus leaving them stranded."}, {"tag": "h5", "text": "Tipoca City Assault"}, {"tag": "p", "text": "Sometime after this, Ventress and Grievous launched another attack at Kamino. While Grievous's fleet engaged the Republic fleet, Ventress led a surprise attack from the oceans of Kamino to attack the cloning facilities using her ship, the Trident and several trident drills similar to it. After killing ARC Trooper Commander Colt and meeting up with Grievous, Ventress was tasked during the invasion to recover the DNA template for Jango Fett from the laboratory so that clone trooper production would become severely limited. During this she engaged Anakin Skywalker in lightsaber combat and he recovered the DNA template from her. Defeated, Skywalker was going to authorize the clones to execute her. Before they had the opportunity, however, she escaped aboard General Grievous' vessel."}, {"tag": "h4", "text": "Valahari"}, {"tag": "p", "text": "Ventress was sent to the Valahari system by Count Dooku. She secretly planted a explosive on Harko Vane's ship to frame Anakin Skywalker and the Republic for his murder. Later, Obi-Wan Kenobi secretly investigated on Valahari where he found a recording of Ventress planting a explosive charge on Lord Vane's ship. When Obi-Wan went to find Lady Elodore Vane, he was briefly interrupted as Ventress fought with him before he escaped."}, {"tag": "h4", "text": "Return to the Nightsisters"}, {"tag": "p", "text": "During the Battle of Sullust, Ventress led Separatist droid forces against Skywalker's and Kenobi's forces in her Fanblade starfighter. Though she destroyed Skywalker's flagship, the Resolute, Darth Sidious sensed Ventress growing more powerful in the dark side of the Force and ordered Dooku, despite his objections, to eliminate her. Dooku ordered the T-series tactical droid, TJ-912 to destroy the command ship with Ventress, Skywalker and Kenobi on board, and when the scans revealed no survivors, she was presumed to be dead."}, {"tag": "h4", "text": "Home again on Dathomir"}, {"tag": "p", "text": "Unknown to Dooku, Ventress survived and was rescued by a scavenger ship called the Raider. She asked them to take her to Dathomir, killing the pirates when they refused, and took the ship to Dathomir. At first she was not recognized by the Nightsisters until Mother Talzin took her in for treatment. There she was treated with Nightsister magicks and had flashbacks of her past with Ky Narec up to his death, her first meeting with and betrayal by Count Dooku. It was here Ventress vowed vengeance on Dooku."}, {"tag": "p", "text": "Mother Talzin sent Ventress and Nightsisters Naa'leth and Karis to take revenge on the Sith Lord, and gave them the ability to be invisible and a poison to dull his senses. When they made it to Serenno, they managed to infiltrate Dooku's palace. Though they gave him the poison via a dart to his neck, Dooku was able to defeat Ventress and her fellow Nightsisters with Force lightning and fling them out of his palace. Though Ventress failed in this attempt, Talzin assured her that Dooku would be asking them for a new assassin and apprentice, Savage Opress, the brother of Tyranus's predecessor, Darth Maul."}, {"tag": "p", "text": "Opress was at first a promising pawn in plan for vengeance on the Count, but after his training with Dooku and his failed mission to Toydaria, Ventress came, surprising the Count and reasserting her control over Opress, but even with the two apprentices fighting side by side, they were not strong enough to defeat the Count. Dooku attacked both Ventress and Opress with Force lightning to incapacitate them, and Ventress' growing impatience at Opress' inability to hold his own caused him to betray her as well, attempting to Force choke both her and Dooku. Later, as Opress fought against Skywalker and Kenobi, Ventress and Dooku engaged each other once more. Just as Dooku was about to kill Ventress, she blinded Dooku and fled to an escape pod."}, {"tag": "p", "text": "She arrived on Dathomir, and agreed to lay down her Sith allegiance to once again join the Nightsisters, and track down and kill Dooku. She underwent a Rebirth Ritual and took her place in the order of the Nightsisters. Dooku promptly sent General Grievous, along with a platoon of droids to locate Ventress and finally destroy her. After a battle between Grievous' forces and the Nightsisters, and a one on one battle between the general and Ventress, in which she was wounded, Dooku, fearing death from magic of Mother Talzin called off the search for Ventress and instead ordered the annihilation of the Nightsisters, to which Grievous complied. Ventress meanwhile fled the planet under the urging of Mother Talzin's spirit telling her that she was the last survivor of the order."}, {"tag": "h4", "text": "Bounty hunter"}, {"tag": "p", "text": "Not having any place to go, Ventress landed in Mos Eisley and went to Chalmun's Spaceport Cantina to forget her troubles. There she was approached by a Balnab and killed him when he tried to take advantage of her. She then spotted Bossk and Latts Razzi sitting at a table signaling her to come over. She approached him and he told her the Balnab she just killed was a bounty hunter and part of his team. He asked her if she was a bounty hunter, saying that she suited the description of one, and asked her to take the place of the man she killed on their next mission. Ventress agreed to meet the rest of the team."}, {"tag": "p", "text": "When Ventress was brought to the team she was surprised to find a young Boba Fett as its leader, even though he seemed to be the least experienced bounty hunter of the team (which also included Dengar and a droid named C-21 Highsinger built by Boba). Boba felt insulted but agreed to let her join the mission as it required six bounty hunters."}, {"tag": "p", "text": "The Team was given its orders to protect a chest while it traveled by train, and not to view its contents. Ventress was paired with Dengar and sent to watch the back of the train, which quickly came under attack. Dengar was quickly thrown overboard, along with Highsinger, Latts, and Bossk, leaving only the lead attacker, Boba and Ventress onboard. In a confrontation for the chest it was accidentally opened, revealing its contents to be a young girl whom Boba promised to defend. When the girl saw the attacker however she slapped Boba and the attacker knocked him down."}, {"tag": "p", "text": "Ventress reached the front car, and confronted the attacker. She was able to subdue him while chiding Boba for not realizing that the girl was a captive. She apprehended the girl and the attacker and stayed with them for a short period, while the girl told her that she didn't understand what it was like to be taken from everything she knew. Ventress replied that she wished she didn't know what it felt like, having also been taken from her life at a young age."}, {"tag": "p", "text": "Ventress then demanded Boba that she receive half of the bounty as only they reached the end of the mission. Boba refused her saying that she would each get one sixth as agreed upon and split the rest with the others when they finished the mission. Ventress then insisted that she deliver the bounty and receive the reward."}, {"tag": "p", "text": "Upon arrival, Ventress presented the chest to Otua Blank and demanded the credits first. She received them and got back on the train, leaving before the chest was opened, revealing Boba bound and gagged inside. Meanwhile, Ventress took the hostages and returned them to their people in return for a second smaller payment of credits."}, {"tag": "p", "text": "Upon rendezvous with the rest of the team, Ventress told them she had removed her share of the profits and Boba's share was still intact for when he could receive it. She then said she would quit bounty hunting, as she did not enjoy the ambiguity of morality it involved. With her share of the missions profits and the ransom money for the captives, she walked away from the team, saying she now had a future to look forward to."}, {"tag": "p", "text": "Some time later, Ventress was sitting in a cantina with Latts when she reacted to the door suddenly opening by gripping her lightsaber. When Latts questioned her reaction, Ventress told her that she had thought that she sensed someone from her past. With further questioning from Latts, Ventress specified that the being she feared was a monster: Savage Opress."}, {"tag": "h4", "text": "Skirmish above Raydonia"}, {"tag": "p", "text": "At Chalmun's Spaceport Cantina, Ventress overheard Savage Opress's name being read off a list of active bounties. Having recently been plagued by shadowy disturbances in the Force, the source of them being Opress, Ventress claimed the bounty for herself and set out to hunt down the estranged Nightbrother."}, {"tag": "p", "text": "Her search brought her to Raydonia, where she stowed aboard a departing cargo hauler that had been commandeered by Opress. On board she discovered that Opress and the last of his kin, Darth Maul, were holding none other than Obi-Wan Kenobi prisoner. Ventress revealed herself to the brothers and lured them away from Kenobi. With the battered Jedi Master left unguarded, Ventress quickly came to Kenobi's aid and brought him to his feet. Opress and Maul quickly returned, however, and surrounded Ventress and Kenobi. Left with no choice but to work together, Ventress handed Kenobi one of her lightsabers and the two engaged the brothers in combat. Unfortunately, the unlikely duo's combined efforts weren't enough to fend off the two brothers and they were forced to retreat to the tanker's cockpit. Once there, Kenobi took the controls and ejected the cockpit into space, leaving Opress and Maul adrift. Following their narrow escape, Kenobi warned Ventress that the brothers would now be after her as well."}, {"tag": "p", "text": "Thereafter, they made their way to a nearby outpost and parted ways, though not before Kenobi suggested that he could help exonerate Ventress from her previous war crimes if she were to join the Republic's war effort and assist the Jedi, an offer which Ventress would turn down, claiming she was on no side but her own."}, {"tag": "h4", "text": "Coruscant Underworld"}, {"tag": "p", "text": "At some point, Ventress would obtain the addition of an adjustable set of helmet headgear to enhance her aura of secrecy, protection and intimidation in her newfound career as a freelance bounty hunter."}, {"tag": "p", "text": "Later, the Separatist Lieutenant would use her new-found disguise additions while tailing Ahsoka Tano in the Coruscant Underworld, as the Padawan was on the run from Republic authorities, including the Jedi Order, and had a bounty placed on her head. Catching up to her in a remote area of one of the underlevels by herself, Ventress readily subdued Tano, who easily acquiesced to her capture. However, while Tano was in Ventress' custody, the former managed to convince her that they had more in common than they thought, with both in a similarly precarious position legally- and physically-speaking. Moreover, Tano appealed to Ventress' sense of retribution by asserting that it was possible that Dooku, her former master, had a new apprentice, and that said the apprentice might have been involved with the bombing case with which Ahsoka was enmeshed. Therefore, Ventress agreed to help Tano, provided that Tano kept her end of the bargain to testify on her behalf and reveal information that would allow the Republic to pardon her from her previous Separatist war crimes."}, {"tag": "p", "text": "However, the two would find themselves being pursued by clone squads, led by Ahsoka's master Anakin Skywalker and Council member Plo Koon. Realizing that Ventress was now somehow involved with Tano, Skywalker made it his priority to see to it that both of the fugitives were captured and get to the bottom of the case at hand. Managing to temporarily elude their pursuers, Ventress and Tano stopped to make a covert transmission to the Jedi Temple, where Ahsoka's friend Barriss Offee sought out clues that would help her find the figure who had framed her and informed Tano that she had uncovered the source of the Nano-droids used in the bombing located on level 1315. However, a nearby probe droid recorded the scene and alerted one of the clone squads, led by Commander Wolffe, to their location, where they were cornered. After a failed attempt to negotiate with the troopers, Ventress helped Tano incapacitate the clones without killing them, per the latter's requests, before the two fled once more."}, {"tag": "p", "text": "Soon, Ventress and Tano arrived safely at their location, where they parted ways, with Tano commenting that she hadn't ever previously envisioned working with Ventress, to which Ventress replied that \"these were unusual times.\" However, after Tano had left her company, she sensed a presence. Initially believing it was Tano, Ventress was taken by surprise when a mysterious assailant managed to immobilize her, retrieving her lightsabers and helmet, just before leaving her in the alleyway unconscious. The assailant would utilize Ventress' lightsabers and disguise against Tano at the location of the nano-droid arms cache to great effect, making Tano falsely believe that Ventress had broken their deal and come to destroy her."}, {"tag": "p", "text": "Believing Ventress to be involved in the plan due to Ahsoka's testimonies and his sighting of her with his Padawan earlier, Anakin Skywalker sought out Ventress to capture her, bring her to justice and invalidate the current charges against Tano. Encountering Skywalker on one of the underlevels, Ventress denied her involvement with the terrorist plot, before she led Skywalker on a chase throughout the labyrinthine pipe and walkway systems of the underlevels. Deprived of her lightsabers, Ventress was soon easily subdued by Skywalker with a Force choke, who demanded to know why she had framed Tano and what her role in all of these proceedings was. Releasing her from his grip, Skywalker stood by as Ventress recounted her initial intentions to collect a bounty on Ahsoka Tano, but how she'd discovered they had more in common than she thought, much to Skywalker's fury. However, Ventress proceeded to point out that both Tano and herself had seemingly been betrayed by their respective masters (Skywalker and Dooku) and the interests they thought they represented, prompting Skywalker to believe her narrative. Thereafter, Ventress contended that someone of sufficient skill with the Force, likely a Jedi, had ambushed her and stolen her lightsabers. While she initially couldn't think of any suspect perpetrator, she soon recalled that Tano had made contact with Barriss Offee, who was the one that had informed them of the location of the explosives warehouse. Given the great body of circumstantial evidence suspiciously tying Offee's involvement in the affairs, Skywalker departed from Ventress' presence, thereby freeing her from suspicion or responsibility for the crimes at hand."}, {"tag": "h4", "text": "Extinction of the Sun Guard"}, {"tag": "p", "text": "For reasons unknown, Ventress had returned to the service of Count Dooku and the Separatist movement. Under Dooku's orders, Ventress executed most of the Sun Guard when Darth Sidious saw their destiny as complete. Some who survived served as Sidious' new Royal Guard in the new regime; others, who were Force-sensitive, became his Shadow Guard."}, {"tag": "h4", "text": "Battle of Boz Pity"}, {"tag": "p", "text": "Ventress had been sent to the planet Boz Pity, where she was placed in a bacta tank by Count Dooku and given cybernetic modifications to amplify her rage."}, {"tag": "p", "text": "When Republic forces attacked Boz Pity, Kenobi came upon the chamber in which Ventress was contained within a Separatist facility, and was subsequently attacked by her when she detected him in her trance. She fought against both Kenobi and Skywalker, only to be unexpectedly abandoned by Dooku, who did not want her to delay his escape with an exhausted and malfunctioned Grievous. He ordered an IG-100 MagnaGuard to kill her as she desperately tried to reach Dooku's shuttle. Using a blaster rifle, the droid shot Ventress down as she approached the shuttle."}, {"tag": "p", "text": "Enraged and wounded, Ventress attempted to kill Kenobi, who was trying to help her, only to be dealt a mortal wound by Anakin. As she lay dying, Ventress told Kenobi to protect the Galactic Core from Dooku, and finally let go of her anger and rage. Perhaps, she mused, Kenobi had been right about her. With that, Ventress appeared to die, and Obi-Wan ordered her apparent corpse to be placed aboard a medical shuttle."}, {"tag": "p", "text": "Despite appearances to the contrary, Ventress did not die, instead placing herself in a Sith trance on Boz Pity using her Sith healing techniques to heal the wounds she suffered. She was loaded aboard the med runner Bright Flight, and, while on board, emerged from her trance and ordered the pilots to alter their course; to take her as far away as possible from the war, Dooku, and the Jedi. The pilots complied."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Soon after her disappearance, Ventress was rumored to have fought in the Second Battle of Xagobah. Anakin Skywalker and Boba Fett engaged in a dogfight with the Ginivex-class starfighter similar to one used by Ventress over Xagobah. The pilot fighting on the Confederacy was buying time for the Techno Union Foreman Wat Tambor to escape."}, {"tag": "p", "text": "In 16 BBY, Obi-Wan Kenobi wrote in his journal that he was reminded of Ventress by a desert plant during his exile on Tatooine. He then planted seeds in memory of her."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a child, Asajj Ventress was likely a very caring, compassionate individual. While during her apprenticeship under Ky Narec, he died which caused her to spiral into darkness. Consumed by grief, Ventress gave into her rage and lust for vengeance. She abandoned Jedi philosophy and pursued power and retribution, becoming a vicious warlord. Taking over Rattatak in a flurry of bloodshed and left with no further enemies to slake her bloodlust, Ventress focused her hatred outward. She came to blame the Jedi obsessively for, from her point of view, abandoning her master."}, {"tag": "p", "text": "Recruited by Dooku, Ventress became a Sith aspirant and embarked on a vicious killing spree against the Jedi as a Separatist commander during the Clone Wars. However, her general obsession over the Jedi eventually developed into a specific obsession over Obi-Wan Kenobi. It is unknown why she focused on Kenobi to the point of monomania, but his frequent escapes from death at her hands likely had something to do with it. Interestingly enough, their banter during battle occasionally had a pseudo-romantic theme, with Kenobi frequently referring to her as either \"my sweet\" or \"my darling.\""}, {"tag": "p", "text": "Despite the number of Jedi Ventress slew, she remained angry and pained, coming to resent Dooku for not allowing her to join the Sith."}, {"tag": "p", "text": "Ventress took a great deal of pride in her own abilities and accomplishments, often viciously punishing whomsoever understated or criticized them, with examples including the unfortunate Captain Faro Argyus. She placed particular faith in her formidable lightsaber skills, and when these were described to her as those of an amateur by Luminara Unduli, Ventress' chagrin was immense."}, {"tag": "p", "text": "After being betrayed, abandoned and nearly killed by Dooku, Ventress wanted to kill him and went to the Nightsisters to find a way to kill her former Master. She recruited Savage Opress and treated him like a slave which ultimately caused him to turn against her. Ventress later became a bounty hunter but instead of becoming even harder, her exposure to the pain and suffering in the galaxy actually softened her. This caused her to save the life of Obi-Wan Kenobi and ally herself with Ahsoka Tano, both of whom she had previously tried to kill on several occasions. She also incapacitated a group of clones without killing any of them. She stated that not killing people was \"the new me\"."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Lightsaber training"}, {"tag": "p", "text": "Asajj Ventress was a master of Jar'Kai and took up the style after the death of her master, Ky Narec, taking up his lightsaber alongside her own. However, without Narec's guidance, she spiraled down the path of the dark side, and this showed in her bladework, which became furiously aggressive. She demonstrated her skills to Count Dooku during his visit to Rattatak, viciously killing off the competitors in the Cauldron in a furious display of bladework and raw power in the Force. During her subsequent duel with the Count, she fell on him in a blind fury, but was nonetheless defeated. However, she did impress the Count and his Sith Master, Darth Sidious, with her skills. The Count awarded her with the twin curved-hilt lightsabers of his former student, Komari Vosa."}, {"tag": "p", "text": "Wielding these new lightsabers, Ventress developed her skills under Dooku's tutelage, applying her skills in dual-blade combat to Makashi, and began utilizing the paired function of the weapons, demonstrating impressive skill with the saberstaff, and occasionally joined the weapons together with a fibercord, flailing them about. Eventually, her prowess as a duelist allowed her to hold her own against up to three adversaries with little difficulty, as she demonstrated during her mission to Ruul. Ventress' skills even advanced to the point where she was able to battle and defeat, or at least hold her own against, Jedi Council masters, an accomplishment that few of her contemporaries could match; she had disarmed Obi-Wan Kenobi during the initial stages of their duel on Teth, which seemed to impress the Jedi Master. While having lost to General Grievous in their first encounter, she was eventually able to contend with and defeat him at least twice."}, {"tag": "p", "text": "Despite her skills, Ventress was not without her weaknesses. During her earlier years, she lacked the major levels of physical strength to compensate for the inherent weaknesses of Jar'Kai and Makashi; her blows lacked power, as shown by Dooku's casual defensive moves during their bout on Rattatak; and she was left vulnerable to power attacks, as shown by her retreat before Anakin Skywalker's offensive frenzy during their duel on Yavin IV. However, she eventually developed the physical strength necessary to compensate for these weaknesses, demonstrating the ability to hold up simultaneous bladelocks with multiple duelists at a time. Even so, her technique still was not without its flaws; notably her usage of Makashi was criticized by Luminara Unduli as being \"unrefined,\" \"amateurish,\" and \"sloppy.\" Ventress had also used to be heavily reliant on her second blade, and was left at a disadvantage if deprived of it. But later on in the Clone Wars, she overcame this weakness, having driven Plo Koon against the edge of a catwalk while one-handed."}, {"tag": "p", "text": "Ventress had been adept in the art of Dun Möch, taunting the Jedi on Ruul in the initial skirmish and eventually turning Rhad Tarn to the dark side. She had come close enough to obtaining the same result with Darrus Jeht, which was part of Dooku's plan from the beginning. On the Tranquility, she traded verbal jabs as well as saber strikes with Ahsoka Tano and Luminara Unduli. However, while fighting Anakin Skywalker on Coruscant, Ventress went too far in threatening the Jedi's secret wife, causing him to go even deeper in the dark side; she had nearly been killed as a result."}, {"tag": "h3", "text": "Force powers"}, {"tag": "p", "text": "Though noted for her skill in physical combat, Ventress was said to have an unusual command of the Force. She may have been Darth Tyranus' most powerful Dark Acolyte, her connection to the Force second only to his. Obi-Wan Kenobi once stated that had Ventress not turned to the dark side, she could have been one of the greatest Jedi Masters in her era. Throughout the Clone Wars, Tyranus felt his apprentice growing stronger. Darth Sidious himself noted that Ventress was powerful; he knew that, once at her height, she and Tyranus could prove a combined threat and destroy him."}, {"tag": "p", "text": "Ventress was able to use telekinesis to a very high degree, as evidenced when she caused large sections of a roof to collapse during her initiation on Rattatak. In that same instance, she demonstrated a mastery of Force speed. She had displayed a great deal of aptitude with the Force Jump, performing it frequently during her fights."}, {"tag": "p", "text": "Ventress was able to use the iconic dark side power of Force Grip, as witnessed when she telekinetically lifted Captain Rex, while simultaneously choking him. Later, the Dark Jedi proved herself capable of Force choking and telekinetically levitating Anakin Skywalker and Obi-Wan Kenobi, both of whom were very powerful Jedi, at the same time; her aptitude had even increased to four targets, as shown by her killing of the pirates aboard the Raider. Ventress demonstrated an aptitude for using the Affect Mind ability, when she used the Force to make Rex do her bidding. She was able to easily command a Rancor in her and Tol Skorr's hunt for Obi-Wan Kenobi and Quinlan Vos, which would have been natural for a Nightsister. It is also possible that Ventress was capable of using the power Force Crush, as she attempted to use it to crush the heart of Jedi Master Fay during their confrontation. At one time, she telekinetically manipulated one of her lightsabers to stab the Jedi Tauht in the back. Ventress also used a Force-energy weapon called \"starblades\"."}, {"tag": "p", "text": "Before meeting Tyranus, Ventress had learned the ability to conceal her Force signature. While Tyranus may have sensed her as she killed his host upon her introduction, he was nonetheless impressed. Taking Ventress under his wing, he had taught her the more advanced Quy'Tek meditations to the point that, by 21 BBY, Obi-Wan Kenobi noted her perfection of the art. Ventress could not only to hide her presence within the close proximity of Jedi Council members, but also strike her blind target without being detected."}, {"tag": "p", "text": "It should also be noted that Ventress had at least some of the more esoteric Force powers at her command. She had learned what she would term as \"lesser arts\" of the Sith from Tyranus, \"devices\" and \"little scraps\" that came easily for her. She re-animated dead Gungans during the Battle of Ohma-D'un, which would come across as Tsaiwinokka Hoyakut, an ancient, elaborate form of Sith magic. Pyrokinesis was not unknown to Ventress, as she demonstrated on Yavin 4, commanding flames to sweep aside for her. She could even be creative with the Force: in her first duel with Tyranus, she somehow caused a column to collapse on him by crossing both her lightsabers just a few meters away, almost as if she were cutting it down."}, {"tag": "p", "text": "Ventress had learned at least one trick from the Nightsisters before she had met Tyranus: the blood trail. Using her own blood on her conquered enemies on Rattatak, she would be able to know where they went."}, {"tag": "h3", "text": "Other abilities"}, {"tag": "p", "text": "In addition to her lightsaber skills and Force powers, Ventress also proved to be an excellent pilot during the Battle of Muunilinst as she was able to shoot down numerous Republic starfighters within seconds and survive a dogfight with Anakin Skywalker, who was considered to be one of the greatest pilots in the Jedi Order."}, {"tag": "p", "text": "Ventress also displayed considerable skill in unarmed combat, notably being able to easily fight a group of Nightbrothers when she was looking for a suitable servant on Dathomir. Her hand-to-hand combat skills were later displayed when she fought Savage Opress and Darth Maul alongside Obi-Wan Kenobi, dodging Opress's aggressive blows and striking back with a flurry of punches and kicks until Kenobi returned her lightsaber to her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The design for Asajj Ventress comes from early Attack of the Clones brainstorming sketches by Dermot Power for the design of Palpatine's apprentice that would later become Dooku. He wanted her earlier designs to look almost as if she was a samurai. The concept art can be seen in The Art of Star Wars Episode II: Attack of the Clones. However, the character itself was created specifically for the Clone Wars multimedia project. Note that the concept art was later converted into comic content of the character in Star Wars: Republic: The New Face of War."}, {"tag": "p", "text": "Leland Chee suggested to use \"Asajj\" as the first name for Ventress, naming her after the character Asaji from Akira Kurosawa's Throne of Blood. She originally was to be named Juno Eclipse, but that name was changed as the name didn't sound \"villainy enough\"."}, {"tag": "p", "text": "There is a notable discrepancy regarding Ventress' lightsabers. They look different in their official picture in The New Essential Guide to Weapons and Technology than they do in the video game Bounty Hunter, when they belong to Komari Vosa. Their appearance continues to vary throughout the Clone Wars period, changing again in the Clone Wars animated miniseries and the Clone Wars TV series."}, {"tag": "p", "text": "Through the Star Wars: Battlefront II Xbox Live content, Asajj Ventress is available to download to the game. In the game, her lightsabers are connected together by a fibercord at the hilt. She also threw starblades."}, {"tag": "p", "text": "In the Wii, PS2, and PSP versions of Star Wars: The Force Unleashed video game, if you enter ACOLYTE as a cheat code, you can play as Asajj Ventress."}, {"tag": "h3", "text": "Original fate"}, {"tag": "p", "text": "Ventress was originally supposed to be killed off in James Luceno's novel Labyrinth of Evil."}, {"tag": "p", "text": "In Obsession 5 (2005) it was stated that during Obi-Wan Kenobi's mission to return Ventress to the light on Boz Pity, she received a life-threatening wound from Skywalker, faked her death and disappeared into the unknown; wishing to be free of the Jedi, the war, and Dooku. This was later overridden by the Star Wars: The Clone Wars television series. Leland Chee, the Keeper of the Holocron continuity database, provided confirmation that any parts of the comic relating to her ultimate fate should be treated as non-canon."}, {"tag": "h3", "text": "\"Nightsisters\" inconsistency"}, {"tag": "p", "text": "The Clone Wars episode \"Nightsisters\" involves a different version of Ventress's background. As an infant, she is said to have been taken from a family of Nightsisters, rather than her original Rattataki species, by a slaver in order to save the rest of her tribe from suffering the same fate. A few years later her master is killed by a group of Weequay pirates who are then fighting a Jedi, Ky Narec. Asajj performs her Force powers on one of the pirates which encourages the Jedi to make her his new apprentice. Narec is later killed fighting alongside Ventress and his death drives her to the dark side. It should also be noted that, prior to and during Narec's death she actually has hair, despite earlier statements that her species was naturally hairless. also depicts Ventress wielding two lightsabers both with green blades before joining forces with Dooku, but Republic 60 shows her using a blue-bladed lightsaber during and following her Jedi training, and Star Wars: Clone Wars chapters 6 & 7 show her with one green and one blue bladed lightsaber. Ventress' warlord parents, shown in Hate and Fear, are also entirely absent from the new backstory."}, {"tag": "h3", "text": "Slaves of the Republic"}, {"tag": "p", "text": "When the story arc Star Wars: The Clone Wars: Slaves of the Republic was adapted for the television series' fourth season, Ventress was written out of the story due to having been abandoned by Dooku. The following details the original story."}, {"tag": "h4", "text": "Storyline"}, {"tag": "p", "text": "Ventress went with Count Dooku to deal with the Zygerria's Queen, Miraj Scintel. Dooku sent her to deal with Anakin Skywalker and Ahsoka Tano. Though she missed her chance at getting Ahsoka, she went after Skywalker, after Dooku Force-Choked the queen. Ventress taunted Skywalker, saying that his protection of her was misplaced as her love for him. The two fought each other, with Skywalker offering her the chance to surrender. He then escaped with his Padawan on Dooku's Solar sailer to the Kadavo system to rescue Master Kenobi, Captain Rex, and the people of Kiros as Dooku expected."}, {"tag": "p", "text": "Ventress, along with General Grievous, went to Kadavo to eliminate the people of Kiros to protect her master's reputation. Ventress, onboard her ship, the Trident, took a squadron of Hyena-class bombers to destroy evidence of Separatist involvement. Luckily, the clone troopers were able to destroy her bomber squadron. When Ventress requested more bombers, Grievous turned her down because of Republic reinforcements, so he retreated. After this setback, Ventress took her ship and attacked the transport ship that Kenobi and Skywalker were using to help the people of Kiros. Just as she was about to destroy the transport ship, Master Plo Koon arrived and chased her away."}, {"tag": "h3", "text": "Non-canon storyline"}, {"tag": "p", "text": "After the airing of Ventress's betrayal, and subsequent revenge, Star Wars: The Clone Wars Magazine 5 presented an Infinities scenario. Ventress returned to the Nightsisters' coven, and the Nightsisters instead imbued her with the dark magick ritual, as opposed to Savage Opress. Ventress's speed, power and agility were augmented and she was outfitted with dueling armor capable of deflecting lightsabers and blaster bolts. Asajj also added more tattoos to her face. Seeking revenge, Ventress then methodically took out all of Count Dooku's security systems and made her way into his inner sanctum to confront him in combat. Shrugging off or deflecting his Force lightning, she used her double-bladed lightsaber to tear through his defenses and put an end to him once and for all. Darth Sidious, pleased to have a younger, more powerful apprentice, knighted Ventress as Darth Vindicaa. Ventress was silently planning to eventually overthrow him as well."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Asajj Ventress was voiced by Grey DeLisle in the 2003 series Star Wars: Clone Wars and the 2008 video game Star Wars: The Force Unleashed, and by Nika Futterman in the 2008 film and the subsequent TV series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}