{"url": "Monument_Plaza", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Coruscant public spaces", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Plazas"], "nodes": [{"tag": "h1", "text": "Monument Plaza"}, {"tag": "p", "text": "Monument Plaza was a large plaza on the populous ecumenopolis world of Coruscant. It was also the location of the planet's only uncovered mountain peak, Umate, the highest point of the Manarai range. The plaza had existed for millennia, moving upward level by level as the city-world built up."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Monument Plaza was located on the ecumenopolis world of Coruscant. It was composed in a square and had four, large cone shaped statues which were lit around Umate, the planet's only uncovered mountain peak, in the center of the park. Shops and restaurants surrounded the plaza on all four sides, while citizens could touch the peak itself."}, {"tag": "p", "text": "During the High Republic Era, the park was located on Level 5,216 and contained substantial greenery, designed as a reflection of what the area might have looked like before it had been built over."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, a series of conflicts between the Galactic Republic and the breakaway Confederacy of Independent Systems, Duchess Satine Kryze and Jedi Master Obi-Wan Kenobi secretly met in Monument Plaza when she was being pursed by the Coruscant police after being framed for a murder she didn't commit. She gave Kenobi a holodisc with a recording to be played in front of the Senate that would vindicate her. Later in the conflict, during one of the mandatory blackouts following the Separatists' bombing of Coruscant's central power distribution grid, Senator Onaconda Farr was attacked in the plaza by two thugs in an attempt to deter him from opposing a bill that would approve the Republic's purchase of 5 million additional clone troopers. Later, Senator Padmé Amidala made a speech in front of the Senate which was broadcast in Monument Plaza in opposition of the bill."}, {"tag": "p", "text": "During the Galactic Civil War, after the Galactic Empire's defeat by the Alliance to Restore the Republic at the Battle of Endor, a celebration took place in Monument Plaza to commemorate the demise of Emperor Sheev Palpatine. After a mob destroyed a statue of the Emperor, Coruscant Security Forces arrived at the plaza to restore order and opened fire on the crowd without warning, killing multiple civilians and transforming the celebration into a full-blown riot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Monument Plaza first appeared in the 1995 Star Wars Legends book The Illustrated Star Wars Universe, where it was portrayed in a drawing by Ralph McQuarrie and extrapolated on in text by Kevin J. Anderson. As some of the McQuarrie art used in this book was concept art from the Star Wars movies and other pieces were commissioned for the book, with whom the idea for Monument Plaza originated is unknown. It became canon when it appeared in the 1997 Special Edition version of Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "Monument Plaza's appearance in the Star Wars: The Clone Wars animated series was based on several pieces of Ralph McQuarrie concept art. The plaza also included a large boulder at its center—a nod to a detail seen in McQuarrie's work suggesting the sole exposed mountain peak on Coruscant's covered surface. Some of the original design development of this monument looked to the actual boulder found on the road to Lucasfilm Animation's northern California headquarters. It is this boulder that gives the Big Rock campus of Skywalker Ranch its name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}