{"url": "Monument_(freighter)", "categories": ["Category:Legends articles", "Category:Freighters"], "nodes": [{"tag": "h1", "text": "Monument (freighter)"}, {"tag": "p", "text": "The Monument was an unattractive Corellian barge that was shaped like a crate, and which appeared in a state of disrepair. It was used to transport workers and cargo to the planet of Bandomeer. Onboard, many thefts and fights broke out between Offworld Mining Corporation's miners and the miners of the Arcona Mineral Harvest Corporation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Monument was a barge of Corellian manufacture. Much of its surface was pitted with dents from multiple meteor hits over the course of its history. Cargo boxes could be attached to the front of the ship for transportation, and it was armed with gun turrets and a proton torpedo launcher to repel pirates from destroying the ship. Inside the Monument looked worse than the outside, with sections of wall left open, with pressure hoses and wires hanging out, and smelled of a combination of the perspiration of many different species, as well as whatever particulate matter may have been left on the miners onboard. Due to fighting that may have occurred during transit, the crew transformed a small cabin into a temporary jail cell. Due to the rivalry between the Offworld Mining Corporation and the Arcona Mineral Harvest Corporation, the ship was sequestered into two parts, one for each faction."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Monument was tasked with carrying miners and cargo to the mining planet of Bandomeer. In 45 BBY, the hallways of the ship were filled with various species such as Hutts and Whiphids, who worked for the Offworld Mining Corporation, Arconans, which worked for the Arcona Mineral Harvest Corporation, as well as the Humans Obi-Wan Kenobi and Qui-Gon Jinn, on a trip from Coruscant."}, {"tag": "p", "text": "During this trip, the ship was attacked by Togorian pirates. A Jedi Master, Qui Gon Jinn fought off the Togorians which boarded the ship, while Kenobi attempted to fly to safety. After the gun turrets were reduced to burning slag, Kenobi was able to fire the proton torpedoes at some of the Togorian gunships, crippling them. Kenobi had to fly the ship manually since the navigation console was disabled, and in so doing ripped the Togorian boarding party's ships from the docking bay, exposing it to the vacuum of space. Having defeated the pirates, Kenobi brought the ship down on a watery world near Bandomeer. The survivors had to fight off the planet's native draigons, but the Monument was repaired, and managed to make it to Bandomeer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}