{"url": "Monument_Plaza/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Coruscant public spaces", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Plazas"], "nodes": [{"tag": "h1", "text": "Monument Plaza"}, {"tag": "p", "text": "Monument Plaza, also known as Monument Park, was a large plaza on the city-planet of Coruscant. The plaza circled the summit of Umate, one of the highest peaks of the Manarai Mountains. Thousands of tourists came to the plaza each day to touch the giant lump of rock in the center; it was said that Monument Plaza was the only place on Coruscant where people could touch bare rock. The surrounding mall resembled a stadium with the peak of Umate standing in the center. Huge statues and colorful banners decorated the grounds, while restaurants and shops were built into the plaza walls. Amongst the popular sites in or near the plaza were the Manarai restaurant, the Galactic Museum, and the old Senate Hall."}, {"tag": "p", "text": "Monument Plaza was the site of several events throughout its history, including a battle of the Great Droid Revolution, a terrorist threat by the Separatist movement, and a Republic rally during the Clone Wars. When the Galactic Empire came to power it replaced the statues of the plaza with those honoring Imperial heroes. Monument Plaza was damaged sometime before 29 ABY, during the Yuuzhan Vong War, when it and the peak of Umate were turned into a yorik coral-covered crater. After the war, the Reconstruction Authority restored the plaza to its original state, rebuilding much of what was damaged."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Monument Plaza was a bowl-shaped arena in the Manarai Mountains, and the only place on Coruscant where one could touch the bare rock of the planet—namely the peak of Umate, one of the highest peaks in the Manarai. It sat one kilometer south of the site of the Imperial Palace, and was visible from that building."}, {"tag": "p", "text": "Monument Plaza resembled a sports arena, with towering buildings forming its perimeter and an open space occupying the area inside. The bare peak of Umate sat in the center of the plaza, protruding from a hole in its floor. It was forbidden to chip away pieces of Umate's rock. Surrounding the plaza were a number of restaurants and souvenir shops, including the prestigious Manarai restaurant. The Galactic Museum lay next to it as well, and the original Senate Hall was nearby. The buildings of Monument Plaza were in the style of the Hasennan period, characterized by an epic style of architecture. The North Garden was one of the sections of the plaza, capable of holding over 6,000 individuals."}, {"tag": "p", "text": "A cavalcade of memorials and banners of various cultures and species lined the approach to Monument Plaza, and a set of main gates provided entrance to it. Statues commemorating heroes and colorful banners lined the plaza, giving the plaza its name, and the overall atmosphere was bright and airy. In the time of the Galactic Republic, the plaza statuary consisted of heroes and key figures from all over the galaxy, in a celebration of galactic diversity. Senators often used the plaza to hold press conferences, supporting their image with the presence of these celebrated cultural figures. One of the last statues to be installed during the Republic was that of Phow Ji, a mercenary who had fought for the Republic in the Clone Wars. Under the Republic's successor state, the Empire, the statues of the plaza were of Imperial dignitaries and the Empire's own heroes, and above them all, a gigantic statue of Emperor Palpatine. Monument Plaza was overseen by a Plaza Director, a position held by Shelbin Dang in 22 BBY."}, {"tag": "p", "text": "Monument Plaza was a historic landmark, and the public concourse of the Manarai historical site. It was a popular recreational area, with many of the planet's inhabitants and civil servants visiting. Admission to the plaza was free, and it was continuously open. Monument Plaza was one of Coruscant's most popular tourist attractions, with thousands of visitors every day viewing the peak in curious disbelief at the thought that it was the only spot they could touch the planet's bare surface. It was also a popular starting point for tours of the city. However, the plaza was also seen by some as the epitome of all that was wrong with the planet. They compared the display of bare rock to the caging of an animal in a zoo."}, {"tag": "p", "text": "After the ravaging of the plaza in the Yuuzhan Vong War, all that remained visible was an immense crater in the ruins of the Manarai Mountains. A ring of permacrete remained along the shoulder of the crater, which was inhabited by winged creatures. The plaza itself was buried beneath two meters of yorik coral, and Umate covered in stone-dissolving lichens, speculated to be a terraforming device. However, with Monument Plaza's reconstruction, the thousands of statues that had once filled it were recreated identically. Others were added, in particular Devoted Technician, a statue commemorating the droids that had helped the Reconstruction Authority rebuild the galaxy after the war. Holograms of individuals of various species were set up near the statues to give information on the monuments to visitors, some of it self-aggrandizing propaganda on the part of the Authority."}, {"tag": "p", "text": "With the rebuilding, the plaza once again became a popular site for tourists and office workers, though the heavy amount of tourist traffic left it strewn with litter. The post-war plaza square was made of durasteel, and where it dropped off into the chasms between buildings it was blocked by a transparisteel safety wall. Sites around the plaza included the Traveler's Palace and Curat Commercial Center, with traffic routes out including the Arakyd Towers ThroughPass and TravRat Gap, which passed between the Palace and Commercial Center. A no-fly security zone was enacted over Monument Plaza, keeping the sky above it free of traffic, and plainclothes security agents were stationed around the plaza to keep watch for potential terrorist attacks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 4015 BBY, the Great Droid Revolution began, with droids rising in revolt and turning on Coruscant. Monument Plaza was the site of one of its battles; in a memorable battle above the plaza, the juggernaut war droids of Coruscant's home guard destroyed a platoon of the Republic's rocket-jumpers."}, {"tag": "p", "text": "The plaza remained a popular destination almost 4,000 years later, in the time of the late Republic. Approximately a month before the Clone Wars began, an untraceable anonymous call was made warning that there would be a Separatist terror attack on the plaza. The call warned that the attack would be carried out through a droid-delivered bomb. In response, local security closed the plaza and evacuated its inhabitants, including the Flames of Umate followers, who responded by praying loudly in protest of their ejection from the site. Security also banned all droids from the area and increased armed security around the peak of Umate. Shelbin Dang, Plaza Director at the time, announced that the Plaza was planned to reopen within a week."}, {"tag": "p", "text": "In fact, it would not open for a year and a half. With clone troopers standing guard over Umate, the Plaza's reopening was celebrated with a rally by the Commission for the Protection of the Republic's SAGroup. Over 6,000 members marched in military fashion from the Jrade-Daders Concourse to the plaza, carrying banners of loyal Republic worlds in celebration of recent Republic victories, while 10,000 citizens watched. Still others throughout the Core Worlds watched on a live broadcast. At the plaza, the SAGroup members assembled in the North Garden, where brigade leader Nenevanth Tion recited an ancient speech of Uueg Tching, Emperor of the Atrisi system, on the removal of corruption. The youths then sang from Dha Werda Verda, after which Supreme Chancellor Palpatine addressed the gathering via holocom. As one of his last acts as Supreme Chancellor, Palpatine had a statue of the mercenary Phow Ji installed."}, {"tag": "p", "text": "When the Empire came to power, the statues celebrating galactic heroes were torn down and replaced with statues of Imperial heroes and officials. A massive statue of Emperor Palpatine was erected in the plaza as well, looming over all the other sculptures. The displays along the approach to the plaza, however, remained as diverse as they ever were. The plaza's Manarai restaurant became a popular place for the Imperial upper-class, and Palpatine often visited Monument Plaza when he sought solitude. When Palpatine died, the Monument Plaza was the site of a riot by various Coruscanti people celebrating their freedom from the Empire before it was put down by Ysanne Isard. In addition, in the long term, the Empire fell into chaos, as different factions sought to claim supremacy. During the Imperial Civil War, elements of the Empire engaged in battle in Monument Plaza."}, {"tag": "p", "text": "Over the next decades, as the New Republic retook Coruscant and eventually became involved in the Yuuzhan Vong War, Monument Plaza remained a fixture of the planet. However, when the Yuuzhan Vong invaded Coruscant, they bombarded and terraformed the world, destroying many of the planet's structures and converting others into wildlife and plant-covered landscape. It is possible that Monument Plaza was used by the Vong to grow their organic war materiél. When the Galactic Alliance landed on Coruscant in 29 ABY, they found a large crater in the plaza's place."}, {"tag": "p", "text": "After the close of the Vong War, the Reconstruction Authority was formed, an organization dedicated to rebuilding the war-ravaged galaxy. As a finale to its project, the Authority spent years restoring Monument Plaza. It took three years to removed the layer of yorik coral that coated the plaza and five years to rebuild the statues with the original materials and methods. A year was also spent removing the stone-dissolving lichens from the peak of Umate. When the project was finished, the Authority pronounced it their crowning achievement and an incredible success in their mission to restore the galaxy to its pre-war state."}, {"tag": "p", "text": "By 41 ABY, the plaza was once again a popular tourist attraction. It was this and many other secrecy-aiding aspects of the site that made it a common place for Galactic Alliance Guard captain Lon Shevu to meet his informants, as he did with fugitive Jedi Ben Skywalker. Skywalker, in opposition to the Chief of State of the Galactic Alliance, Darth Caedus, sought information on Caedus' whereabouts, and along with his aunt Leia Organa Solo and cousin Jaina Solo, rendezvoused with Shevu in the plaza. Shevu was followed by GAG personnel, though, including Caedus' Sith apprentice Tahiri Veila, and they soon closed in on Shevu and Skywalker. Though Skywalker attempted to fight his way from the plaza, he was captured and transported from the plaza in a GAG Doomsled. The Solos hijacked a medwagon and pursued, though they were ultimately unsuccessful in retrieving him."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Flames of Umate were a religious sect local to the plaza area who had guarded the peak of Umate for generations. The Flames wore robes, and sought to communicate with the \"world-spirit\" that they believed resided in the molten core of Coruscant by meditating with their hands touching the rock. They attempted to seek the peace that the planet had felt before it had become entirely urbanized. The Flames also kept vigil to prevent tourists from chipping rock off the mountain. In 22 BBY, the Flames of Umate were ejected from the plaza due to the terrorist threat against it. Even in the time of the Empire, Palpatine tolerated the existence of the sect."}, {"tag": "p", "text": "In the time of the Empire, the bounty hunter/assassin Anniha Nega used Monument Plaza as a contact point. Those who wished to hire him placed their request under a specific paving stone in the plaza, where he would pick it up."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Manarai"}, {"tag": "p", "text": "The Manarai was an upscale restaurant in Monument Plaza, and a popular spot for the Imperial elite. It was located in a spire alongside the plaza, and diners could view the plaza and cityscape below. The levels of the restaurant were, in fact, tiered to ensure an optimal view of both. The most exclusive restaurant on Coruscant, the Manarai required reservations months in advance, and even then only from individuals on the approved list. One of its owners was the crime lord Prince Xizor, who often dined there."}, {"tag": "h3", "text": "Galactic Museum"}, {"tag": "p", "text": "The Galactic Museum was the galaxy's chief repository for important artifacts. The Museum held billions of relics, with less than 1% on display. The exhibits, like the plaza, celebrated the galaxy's diversity. When the Empire came to power, many wings of the Museum were transformed into a celebration of the New Order or closed off, including the exhibits on the Jedi Order. The Jedi section also housed a secret tunnel to the Super Star Destroyer and secret prison Lusankya."}, {"tag": "h3", "text": "Umate"}, {"tag": "p", "text": "Umate, also known as KnobHead, was one of the Manarai Mountains' highest peaks, though not the highest. Made of granite, the lump of rock protruded above the plaza about twenty meters, casting its shadow over visitors. Removing rock from the peak was forbidden, and the Flames of Umate kept an eye out for this. During the Yuuzhan Vong occupation of Coruscant, it was covered with stone-dissolving lichens."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Monument Plaza first appeared in The Illustrated Star Wars Universe, where it was portrayed in a drawing by Ralph McQuarrie and extrapolated on in text by Kevin J. Anderson. As some of the McQuarrie art used in this book was concept art from the Star Wars movies and other pieces were commissioned for the book, with whom the idea for Monument Plaza originated is unknown. It was called both \"Monument Plaza\" and \"Monument Park\" in this book, though the former would be the more lasting name. However, with the publication of The Complete Star Wars Encyclopedia in 2008, \"Monument Park\" was listed as a separate entry from \"Monument Plaza,\" with \"Monument Park\" surrounding \"Monument Plaza.\""}, {"tag": "p", "text": "In the Shadows of the Empire multimedia project, Monument Plaza was used again. For that project's soundtrack, composer Joel McNeely created a piece representing Coruscant in the track \"Imperial City.\" The piece is structured as an approach to Coruscant from space, followed by a journey through its buildings, as well as Monument Plaza. A welcoming fanfare signals the arrival at the gates of the plaza, which is followed by a reflective theme that plays during the trip through it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}