{"url": "Moogan_tea", "categories": ["Category:Canon articles", "Category:Beverages in Black Spire Outpost", "Category:The Official Black Spire Outpost Cookbook recipes", "Category:Teas"], "nodes": [{"tag": "h1", "text": "Moogan tea"}, {"tag": "p", "text": "Moogan tea was a beverage which was popular throughout the Outer Rim and brewed daily at cantinas before the Commerce Guild took control of its planet of origin, Mooga, and trademarked the tea as Ardees Beverage. Locations such as Oga's Cantina in Black Spire Outpost continued to brew and serve Moogan tea despite the legal claim that it was a proprietary recipe."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The original Moogan tea was a tea that originated on the planet Mooga, but its recipe was widely known across the Outer Rim. It was a sweet and spicy beverage that was brewed fresh daily at drinking establishments. The tea was made with a spiced syrup or tea concentrate, and when mixed with milk, it was beige-colored and frothy. Alcohol was an optional addition."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Clone Wars, the Commerce Guild had taken control of Mooga, deemed Moogan tea their trademarked beverage with a proprietary recipe, and branded it as Ardees Beverage. The Commerce Guild created Ardees Beverage Company to manufacture the bottled beverage. The guild utilized corporate surveillance droids and issued cease and desist transmissions to establishments that attempted to sell their own homebrewed Moogan tea. Nevertheless, many continued to quietly serve it."}, {"tag": "p", "text": "While human Senator Padmé Amidala was on Batuu for a personal mission later during the Clone Wars, she visited Oga's Cantina in Black Spire Outpost and was offered alcoholic and non-alcoholic Moogan tea by the bartender, Janott. By the time of the war between the First Order and the Resistance, Oga's Cantina continued to serve Moogan tea during breakfast hours. In his guide to Batuu, Eloc Throno described the tea at Oga's Cantina as \"well-garnished.\""}, {"tag": "p", "text": "Artiodac chef Strono Tuggs advised that any respectable barkeep would know how to make real Moogan tea from the original recipe, and he believed it was likely worth risking legal ramifications to have a taste. He took the risk himself by including his recipes for Moogan tea and his personal blend of Moogan Spice Syrup in his cookbook."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ardees Beverage version of Moogan tea was introduced in the Star Wars: The Clone Wars episode \"Corruption.\" Alcoholic and non-alcoholic Moogan tea were mentioned in the 2018 novel Thrawn: Alliances by Timothy Zahn. The 2019 cookbook Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook, which was written by Chelsea Monroe-Cassel and Marc Sumerak, distinguishes the sometimes-toxic Ardees Beverage as separate from \"real Moogan Tea.\" The book includes a recipe for the latter drink that uses the ingredients unsweetened iced tea, chocolate milk, Moogan Spice Syrup, heavy cream, and Falernum, and a sprinkling of Christophsian sugar mixed with ground cinnamon. Recipes for Moogan Spice Syrup and Christophsian sugar are also included in the book."}, {"tag": "p", "text": "The beverage is available out-of-universe during breakfast hours at Oga's Cantina in Star Wars: Galaxy's Edge. The cantina version is topped with whipped cream sprinkled with spices, and its menu description reads, \"Gold Peak unsweetened tea, chocolate milk, vanilla, and cinnamon.\" When the drink was promoted in advance of the opening alongside Black Spire Brew, they were erroneously identified with their names swapped; Black Spire Brew was subsequently labelled correctly at the bar."}, {"tag": "p", "text": "A purple version of Moogan tea appeared and was served to a Wookiee within a flashback scene in \"Episode 4\" of Star Wars: Jedi Temple Challenge. This drink was not identified as Ardees Beverage, yet it did not cosmetically resemble the original version of the tea."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}