{"url": "Moon_Dash", "categories": ["Category:Legends articles", "Category:Shuttles"], "nodes": [{"tag": "h1", "text": "Moon Dash"}, {"tag": "p", "text": "Moon Dash was a cargo shuttle and the backbone of a small-time shipping operation run by Captain Narek-Ag and her co-pilot Trebor."}, {"tag": "p", "text": "In 23 ABY, Moon Dash was cleared by Coruscant Control Tower One to depart from their spacedock in Gamma Section. Loaded with a with a full cargo bay, its contents destined for Cloud City, the shuttle cleared the docking bay without incident."}, {"tag": "p", "text": "While accelerating to hyperspace while in the inner Coruscant system, the Moon Dash struck the upper docking tower of the Shadow Academy, which had been cloaked and thus undetectable at the time. Believing that they had hit unknown space debris, Trebor informed Coruscant One of Moon Dash's dire emergency."}, {"tag": "p", "text": "The shuttle suffered a rupture in its lower hull, which initially resulted in the loss of most of its cargo, but this would turn out to be the least of the crew's worries. Moon Dash lost all control when its main guidance console malfunctioned."}, {"tag": "p", "text": "The collision also inflicted damage upon Moon Dash's communications system and hyperdrive engines. The damage to the engines had caused a chain reaction to build in their chambers. This resulted in the destruction of the Moon Dash and the loss of her crew shortly thereafter."}, {"tag": "p", "text": "Coruscant One managed to pick up Trebor's transmission and the New Republic's Commissioner of Trade took note of the incident. He informed Chief of State Leia Organa Solo that as he had pointed out before, the remaining space debris that had surrounded Coruscant since the Galactic Civil War was an accident waiting to happen."}, {"tag": "p", "text": "The larger chunks of debris that had remained had been believed to be already mapped out, but the Moon Dash's destruction convinced him that this was not the case anymore. He requested Organa Solo to direct more resources to the task of mapping out space debris that might still remain uncharted. However, Organa Solo doubted that the New Republic had any to spare at the moment."}, {"tag": "p", "text": "Jaina Solo happened to hear her mother and father conversing about this matter and decided to volunteer herself and Lowbacca to map out the space debris. Some hours later, after twelve percent of the project was complete, she and Lowbacca volunteered to go up to the dilapidated Orbital Solar Energy Transfer Satellite, that Peckhum was a caretaker of, and effect some quick repairs which would make his job more bearable."}, {"tag": "p", "text": "Jaina and Lowbacca also reasoned that the satellite would be a much more effective vantage point from which to work on their project. Eventually, Lowbacca would discover the true cause of the Moon Dash's destruction when he found an anomalous area of space completely devoid of debris."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}