{"url": "Moonglow_Polychemical", "categories": ["Category:Canon articles", "Category:Mining companies"], "nodes": [{"tag": "h1", "text": "Moonglow Polychemical"}, {"tag": "p", "text": "Moonglow Polychemical, or simply Moonglow, was a mining and refinery company based in the Gorse system. The company had originated as an offshoot of Introsphere, which had become bankrupt after the end of thorilide surface mining on the planet Gorse. After the Galactic Empire established mining operations on Gorse's moon Cynda, Moonglow delivered baradium bisulfate for blasting operations on Cynda. In addition, the company also maintained a refinery in Gorse's Shaketown."}, {"tag": "p", "text": "In 11 BBY, Moonglow's operations attracted the attention of the dissident miner Skelly and the Imperial Count Denetrius Vidian. Skelly tried to convince the company not to conduct blasting past Zone Forty-Two. After Skelly was apprehended for assaulting Imperial personnel and staging an illegal test bombing, Moonglow attempted to hand him over to the Empire. However, Skelly was rescued by the rebel operative Hera Syndulla. During his inspection of Moonglow, Vidian murdered company head Lal Grallik and her husband Gord Grallik. Shortly afterwards, the Empire nationalized the company's assets when it was blamed for an explosion Vidian had ordered set off on Cynda which largely destroyed the moon's mining facility."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Since the company operated on both Gorse and its moon Cynda, Moonglow Polychemical maintained a fleet of freighters that were used to transport baradium bisulfate to Cynda for both blasting operations and the extraction of thorilide, a crystal used to shield turbolaser mounts. In addition, Moonglow operated a refinery in the Gorse urban settlement of Shaketown that used xenoboric acid to process the thorilide crystals into shock absorbers. The Shaketown refinery also served as Moonglow's headquarters and had a heavy-duty bulk-loader vehicle, which was considered to be the newest model in use on Gorse. Moonglow was also know to operate a spaceport near its Shaketown refinery that serviced the company's freighters."}, {"tag": "p", "text": "The company was managed by the Besalisk Lal Grallik while her husband Gord Grallik served as the head of ground security at its Shaketown plant. As chief operations officer, Lal introduced several safety improvements to her Shaketown refinery which was emulated by other Gorsian factories. While the Gralliks employed several of their cousins to clean and guard the Shaketown refinery, they employed several miners and pilots from various species. One of their pilots was Kanan Jarrus, a Great Jedi Purge survivor, who flew a freight hauler designated Moonglow-72; which he christened the Expedient. In addition, the bartender Okadiah Garson also worked as the foreman of a mining team for the company."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Moonglow Polychemical originated as an offshoot of Introsphere, a mining company that had gone bankrupt after the mining consultant Denetrius Vidian authored a critical report that ended all surface thorilide mining on the planet Gorse. Moonglow was involved in mining operations on Gorse's moon Cynda, which was rich in thorilide. In 11 BBY, Moonglow's chief of operations Lal had to deal with a dissident miner named Skelly, who tried to convinced Moonglow and the other mining companies not to blast beyond Zone Forty-Two while he conducted some research. Lal ignored him and returned to Gorse."}, {"tag": "p", "text": "Undaunted, Skelly conducted his test-bombing in Zone Forty-Two which disrupted mining operations on Cynda. He also resisted arrest from several stormtroopers, who tried to arrest him for seditious remarks he had made on an elevator. Skelly was later apprehended by Kanan, whose team had narrowly survived the blast. Angered at Skelly's actions, Kanan and his friend Okadiah Garson restrained him in chains and handed him over to Gord Grallik at Shaketown. The Gralliks promptly informed the now-Count Vidian, who had become the Emperor's efficiency expert and was overseeing production in the Gorse system. Recognizing Moonglow as a spinoff of his rival Introsphere, Vidian decided to inspect the company as part of his tour of Gorse."}, {"tag": "p", "text": "Later, the rebel operative Hera Syndulla managed to free Skelly from Moonglow custody after she hired a criminal gang known as the Sarlaccs to attack the Moonglow refinery in Shaketown. Twelve hours later, Count Vidian inspected the Moonglow refinery as part of the first leg of his Gorsian tour. The tour was hosted by the company's chief operations officer Lal Grallik. During his tour, the refinery was infiltrated by the rebel Hera, who was tailing Vidian, and Skelly, who wanted to convince the Count to end all thorilide mining operations on Cynda due to the fragility of the moon's surface. Skelly tried to reason with the Count but Vidian assaulted him, forcing him to flee into the factory."}, {"tag": "p", "text": "After learning from his rival Baron Lero Danthe that the Empire had tripled the Gorse system's thorilide quota, Vidian killed Lal after learning that Moonglow could not meet that quota. Using Skelly's research, Vidian decided to cut his tour short and return to his Imperial Star Destroyer Ultimatum. However, Skelly made two attempts to kill him by bombing two Imperial shuttles. Vidian also had to contend with a vindictive Gord, who had come to seek justice for his murdered wife. Instead, Vidian killed Gord and later covered up Lal's death by claiming that she had fallen into a vat of xenoboric acid during a ground quake."}, {"tag": "p", "text": "Count Vidian then moved against Moonglow by staging a test bombing on the mining facilities on Cynda which killed many miners. In truth, the explosion was a test bombing conducted by Vidian to prove his theory that detonating Cynda would not destroy the moon's thorilide results. However, Vidian had falsified the results in order to discredit his rival Baron Danthe. To cover up Vidian's secret plot, Imperial investigators claimed that Moonglow's negligence had cause the blast. The Empire then used the blast as a pretext to nationalize the company and to seize its assets. Several Moonglow ships including the Expedient were used by Vidian to transport Baradium-357 from his depot in the Calcoraan system. The rebels Hera, Kanan, Skelly, and Zaluna Myder used the Expedient to disrupt Vidian's plan to destroy Cynda during the Gorse conflict."}, {"tag": "p", "text": "Following the events of the Gorse conflict, Moonglow was owned by the Galactic Empire, which competed with the other Gorsian firms. The Empire continued Lal's safety improvements which were also adopted by the other factories on Gorse."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}