{"url": "Moorja/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Agriworlds", "Category:Confederacy of Independent Systems planets", "Category:Corellian Trade Spine", "Category:Corporate Alliance locations", "Category:Galactic Empire planets", "Category:Inner Rim planets", "Category:Moorja locations", "Category:New Republic planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Moorja"}, {"tag": "p", "text": "Moorja was a small Inner Rim world on the Corellian Trade Spine. It was owned by the Salliche Agricultural Corporation, which ran an agricultural and mining colony there. Though the planet was frequently swept by fierce ion storms capable of interfering with electronic equipment, it was a major exporter of foodstuffs."}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems established a base on the planet, gathering soil from its badlands, which it then utilized during its assault on Ukio. The Confederacy later conquered the planet and garrisoned it with organic forces, a rare move for the battle droid-focused government. While there, the CIS fought the Galactic Republic in the Battle of Moorja. The planet subsequently became part of the Galactic Empire and home to an advanced scout training facility. During the Galactic Civil War, the planet was the site of another major engagement, between forces of the Empire and the rogue Moff Utoxx Prentioch; both were attempting to gain access to a New Republic reconnaissance report prepared by the Black Curs. Later that same year, the New Republic gained control of the planet, establishing a permanent base, and using it as a jumping point for assaults against various Imperial forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Moorja was a small planet in the Moorja system of the Inner Rim, down the Corellian Trade Spine from Yag'Dhul. It had one moon, and a local day consisting of seventeen standard hours, and a year of 310 local days. The terrain varied from fertile plains and forests to a number of desolate badlands. Notable among these badlands were the Crumbling Lands, a region of sedimentary rock strata undermined over many years by water erosion. Many caves and tunnels crisscrossed the area, while sandstone formations and deep sinkholes dominated the surface. The soil in the Moorja badlands was an electrostatic compound with photosensitive properties."}, {"tag": "p", "text": "In contrast to these barren regions, most of Moorja's surface was naturally fertile, aided by plentiful rainfall from the frequent ion storms that blew in from the world's oceans. However, poor crop management had taxed this fertility, leaving many areas dependent on artificially produced fertilizer. Nevertheless, Moorja produced sufficient crops of fenti beans and ruva grain to export offworld."}, {"tag": "p", "text": "The planet was home to no native sentient species. The most distinctive creatures there were the bruwoses, immense lizards that inhabited the badlands. Equipped with large fore-paw talons, the reptiles burrowed through the soft rock, searching for small prey. The bruwoses possessed only vestigial eyes, instead using heat, sound and smell for guidance."}, {"tag": "p", "text": "A frequent recurrence on Moorja were ion storms. These lightning storms heavily interfered with electronic equipment, and ion lightning strikes damaged shields, life support, nav-control and other important starship systems, rendering planetary landings extremely difficult. To counteract this, most of Moorja's farming equipment was earthed, however, machinery still needed to be replaced often."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "Around 22 BBY, near the start of the Clone Wars, the Confederacy of Independent Systems established a presence in the Moorja badlands, under the command of Magistrate Passel Argente of the Corporate Alliance, and his assistant T-series tactical droid, Doctor. The Doctor had developed Project Instinction, an operative designed to neutralize the agriworld of Ukio. The Confederacy utilized four seismic tanks to collect soil from the Moorja badlands. The Confederacy took advantage of its photosensitive properties by dumping large amounts of soil into Ukio's atmosphere. There, it stuck to the planet's defensive shields, drifting to stay in line with the planet's star, creating a moving eclipse designed to block sunlight from the surface and destroy the planet's crops."}, {"tag": "p", "text": "In the later years of the Clone Wars, circa 20 BBY, the Confederacy gained control of the entire Corellian Trade Spine, including Moorja, after an extended campaign known as Operation Durge's Lance. The Confederacy then opted to fortify Moorja in order to protect the \"back door\" of their recent conquest. However, the frequent ion storms that swept the planet prevented a cost-effective deployment of the Confederacy's standard droid forces. As such, a combined force of organic troops, made up of Neimoidian Gunnery Battalions, Gossam Commandos, and Koorivar Fusiliers, was stationed on the planet, in a move announced by Commerce Guild Presidente Shu Mai. The cost of the unusual move was offset by the availability of agrarian yields to feed the troops. While planetside, the Fusiliers took part in the Battle of Moorja under the command of the famous General Oro Dassyne. The Koorivar General went on to lead troops in the ruinous Battle of Bomis Koori IV."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "With the defeat of the Confederacy and the subsequent declaration of the Galactic Empire, control of Moorja switched hands to the new galactic power. The Salliche Agricultural Corporation, an Imperial agricultural conglomerate, governed the planet, although so long as the colony paid its taxes and produce exports continued, supervision was limited. The Empire also established an advanced Scout trooper training camp in one of the more remote regions of the planet; Moorja was selected as a political favor to an officer of the Imperial Navy that hailed from the colony. The scout base was largely kept a secret from the planet's inhabitants, although a small garrison was established on the planet to keep peace in the urban centers."}, {"tag": "p", "text": "The training facility offered refresher courses for Imperial units who were rotated out on a weekly basis. While the facility was under the command of Colonel Dyrra, a group of smugglers broke into the facility and stole a Lambda-class shuttle. Fighting off the troops stationed there, and a number of training probe droids, the thieves piloted the shuttle straight into an ion storm and into orbit. There, they avoided an Imperial Star Destroyer and its TIE fighter patrols and escaped into hyperspace. Dyrra, however, was not content to end the pursuit. Tracking the thieves to the planet Tatooine, he ambushed them in their Mos Eisley docking bay. Despite this advantage, the thieves managed to escape the colonel a second time."}, {"tag": "p", "text": "While the Empire suffered a major defeat by the Alliance to Restore the Republic at the Battle of Endor, the defeat had little impact on Moorja. Even the rising unrest across the Salliche Ag conglomerate—where many workers rebelled, burning fields and farming facilities on multiple worlds—had limited effect on the populace, who continued their lives as though nothing had changed. However, despite the planet's momentary inconsequence, it was the site of a large skirmish between warring Imperial factions in 39:9, six months after the Battle of Endor."}, {"tag": "p", "text": "The cause was Dirk Harkness, a mercenary and Rebel sympathizer, who had conducted an extensive reconnaissance of the Core Worlds as a precursor to a major Rebel offensive in the central galactic region. Before departing on his mission, he had stashed a cache of equipment in the Crumbling Lands of Moorja. His mission having been discovered by the Imperial Advisors in the Core, he returned to the planet pursued by two of their Star Destroyers under the command of Bregius Golthan. However, Goltan's forces were met in the system by two Star Destroyers commanded by the Imperial Warlord Utoxx Prentioch. Prentioch, a former Moff and pretender to the Imperial throne who was carving out his own Dominion in the Mid Rim, sought Harkness's recon report for his own gains. While the warships exchanged salvos, Harkness and his companions aboard the Last Chance were stuck by turbolaser fire and crash-landed on the planet."}, {"tag": "p", "text": "Fortunately for Harkness and his team, General Airen Cracken, chief of the New Republic Intelligence Service, was aware of their pursuit. His team, dispatched to provide aid to the mercenaries, arrived in the Moorja system just as the Last Chance descended to the planet's surface. Competing with two sets of Imperial dropships, the operatives reached the downed mercenaries first. While Harkness's companions—Platt Okeefe, Tru'eb Cholakk, and Jai Raventhorn—were at the ship, Harkness himself had set off across the Crumbling Lands to retrieve a snubfighter he had stashed there. Tracking Harkness through the wastelands, they caught up to him outside the tunnel leading to his ship. However, blocking the entrance to the tunnel were three bruwoses, which the operatives were forced to kill in order to gain access to Harkness's ship. Once they had done so, they retrieved Harkness's Y-wing and regrouped with the crew of the Last Chance. Together they fled the planet, evading fighters from the battle still occurring in Moorja space."}, {"tag": "p", "text": "Later that same year, the New Republic successfully wrested control of Moorja from Imperial forces, as part of their strategy of isolating various Imperial warlords, and established a permanent presence on the world. The following year, the Republic pushed Coreward from Moorja, striking at Yag'Dhul against Admiral Sander Delvardus of the Eriadu Authority, and in 6 ABY, a Republic strikeforce from Moorja struck southwest at Bomis Koori, taking Prentioch captive."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "Moorja escaped the worst of the Yuuzhan Vong War of 25–29 ABY, being on the far side of the invasion vector of the extra-galactic Yuuzhan Vong's assault path, and remained in Republic hands. More than a century later, however, the planet was part of Darth Krayt's Sith Empire."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Though Moorja had no native sentient species, it was settled by a number of species under the auspices of the Salliche Ag Corporation. A small colony of Arcona settled the planet, working in salt mines. By 4 ABY, they numbered 2,500, most of whom had some degree of salt addiction. Around 15,000 Ithorians lived on the planet, settling around a number of forested regions, where they harvested specialty fruits and low yield crops for export. 25,000 Human settlers made up the remainder of the planet's permanent population."}, {"tag": "p", "text": "During the Clone Wars, a number of Gossam, Koorivar, and Neimoidians were stationed on the planet, but none remained on the planet in the decades afterwards."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Confederate base"}, {"tag": "p", "text": "During the Clone Wars, the Confederacy established a base in the mountains overlooking some of Moorja's badlands. From there, the Doctor was able to monitor the progress of the seismic tanks under his command. He occupied the installation, along with his pet Seventeen, and Magistrate Passel Argente, until leaving the planet to assault Ukio."}, {"tag": "h3", "text": "Moorjay"}, {"tag": "p", "text": "Moorjay was the sole spaceport on the planet and the only major settlement. It was an undisturbed environment, surrounded by millions of acres of farmland and fields. A number of smaller agrarian settlements were dotted around the spaceport, such as the settlement of Avisio."}, {"tag": "h3", "text": "Moorja Training Installation"}, {"tag": "p", "text": "The Moorja Training Installation was designed to provide refresher courses for squads from different Sector Fleets. It was located in a remote region of the planet, on the edge of crumbling badlands. The outpost contained limited facilities: a command bunker, two modular barracks, various storage sheds, a mess hall and a motor pool. A flat area was also cleared to provide landing facilities."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Moorja was created by Peter M. Schweighofer for the roleplaying game adventure Black Curs Blues, published in the Star Wars Adventure Journal 8 in 1993. There, it served as the setting for the first part of the adventure, which eventually moved offworld to Canyon and Voktunma. Schweighofer revisited the planet as part of the adventure The Lambda Heist in Star Wars Gamer 2, published in 2000. Again, it was the setting for one part of a larger adventure. The third appearance of the planet was in CIS Shadowfeed Dispatch 15:3:21 Edition, published in the Star Wars Insider 76 magazine in 2004. Moorja also briefly appeared in the online comic The Clone Wars: Act on Instinct."}, {"tag": "p", "text": "Moorja was initially placed in the Inner Rim region by Schweighofer, but was described as a Mid Rim world by Insider magazine. Despite this, both maps in which it has been placed and the Star Wars Gamer adventure all returned it to the Inner Rim. It is worth noting that in Black Curs Blues, the travel time from the position of the New Republic fleet near Mon Calamari, in the Outer Rim Territories, to Moorja was stated to be \"only a few hours.\" Since that publication, maps of the galaxy have been published with Mon Calamari on the other side of the galaxy from the Corellian Trade Spine, rendering this travel time unlikely."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}