{"url": "Mooring_tower/Legends", "categories": ["Category:Legends articles", "Category:Buildings"], "nodes": [{"tag": "h1", "text": "Mooring tower"}, {"tag": "p", "text": "A mooring tower was a structure used to dock larger spaceships that could otherwise not land on a solid surface."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The mooring towers were usually several hundred meters in height and could dock Star Destroyer-sized capital ships. Smaller vessels, like shuttles, could be docked using umbilical tubes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Spaceport towers on Coruscant allowed docking of large spaceships in the Jedi Temple Precinct during the time of the Galactic Republic. The Venator-class Star Destroyer had a set of large hangar bay door on each side of the vessel, that could dock with mooring towers for resupply purposes."}, {"tag": "p", "text": "A similar system to the mooring towers was used in Terrarium City on Alderaan, where the spires were used for turbolift shafts into and out of the sealed city, as well as for garbage disposal."}, {"tag": "p", "text": "On the Death Stars, the Galactic Emperor Palpatine utilized modified mooring towers—fitted with extensive shield systems—as his personal command centers when visiting. The tower for the second Death Star was known as the Emperor's Tower."}, {"tag": "p", "text": "An exceptionally large and massive mooring tower was the Imperial Freight Complex on Byss. It was here most freighter pilots hauling cargo to the planet ended up, going through extensive checks and resting out in one of the myriad cantinas inside the tower."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ralph McQuarrie paintings of structures on Alderaan from the production of the original film were reused in the prequel Attack of the Clones as mooring towers on Coruscant. The painting itself was reused in The Illustrated Star Wars Universe, depicting transport spires on Alderaan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}