{"url": "Ascension_gun/Legends", "categories": ["Category:Legends articles", "Category:Climbing equipment", "Category:Heavy blaster pistols"], "nodes": [{"tag": "h1", "text": "Ascension gun"}, {"tag": "p", "text": "An ascension gun was any weapon that carried a grappling hook launcher, commonly in conjunction with a liquid-cable launcher or a syntherope tether."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The ascension gun was generally a heavy blaster pistol with a grappling-dart launcher which launched a tether made of syntherope. The user could switch the weapon from blaster mode to ascension mode. When fired in ascension mode, the weapon shot a grappling dart attached to the syntherope, tethering the weapon to the target. If the tether was launched vertically, the ascension gun could quickly pull the wielder upward, with a maximum vertical lift capacity of roughly 720 kg. The ascension gun could also be used to create a horizontal zipline to a target surface. The zipline allowed the wielder to quickly slide along the line if the destination had a lower elevation. In ascension mode, the tether had a maximum range of 45 meters."}, {"tag": "p", "text": "The ascension gun had a capacity of 50 shots, after which the power pack would need replacing. Additionally, the ascension gun carried only two lengths of syntherope; after 2 uses, the syntherope had to be replaced. The ascension gun was restricted to military use."}, {"tag": "p", "text": "A variant of the ascension gun was the S-5 heavy blaster pistol."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The S-5 heavy blaster pistol used by the Royal Naboo Security Forces at the Second Battle of Theed could be easily configured to operate as an ascension gun. Queen Amidala and Captain Panaka used the S-5's grappling hook launcher to scale the walls of the Theed Royal Palace, during their ultimately successful attempt to capture Nute Gunray."}, {"tag": "p", "text": "The Jedi Knights of the Galactic Republic carried liquid-cable launchers on many missions. Qui-Gon Jinn used one such device to escape a doomed Bongo over the Virdugo Plunge in Theed, and to avoid drowning during high tide on Senali. 13 years later, Obi-Wan Kenobi and Anakin Skywalker would use their fibercord grappling hooks to reach safety in an elevator shaft onboard the damaged Invisible Hand during the Battle of Coruscant."}, {"tag": "p", "text": "Commander Luke Skywalker used a magnetic harpoon gun at the Battle of Hoth to lift himself underneath an AT-AT, where he used his lightsaber to slice open a section of the assault vehicle's belly. Skywalker threw a proton grenade into the breach, and released the harpoon, falling to the snowy ground moments before the walker exploded."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}