{"url": "Moranda_Savich", "categories": ["Category:Legends articles", "Category:Car'das members", "Category:Con artists", "Category:Females", "Category:Humans", "Category:Smugglers' Alliance members", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Moranda Savich"}, {"tag": "p", "text": "Moranda Savich, a Human woman, was a professional thief, con artist, and master of disguise who worked independently and in association with Talon Karrde's smuggling organization. In 0 BBY, she helped the Rebel Alliance get information on the construction of the Death Star I. In 19 ABY, though she was old enough to be a great-grandmother, she played an active role in Karrde's efforts to assist the New Republic during the Caamas Document crisis."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Activities on Darkknell"}, {"tag": "p", "text": "In 0 BBY, Savich was on the run from Corellian Security Force. CorSec agent Hal Horn had tracked her down on Corellia, Kreeling, Dorsis, and Mantarran, but she evaded him on each of those worlds. While on Darkknell, she impulsively stole a datapack from a patron at the Continuum Void tapcafe on Darkknell, unaware that he was an Imperial defector planning to give the datapack to a Rebel contact. Once she realized that she had stolen encrypted Imperial Military files, and that Imperial Intelligence agents were on the trail of the data (though not on her trail specifically), she slipped the datacards into the window well of an Imperial agent's rented landspeeder. After she had done this, however, Hal Horn and Intelligence Agent Ysanne Isard spotted her. When she turned to run, the first agent (Trabler) shot her on Isard's orders."}, {"tag": "p", "text": "Believing her dead, Isard, Horn, and Trabler left to pursue the Rebel agents they still thought had the datapack. Savich was only wounded, however, and was taken to a safehouse for medical treatment by Garm Bel Iblis, the intended recipient of the datapack. She agreed, for a price of 50,000 credits, to work with Bel Iblis to steal the datacards back. She did this by calling Darkknell's security forces with false tips, hoping to draw Isard into the open. With this accomplished, she used her disguise talents to impersonate an old friend of Horn's, and her pickpocketing skills to steal Isard's identification. She then had Isard arrested by Colonel Nyroska of the Darkknell Defense Agency, while claiming to be Isard herself. By the time the local authorities realized they had made a mistake, Bel Iblis had retrieved the datacards, and he and Savich had separately left the planet."}, {"tag": "h3", "text": "Activities on Bothawui"}, {"tag": "p", "text": "Sometime after her time on Darkknell, Savich put her talents to work for Talon Karrde's organization. While doing courier work for Karrde on Cejansij, Luke Skywalker helped her and her Noghri bodyguard Plakhmirakh fight off thugs hired by a Hutt syndicate. (Skywalker was on Cejansij to investigate the source of clones who had appeared in certain pirate groups.)"}, {"tag": "p", "text": "Soon afterward, Karrde sent Savich to Bothawui to investigate the anti-Bothan terrorist organization calling itself \"Vengeance\". While in the planetary capital of Drev'starn, she met up with Corran Horn (son of the late Hal Horn) and Wedge Antilles, who had been sent on a similar mission for the New Republic by Garm Bel Iblis. Together, they had some success in tracking down the Imperial Intelligence cell which was behind Vengeance's activities. However, Antilles and Horn were called off their mission in order to join the rest of Rogue Squadron, which was about to join the rest of the New Republic task force for the Battle of Yaga Minor."}, {"tag": "p", "text": "Though her criminal past made her unable to alert the Bothan authorities, Savich continued to harass the Imperials. Despite starting a fire in Exoticalia's Pet Emporium, the Drev'starn pet shop the Imperials were using as a front, \"Vengeance\" did not put a stop to their plans. Bothawui's planetary shields were still sabotaged, and a battle at Bothawui ensued. However, thanks in part to her efforts, the Imperial timetable was disrupted, one of several factors which led to the Imperial Remnant's defeat."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Savich was fond of Gralish liqueur, which she was often seen sipping during her adventures on Darkknell and Bothawui. She was also known for smoking cigarras in her early days."}, {"tag": "p", "text": "Savich's ship, the Fingertip Express, was a Sydon MRX-BR Pacifier scout vessel sold as Imperial surplus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}