{"url": "%22Shady%22_Pers", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Chefs", "Category:Humans", "Category:Kashyyyk residents", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "\"Shady\" Pers"}, {"tag": "p", "text": "\"Shady\" Pers was a male Human smuggler living among the Myyydril in the Myyydril Caverns during the Galactic Civil War in 1 ABY. The Myyydril claimed he was their chef, but also said that he didn't know the difference between Muon Gold and bofa treats."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 1 ABY, Pers contracted a fellow smuggler and spacer to retrieve a special crate from an abandoned Imperial camp in the Kkowir Forest. The spacer arrived at the camp to find it being guarded by Blackscale Clan slavers. The spacer killed them, including their apparent leader, a female Trandoshan named Myssith, and recovered the crate. Returning it to Pers, the spacer was rewarded with 3,000 credits and a DL-44 named the Black Falcon, which was a duplicate of Rebel Alliance hero Han Solo's modified weapon."}, {"tag": "p", "text": "Later, Pers was confronted by an Imperial Security Bureau agent looking to obtain a Krayt dragon pearl, which was recently delivered to Pers from Tatooine. In a dark corner of a spaceport on Kashyyyk, Pers and his acquaintances were cornered, and soon most of the thugs chose to escape from battle, leaving Pers alone. Hands tied, Pers had no choice but to hand over the pearl, which was worth 100,000 credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Shady\" Pers was a non-player character (NPC) in the expansion pack Rage of the Wookiees for the massively multiplayer online role-playing game Star Wars Galaxies prior to its closure on December 15, 2011. He, along with the planet Kashyyyk, were added to the game in 2005. He also appeared as a computer-only avatar card in the Star Wars Galaxies Trading Card Game."}, {"tag": "p", "text": "The mission he offered players in the game was only available to those who chose the Smuggler profession."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}