{"url": "Mordon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Mordon"}, {"tag": "p", "text": "Mordon was an admiral in the Imperial Navy and the commander of the Imperial-class Star Destroyer Vengeance during the Galactic Civil War. A native of a lush world in the Corellian sector, Mordon became a transport pilot before entering the Imperial Academy. Mordon's successful career saw him rise to the rank of admiral and assume command of the Vengeance by 3 ABY."}, {"tag": "p", "text": "While in command of the Vengeance, Mordon oversaw the Imperial conquest of the Taroon system and Farboon, where his shuttle came under attack from Rebel starfighters. After being rescued by a TIE/In interceptor piloted by Imperial mechanic Maarek Stele, Mordon recommended Stele for training as a TIE pilot. Over time, the two became close, with the admiral taking the cadet as his protégé. Mordon was killed by Admiral Harkov when he conducted an investigation into Imperial treachery that implicated the latter. He was eventually avenged when Stele proved instrumental in bringing Harkov to justice."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Mordon was born in the Corellian sector, on a planet with remarkable flora and fauna. As a youngster he desired to explore other worlds and began piloting freighters and transports. By the time he joined the Imperial Navy, he had already captained a small Corellian transport. After some time as a cadet at the Imperial Academy, Mordon entered active duty. He would later indicate that he spent at least some of his early career as a starfighter pilot, seeing much combat, and it is known that he earned several medals during this time."}, {"tag": "p", "text": "By 3 ABY, Mordon rose to the rank of admiral and assumed command of the Imperial-class Star Destroyer Vengeance. His newfound position allowed him the luxury of pursuing his own interests and, in a large room, discreetly located in one of the Star Destroyer's upper levels, he cultivated a garden, complete with a small waterfall and featuring plants from across the galaxy. Of particular note was a set of semi-intelligent plants, grown from seeds flown in from his home system, which spat a poisonous mist capable of killing a Human in seconds. The plants knew Mordon and did not spit at him or anyone in his presence, nor did they attack anyone wearing a special ring given to them by Mordon, which marked them as friends of the admiral. During his time on the Vengeance, the room became the admiral's personal retreat and allowed him to enjoy the solitude he found missing aboard a starship."}, {"tag": "h3", "text": "Invading the Taroon system"}, {"tag": "p", "text": "Around 3 ABY, he was charged with overseeing the Galactic Empire's invasion of the Taroon system and ending the conflict that had existed between the system's inhabited planets, Kuan and Bordal, since the end of the Clone Wars. Shortly after arriving in the system, the Imperials declared martial law and set about taking prisoners from both worlds, mostly public figures and hardened soldiers. Among those captured was a small Bordali transport, commanded by the Bordali agent Gwadj and containing the captive Maarek Stele, along with his mother, Marina Stele, and his friend Pargo."}, {"tag": "p", "text": "The day after the Vengeance arrived in the Taroon system, Mordon addressed approximately 150 inhabitants of the system in a small amphitheater aboard his Star Destroyer. In addition to numerous invited guests were prisoners from both sides whose interrogation had revealed skills deemed desirable by the Imperials and a willingness to accept Imperial rule. When the amphitheater was full, Mordon took his place at a small raised platform in the center of the room. Mordon blamed decades of neglect under the rule of the Galactic Republic's corrupt Senate, which had left their worlds with tattered economies and weak leadership, for the war which had ravaged their system. He explained how Supreme Chancellor Palpatine had swept aside the corruption and begun the process of rebuilding the galaxy as the Galactic Empire, beginning a new era of peace and prosperity that was only now spreading to Outer Rim worlds such as theirs. He further painted the Rebel Alliance as rogue aliens who refused to live peacefully with Humans and criminals who longed to restore the corruption of old, before introducing a holographic film designed to show the power at the Imperial Navy's disposal and a recorded message from Emperor Palpatine himself. Those called to the presentation were to be given the chance to serve the Empire, some by returning to their world to aid in the transition of power, while others would be allowed to join the Imperial Military. For those not swayed by Mordon's recruitment speech, the admiral made it clear that the Vengeance had the power to decimate their worlds should they not cooperate."}, {"tag": "p", "text": "Mordon's speech produced the desired effect, and the transition of power in the Taroon system went smoothly, with many of the attendees swayed into service to the Empire. Within three months, the system was firmly under Imperial control and Mordon took the Vengeance on its next assignment. The ship was frequently on the move, jumping between hot spots of Rebel activity and sometimes involved in multiple actions simultaneously. Although most of the fighting was left to the Vengeance's TIEs, later accounts of torpedo strikes would indicate that the ship itself came under attack on at least one occasion during this time."}, {"tag": "p", "text": "One such mission took the Vengeance to Farboon where it soon secured the area. However, as Mordon traveled in his shuttle to inspect the planet, he came under attack from Rebel forces. Two Rebel T-65 X-wing starfighters eliminated his minimal TIE escort and a pair of BTL Y-wing starfighters set about disabling Mordon's shuttle with an ion cannon attack. Before the Vengeance could send reinforcements, it was called away urgently and the only ship available to respond was a TIE interceptor that had been recently repaired and which Maarek Stele, now a starfighter mechanic on the Vengeance, was taking on a test flight. Though he had no formal combat training, Stele still came to the admiral's aid and was able to draw the Rebel fighters away from the shuttle. Though Stele was outnumbered, he was able to hold off the Rebels long enough for the Star Destroyer to return and for reinforcements to arrive. Some time after his safe return to the Vengeance, Mordon, flanked by two stormtroopers, went to see Stele in the small debriefing room where the pilot had been told to wait. Mordon personally commended Stele for his skill and bravery and consequently recommended him for starfighter pilot training in the Imperial Navy."}, {"tag": "h3", "text": "Protégé"}, {"tag": "p", "text": "Around this time, Mordon became suspicious of treacherous elements within the Imperial Navy and began conducting his own investigations. While this was ongoing, Stele returned from his basic training and, while Mordon was disembarking his personal shuttle, he recognized the young pilot in the hangar. Impressed by Stele's progress and recognizing certain traits in him that he wished to encourage, Mordon decided to trust him with a special password, \"There's a fog over Celadon City,\" which he could use if he ever needed to see the admiral."}, {"tag": "p", "text": "During Stele's continued training on the Vengeance, Mordon dispatched stormtroopers to fetch the young pilot and bring him to the admiral's garden. Mordon had been monitoring Stele's progress and had decided to take the cadet into his confidence and the meeting would be the first of many between the two. Over time, Stele came to regard Mordon as a surrogate father figure as the two frequently met for tea and to discuss history, combat techniques and the current galactic political situation. Mordon passed on some of his experiences with dogfighting, piloting and command, which Stele summarized into 23 rules labeled \"Some General Combat Tactics\". Mordon also provided Stele with one of the rings to allow him safe access to the garden in the admiral's absence."}, {"tag": "h3", "text": "Imperial treachery"}, {"tag": "p", "text": "Mordon had been studying Imperial transmissions, together with information from some of his sources, and was becoming increasingly convinced that his earlier suspicions were correct—there was a threat to the Empire from within the Imperial Navy itself. His sources led him to conclude that the treachery involved some high ranking Imperial officers, though with only partial information he was not yet able to identify any suspects. During the course of his meetings with Stele, Mordon confided his fears to the pilot. He also encouraged Stele to make contact with the Secret Order of the Emperor, whose envoys were already watching the cadet."}, {"tag": "p", "text": "Mordon continued his investigation and believed that he was close to the names of those involved. However, Mordon's investigation did not go unnoticed and news of the admiral's activities eventually reached Harkov, an Imperial admiral who had been selling Imperial arms and was negotiating to defect to the Rebel Alliance. Realizing that Mordon was getting close to exposing his treachery, Harkov ordered the admiral's assassination. Mordon, however, had come to suspect that his life was in danger aboard the Vengeance and, though he was unable to escape Harkov, one of his last acts while he was still alive was to make arrangements to have Stele transferred to the remote Outpost D-34 for his own safety."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Rumors of the admiral's death began to circulate on the Vengeance several days before the news was officially announced to the crew. The announcement said merely that he had died of \"natural causes\" and was to be replaced by (Acting) Admiral Coross. However, the admiral's suspicious death led to military investigators conducting an investigation aboard the ship, during which they interviewed many crew members including Stele, who had recently completed his training. The crew was told simply that the investigation was \"standard procedure.\" After several days, the investigators left and the turmoil caused by the admiral's death began to die down. Before his death, Mordon had written a message to Stele informing him of the reasons for his transfer, which was to be transmitted in the event of his death. Stele received the message, which claimed to be from his mother, but the style of the message and a reference to Celadon City prompted him to use Mordon's password to decrypt it and receive the admiral's final message to him."}, {"tag": "p", "text": "During his time on D-34, Stele finally made contact with the Secret Order before he was ironically transferred to the Victory-class Star Destroyer Protector, under the command of Harkov. While serving under Harkov, Stele uncovered some evidence of the admiral's dealings, prompting a full investigation by the Secret Order. As the net closed around him once more, Harkov was forced to step up his defection. Ultimately, Stele proved instrumental in uncovering Harkov's treachery and, after hearing that Harkov was responsible for Mordon's death, the pilot helped Imperial forces capture the rogue admiral. Mordon's death was finally avenged when Darth Vader executed Harkov for his crimes."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Admiral Mordon was a soft spoken individual whose narration skills provided him with the means to bring a prompt and peaceful conclusion to the conflict in the Taroon system. Maarek Stele considered the admiral to be something of an enigma but, in many ways, felt that he was one of the most personable officers he encountered during his service to the Empire. Unlike others in the Imperial Navy, Mordon realized the need to preserve resources and believed that there was no shame in passing up a kill if it meant you survived to fight another day, a philosophy that he developed during his early days as a pilot. He also valued those who showed an ability to think for themselves rather than blindly following orders."}, {"tag": "p", "text": "As a young man, Mordon felt that he was meant to travel to other worlds, yet he never stopped missing his own. He became an avid horticulturalist, an interest stemming from his early life on the lush world, and collected plants from across the galaxy for his garden aboard the Vengeance. Amid the stress of commanding a Star Destroyer, his garden provided him with a means of finding relaxation and solitude. He was also known to enjoy tea and exotic foods, which he would often share with Stele during their meetings in the garden."}, {"tag": "p", "text": "Mordon was an extremely loyal Imperial and was very concerned with treachery within the Empire's upper ranks. His investigation into the corruption left him tired and somewhat distracted by the weight of his undertaking. The admiral could trust few others with what he knew, yet chose to trust Stele, then a mere cadet. He attributed this to an almost sixth sense for dedication and promise in others. It was this sense, and conversely his sense for treachery and deceit, that he believed had allowed him to survive in the Imperial Navy for so many years."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mordon was created by Rusel DeMaria and first appeared in The Stele Chronicles, the novella that accompanied the 1994 video game Star Wars: TIE Fighter and told the story of the game's player character, Maarek Stele. He later appeared in DeMaria's TIE Fighter: The Official Strategy Guide, where his story was continued and further linked into that of the game when Harkov, one of the game's antagonists, was established to be responsible for Mordon's death."}, {"tag": "p", "text": "The Stele Chronicles uses a screenshot from one of TIE Fighter's cutscenes to represent Mordon's speech to the representatives of the Taroon system. In fact, the cutscene depicts Harkov giving a similar speech after pacifying the Sepan system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}