{"url": "Moregi%27s_wife", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Unidentified Rodians", "Category:Unidentified wives"], "nodes": [{"tag": "h1", "text": "Moregi's wife"}, {"tag": "p", "text": "Moregi's wife was a female Rodian who lived on Pantora and was married to the Volpai Moregi during the Clone Wars. She had a Rodian son through another mate but Moregi loved the child as his own. She stood by her husband after he had embezzled funds from the Rang Clan and was pursued by the bounty hunters Asajj Ventress and Quinlan Vos. Moregi's wife and child were present in their apartment when the two bounty hunters stormed it to apprehend Moregi."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Rodian woman had a son with an unidentified Rodian mate. At some point after, she met the Volpai Moregi and the two married despite coming from different species. She and her family lived in an apartment room on the moon Pantora. Their apartment had a narrow bell-shaped window with blue and yellow curtains and was located on the fourth floor of an apartment block. Moregi loved his family but was unable to provide financially for their needs. Their dire situation led Moregi to embezzle funds from the Rang Clan. The Clan retaliated by placing a bounty on his head and dispatching the bounty hunter Asajj Ventress to capture him."}, {"tag": "p", "text": "Ventress made four unsuccessful attempts to apprehend Moregi before partnering up with Quinlan Vos, an undercover Jedi Master, to capture the fugitive. Using his psychometric powers, Vos discovered that Moregi had a Rodian wife and child and ascertained the location of their home. The Rodian woman and her child were terrified when Ventress and Vos invaded their apartment to arrest her husband. Fortunately for her, the bounty hunters were not interested in harming her or her child. Following a struggle, Moregi's wife pleaded with Moregi to flee. Moregi jumped out through the window and tried to escape on a red speeder sled. However, the two hunters caught up with Moregi and handed him over to the Rang Clan."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Moregi's wife was a female Rodian with gray-green skin and large expressive eyes. She had son with an unidentified Rodian male. Despite coming from different species, she was a loyal wife and a devoted mother to their child. Her love and devotion for Moregi led her to urge her fugitive husband to flee when the bounty hunters Ventress and Vos invaded their apartment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Moregi's wife was an unidentified supporting character who first appeared in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled series.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}