{"url": "Morga_Bunna", "categories": ["Category:Legends articles", "Category:Bosphs", "Category:Bounty hunters", "Category:Criminals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Morga Bunna"}, {"tag": "p", "text": "Morga Bunna was a male Bosph who lived during the reign of the New Republic. Bunna worked as a bounty hunter, but later retired and established a depot on one of the moons of the planet Bosph, which served as a cache point for illicit items."}, {"tag": "p", "text": "In 19 ABY, supplies of the spice Tempest were stored in Bunna's facility by the Hutt crime lord Mika Anjiliac Chiera. Bunna had the Tempest removed after the Jedi archivist Mander Zuma and the spacers Reen Irana and Eddey Be'ray began shutting down the Tempest trade. Bunna's depot was later raided by Zumma and the Jedi's Corporate Sector Authority arrived moments later, and Bunna was forced to surrender to them. Bunna shared his knowledge of the Tempest trade with Zuma and in return for his honesty, the Jedi Master instructed the CSA to not detain the Bosph."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Morga Bunna was a male Bosph who lived during the era of the New Republic. After making a living as a bounty hunter and traveling across the galaxy, Bunna retired and set up a depot on the outermost moon of the Bosph homeworld for storing stolen goods. The small moon was desolate and far from the planet Bosph, and Bunna's facility served both as a place for criminals to cache illicit goods and a trading post for individuals who wished to sell their wares without meeting buyers face to face. To protect the anonymity of Bunna's customers, all deliveries to his depot were arranged through blind drops with shipping schedules changing regularly. Over time, Bunna burrowed through moon to expand his depot and he built a number of halls, passages, storage rooms, as well as a translucent pleasure dome along one side."}, {"tag": "p", "text": "Around 19 ABY, Bunna agreed to a number of contracts to store Tempest, a new potent form of spice produced by the Hutt crime lord Mika Anjiliac Chiera that left users prone to violent fits of rage. However, after the Jedi archivist Mander Zuma began disrupting the Tempest supply chain across Hutt Space and the Corporate Sector in an attempt to trace the source of the spice, Bunna sent on all of the Tempest stored at his depot and refused to accept any more shipments of the spice."}, {"tag": "p", "text": "To defend against any possible attack by Zuma, a squad of mercenaries were sent to Bunna's facility by Mika's crime syndicate, with orders to help the Bosph wherever they could with defending his depot. Three days later, Zuma arrived in the Bosph system aboard the TL-1200 transport New Ambition after having traced a shipment of Tempest he had found on the planet Budpock back to Bunna's depot. Using a communications channel that only Bunna's clients had been provided details of, the New Ambition hailed the Bosph and requested a meeting. Bunna correctly guessed that Mander Zuma was aboard the ship and he agreed to the request and granted the vessel permission to land."}, {"tag": "p", "text": "Bunna met with Zuma and the Jedi Master's associates, the Pantoran Reen Irana and the Bothan Eddey Be'ray, inside a transparisteel dome at the heart of the Bunna's depot. The Bosph introduced himself and confirmed to Zuma that Tempest had recently been stored at the depot, and he provided Zuma with a data cube that contained notes of his recent transactions."}, {"tag": "p", "text": "Bunna declined a request from Zuma to supply details of who had shipped the Tempest to his depot as he did not no their identity, and he did not yield any further information after Zuma attempted to use a Jedi mind trick on him. To resist any further attempt by Zuma to discover more about the origins of Tempest, Bunna summoned out the mercenaries that Mika had sent, who emerged with their blasters aimed at the Jedi. Bunna implored Zuma, Irana and Be'ray to return to their ship and leave, but Zuma refused and moments later the Corporate Sector Authority Invincible-class Dreadnaught Heavy Cruiser Resolute arrived at the moon. The CSA ship had been assisting Zuma with his efforts to disrupt the Tempest supply chain and it sent landing forces to raid Zuma's depot."}, {"tag": "p", "text": "The CSA forces found a number of items stolen from Corporate Sector citizens among the contents of Bunna's depot, but  Zuma stepped in to stop them from taking the Bosph into custody because the Bosph had been open and honest in his dealings with the Jedi Master. At Reen Irana's request, Bunna supplied her with information on the location of Hedu, the matriarch of a Rodian clan that had been involved in the distribution of Tempest, and confirmed that the Rodian leader could be found on the planet Dennogra. Zuma, Irana and Be'ray then departed Bunna's facility and ventured to Dennogra to track down the Rodian matriarch."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bunna considered Mander Zuma's campaign against the Tempest trade as both good and bad for business, as it prompted some customers to withdraw their wares from his facility, while it led others to transfer their goods to the safety of the Bosph's supply depot. During his encounter with Mander Zuma, rather than resist the Jedi, Bunna sought to keep his exchange with the Jedi Master as brief as possible by being open and honest about what information he possessed on the Tempest trade."}, {"tag": "p", "text": "Bunna wore opulent robes and as was common for members of his species, his four arms were inscribed with star maps depicting his travels. He also had two slender horns atop his head that were tipped with gold."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Morga Bunna was created by Jeff Grubb and appeared in the 2012 novel Scourge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}