{"url": "Morichro/Legends", "categories": ["Category:Legends articles", "Category:Control powers", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Morichro"}, {"tag": "p", "text": "Morichro was a powerful, but potentially dangerous technique of the Force which could slow down the body functions of another being into mild catatonia or long-term suspended animation. Although a few Jedi Masters practiced this as \"forbidden\" classified ability, it was considered off-limits for Jedi Knights without exceptions."}, {"tag": "p", "text": "One of its chief practitioners in the Order's last years was Jedi Master Yaddle."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Similar to a Force trance, morichro suspended biological functions, including breathing and heart rate. A trained morichro user could turn the technique upon himself, surviving without food, water, or even air for periods of over a year at a time, though it would not protect against vacuum. But unlike a Force trance, it could also be turned on others, making it an effective way of subduing enemies. However, failure to monitor a targeted opponent could render them permanently unconscious or cause them to die of dehydration or starvation."}, {"tag": "p", "text": "Despite its deadly potential, morichro was not practiced by those who used the dark side, as it required a mastery of a less malicious use of the Force than most darksiders traditionally employed."}, {"tag": "h2", "text": "History and notable users"}, {"tag": "p", "text": "Morichro had been known to Jedi since 24,500 BBY. During the First Great Schism, Jedi Master Awdrysta Pina used the technique against Arden Lyn, killing her, until she was resurrected by the power of the Kashi Mer talisman 250 centuries later. Before approximately 5000 BBY, use and training in morichro was left unchecked, but the Council -wary of its potential for abuse - classified it as forbidden ability and banned its teachings to all but a select few by 1000 BBY."}, {"tag": "p", "text": "Before long, the Force ability became forgotten to most Jedi, and its mention became scarce, if hardly at all. In the last centuries of the old Jedi Order, however, the Jedi Master Yaddle uncovered the ancient technique after apparently scanning through three holocrons that barely contained any information on the power. While the Jedi High Council allowed her to teach some students on morichro, they ultimately prohibited its use as abuse of the technique could easily prove fatal."}, {"tag": "p", "text": "During the Clone Wars, Jedi healers used morichro to destroy stone mites on Kishi."}, {"tag": "p", "text": "Kyp Durron used morichro when he saved himself from the destruction of the Sun Crusher. After stuffing himself inside a messenger pod as his only means of escape, he was rescued by Han Solo, Lando Calrissian, and Mara Jade. Han thought that Kyp entered into a form of Jedi meditation, but Mara corrected him saying that Kyp survived by slowing his bodily functions to the point of near-stasis."}, {"tag": "p", "text": "It was also successfully used by Anakin Solo on Yavin 8 against a reel."}, {"tag": "h2", "text": "Risks and dangers"}, {"tag": "p", "text": "There was a great risk that an untrained user may go too far and accidentally stop a heart from beating."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When first introduced in The Emperor's Pawns article, this ability was spelled \"Mortichro.\" Later publications, such as the Power of the Jedi Sourcebook misspelled it, and since they were published widely, \"morichro\" became the accepted spelling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}