{"url": "Ash-Streak", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Humans", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Ash-Streak"}, {"tag": "p", "text": "Ash-Streak was the nickname New Republic pilot Temmin Wexley gave to a male desert trooper he encountered during the Battle of Jakku in 5 ABY. \"Ash-Streak\" fought in the battle as part of the Galactic Empire's ground forces and found Wexley while accompanied by two other members of the Stormtrooper Corps and an All Terrain Scout Transport shortly after the pilot's T-65C-A2 X-wing starfighter had been brought down during the battle."}, {"tag": "p", "text": "Knowing that the Empire had already all but lost the battle, Ash-Streak and one of his comrades decided to take their time killing Wexley, despite the orders of their commanding officer. Before the Imperials had a chance to harm the pilot, Wexley's customized B1-series battle droid Mister Bones arrived to save his master. The droid used a vibroblade built into his arm to first kill the stormtrooper's leader and then kicked Ash-Streak to the ground before stabbing him multiple times in the chest and killing him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male desert trooper was amongst the many members of the Stormtrooper Corps who gathered as part of the Galactic Empire under the leadership of Counselor to the Empire Gallius Rax on the planet Jakku. In the year 5 ABY, he was part of the Imperial ground forces during the Battle of Jakku, in the which the New Republic's military forces staged an attack on the planet in order to defeat the Empire once and for all."}, {"tag": "p", "text": "Shortly after the Imperial Executor-class Star Dreadnought Ravager crashed to Jakku's surface, the trooper was traveling through the desert battlefield with his commanding officer, another trooper and an All Terrain Scout Transport when they came across the New Republic pilot Temmin Wexley, whose T-65C-A2 X-wing starfighter had been brought down by debris from the Ravager."}, {"tag": "p", "text": "The troopers silently observed the lone enemy combatant, who mentally nicknamed the two lower ranking troopers as \"Ash-Face\" and \"Scruff-Cheek\", until he tried to speak, at which point the leader of the trio of silenced him. Ash-Streak then suggested they have fun killing Wexley slowly, but the leader ordered they kill him quickly so they could return to battle. Scruff-Cheek ignored this and suggested shooting off Wexley's limbs one at a time, but before the Imperials had a chance to act on their grim plans the B1-series battle droid Mister Bones fell from the sky and landed atop the walker."}, {"tag": "p", "text": "Bones, who belonged to Wexley and had dropped from a stolen Imperial transport piloted by Wexley's mother Norra Wexley, swiftly climbed down the side of the AT-ST and killed the leader of the three troopers with a vibroblade before they could properly react. The droid then kicked Ash-Streak to the floor and leapt atop him, stabbing him in the chest with the vibroblade several times, perforating his armor and killing him. Temmin Wexley then knocked down Scruff-Cheek while Bones took out the walker's drivers, although the droid was destroyed moments later when a Republic RZ-1 A-wing interceptor fired upon the AT-ST and destroyed it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ash-Streak and his comrades failed to follow proper Imperial protocol upon discovering Wexley, standing in silence instead of ordering to drop his weapon. Knowing that the Empire had lost the battle already, he suggested that he and his comrades have some fun killing Wexley and ignored his commanding officer's orders to kill the pilot quickly."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ash-Streak wore scarred stormtrooper armor with finger-streaks of gray ash painted onto the helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ash-Streak first appeared in the 2017 novel Aftermath: Empire's End, which was written by Chuck Wendig."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}