{"url": "Morlish_Veed", "categories": ["Category:Legends articles", "Category:Fel Empire military personnel", "Category:Grand Admirals", "Category:Grand Moffs", "Category:High Moffs", "Category:Humans", "Category:Imperial heads-of-state", "Category:Imperial Navy admirals of Darth Krayt's Galactic Empire", "Category:Imperial Supreme Commanders", "Category:Males", "Category:Moffs of Darth Krayt's Galactic Empire", "Category:Moffs of the Fel Empire", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Morlish Veed"}, {"tag": "p", "text": "Morlish Veed was a male Human who served as an Imperial High and Grand Moff, as well as Grand Admiral and one of the foremost leaders of the Fel Empire around 130 ABY until he reached the rank of Lord Regent of the Sith-controlled Empire during the Second Imperial Civil War in 137 ABY. After the death of Darth Wyyrlok and the reappearance of Darth Krayt, Veed was removed from his position as Regent. Veed remained Krayt's lead military officer and commanded the assault on the Hidden Jedi Temple and coordinated the defense of Coruscant when it came under assault by the allied forces of the Empire-in-exile and the Galactic Alliance Remnant. Veed was killed during the battle by his former lover, Nyna Calixte."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving Fel"}, {"tag": "p", "text": "Veed originally served onboard the ship Wesk Herf. He was regarded as a military genius and an even more astute politician, being the only person to hold the rank of Grand Admiral while also serving as the head member of the Moff High Council. As such, he was second in rank only to Emperor Roan Fel, and harbored barely-hidden ambitions toward replacing Fel on the Imperial throne."}, {"tag": "p", "text": "He was also the lover of Moff Nyna Calixte, the Director of Imperial Intelligence, who left her husband, Moff Rulf Yage, for Veed. When the Sith approached her with an offer to cooperate in conquering the Galactic Alliance, he quickly became involved in their plans. Like Darth Krayt, Veed believed that the galaxy needed to be united under the leadership of a single strong ruler; however, he believed that he should be that man, not Krayt."}, {"tag": "p", "text": "He served as the Supreme Commander in the Sith–Imperial War from his flagship, the Pellaeon-class Star Destroyer Imperious, and commanded the decisive Battle of Caamas. This earned him the rank of High Moff. However, the remnants of the Alliance fleet, led by Admiral Gar Stazi, were planning of escaping. Veed entrusted Dru Valan to prevent this but the GA forces escaped through a spacer route. Veed reported the final victory over the New Jedi Order to the Emperor and the Moffs in the throne room on recently-conquered Coruscant—which served as the signal for Darth Krayt and his Sith to attack the guard detail of Imperial Knights and slay the Emperor."}, {"tag": "h3", "text": "The Sith Empire"}, {"tag": "p", "text": "For a moment, Veed believed that he was about to become the first ruler of a united galaxy in more than a century—only to watch as Darth Krayt settled down casually in the throne, and proclaimed himself the new ruler of the Empire. The Sith Lord invited Veed, as the senior member of the Imperial hierarchy, to be the first to swear loyalty, and the Grand Admiral, inwardly reluctant, complied. Despite the fact that his plan to become Emperor had temporarily failed, Moff Calixte quickly reminded him that he could still sit upon the Imperial throne in the future. Veed appeared to have been unaware that the real Roan Fel had survived the assassination attempt, and that the man slain by Krayt had merely been his double."}, {"tag": "p", "text": "Seven years later, when word spread that a Skywalker had survived, Veed thought of capturing him and turning him to his side. But when Morrigan Corde failed and the Sith called off the search, as they had captured him, Veed still refused to give up."}, {"tag": "p", "text": "The Moffs then began to argue whether or not Skywalker had been captured and whether or not they should reassert their authority like back in the days of the Remnant until Veed dismissed all points. He later went to Calixte's apartment, discussing on how to obtain Skywalker."}, {"tag": "p", "text": "Veed later assigned Morrigan Corde to retrieve Cade Skywalker from the Temple of the Sith, but for a price. In addition, she wanted three dozen Yuuzhan Vong Thud Bugs the Imperials just confiscated from Black Sun. Veed agreed to these terms, and even intended to personally deliver the Vong Bugs to her, however Calixte found out and took over the job of delivering the bugs, knowing Veed was attracted to Corde. When she had approached him at his apartment, he had tried to seduce her."}, {"tag": "p", "text": "Veed saw the explosions resulting of Corde's attack on the Sith Temple and when Skull Squadron attacked the Mynock near it, Veed ordered Moff Yage to call them off citing Sith orders that no ship was to trespass their airspace."}, {"tag": "p", "text": "After Skywalker's escape from Coruscant, Veed spoke to Calixte outside her refresher, wondering how to explain to Krayt why they pulled back the squadron, though he was pleased on the damage done to the Temple. He then noticed a holographic choker that he had never seen before. Calixte told him it was a family heirloom. In reality, it was a holo of Kol Skywalker with his family — Corde and Cade. Also unknown to Veed was that Nyna Calixte and Morrigan Corde were actually the same person."}, {"tag": "h3", "text": "Regent of the Empire"}, {"tag": "p", "text": "Veed and Calixte later heard that Krayt was wounded during an attempt on his life. They also heard Darth Wyyrlok would be serving as leader of the Empire until Krayt - who was actually dead, having being killed by Lord Wyyrlok himself - had recovered. Veed and Calixte both suspected something more was going on, and became determined to uncover the truth."}, {"tag": "p", "text": "While Calixte was absent supposedly to find a way into Korriban, Veed was summoned to a meeting with Darth Wyyrlok, something he was reluctant to attend because the Sith had a reputation of killing people who were called to similar meetings. Wyyrlok explained to him that Emperor Krayt had suffered severe injuries on Had Abbadon that required him to remain in stasis. He also told Veed that the Sith understood that he needed to command the Empire, but many of the non-Sith personnel and citizens of the Empire did not because they did not know Wyyrlok's position as Krayt's Voice. Veed assured Wyyrlok that his authority would go unchallenged, but Wyyrlok had another idea in mind. For the sake of those outside the Sith Order, Wyyrlok proposed the idea of making Veed the Regent of the Empire. Veed would rule the Empire in Krayt's name, while secretly answering to Lord Wyyrlok to ensure he was carrying out Krayt's will. Veed was shocked, but accepted the offer nonetheless."}, {"tag": "p", "text": "One of Veed's first actions as Regent was to summon the Moff Council for a meeting. There, he informed them of his plan to implement Operation: Thunderstroke, an strike against a secret meeting between Roan Fel and representatives of the New Jedi Order on the planet Agamar. He also informed that his sources had revealed to him the existence of a spy among Imperial ranks, prompting him to order that in order to ensure the missions success and until the spy was uncovered, no messages would be transmitted from or to Coruscant or any Imperial ship without his direct knowledge and authorization."}, {"tag": "p", "text": "This turn of events led Moff Calixte to privately confront Veed on his personal office. She chided him for having accepted Lord Wyyrlok's offer without consulting to her first. Though he retorted that he was a step closer to the throne, she reminded him that as public face of the Empire, he would have to answer for any action and atrocity committed by the Sith, who had made him their tool. Angered by Calixte's questioning and what he considered disrespect from an inferior, Veed threatened her with physical violence and dismissed her."}, {"tag": "h3", "text": "Final Protocol"}, {"tag": "p", "text": "After the public learned of the execution of the Final Protocol on Dac, which would eliminate every single being on the planet within seven days, Veed was confronted by a number of Quarren ministers, as his status as Regent, the public face of the throne, made him responsible for any action committed by either Sith or Imperial forces."}, {"tag": "p", "text": "Veed confronted Lord Wyyrlok to know why he had given the order without consulting him first. Wyyrlok limited to strangle Veed with the Force and told him that it was Lord Krayt's will, therefore there was no need for consultation, and that the extermination of Dac's inhabitants not only would send a message to the entire galaxy, but it could also lure the Galactic Alliance Remnant into a trap."}, {"tag": "p", "text": "A week later, Veed prepared to receive the recently captured Princess Marasiah, only for his orders to be overruled by Darth Havok, a Sith Inquisitor acting under the authority of Darth Wyyrlok, who took the Princess to Korriban. Havok also informed Veed that the loyalty of all Moffs were in question since Emperor Fel had been warned of the Sith Imperial attack. Veed confronted Moff Yage about the failed operation. Yage chided Veed about the Empire becoming a tool of the Sith's will and warned him that the Sith would cast him aside when he was no longer useful."}, {"tag": "p", "text": "After Yage left the landing platform, Veed questioned Moff Calixte about her absence. After she told him that he had been in the Undercity to try to verify the rumors about Darth Krayt's death, Veed gave her a new mission: to uncover the traitor. Unbeknownst to Veed, Nyna was the one who had warned Roan Fel."}, {"tag": "h3", "text": "Krayt's return"}, {"tag": "p", "text": "Several nights later, Morlish came close to discovering Nyna's secret when he discovered her reminiscing about her past in the middle of the night. He scolded her and told her to return to bed."}, {"tag": "p", "text": "Veed was present with Calixte in the throne room of the Sith Temple when Krayt, having resurrected, returned to Coruscant to reclaim his throne from Darth Wyyrlok. Krayt and Wyyrlok proceeded to engage in a fierce duel, in which Krayt was victorious. With himself fit again to rule the Empire, Krayt dismissed Veed as Regent, but allowed him to resume his position as Grand Admiral. Veed offered no opposition and relented to Emperor Krayt's will."}, {"tag": "p", "text": "A short time later, after giving Emperor Krayt a status of the position of several galactic powers, Veed was given the task of rooting out Roan Fel's spy, and was told that his survival depended on his success. He obtained the spy's identity from his own source within Bastion, Master armorer Hogrum Chalk, who as the newly appointed head of Bastion's security had access to information he wasn't able to in the past. It had been Chalk who had informed Veed of Fel's meeting with the Jedi on Agamar, and now he revealed the spy within Krayt's Empire: Nyna Calixte."}, {"tag": "p", "text": "Veed made his way to the Calixte's apartment with the excuse of celebrating he figured out that Konrad Rus, the head of the Imperial Mission and who had disappeared, was the much-sought spy. After pouring his lover a glass of Merenzane Gold, Veed asked her why was she packing. Calixte answered that she was going offworld to personally investigate some intel, but quickly discovered she had been poisoned. Veed received a kick in the face and quickly drew a blaster from his boot, just as Calixte took one from her bag. The two former lovers shot at each other, and Nyna fell off the landing platform."}, {"tag": "p", "text": "Afterward, Veed contacted Admiral Yage, who was aboard his flagship, the War Hammer, alongside his daughter Gunn. After expressing his doubts that Yage knew nothing despite having been her husband, he informed Moff Yage that he had executed Nyna and threatened to \"break\" Yage if he found any evidence the latter had a link to Calixte's treason."}, {"tag": "h3", "text": "Final Actions"}, {"tag": "p", "text": "When Darth Krayt discovered the position of the Hidden Temple on Taivas and assembled large amount of Imperial forces to destroy it, Veed was put in charge of supervising the task force alongside the Sith Lord Darth Stryfe, with Moff Yage commanding the naval forces and Moff Geist the ground troops. However Darth Krayt had large reserves of forces that Veed was unaware of, a secret cadre of Sith troopers ready to move in should the battle go against him."}, {"tag": "p", "text": "The battle at Taivas originally went in favor of the Imperials but when Empire-in-exile and Galactic Alliance Remnant forces arrived to aid the Jedi, Krayt made his move. Hundreds of Sith troopers joined the battle, devastating the allied forces before attacking the Hidden Temple itself. The arrival of these troops surprised Veed and Stryfe, especially when they swept through the Imperial forces already on the ground in an attempt to reach the Jedi. Veed attempted to warn Geist of the danger but the latter was killed by his own side's reinforcements. Although the battle was a victory for the Imperials, they had suffered heavy losses, as well as the defections of Moff Yage and his daughter following the devastation wrought by the Sith troopers."}, {"tag": "p", "text": "Short time after the fall of the Hidden Temple, Morlish Veed was stationed on the Imperial Command Headquarters at Coruscant when the allies launched a surprise attack at the planet. As the battle raged following the destruction of the planet's orbital defenses, Veed received a report from Admiral Krion Grail about the intervention of Darth Nihl and his Sith ships. Veed commented that regardless of the Sith, Fel's alliance would have no hope for victory, only to be interrupted by a shot in the back courtesy of Morrigan Corde, who had infiltrated the Imperial command center with a group of Jedi and Imperial Knights. Veed fell to the ground to see the face of his attacker. Never revealing her alternate identity to him, the final words Veed heard were Nyna Calixte sends her regards, before being shot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Morlish Veed was ambitious and power-hungry. He made his way to power under the reign of Roan Fel by joining the military and rising through its ranks swiftly. He finally became the leader of Imperial military forces being second only to the Emperor in matters of power. He was willing to betray his lord to claim the Imperial throne, the true power that he craved."}, {"tag": "p", "text": "Veed had very little sense of loyalty to anyone other than himself. He betrayed Roan Fel several times without hesitating and also nearly betrayed his lover Nyna Calixte when he tried to seduce Morrigan Corde, not knowing that they were the same person. He did not display any loyalty whatsoever to the Sith, even plotting behind their backs until Darth Wyyrlok offered him a position of power as Regent of the Empire, an offer he took without second thought. Veed was highly arrogant as well, dismissing Roan Fel's alliance with the GA and Jedi as insignificant and challenging the authority of Darth Wyyrlok when the Sith Lord did not consult him about the Final Protocol."}, {"tag": "p", "text": "Veed was a noted military commander and a strict hardliner who looked down on non-Humans and on women, including his own lover. He was cunning, making him a good politician, and was also particularly ruthless, willing to sacrifice any life if it served his purposes."}, {"tag": "p", "text": "Ultimately, Veed's main defining traits were also his greatest weaknesses. His lust for power blinded him to the possible dangers and consequences of his choices. He cast his lot with the Sith without realizing Darth Krayt's intent to seize the Imperial throne for himself, and when promoted to Regent, he believed this made him ruler of the Empire, when in fact his position was a mere figurehead intended to answer for the Sith's actions, not to exercise any real power. In addition, his arrogance led thim to underestimate his enemies on several occassions, notably during the battles at Caamas, Taivas, and Coruscant. These traits culminated in his downfall when, after believing he had successfully terminated Calixte for her treason and believed victory was in his grasp, his former lover returned as Morrigan Corde and mocked him for his obliviousness before shooting him dead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}