{"url": "Morling", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Canine sentient species", "Category:Morlings"], "nodes": [{"tag": "h1", "text": "Morling"}, {"tag": "p", "text": "The Morlings were the native sentient species of the planet Morda."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Morlings were humanoids and canine in appearance. They possessed a thick fur with sharp claws on their hands and feet. They were also stocky and strong."}, {"tag": "p", "text": "Their language was based on growls and hard consonants, difficult to pronounce for Humans."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Morling society was primitive, belligerent and clan-based. Organized in hunting tribes, they lived in caverns and burrows."}, {"tag": "p", "text": "Their principal occupation was to gain a better rank in the clan's hierarchy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Recently discovered by the time of the Galactic Empire, Morlings quickly adapted themselves to modern weapons and starships, although they couldn't use them to their full potential as they considered it to be magic. However, they became pirates and looters, and the Empire didn't manage to eradicate this menace, despite pacifications attempts on Morda."}, {"tag": "p", "text": "At the pirate lair of Providence, they occupied the wreckage of a Mon Cal luxury yacht, where they organized a sort of anthill with separations between clans. Outside observers noted that they seemed to do little but eat—sometimes human flesh—fight, and wallow in their own filth. The rest of the population stayed away from them, and never took their opinions into account."}, {"tag": "h2", "text": "Morlings in the galaxy"}, {"tag": "p", "text": "Akrim was a notable Morling chief."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Morlings were created by Jean-Michel Ringuet for the ambiguously canon roleplaying help \"Providence\" which appeared in the French magazine Avalon 1. The lone Morling to be depicted, Chief Akrim, was illustrated by Jean-Marc Emy."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}