{"url": "Morodin/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Gastropod sentient species", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Morodin"}, {"tag": "p", "text": "Morodins were a species of large, sentient herbivores. Often mistaken for massive herd animals, the Morodins had long, slender bodies that could grow up to twenty meters in length. They possessed six legs and two forearms, as well as a wide spoon-shaped snout. The most distinctive feature of the Morodins was their ability to secrete a nutrient slime trail that promoted growth and mutation in plant life that it covered. The composition of the secretion varied with the Morodin's diet, and they were always experimenting with new combinations by eating plants, exuding the secretion to create a new, more nutritious, strain of flora which then entered their food chain."}, {"tag": "p", "text": "Originally from a homeworld that struggled to feed its growing population, the Morodins established a colony on the planet Varonat to grow food. The Morodins turned part of Varonat into a vast jungle and transported their bounty to the homeworld aboard organic space vessels. However, an ecological disaster on their homeworld prevented the Morodins from growing their ships, and contact with the homeworld was lost. The Morodins on Varonat continued to thrive. Eventually, Human colonists reached Varonat and saw the Morodins as wild beasts intent on destroying their plantings when, in reality, the Morodins were trying to help the Humans to grow their food. During the early years of the New Republic, a group of Krish began planting in the jungle and actively allowing the Morodins to fertilize the crop. At the same time, a safari had been established by the same group of Krish that killed several Morodins a year as part of a big-game hunt."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Morodins were huge, sentient, herbivorous, mammalian lizard–slugs that grew to between ten to twenty meters in length, but usually averaged about fifteen meters. Long and slender, the Morodins had no trouble navigating dense jungle foliage. Members of the species possessed six stubby legs with three-toed feet, and two short forearms that terminated in clawed, three fingered hands. A long neck, which included prominent bulges where it connected to the lower jaw, supported a head with a spoon-billed snout full of flat teeth, and an eye on either side of a ridged cranium. Yellow skin covered the Morodin body, with darker-colored mottling running down the back; a small tail protruded from the rear of the body. Morodins were generally peaceful and docile, even when confronted with a clear threat, and they moved relatively slowly. The Morodin produced a distinctive growl, which they used for communication."}, {"tag": "p", "text": "Morodins exuded a nutrient slime trail that fertilized soil and plant life, and was the basis for their unique form of biochemical agriculture. The slime was secreted from a gland located on the Morodins' underbelly. The nutrient content of the slime fluctuated with the Morodin's diet, and the resulting excretion encouraged growth and mutation in plant life. By eating certain plants and then spreading the resultant slime over other vegetation, Morodins produced new species of flora. The new strains were more nutritious, and the Morodins added the resulting crop to their diet, in turn using it to create new secretions that produced yet more nutritious plants. The Morodins knew which combinations of food eaten and plants fertilized produced the best crop."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Only 50,000 Morodins were known to live on the planet Varonat, and they were organized into tribes. To completely fertilize an area, the Morodins had developed a form of maze–running; the elders of the tribe used their slime trails to create an elaborate and complex maze in a given area. The younger generation, as part of their education in the art of biochemical agriculture, then ran the maze to complete the fertilization. By using different slime patterns, the Morodins kept track of which combinations of nutrients were used to fertilize an area. At the height of their civilization, the Morodins had mastered space travel and grew their own organic space vessels, although they lost their ability to grow these starships when an ecological disaster occurred on their homeworld."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Morodin civilization flourished on their homeworld before the formation of the Galactic Republic. 1,000 years before the Republic was founded, the Morodins established an agricultural colony on the planet Varonat in an effort to produce enough food to support their homeworld's growing population. Varonat was covered in immense plains, and the Morodins transported stores of food to the world to allow them, in conjunction with their own nutrient slimes, to convert the grasslands into edible plant life. The result produced the vast Great Jungle for which Varonat would become known thousands of years later."}, {"tag": "p", "text": "The colony on Varonat produced and harvested food, transporting it back to their homeworld aboard organic space vessels. Eventually, an ecological disaster on the Morodin homeworld stopped the Morodins from growing their organic starships. Cut off from their home planet, the colony on Varonat was left to its own devices. Over the centuries, the Morodins used their unique biochemical abilities to continually transform and modify Varonat's plant life to suit their needs, and gained an extensive knowledge of the native flora."}, {"tag": "p", "text": "In 242 BBY, Human colonists from Salliche led by Adarian Tropis settled on Varonat after scouting reports indicated rich, fertile soil in the Great Jungle. Settling Tropis-on-Varonat, the colonists began planting crops. However, the fertility of the soil only lasted for a single season. The Morodins attempted to help the Humans by covering their crops with their nutrient slime. However, communication between the Morodins and the Humans proved to be impossible, and the Humans had no comprehension of what the Morodins were trying to do or even the fact that they were sentient. They thought the Morodins were just animals trampling their crops. Eventually, Tropis theorized that the slime trails laid down by the Morodins were vital to the soil's fertility and gave the Morodins free run of several fields. The resulting crop was yellow and inedible; following this, the colonists began to actively chase the Morodins from their fields and hunt them."}, {"tag": "p", "text": "Around 7 ABY, the Morodins encountered a group of Krish who ventured into the Great Jungle planting Yagaran aleudrupe plants. Believing the Krish were interested in agricultural cooperation, the Morodins added the newcomers' plantings to their fertilization rounds. Unknown to the Morodins, their nutrient slime chemically changed the pips of the aleudrupe plant's berries which, when combined with rethan-K and promhassic triaxli, created a blaster formulation as powerful as spin-sealed Tibanna gas. The Krish were pleased with the resulting crop, and continued to plant and harvest in the jungle. The Morodins continued to help the newcomers. Every few months, several Morodins were killed by hunters in the jungle; to cover their operations, the Krish established a safari to hunt the Morodins. The leader of the Krish, Gamgalon, discovered that the Morodins were sentient, but established the hunt anyway while paying the local Imperial governor a large bribe to look the other way, as hunting sentient species was prohibited by Imperial law. The Morodins never equated the two groups, the farmers and the hunters, to be from the same source."}, {"tag": "p", "text": "A year later, the smuggler Talon Karrde and his associate, Quelev Tapper, traveled to Varonat to investigate Gamgalon's operation and see if it was a venture in which they could invest. During the course of their investigation, Karrde and Tapper joined a Morodin-hunting safari, but Karrde could not bring himself to kill a Morodin when he was confronted with one in the jungle as he sensed something was amiss. Later, he and Tapper witnessed a Morodin maze–running, and deduced that the large creatures were sentient beings. The two smugglers were discovered by Gamgalon, who did not take kindly to outsiders attempting to interfere with his operation. Tapper was killed by the Krish, but Karrde was rescued by a woman called Mara Jade. Karrde's actions left Gamgalon's operation in ruins."}, {"tag": "p", "text": "After the discovery of the Morodins' sentience by the New Republic, a team was dispatched to Varonat to make formal contact with them and learn the Morodins' biochemical agriculture. The team had to learn how to communicate with the Morodins, and to study the unique properties of the biochemical slime and deduce how it interacted with the native plant life. The team was also forced to deal with hunters who believed the Morodins were worth more as trophies, and had to contend with the inquisitive Imperial governor."}, {"tag": "h2", "text": "Morodin in the galaxy"}, {"tag": "p", "text": "Morodins were only known to inhabit Varonat, a world on the Ison Corridor in the Anoat sector of the Outer Rim Territories, during the early years of the New Republic, and their population numbered 50,000 individuals. The location of their original homeworld was unknown to the galaxy at large as Morodins had been encountered on no other planets as of 8 ABY. Once the Morodin's sentience became known, it was generally believed that they had either lost or abandoned their advanced organic starship building technology over the millennia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Morodin first appeared in First Contact, a short story written by Timothy Zahn for West End Games' Star Wars Adventure Journal 1 published in 1994. First Contact was later reprinted in The Best of the Star Wars Adventure Journal, Issues 1-4 in 1996, Tales from the Empire in 1997, and on Hyperspace. As the latter two only reprinted the story, the RPG information that included the Morodin's history was not included."}, {"tag": "p", "text": "Morodins were later referenced in 1995's The Essential Guide to Characters in Mara Jade and Talon Karrde's entries, and in 1998's Star Wars Encyclopedia in the Varonat entry. 1998's Alien Encounters reprinted the roleplaying lore and statistics from the original Star Wars Adventure Journal publication and classified the Morodins as a mammalian species. In 2004, Morodins were mentioned in Varonat's entry in Galactic Gazetteer: Hoth and the Greater Javin by Wizards of the Coast, and an entry in 2008's The Complete Star Wars Encyclopedia. In 2009, the Morodin were mentioned, again in relation to Varonat, in The Essential Atlas."}, {"tag": "p", "text": "The illustration of the Morodin accompanying First Contact was provided by Mike Vilardi. For Alien Encounters, the artist who provided the image was not credited specifically for the work as several artists were listed en masse as providing interior art on the table of contents page."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}