{"url": "Mortar/Legends", "categories": ["Category:Legends articles", "Category:Explosive projectile launchers", "Category:Portable launchers", "Category:Vehicle-mounted launchers"], "nodes": [{"tag": "h1", "text": "Mortar"}, {"tag": "p", "text": "A mortar, also known as a mortar launcher, was an indirect fire weapon that lobbed explosive projectiles known as mortar bombs or shells in a high arc. Some mortars were powerful enough to destroy vehicles."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The mortar launcher was popular with military and insurgent groups due to its low cost and ease of use. The weapon consisted of a tube, a tripod, a magazine, as well as a powerful electromagnet at the base that launched the shells. Also included was an integrated targeting computer which compensated for wind and other environmental factors. A magazine held 5 shells, which the launcher could reload and fire automatically until the magazine was depleted. Alternatively, a soldier could manually load the mortars one at a time, at which point the mortar launcher would fire it. The damage caused by mortar shells was very similar to the damage caused by fragmentation grenades."}, {"tag": "p", "text": "Because the weapon launched mortars very high into the air, it was ideal for use against long-range targets behind cover. However, this also meant that the mortars could not be fired at targets closer than 75 meters."}, {"tag": "p", "text": "The mortar launcher weighed 20 kilograms and cost 2,500 credits, but was available for military use only."}, {"tag": "h3", "text": "Variants"}, {"tag": "p", "text": "The mortar launcher could also be mounted on a vehicle and be used as a mobile grenade launcher. The MobileMortar-3 combined the MM-s3 grenade launcher and WW-676 repulsorlift sled to create a such a mobile artillery weapon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the 501st Legion used these weapons during a battle on Umbara to attack what they believed to be Umbarans that were dressed up as clone troopers, when in actuality, they were other clones from the 212th Attack Battalion sent by General Pong Krell."}, {"tag": "h2", "text": "Equipped vehicles"}, {"tag": "h2", "text": "Equipped infantry"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the real world, a mortar is a short range artillery piece that fires shells at a high angle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}