{"url": "Mortis_monastery", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Mortis locations"], "nodes": [{"tag": "h1", "text": "Mortis monastery"}, {"tag": "p", "text": "The Monastery was a construct within the realm of Mortis, a place where the Force converged. The powerful Force wielder known as the Father resided inside the walls of the Monastery and presided over the lands."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Monastery was a pyramid-like structure located atop a rocky spire. Temple-like in appearance, the soaring facade seemed to be made of stone, and a glowing crystal was embedded within the pinnacle, casting a dim light for kilometers in every direction. The halls and rooms that made up its interior were random, and prone to shifting without reason. Meditation rooms, sleeping chambers, and reading rooms opened onto cavernous halls. On the exterior was an arena, marked with symbols corresponding to the light and dark aspects of the Force, including a wolf, a snake, and a bird."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Father brought the Chosen One, Anakin Skywalker, to Mortis in order to test if he was the prophesied Jedi legend, Skywalker stayed at the monastery as the Father's guest. That same night, the dark side-child of the Father known as the Son approached Skywalker, disguising himself as the Chosen One's deceased mother, Shmi Skywalker Lars. When Skywalker confronted the Father about the illusion, the Father convinced the Jedi Knight to agree to test if he was, in fact, the Chosen One."}, {"tag": "p", "text": "At the monastery's arena, Skywalker proved himself to be the one the Father sought after he tamed both his children, the Son and the Daughter, to prevent them from killing his Jedi allies, Ahsoka Tano and Obi-Wan Kenobi. When Skywalker refused to stay on Mortis and replace the Father in maintaining the balance in the Force, the Son attempted to corrupt Skywalker to the dark side and use him as a means to wreak havoc in the galaxy. The Son ultimately failed and, after his efforts led to the deaths of both the Daughter and the Father, the entire realm of Mortis disappeared in a shining white light from atop the monastery tower."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}