{"url": "Mortis", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Force planes", "Category:Mortis locations", "Category:Type I atmosphere planets", "Category:Vergences", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Mortis"}, {"tag": "p", "text": "Mortis was an ethereal realm within the Force which was whispered over in legends and stories passed down through the millennia by Jedi, Sith, and the average spacer alike. It was believed to have existed outside any star system, and potentially the galaxy or even the universe. Some believed that the origins of the Force came from Mortis."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mortis was a realm of the Force which contained dreamlike environments; it could not be mapped, and even its landmarks appeared in different locations frequently. The daytime was a time of peace during which luminous creatures moved about lush fields, green mountains, and stunning vistas. Dense forests, molten caverns, and floating mountains above the surface were among some of the different biospheres. The light had a healing quality, though it came from no star. When night fell the plants withered and died, the creatures vanished, and the few stars that shone in the black sky were unidentifiable. Scalding rains swept the terrain, making survival without shelter near impossible."}, {"tag": "p", "text": "Entrance to the realm was never voluntary, as Mortis drew in its visitors inexplicably. It manifested itself in different ways; Mortis was reported as having appeared as a giant, metal rhombohedron floating in space; other times individuals walked through a door or landed there without discernible reason. Time within Mortis had no meaning; what seemed like days or weeks within the realm, passed within seconds without."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The realm of Mortis was inhabited by only three intelligent beings, Force wielders locked in an eternal struggle for dominance over one another: the Son, who represented the destructive and deadly aspects of the realm; the Daughter, who represented peace and creation on Mortis; and the Father, who maintained the balance of the Force between them. Mortis was therefore a fulcrum for the galaxy and a conduit through which the Force flowed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Father drew Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano into the realm. The Father realized that Skywalker was the Chosen One, and that he could maintain the balance of the Force between the two children once the Father died. This led to a struggle between the Force wielders and the three Jedi, culminating in the deaths of all three wielders and the restoration of balance on Mortis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}