{"url": "Morvogodine", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Calaron sector planets", "Category:Galactic Empire planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Morvogodine"}, {"tag": "p", "text": "Morvogodine was a planet crawling with life that was located in the Calaron sector of the Outer Rim Territories. The Galactic Empire occupied Morvogodine during the Galactic Civil War and hosted a notoriously vicious stormtrooper training facility on the planet. Shortly before the Battle of Yavin, the Empire arrested famous musician Maxa Jandovar on Morvogodine to suppress her politically outspoken artistic endeavors."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Morvogodine, part of the Calaron sector's Morvogodine system, was located in the Slice portion of the Outer Rim Territories. Morvogodine was a world teeming with life—its varying conditions and plentiful sunlight produced many different plant and animal species. The planet's surface features included landmasses and expanses of ocean."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Morvogodine fell under occupation by the Galactic Empire. Following the Battle of Yavin, the planet was the site of an especially vicious stormtrooper training facility run by Commander Kayn Somos, who sent its students on \"peacekeeping\" missions as a final test."}, {"tag": "p", "text": "The famed vandfillist artist Maxa Jandovar included Morvogodine as part of her ongoing informal musical tour in the years preceding 0 BBY. An outspoken political opponent of the Empire, Jandovar was forced to follow an unannounced touring schedule, lest she reveal her next performance stop and find Imperial forces waiting to seize her. Nevertheless, the Empire arrested Jandovar on Morvogodine, and she later died in custody. The Devaronian Kardue'sai'Malloc, who followed Jandovar around the galaxy in an attempt to catch one of her performances, was arranging transport to Morvogodine from the planet Tatooine to see her when he learned that Jandovar had been captured."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Morvogodine was first mentioned—as the site where the Empire arrested artist Maxa Jandovar—in the short story \"Empire Blues: The Devaronian's Tale,\" written by Daniel Keys Moran and published in the 1995 anthology book Tales from the Mos Eisley Cantina. Morvogodine was later one of 200 playable worlds included in the 1998 PC game Star Wars: Rebellion, which provided the planet's first visual depiction, an image also used to illustrate eleven other planets of similar composition in the game."}, {"tag": "h3", "text": "Star Wars: Rebellion cartography"}, {"tag": "p", "text": "Star Wars: Rebellion provides hyperspace travel times between each planet in the game. However, in several instances these times are significantly longer than those in other Star Wars Legends sources, which seems to reflect the Star Wars: Rebellion hyperspace times as game mechanics rather than actual figures. Morvogodine's intra-sector hyperspace times and distance from Coruscant according to Star Wars: Rebellion using the game's fastest capital ship hyperdrive are as follows. Note that this chart only includes planets that were canonically located in the Calaron sector with respect to the Legends continuity, excepting Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}