{"url": "Mos_Entha/Legends", "categories": ["Category:Legends articles", "Category:Cities on Tatooine", "Category:Mos Entha locations"], "nodes": [{"tag": "h1", "text": "Mos Entha"}, {"tag": "p", "text": "Mos Entha was a spaceport city on Tatooine."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Dominating the skyline were four massive 500-meter-tall domed spaceport hubs. Sixty ultra-modern docking facilities were grouped radially around the four domed hubs. Nearly another dozen docking bays were scattered around the edges of the city resulting in nearly 75 docking bays being available for visiting starships."}, {"tag": "p", "text": "The majority of the cultural, entertainment and government establishments were contained within the spaceport domes. Each dome contained large multi-level, controlled-environment hotels that catered to the tourist trade. Also contained within the domes were many government offices, shopping centers, restaurants, museums and theaters."}, {"tag": "p", "text": "Outside the general area of the spaceport domes the streets of Mos Entha were much like those of other Tatooine cities. Swoops and speeders could be found darting around slower-moving traffic like dewbacks and rontos. Jawas and traders from hundreds of worlds clogged the streets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Mos Entha was widely regarded as a calm and orderly city, but it was often overshadowed by the Imperial might of Bestine and the crime-laden city of Mos Eisley. Though the city seemed to support itself through moisture farms and some hydroponic gardens, it actually generated income by providing storage facilities for outdated Imperial munitions and hazardous wastes. These storage facilities were placed far beneath the city's streets."}, {"tag": "p", "text": "Though the city was safe, it was not entirely devoid of criminal activities. Inspired by the success of the Lucky Despot Hotel and Casino, Lady Valarian established a similar venue in Mos Entha known as the Fallen Star. As with most of Lady Valarian's operations, the Fallen Star attracted a number of seedy individuals. Lady Valarian also owned a lavish town home in the city, which was heavily guarded to protect herself and her property."}, {"tag": "p", "text": "After the death of Jabba Desilijic Tiure in 4 ABY, much of Mos Eisley's traffic began to switch to Mos Entha. The switch in traffic by the traders and smugglers combined with an increased amount of tourism due to interest in the home world of Jedi Master Luke Skywalker resulted in Mos Entha becoming something of a model for the modern Tatooine city."}, {"tag": "h3", "text": "Socio-political"}, {"tag": "p", "text": "One noticeable difference between Mos Entha and other Tatooine cities could be seen in the police force. Mos Entha's law enforcement personnel were described as efficient, courteous and visible. While there was still a fair amount of corruption, it was acknowledged that there was more of a focus on protecting the rights and safety of residents and visitors rather than lining the pockets of Hutts."}, {"tag": "p", "text": "While the government officials drew a respectable salary from the New Republic and were quite visible, many argued that the real power still lay with organized crime—though Lady Valarian's activities were hardly recognizable as such. Valarian actually held a post in the government as a representative of the business community. Most looked the other way with regards to her business concerns as long as they did not bring embarrassment to the mayor or police chief."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}