{"url": "Mos_Espa_Grand_Arena/Legends", "categories": ["Category:Legends articles", "Category:Buildings", "Category:Mos Espa locations", "Category:Podracing courses", "Category:Swoop tracks"], "nodes": [{"tag": "h1", "text": "Mos Espa Grand Arena"}, {"tag": "p", "text": "The Mos Espa Grand Arena on Tatooine―originally the brainchild of Gardulla the Hutt but ultimately brought to fruition and overseen by Jabba Desilijic Tiure―was located just outside the city of Mos Espa on its Northern Dune Sea side. It was the home to one of the most famous Podracing tracks in the Outer Rim Territories."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Once a year, hopeful contenders made their way to the enormous stadium to participate in the Boonta Eve Classic, which was hosted by the Hutts to commemorate the Boonta's Eve holiday and was among the most illustrious of all podraces. Other races took place here throughout the season as well, including the Mos Espa Open and the Boonta Training Course."}, {"tag": "p", "text": "The arena was open-air and open-ended, being built into a natural canyon amphitheater. It consisted of a curving track running between a massive seating structure for more than 100,000 race fans, and an observation platform for race officials built into a rockface. Only a very small portion of the circuit was actually located in the arena with the rest extending for kilometers in a circuit around a broad, flat-topped mountain known as Ben's Mesa. However, the circuit was not without obstacles, such as the Macroon Mesa. Significantly, the start/finish line was located within the arena."}, {"tag": "p", "text": "Before being towed out onto the start grid, the pods themselves were housed and maintained in a large hangar located on the arena grounds."}, {"tag": "p", "text": "After podracing was outlawed, the arena was transformed into a swoop bike arena—the Mos Espa Swoop Arena—maintained by a Kuati woman named Ulda."}, {"tag": "p", "text": "The Bo Charmian Racing School was located inside one of the concession concourses of the arena. 7-Gee Lounge and Jabba's private box were also located in the arena."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the production of Star Wars: Episode I The Phantom Menace, Industrial Light & Magic eschewed complicated digital techniques to portray the crowd of hundreds of thousands of spectators. They stuck long wooden sticks tipped with painted cotton swabs randomly into chicken wire on a miniature set of the arena. Action figures were placed on the steps for realism while a fan was used to make the cotton swabs move thus giving the impression of a lively crowd."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}