{"url": "Mos_Espa_Circuit", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles needing additional sources", "Category:General location stubs", "Category:Podracing courses", "Category:Swoop tracks"], "nodes": [{"tag": "h1", "text": "Mos Espa Circuit"}, {"tag": "p", "text": "The Mos Espa Circuit, also known as the Mos Espa Raceway or the Mos Espa Podrace circuit, and later the Old Mos Espa Arena Circuit, was a podracing and later swoop-racing track located on the desert planet of Tatooine close to Mos Entha."}, {"tag": "p", "text": "Mos Espa Ciruit was where the Boonta Eve Classic podrace was held annually. Following the decline of podracing popularity with the departure of public spectacle and Jabba Desilijic Tiure, the most powerful of the Hutt gangsters on Tatooine, moved from the port city of Mos Espa in favor of the growing city of Mos Eisley, the course was left largely abandoned. During the Galactic Civil War, the local swoop gangs used this track for their own racing events. In 8 ABY, Han Solo test drove the Novastar swoop at the circuit to find Kitster Chanchani Banai, who had stolen a piece of Alderaanian moss art."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The film Star Wars: Episode I The Phantom Menace marks the first appearance of the Mos Espa Circuit. The Circuit is depicted differently in various Star Wars media. Based on the course shown in the film, the 2000 reference book Inside the Worlds of Star Wars: Episode I provides a map of the Mos Espa Circuit, although the track featured in the Racer Rush video game is much more simplistic than the one displayed in The Phantom Menace: it does not include the tunnel segment and it takes only up to 2 minutes to race through its one lap. However, the Mos Espa Circuit in the Star Wars Galaxies video game is in keeping with the layout from Inside the Worlds of Star Wars: Episode I. The Old Mos Espa Arena Circuit was added to Star Wars Galaxies with the \"Publish 9.2\", released on July 27, 2004."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}