{"url": "Mos_Espa/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cities on Tatooine", "Category:Galactic Empire cities", "Category:Mos Espa locations", "Category:New Republic cities"], "nodes": [{"tag": "h1", "text": "Mos Espa"}, {"tag": "p", "text": "Mos Espa was a spaceport on Tatooine. It was the home of Anakin and Shmi Skywalker and also held the famous Mos Espa Grand Arena, at which the annual Boonta Eve Classic podrace was held, and the location of Watto's shop."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Mos Espa was an expansive spaceport and rested near the Dune Sea. It consisted of the dome-roofed, adobe buildings found in cities across Tatooine, and was said to appear as a great, twisting snake, hunkered down to escape the heat. Most residents either were involved in crime business with the Hutts or were poor shopkeepers and moisture farmers trying to eke out a living in the inhospitable desert. The biggest retail business in Mos Espa seems to have been junk-dealing, and even small dealers like Watto the Toydarian seemed to rake in a substantial amount of money, albeit sometimes unscrupulously. Locals who spoke Huttese did so with a distinct accent."}, {"tag": "p", "text": "The other major activity in Mos Espa was gambling on the podraces held in the nearby Grand Arena. The podrace that set Anakin Skywalker free from slavery was held at Mos Espa. Jabba the Hutt may have had some sort of seasonal residence in the city."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Like most Tatooine settlements, it began as a mining colony. When the mining efforts failed, the dying settlement attracted the criminal Hutts, who took control and turned the city into a thriving yet dangerous spaceport."}, {"tag": "p", "text": "It gained a deadly reputation for lethal podraces sponsored by the Hutts to encourage gambling. During the reign of the Hutts, the population consisted mostly of slaves, slavers and poor settlers, not including the large number of spacers and smugglers who briefly stayed in the city before moving on to the next rock."}, {"tag": "p", "text": "The town also boasted at least two local ghost stories: the spooky and mysterious Nobot and a strange ship left deserted on the outskirts that was believed to be haunted."}, {"tag": "p", "text": "Around the Trade Federation blockade of Naboo, Padmé Amidala and her Jedi escorts arrived in Mos Espa seeking a new hyperdrive. After finding a suitable one in Watto's junk dealership, Jedi Master Qui-Gon Jinn made a deal with the Toydarian to exchange the parts and for freedom for his young slave boy Anakin. The deal went in Qui-Gon's favor, and Anakin came with him to Coruscant, marking a pivotal moment in galactic history."}, {"tag": "p", "text": "Years later, when the Galactic Empire arrived on Tatooine, the podraces were outlawed, and the city lost its illicit reputation and allure. Jabba the Hutt left for more lucrative parts unknown."}, {"tag": "p", "text": "During the Galactic Civil War, Mos Espa was garrisoned by a large Imperial force that patrolled the city in an effort to crack down Rebel insurgents."}, {"tag": "p", "text": "In about 1 ABY the town was invaded by Tusken Raiders led by the Tusken King, but they were soon driven out by a group of spacers."}, {"tag": "p", "text": "An auction was held in 8.5 ABY for the Alderaanian moss painting Killik Twilight. It was sought by many bidders, in particular Commander Quenton on behalf of the Galactic Empire and Captain Han Solo and Leia Organa Solo on behalf of the New Republic. It was stolen from the auction by Kitster Banai. The Solos, C-3PO and Chewbacca with the assistance of a Weequay, Grunts, searched through Mos Espa for the painting."}, {"tag": "h3", "text": "Golden Age"}, {"tag": "p", "text": "Since the departure of Jabba, the city gained a new reputation: as a respectable and law-abiding, bustling town. It remained a center of trade on the planet and a welcome rest stop for travelers seeking to trek into the deadly Dune Sea nearby."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The real-world locations of Mos Espa are in Tunisia. The sets in Oung Jmel are still standing. Ksar Hadada, Ksar Medenine and Ksar Ouled Soltane were filmed for Mos Espa's Slave Quarters Row. On July 19, 2013, it was reported that the sets will soon be buried under encroaching sand dunes."}, {"tag": "p", "text": "In the first printing of The Rise and Fall of Darth Vader, Mos Espa is misspelled \"Mos Epsa\" on page 19."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}