{"url": "Asha_(episode)", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "Asha  (episode)"}, {"tag": "p", "text": "\"Asha\" is the thirteenth and final episode of the first season of Ewoks. Written by Paul Dini and directed by Raymond Jafelice, the episode originally aired on ABC on November 30, 1985."}, {"tag": "p", "text": "After a group of Ewoks have a run-in with the Duloks, Princess Kneesaa discovers that her lost sister Asha is alive and is living in the forest. Kneesaa and Wicket set out on a quest to find her."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Wicket, Teebo, and Paploo are off by themselves in the forest, a day's glider-flight from home. They are going about their everyday lives; Wicket is catching water in his basket from a stream, Paploo is sleeping, and Teebo is walking near Paploo. Suddenly they hear Dulok voices, and decide to investigate. They watch as a group of Duloks chase a maramu, hoping to capture it. The bumbling Duloks nearly have it, but are knocked down a hill. Just as they get back up the hill and throw a net over the creature, they are scared away by an individual they identify as \"The Red Ghost.\" After the Duloks run away, Wicket, Teebo, and Paploo go to the animal and help remove the net and set it free. However, \"The Red Ghost\" thinks they wish to harm the animal. But after she sees they mean no harm, she summons a korrina, which, to the surprise of the Ewoks, allows her to ride it. Wicket notes that Ewoks only hunt for food, unlike the Duloks who hunt for fun as well. The three Ewoks fly away in their gliders, with Teebo proclaiming he would never again return to that section of the forest."}, {"tag": "p", "text": "Back at the village, Paploo is telling the woklings that they had encountered a monster Ewok, with six arms and fangs the size of a wokling's head. One of the Ewoks asks if Paploo was scared, to which Teebo says that was terrified. Kneesaa comes along, and the woklings tell Kneesaa of Paploo's story. Kneesaa then asks what is going on, and Wicket explains what they really found. When he mentions that the Ewok they spotted had red fur, Kneesaa begins to cry, and runs off to her hut. Wicket and Winda follow her, and Kneesaa tells them the story of what happened to her older sister, Asha."}, {"tag": "p", "text": "Late that night, Kneesaa wakes Wicket, telling him that she is going to find Asha. When she asks where he saw Asha, Wicket attempts to explain how to get there by glider, but soon gives up, deciding he cannot let Kneesaa go alone."}, {"tag": "p", "text": "The two of them encounter a fierce snowstorm, and Wicket nearly falls to his death off the edge of a cliff, but he is saved by Chukha-Trok. Soon after, they encounter a group of koyts. They are saved by Asha. Asha and Kneesaa quickly recognize each other."}, {"tag": "p", "text": "At Asha's cave, Kneesaa reminds Asha of their previous life. She tells Asha that they will return home. But Asha says that she can never leave; she must stay and fight the Duloks."}, {"tag": "p", "text": "Next morning, Wicket and Kneesaa awaken to find that Asha and Chukha-Trok are gone. They soon find the two fighting a group of Duloks led by King Gorneesh, whom Asha defeats alone with ease. After this, the group returns home with Asha. They immediately go to Chirpa, who is delighted to see his daughter again."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}