{"url": "Mos_Espa_scavenger%27s_species", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Unidentified sentient species"], "nodes": [{"tag": "h1", "text": "Mos Espa scavenger's species"}, {"tag": "p", "text": "This alien race were grey-skinned humanoids with muzzles and cranial horns which sprouted from the back of their heads. A member of this species was a scavenger in Mos Espa who sold parts scavenged from destroyed podracers. The species was forceful, but slow, and individuals were docile if paid to guard something."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The sentient species had a humanoid body plan, featuring two arms, two legs, one head, and an upright posture. They were grey-skinned and hairless, and their head featured a large muzzle, two small black eyes, a pug-like nose but no apparent external ear. Despite the size of their imposing jaws, they had a relatively small mouth filled with sharp, needle-like teeth. Two ridged cranial horns that bore resemblance to the head cones of the Gotal species sprouted from the back of their heads. While those sentients were tall, massive and physically strong, they were also slow-moving due to their mass."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Several members of that species displayed aggressive or threatening behavior, frequently menacing those who inadvertently brushed past them. However, they could prove obedient whenever someone paid them to guard something. In melee combat, they wielded heavy combat axes and, in spite of their slowness, they were fierce opponents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The grey-skinned, horned species appeared in the \"Mos Espa\" and \"Mos Espa Arena\" levels of the video game adaptation of Star Wars: Episode I The Phantom Menace. To portray the guards patrolling the streets of Mos Espa, the game designers initially wanted to use Gamorreans like those who were first seen in Star Wars: Episode VI Return of the Jedi. However, they got word from Skywalker Ranch, the workplace of Star Wars creator George Lucas, that the Gamorreans should be removed from the game, without providing any explanation. This prompted the creation of a new alien species, which was designed by LucasArts artist Martin Yee."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}