{"url": "Mos_Taike/Legends", "categories": ["Category:Legends articles", "Category:Cities on Tatooine", "Category:Tatooine locations"], "nodes": [{"tag": "h1", "text": "Mos Taike"}, {"tag": "p", "text": "Mos Taike was a small city on Tatooine."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was located just outside Mos Entha, between the Xelric Draw and the Northern Dune Sea."}, {"tag": "p", "text": "The mayor of the small settlement was Gramm Rile, an older individual who cared a great deal about his citizens. Lorne Prestar acted as the Chief of Security for the city. It was also the former home of Ackli. Additionally, the xenobiologist Dusque Mistflier and the Imperial scientist Tendau Nandon once investigated a krayt dragon graveyard located near the city."}, {"tag": "p", "text": "Sometime following 0 BBY, Mos Taike was vulnerable to repeated Tusken Raider attacks. The mayor pleaded with both the Galactic Empire and Jabba the Hutt for protection, but to no avail. Fortunately for the mayor, with the help of a devoted spacer, the city managed to gather enough citizens to repel a massive Tusken raid."}, {"tag": "p", "text": "The city itself could be described as a small backwater town on a small backwater world. Still, it was home to a number of notable venues, such as the Third Sun Cantina. This establishment, managed by a Bith named Stella doubled as both a cantina and a medical center. The city also had a number of other facilities, such as a garage for vehicle reparations, but it lacked any kind of shuttleport for incoming travelers. A gang of technology-hating terrorists known as the Meatlumps established a small chapter on the outskirts of Mos Taike."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mos Taike was one of many cities on Tatooine that players of the MMORPG Star Wars Galaxies could visit, prior to the game's closure on December 15, 2011. However, unlike the other cities on Tatooine, Mos Taike was the only one which lacked a shuttleport for easy transport to and from the town."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}