{"url": "Ashaar_Khorda", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Admirals and generals", "Category:Annoo-dat Prime", "Category:Males", "Category:Resistance fighters", "Category:Terrorists"], "nodes": [{"tag": "h1", "text": "Ashaar Khorda"}, {"tag": "p", "text": "Ashaar Khorda was an Annoo-dat Prime revolutionary. Sometime before 27 BBY, he tried to seize control of his homeworld, Annoo, only to have the Galactic Republic end his rebellion. Khorda developed a great hatred for the Republic as a result. He fled the planet and began to form a group that shared his contempt. Khorda also located the Infant of Shaa, an ancient artifact that was rumored to have the power to destroy a planet, although once he had found it, the object was stolen from him. He hired the bounty hunter Jango Fett to retrieve it and, once it was back in his possession, went ahead with his plan to destroy Coruscant—the capital of the Republic and, in his view, a planet that was ripe with corruption and injustice."}, {"tag": "p", "text": "Khorda and his most devoted comrades made their way to Coruscant's power relay, located at the planet's core. There, they intended to destroy the Infant, creating an explosion that would consume Coruscant. However, they were opposed by Fett, the huntress Zam Wesell, and Jedi Master Yarael Poof. Fett shot and killed Khorda, while Poof stopped the Infant from exploding, ending the short-lived insurrection."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Annoo-dat Prime Ashaar Khorda was a general from the planet Annoo. At some point, Khorda attempted to start a rebellion on his homeworld. Due to the intervention of the Galactic Republic, the rebellion was defeated. Nonetheless, Khorda did not give up and tried to gain control of the planet with the help of military forces that he had usurped from the government. The Republic was able to put down the insurrection and install its own leader, and Khorda fled the planet before he could be tried for war crimes."}, {"tag": "p", "text": "Claiming to be a freedom fighter who battled against the corrupt and unjust Republic, Khorda assembled a band of followers that bore a similar hatred for the Republic. He also began searching for the Infant of Shaa, an artifact made by the Seylott species that was rumored to have incredible powers capable of even destroying a planet. Khorda had heard of it from a prisoner under interrogation, and although most believed the artifact to be mere rumor, the general believed that he could use the Infant against the Republic."}, {"tag": "p", "text": "Khorda was able to locate the artifact; however, it was not in his possession long before it was stolen by a native of Seylott. In 27 BBY, Khorda had one of his followers, the Dug Fernooda, contact the bounty hunters Jango Fett and Zam Wesell to retrieve the object. Under the general's orders, Fernooda did not reveal his master's identity and claimed only that he was an art aficionado who had had the valuable piece stolen from his collection. The two bounty hunters agreed to the job, and Fett was able to recover the artifact on Seylott. He returned it to Fernooda, who in turn gave it to Khorda. With the artifact in his hands once more, the general began plotting to use the artifact's legendary power to destroy a planet. However, the Jedi High Council was able to learn of Khorda's plans—namely, that he planned to destroy either Coruscant, Corellia, or Alderaan. A Jedi Master was chosen to safeguard each planet, in hopes of finding Khorda and stopping his plot."}, {"tag": "p", "text": "Khorda chose to use the Infant to destroy Coruscant and met with a small group of his most trusted followers in Coruscant's underlevels. The General explained to them his plans to place the Infant in the power relays at the planet's core. The Infant was a Force-imbued object and therefore contained a massive amount of Force energy; when the artifact was destroyed by the electric currents produced by the power relay, this energy would be released, causing a massive explosion that would consume the planet. Although Khorda and his group would die in the process, he had no qualms about this. The destruction of Coruscant, Khorda believed, would inspire others and would \"cleanse\" the Republic that he believed to be so corrupt. He felt that his death was a necessary sacrifice to save the galaxy from the Republic."}, {"tag": "p", "text": "Khorda led his followers to the power relay at the planet's core and killed all the guards who had been stationed there to prevent access. The group reached the core, where Khorda took a moment to bask in his victory. It was then that they were attacked by the two bounty hunters, Fett and Wesell, as well as Jedi Master Yarael Poof, who had arrived at the relay separately from the bounty hunters. The two hunters had learned of the Infant's planet-destroying properties, and as Wesell had helped Fett retrieve it, the huntress felt guilty. She had been able to convince Fett to help her stop Khorda and recover the artifact, with the two managing to follow Khorda to the power relay. Upon spotting the new arrivals, Khorda ordered his men to attack them. His seven accomplices were quickly killed, however. Placing the Infant in the electric current of the power relay, Khorda then attacked Poof. The Jedi cut off his arm, and although Khorda was able to stab Poof with a vibroblade, Fett shot him dead. Poof took the Infant and, using the Force, was able to keep it from exploding. Though the effort ultimately killed the Jedi Master, Coruscant was saved."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ashaar Khorda believed himself to be a brave freedom fighter battling against the corrupt Republic. He felt that the Republic was a tyranny that needed its tainted capital to be destroyed for it to be saved. Thus, he planned to annihilate Coruscant, thereby eliminating the \"infection\" that existed at the highest levels of government and shaping the Republic into a noble body once more. With the \"head\" of the Republic—its capital world—destroyed, the body would be free, as the Annoo-dat Prime believed. Khorda dedicated his life to fighting the Republic and was willing to die for the cause. This commitment and drive came from witnessing what he saw to be the Republic forcing and imposing its unjust policies on his homeworld. Khorda was willing to kill innocents, as he stabbed and killed the driver of the airspeeder that took him to meet with his group in the underlevels. The Jedi High Council considered Khorda to be a terrorist, and Fett believed him to be a madman."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ashaar Khorda was created for the 2002 comic Star Wars: Jango Fett and appeared in its sequel, Star Wars: Zam Wesell. He later received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}