{"url": "Mote", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Moddell sector astronomical objects", "Category:Outer Rim Territories space stations", "Category:Shadowports"], "nodes": [{"tag": "h1", "text": "Mote"}, {"tag": "p", "text": "The Mote was a cobbled-together space station and shadowport in the Kuna's Eye system of the Moddell subsector, situated inside the Outer Rim Territories' Zuma sector and within the Inner Zuma Region. It fulfilled the needs of the prospectors who frequented the system, having a Type I atmosphere and providing standard gravity. Inhabited by 1,000 individuals of various species, the station contained several facilities, including a standard spaceport. It was the site of multiple gun battles throughout its history."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The space station known as the Mote was located near the edge of the Kuna's Eye system, inside the Outer Rim Zuma sector's Moddell subsector and the Inner Zuma Region. Since its parent system was less than 1,000 light-years above the galactic plane, it was also part of the thin disk, a region that spanned the same vertical distance in both directions from the plane."}, {"tag": "p", "text": "The cobbled-together Mote had standard gravity and a Type I atmosphere. It contained cantinas, flophouses, law offices, mini-refineries, and a standard spaceport, and served the prospectors frequenting the system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 43 ABY, the Mote supported a population of 1,000 individuals of different species and had experienced several gun battles. Multiple deals had also been brokered aboard it. It had also become a lawless spaceport, known as a shadowport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mote was first mentioned in the Endor and the Moddell Sector article—authored by Craig Robert Carey, Daniel Wallace, and Jason Fry—of the ninth issue of Star Wars Gamer magazine, released on March 1, 2002. It was also referenced in The Essential Atlas, a reference book written by Wallace and Fry, and released on August 18, 2009."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}