{"url": "Ashara_Zavros", "categories": ["Category:Legends articles", "Category:Alliance individuals", "Category:Darth Nox's crew", "Category:Females", "Category:Jedi trainees of the Jedi Order", "Category:Members of the Sphere of Ancient Knowledge", "Category:Redeemed Jedi", "Category:Sith acolytes and apprentices of the Sith Empire", "Category:Togruta", "Category:Zavros family"], "nodes": [{"tag": "h1", "text": "Ashara Zavros"}, {"tag": "p", "text": "Ashara Zavros was a female Togruta Jedi Padawan who served the Jedi Order until she was lured to the Dark side of the Force by Lord Kallig of the Sith Empire during the Cold War. As part of her training on Taris Jedi Enclave, she was tasked to exorcise the spirit of Kalatosh Zavros. Kalatosh, a Jedi-turned-Revanchist and later Sith Lord, was related to her by blood. Therefore, the elusive spirit only manifest himself to his great-granddaughter via Force bond."}, {"tag": "p", "text": "Unfortunately, Ashara's unique ability to summon Kalatosh draw the attention of Lord Kallig, an exiled Sith lord who recently lost his apprentices to Darth Thanaton. In a desperate bid, Kallig corroborated with a group of Sith assassin to flush her out into open and coerced her into his service, allegedly utilized Darth Angral's holocron in the process.  Ensnared by the Dark side, Ashara failed to resist Kallig's thrall, which resulted in the deaths of her masters. Driven by guilt, Ashara banished herself from the Jedi Order and join the Sith Lord, who had taken pleasure in complete her indoctrination to the Sith."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born around 3662 BBY during the Great Galactic War to Jedi Knights Rolend and Yanila Zavros, she was taken into the Jedi Order at the age of five. Zavros came from a long line of powerful Force users, including her ancestor, Kalatosh Zavros, a former Jedi who had been part of Darth Revan's Sith Empire, and who had died in Darth Malak's bombardment of Taris three centuries before."}, {"tag": "p", "text": "During the Galactic War between the Galactic Republic and the Sith Empire in 3642 BBY, Zavros had come to Taris to train under Jedi Masters Ryen and Ocera, whose philosophy was that Padawans best learn the travails of using the Force through firsthand experience of the galaxy. Learning the knowledge of the Jedi, Zavros managed to become an outstanding student to Master Ryen and applied the principles of the Code to her satisfaction. However, she was dissatisfied with the situation on Taris, and hoped for an attack against the Sith, because she despised the approach of the Empire."}, {"tag": "p", "text": "In Zavros' case, the Masters brought her to Taris for two reasons: first, to teach her compassion amidst the destruction that had occurred there and warn against the dangers of pride and the dark side. Second, to complete her trials by helping to drive a dark ghost from the ruins of a Jedi enclave."}, {"tag": "p", "text": "At the same time, Kallig, a recently promoted Lord of the Sith, reached Taris and went on the search of the Jedi, as the powerful Sith Lord learned from Elios Maliss that Zavros was descended from a powerful spirit. In order to defeat Darth Thanaton, Kallig decided to find Zavros, and bind the spirit of her ancestor. While Kallig was on the search, Zavros was assigned by Ryen to a team preparing an attack against the Sith. Kallig needed to get to Zavros, and learned of her traits through holocron records of her training sessions. In these records, Kallig deemed her lack of understanding and rash to decision are failure as a Jedi."}, {"tag": "p", "text": "Moving to next stage of his plan, Lord Kallig procured a Sith holocron which will be the key to her fall. Rumours about its usages differed, while some suggested Kallig presented the holocron to unassuming Zavros, and it flooded her with dark side knowledge. Allowing Kallig to use this knowledge to bait her, much like Exar Kun did centuries earlier. Other evidences suggest a much more sophisticated and sinister plan was enacted. Trading the artifact with fellow Lord Anathemos, Kallig enlisted a group of Sith assassins to draw Ashara out of safety. Then, in an act of Betrayal, Kallig presented himself as a defected Sith by coming to Ashara's defense. As hunters become the prey, Kallig urges Ashara to execute the man who lead the hunt, which she reluctantly complied. The brutal act broke her conviction to the Jedi way, and Kallig proceeded to coerce her into his service."}, {"tag": "p", "text": "Kallig told Zavros to clear the Jedi Enclave, and summon the ghost. However, Zavros fretted at last and alerted her Masters, who then attempted to stop the Sith Lord. However, Zavros' Masters easily fell before Kallig. With nothing stand between her and Kallig's wrath, Zavros was then forced to summon Kalatosh. Her ancestor was not happy being awakened and tried to kill her, only for Kallig to deter him. The Sith then bound him and took his power. Blaming herself for the bloodshed, Zavros chose to follow Kallig and condemned herself as traitor to Jedi."}, {"tag": "p", "text": "As apprentice to Kallig, she still held to her ideals as a Jedi, but served her new master. Her goal was to create a lasting peace between the Jedi and the Sith, and by extension, the Republic and Empire."}, {"tag": "p", "text": "Eventually, her new master was consumed by his acts from binding too many Force ghosts. Even the same man had been manipulating her, she was unwilling witness such suffering. She aided Darth Zash in finding a cure, and comforted him on the eve of reaching Voss. She would see Kallig become Darth Nox and rise to the Dark Council along with the other members of the Sith Lord's personal crew."}, {"tag": "p", "text": "At a later stage in the Galactic War, while meditating on the Force, Zavros had a vision of Nox being killed by roots and vines on a jungle planet, causing her pass out. When she came to, she informed her Master of what she had seen. She then mentioned that a woman spoke to her through the Force, asking her to tell Nox to go to Rishi. Andronikos Revel then informed them that Rishi had been entered into the Fury's navicomputer. Nox identified it as a subtle message and set a course for Rishi. Zavros then informed Moff Valion Pyron, an ally of her Master's, of the Order of Revan's infiltration of the Empire, prompting the Moff to perform a discrete search for the infiltrators."}, {"tag": "p", "text": "During the Eternal Empire's conquest, Zavros was separated from her master and almost killed by the Eternal Throne's forces. Sometime after Nox's disappearance, she had no where to turn and chose to abandon her allegiance to the Sith since she couldn't trust them, claiming that they and the Jedi were failed orders that she never belonged to. Over the years, Ashara forged her own path away from the Dark Council, the Sith Empire, and Nox that tried to influence her, and traveled across the galaxy where she helped many people that had suffered the wrath of the Eternal Empire. She never stayed in one place too long and she felt that helping those in need taught her a lot. During the war against the Eternal Empire, she was stationed on the planet Voss where she was helping defend the people of Voss from the Eternal Empire's forces, met the Outlander, and joined the Eternal Alliance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "While a capable fighter and knowledgeable of the Jedi Code, Ashara always believed that Jedi should be pro-active against the Sith and that she deserved better. These traits brought her close to the dark side, but even while traveling with Kallig, she tried her best to keep to the Jedi ways."}, {"tag": "p", "text": "During her time spent with Kallig, Ashara found many contradictions within the Sith Order. They claimed to follow their passions but were always at each others throats with no thoughts of friendship. She even criticized the Empire's xenophobic outlook when the original Sith were not human. Despite this, through debate and discussion with Kallig, she came to the conclusion that the best hope for peace was not to destroy the Empire, but to reform it, feeling that an Empire that was strong but rational would do better than the Republic."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ashara was a powerful Padawan, claiming to be the best duelist in her class and even stated she had beaten Master Ocera in lightsaber combat. She was a practitioner of the Jar'Kai dual-saber fighting style, making her melee attacks quite fierce and ruthless. She was also known to be skilled with the Force, such as Force Burst, but used it less often than her physical strikes."}, {"tag": "p", "text": "At later point of her life, she became more devoted to mental aspects of the Force. Utilize her talents to study lores and welfare around her sith master. To the point that she was able use Force vision and communicate with Lana Beniko from across the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ashara Zavros is voiced by Azura Skye in Star Wars: The Old Republic. Both Ashara's dialogue and the Star Wars: The Old Republic Encyclopedia confirm that Rolend Zavros and Yanila Zavros, her Jedi parents, died during the Great Galactic War during the Sacking of Coruscant. However, one conversation Ashara has with a female Sith Inquisitor features her reading a letter from \"Mom and Dad\" that mentions a brother named Asher, and she says that it has been fifteen years since she last saw them."}, {"tag": "p", "text": "Depending on the choices of the player, the Sith Inquisitor and Ashara may work together to find power bases on both sides of the Empire and Republic that would agree to a truce. If so, the following may happen:"}, {"tag": "p", "text": "Ashara first went to a Jedi Master who advised Padawans but was refused, making her angry and convinced of the Sith Code's sincerity concerning \"Peace is a lie\". She would eventually find hard line Jedi who broke off from the Order. Though they are hesitant to believe a Sith would work for peace, they believe in Ashara's sincerity."}, {"tag": "p", "text": "Originally, the task of recruiting Ashara's help included working with Lord Anathemos by giving him a holocron in exchange for assassins to ambush Ashara and \"rescue\" her. This content was removed and replaced with the Inquisitor giving Ashara the holocron instead. However, on the ship, the Inquisitor could still mention the assassins in the dialogue choice, regardless that the events stated never happened."}, {"tag": "p", "text": "Apparently, the original way of recruiting Ashara has been brought back, since that is the way that the writer of this specific line did it."}, {"tag": "h3", "text": "Romance"}, {"tag": "p", "text": "Ashara can be romanced by the male Sith Inquisitor. She will only progress her courtship status with the player if the player chooses to make the more rational choices (usually light-sided), rather than choosing those of malice and cruelty (dark-sided). At some point, the player is given the option to flirt with her, which will begin their romance. If the relationship actually reaches its peak, she and the Inquisitor will decide to get married after the war is over."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}