{"url": "Mot-Not_Rab/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Galactic Republic senators", "Category:Males", "Category:Tarnab"], "nodes": [{"tag": "h1", "text": "Mot-Not Rab"}, {"tag": "p", "text": "Mot-Not Rab was a male Tarnab Senator who represented the Tarnab people in the Galactic Senate of the Republic during the Invasion of Naboo, the Separatist Crisis, and the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 32 BBY, Mot-Not Rab, along with Senators Tikkes of Dac and Onaconda Farr of Rodia, attended an unofficial audience organized by Senator Orn Free Taa of Ryloth. At that point, Supreme Chancellor Finis Valorum had just finished a crisis and was suddenly accused of corruption. Taa admitted to have delayed the accusation because the situation at that point would allow the Senate to oust and replace Valorum, which was Taa's goal."}, {"tag": "p", "text": "Rab believed the Vote of No Confidence in Supreme Chancellor Finis Valorum was part of some political plot, and thus opposed it. However, he was a member of the Rim faction."}, {"tag": "p", "text": "He continued to serve as Senator into the galaxy-wide Clone Wars, which spread corruption and a political war in the Senate itself. During the conflict, the Senate called an emergency session to debate the cost of the war. When fellow Senator Padmé Amidala of Naboo suggested that the Republic negotiate with the Confederacy of Independent Systems, Rab spoke that they could not negotiate with such \"animals,\" declaring to keep the war going and demanded to vote then and there. This caused many Senators to start chanting for the vote. However, Speaker of the Senate Mas Amedda ended the session. Mot-Not Rab was later present during the vote to negotiate with the Separatists, but the vote was stopped due to power failure from a bombing of the Coruscant power generator. Because of this attack, the Senate passed the bill to deregulate the banks so the Republic could increase clone production and rejected the Separatist peace initiative."}, {"tag": "p", "text": "Later Rab continued to serve when a new bill was proposed by Senator Halle Burtoni for an additional five million clone troopers (funded by the Banking Clan of course). Rab was attacked by two bounty hunters hired by Count Dooku to scare the Senators out of voting against the bill, as the campaign for the vote continued Amidala approached Rab and made her plea to him for the senator to vote against the bill. However, Rab told Amidala that despite his wounds he still feels strongly that he should vote in favour of the bill. In the end, Senator Padmé Amidala's speech swayed the votes and the bill was turned down."}, {"tag": "p", "text": "Later on when Ahsoka Tano was put on trial for allegedly orchestrating the bombing of the Jedi Temple and killing Letta Turmond, Rab presided over the trail as a member of the jury. Rab seemed to be the head member of the jury due to the fact that he was the one to announce that the jury had reached a decision. It is unknown whether Rab voted in favor of Tano's conviction or acquittal as moments before the judge of the trial, Chancellor Palpatine, could announce the result Anakin Skywalker burst into the chamber with Barriss Offee who confessed to the crimes that Tano had been accused of."}, {"tag": "p", "text": "When the Banking Clan needed a new leader due to the fact that the core five had been removed from office on grounds of corruption Rush Clovis was backed by the Separatist and went to the senate in order to secure them as allies to be elected as the new head minister of the banks. After Clovis made his speech Rab questioned whether the senate could trust Clovis after he had dealings with the Separatist however after Rab posed this question to the senate Padmé Amidala told the senate that in fact it was Clovis's former ties to the Separatists that allowed for them to back Clovis. When the vote took place it is unknown whether Rab vote din favour for Clovis or against. Once Clovis was put into power Dooku secretly threatened him and forced Clovis to raise the interest rates on the Republic, when the chancellor heard of this he called for a meeting of the senate in which Rab very vocally voiced his outrage that Clovis has raised the interest rates on the senate. Later when Count Dooku made it look as though Clovis had sided with the Separatist and had kidnapped Senator Amidala an emergency meeting of the senate was called to discuss what action the senate should take in response to the separatists invading Scipio the headquarters of the Banking Clan. Rab again told the senate that what Clovis has allowed to happen is outrageous, Rab then called for the senate to immediately invade Scipio in response to the actions taken by Clovis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mot-Not Rab made a minor first appearance in The Phantom Menace. He can be seen along with his Delegation in the senate in a wide shot where Palpatine, Amidala and the others detach their pod."}, {"tag": "p", "text": "In Cloak of Deception, the character's name is written Mot Not Rab without a hyphen; this is also how the character is credited in his appearance in the Star Wars: The Clone Wars television series, in which he was voiced by Dee Bradley Baker."}, {"tag": "p", "text": "Mot-Not Rab is an anagram of Tom Barton, the name of Creature Workshop Supervisor Chris Barton's son."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}