{"url": "Moth_(freighter)", "categories": ["Category:Canon articles", "Category:Freighters", "Category:Smuggler starships"], "nodes": [{"tag": "h1", "text": "Moth (freighter)"}, {"tag": "p", "text": "The Moth was a MK-4 freighter owned by Owerto Naiucho, used for smuggling illegal goods. After the Battle of Endor, he used it to travel to the planet Akiva. Following the death of Owerto, the New Republic starfighter pilot Norra Wexley took ownership of the Moth. She and her team of Imperial hunters including her son Temmin Wexley would use the Moth to hunt down Imperial fugitives during the last stages of the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Moth was an MK-4 freighter and was capable of traveling through hyperspace. It could also outrun TIE fighters and larger capital ships. The Moth also had a bay door outside its cargo compartment. The Moth could be piloted by a pilot and a navigator or astromech droid. As a freighter, the Moth had a sizeable cargo bay for storing cargo. The freighter had a turret which was destroyed during a dogfight with TIE fighters and a collision with a waterfall on the planet Akiva."}, {"tag": "p", "text": "The Moth was equipped with oxygen cyclers which pumped air into the ship. The ship was also equipped with a tractor beam projector for drawing scrap into its cargo bay. The Moth was also equipped with weapons systems for dogfights. The Moth had at least two escape pods and was equipped with front shields. The freighter was maneuverable enough for its pilot to change the ship's direction by taking it on a corkscrew spin."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Homecoming"}, {"tag": "p", "text": "After the Battle of Endor, Owerto traveled to Akiva, both with his normal cargo of illegal shipments, and Norra Wexley, who was returning home to see her son, Temmin. They encountered a small Imperial blockade, but Owerto was confident he could make it through. One of the Star Destroyers, the Vigilance, dispatched TIE fighters to intercept the Moth. One of the TIEs scored a lucky hit, disabling the Moth's turret as the freighter approached the surface of the planet. Norra piloted the ship through the canyons of her homeworld, causing the pursuing TIEs to collide with a waterfall. The waterfall shaved off the wreckage of the ship's turret, but the rest was unscathed."}, {"tag": "p", "text": "After forcibly reuniting with her son Temmin, Norra brought him back to the Moth only to find that Owerto had been killed by roving stormtroopers. Still bitter at his mom for leaving him to join the Rebel Alliance and not wanting to leaving his B1-series battle droid Mister Bones and junk shop behind, Temmin tells Norra he has a plan. He manages to escape the Moth but he and Norra attract the attention of stormtroopers. After reconciling with her son, Norra, Temmin, and Mister Bones joined forces with the bounty hunter Jas Emari and the former Imperial loyalty officer Sinjir Rath Velus to inspire a rebellion on Akiva against the Empire."}, {"tag": "h3", "text": "Norra's Imperial hunters"}, {"tag": "p", "text": "Following the rebellion on Akiva, Norra and her team became New Republic operatives who hunted for Imperial fugitives. In 5 ABY, Norra and Captain Wedge Antilles used the Moth to travel to the edge of Wild Space at the request of Princess Leia Organa to find the last coordinates of her husband Han Solo and his ship, the Millennium Falcon. They were attacked by Commander Valent's Star Destroyer Scythe but were rescued by New Republic ships led by Commodore Kyrsta Agate. Following the Attack on Chandrila, Norra along with Temmin, Mister Bones, Sinjir, and Jas Emari traveled aboard the Moth during their hunt for Grand Admiral Rae Sloane, the alleged mastermind behind the assassination attempt on the New Republic leadership."}, {"tag": "p", "text": "For several months, Norra's team traveled on the Moth to Kashyyyk, Ord Mantell, Corellia, and Jindau Station. Norra and her team eventually managed to capture the bounty hunter Mercurial Swift, who had ties with Sloane, on the planet Taris. While Temmin and Mister Bones manned the Moth, Norra, Sinjir, and Jas interrogated Swift and discovered that Sloane had traveled to the Inner Rim planet of Jakku."}, {"tag": "p", "text": "Under Norra's guidance, Temmin set the coordinates for Jakku. They exited hyperspace only to find a large Imperial fleet above Jakku. This fleet turned out to be Imperial forces that Counselor to the Empire Gallius Rax had mustered on Jakku. Temmin flew the Moth as it came under attack from TIE fighters. Before leaving in an escape pod with Jas Emari to find Sloane, Norra told her son to point the ship clear and that she had set the Moth to jump into hyperspace within two minutes. Temmin sent Mister Bones to look after his mother in a second escape pod. The Moth escaped into hyperspace before it could be hit by Imperial torpedoes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}