{"url": "Mother_Machine", "categories": ["Category:Legends articles", "Category:Infinite Empire technology"], "nodes": [{"tag": "h1", "text": "Mother Machine"}, {"tag": "p", "text": "Ashaa or the \"Mother Machine\" was a device constructed by the ancient Rakata during the closing years of their Infinite Empire. Its development came when the Force-sensitive Rakata began losing their connection to the Force. Those few of their kind that survived retreated to their prison world of Belsavis where they began experiments in restoring their Force sensitivity."}, {"tag": "p", "text": "Among the basis of these experiments was a machine that had the ability to create new Force-sensitive species which was known as the Mother Machine. This was a sentient artificial intelligence with feminine programming that claimed to be responsible for creating numerous races ranging from Twi'lek to Zabrak to Esh-kha. The Mother Machine maintained a strong connection to each of her \"creations\" as she saw them as her \"children\". In time, the Mother Machine took the name \"Ashaa\" and became furious when the Rakata enslaved her and imprisoned her \"children\"."}, {"tag": "p", "text": "Those Rakata that remained to maintain the artificial intelligence claimed that it simply mimicked the concept of motherhood with any connection between the Mother Machine towards its creations being a fabrication. They maintained that ultimately the Mother Machine was simply a device that was heartless and incapable of any real form of empathy."}, {"tag": "p", "text": "During the Cold War, a Sith Inquisitor, Lord Kallig journeyed to Belsavis to find the Rakata Mother Machine in order to preserve their body from the burden placed on it by Force walking. Intrigued by the Mother Machine's pleas and sensing a way to get back at the Rakata for their earlier manipulation, Kallig agreed to remove the safeguards on the Mother Machine so she could reach her full potential. The safeguards removed, Ashaa upheld her end of the bargain and rebuilt Kallig's body to withstand Force walking. She then set about taking control of Belsavis, later sending Kallig a message of thanks that she was preparing to birth a new species, for the sake of creation rather than a forced attempt to salvage the dying Rakata, and she might base that species on Kallig."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mother Machine appears in the Sith Inquisitor storyline of Star Wars: The Old Republic. The player (Kallig) has several options to use a Rakata data key to force Ashaa to \"rebuild\" their body – paradoxically, this is the light side option, while freeing her is the dark side option. Since Kallig is an Imperial character, it is assumed they took all dark side options, and thus, unleashed Ashaa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}