{"url": "Ashas_Ree/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Sith planets", "Category:Sith Worlds"], "nodes": [{"tag": "h1", "text": "Ashas Ree"}, {"tag": "p", "text": "Ashas Ree was a planet in the Ashas Ree system, a star system deep within the ancient Sith Empire in Sith Worlds region of the Outer Rim Territories's Esstran sector. Connected to other nearby worlds by Kamat Aegit and the Zorfe Trete, Ashas Ree was considered a lesser world of the Sith Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ashas Ree was the primary planet of the system of the same name, a star system located deep within the ancient Sith Empire in Sith Worlds region of the Outer Rim Territories's Esstran sector, situated at grid coordinates R-5. It lay along the Kamat Aegit hyperlane between Kalsunor and Jaguada, while the Zorfe Trete hyperspace route linked Ashas Ree to the world of Ch'hodos."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A battle-scarred world, Ashas Ree held the status of one of the lesser worlds of the Sith Empire and was under the control of Ziost, the Empire's capital world. During the Great Hyperspace War, the Sith Lord Garu, who was the holder of King Adas's holocron, perished on Ashas Ree, thus leaving the ancient relic behind where it remained undiscovered for centuries."}, {"tag": "p", "text": "The world was the first planet encountered by the fallen Jedi Freedon Nadd during his exile from the Galactic Republic following the slaying of his former Jedi Master, Matta Tremayne. Nadd recovered Adas's holocron, which he used to acquire knowledge of the dark side of the Force for his successful bid to subjugate Onderon."}, {"tag": "p", "text": "Around 3660 BBY, during the Rim Campaign of the Great Galactic War, the Republic, under the command of Jedi Master Ven Zallow, launched an attack on the planet, but it was successfully repelled by the Imperial Navy and Army under the command of Darth Angral and Darth Malgus."}, {"tag": "p", "text": "During the Cold War between the Republic and the reconstituted Sith Empire, a hostile surveillance droid impersonated a protocol droid on Ashas Ree. It was taken into custody and its memory core was secured before the data was deleted."}, {"tag": "p", "text": "During the New Sith Wars, Brotherhood of Darkness member Seviss Vaa researched the worlds of the Sith Empire, and mentioned in his writings that various Sith texts deemed the world insignificant and that he had yet to visit Ashas Ree. He also claimed that the world was largely stripped of its Sith treasures by Republic scouts after the end of the Great Hyperspace War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}