{"url": "Mount_Chaolt", "categories": ["Category:Legends articles", "Category:Lok locations", "Category:Volcanoes"], "nodes": [{"tag": "h1", "text": "Mount Chaolt"}, {"tag": "p", "text": "Mount Chaolt was a massive volcano on the planet of Lok. The pirate Nym later renamed the volcano to Adi's Rest to honor his fellow Adi Gallia, the Jedi Master who fought with him during the Trade Federation invasion of Lok."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A cave inhabited by a crazy droid engineer during the Galactic Civil War was located in the hearth of the volcano. Contestants of the Lok Marathon had to race through the heights of the volcano."}, {"tag": "p", "text": "After the Battle of Yavin, the smuggler Dak Vox had set up camp on the volcano in order to mine rocks containing deposits of raw cationic chemical coagulant. Circa 1 ABY, an Imperial operative under the orders of Colonel Veers assassinated the Rebel pilot Raphael Mar-Shayal on the slopes of Mount Chaolt. Around the same time, a smuggler shipped contraband to Edwyn who operated on Mount Chaolt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mount Chaolt was a location in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The volcano was known both as Mount Chaolt and as Adi's Rest in the game. Mount Chaolt was used in the list of point of interests and during the Lok Marathon while Adi's Rest was only used for the exploration badge awarded to players climbing the volcano."}, {"tag": "p", "text": "Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide and Star Wars Galaxies: The Total Experience: Prima Official Game Guide identified the volcano \"Mount Explosallot\". This was corrected in Star Wars Galaxies: The Complete Guide: Prima Official Game Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}