{"url": "Mouse_(sentient_species)", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Rodent sentient species", "Category:Unidentified sentient species"], "nodes": [{"tag": "h1", "text": "Mouse  (sentient species)"}, {"tag": "p", "text": "The mice (singular form, mouse) were a species of diminutive, rodent-like sentient beings with large ears who hailed from the world of Hyperion. The renowned Jedi Master named Mickey Mouse, who fought during the Clone Wars and survived the Great Jedi Purge, was one of them."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Mice were a sentient, rodent-like species that had a round head with two large, dish-shaped ears on the top of it. Members of that species had a humanoid body, which included a torso with the head on top, two arms symmetrically arranged on either side, and two legs symmetrically arranged below. They were quite diminutive, measuring approximately 70 centimeters. In proportion to their size, mice had very large feet and hands. Those hands ended with three fingers and an opposable thumb that allowed them to grasp and handle objects. Their faces featured large eyes with a black pupil, and a prominent snout. Their bodies were mostly covered in black short fur, except for the face itself, on which bare, pinkish skin was exposed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The mice hailed originated on the planet of Hyperion. One of them, Mickey Mouse, joined the Jedi Order in the last decades of an time period known to the historians as the \"Great Peace of the Republic.\" Like all the other Jedi Knights of his time, Mickey Mouse protected the Galactic Republic during the Clone Wars. Following the Republic's fall and its replacement by Palpatine's Galactic Empire, Mouse kept up the struggle against oppression by opposing the newly formed Empire."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}