{"url": "Ashka_Boda", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified species", "Category:Jedi Purge victims", "Category:Lore Keepers", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Ashka Boda"}, {"tag": "p", "text": "Ashka Boda was an aged and wise Jedi Master from the period of the Clone Wars. A revered member of the Librarian's Assembly of the Jedi Order, Boda maintained the large collection of holocrons and other Jedi artifacts located within the Jedi Temple's Archives. Shortly before the start of the Clone Wars, Boda and fellow Jedi Master Jabidus Inspra led a team of Jedi to the isolated Gree Enclave to investigate a sighting of the Separatist leader Count Dooku. After the formation of the Galactic Empire at the end of the Clone Wars, Boda came into possession of the Tedryn Holocron, a vast library of Jedi teachings previously owned by the Krevaaki Jedi Master Bodo Baas, who had recently become victim to Galactic Emperor Palpatine's Jedi Purge."}, {"tag": "p", "text": "Boda joined forces with Jedi Knight Halagad Ventor to form a network of Jedi survivors of the destruction of the Almas Academy; however, many of these Jedi were soon exterminated after Ventor compromised their location during an Imperial interrogation. Boda was soon captured by Imperial forces and escorted by Palpatine's elite Imperial Sentinels back to Coruscant, where he was tortured and eventually killed. Palpatine, alias the Sith Lord Darth Sidious, discovered the Tedryn Holocron among Boda's belongings and used its vast repository of knowledge to learn how to transfer his own essence into a clone body. Although Sidious later claimed to have been given the holocron by Boda, Jedi Master Tionne Solusar uncovered the truth about Ashka Boda's fate long after Sidious's final death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Fugitive of the Empire"}, {"tag": "p", "text": "Ashka Boda was a long-lived male Jedi Master from around the time of the Clone Wars. Boda was a revered member of the Jedi Order's Librarian's Assembly and worked alongside Jedi High Council member Yaddle in maintaining the Jedi Temple's vast collection of holocrons, scrolls, and tomes. A close confidant of Jedi Master Qui-Gon Jinn, Boda and Jinn shared a fascination in the study of immortality. In the weeks leading up to the outbreak of the Clone Wars in 22 BBY, Count Dooku, former Jedi Master and leader of the Confederacy of Independent Systems, traveled to the isolated Gree Enclave to purchase a special pre-Republic era solar sail for his personal solar sailer. Reports of Dooku's presence in the Enclave reached the Galactic Republic as well as the Jedi, but only after his departure from the Gree worlds. Ashka Boda and fellow Jedi Master Jabidus Inspra led an investigative task force of five Jedi from the Jedi Temple into the Enclave to determine the purpose of Dooku's visit."}, {"tag": "p", "text": "Shortly after the formation of the Galactic Empire in 19 BBY, Emperor Palpatine, also known as Darth Sidious, initiated the Great Jedi Purge and captured the ancient Krevaaki Jedi Master Bodo Baas, possessor of the famed Tedryn Holocron that stored the teachings and experiences of Jedi Masters long past. Baas was executed by Sidious toward the beginning of the Purge; however, the Tedryn Holocron eventually found its way into the possession of Ashka Boda along with a belt that Baas had once owned."}, {"tag": "p", "text": "Boda collaborated with Jedi Knight Halagad Ventor in an effort to establish a network of Jedi from the Cularin system who had survived the destruction of the Almas Academy. Boda informed Jedi Master Denia of the creation of this network; however, these Jedi were nearly all hunted down and killed in the Purge after Ventor was forced to reveal their location in an interrogation by Darth Vader."}, {"tag": "p", "text": "Boda, too, was captured along with several other Jedi at the scene of another battle. A group of Imperial Sentinels—towering, mutated warriors created by Sidious's Dark Side Adepts—possessed cryptic yet authentic datachips that gave them disposition over Boda. The Sentinels formed a praetorian guard around Boda as he was escorted back to their dungeon ship and summarily transported to the Imperial Center. Once there, Sidious tortured and murdered the Jedi Master and discovered the Tedryn Holocron among his belongings."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Sidious used the knowledge that he gained from the Tedryn Holocron to learn the secret of spirit transference, allowing him to transfer his essence into clone bodies. Other information he used in the creation of The Book of Anger, the first volume of his Dark Side Compendium. Six years after the Empire's crushing defeat at the Battle of Endor, a reborn Sidious initiated a military campaign to retake the galaxy. Amidst the chaos, New Republic Princess Leia Organa Solo was captured by Sidious's forces. The Sith Lord, suffering from the effects of the dark side on his degenerating clone body, introduced the Princess to the Tedryn Holocron, claiming to have been given the device by Ashka Boda before the Jedi Master's disappearance. The holocron soon fell into New Republic hands, but the truth about Ashka Boda's fate was not revealed until a report on the history of the holocron was recorded in 40 ABY by Jedi Master Tionne Solusar of the New Jedi Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ashka Boda was a wise and aged Jedi Master during the Clone Wars. He was considered by many to be great and famous and was a revered scholar of the Librarian's Assembly of the Jedi Order. Darth Sidious considered Boda and the knowledge he carried important enough to have him escorted to Coruscant by his personal bodyguards."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ashka Boda, a Jedi mystic, possessed the knowledge and skills to attain the rank of Jedi Master and to become a member of the Librarian's Assembly of the Jedi Order, as well as one of the Jedi Temple's curators. He had learned and perfected the technique of essence transfer, which Darth Sidious would find useful."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ashka Boda was first mentioned in the endnotes written by Tom Veitch at the end of the second issue of Star Wars: Dark Empire. He received his first in-universe mention in the fifth issue of Dark Empire along with a further expansion in the endnotes at the end of the issue. He has since been mentioned and expanded upon in a variety of sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}