{"url": "Mrssk", "categories": ["Category:Legends articles", "Category:Jedi of the Jedi Order", "Category:Males", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Mrssk"}, {"tag": "p", "text": "Mrssk was a male Trandoshan Jedi who served the Jedi Order during the New Sith Wars and a member of Vannar Treece's strike team. He participated in Operation Influx on the planet Chelloa in 1032 BBY. Mrssk and his comrades infiltrated the planet Oranessan in 1032 BBY. He also subsequently took part in a raid on Chelloa, a producer of baradium. Mrssk was subsequently killed in an explosion caused by baradium ignited by Sith Lord Odion's kinetic corruptor. He was known to have wielded a blue lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi career"}, {"tag": "p", "text": "Mrssk was a Trandoshan Jedi who lived during the Republic Dark Age, the last century of the New Sith Wars. During that period, the New Sith Empire had collapsed and various Sith warlords controlled large areas of the galaxy. The Galactic Republic had shrunk to a rump state centered around the Core Worlds and was defended from Sith invasion by a security cordon around the Colonies. At an unknown period, Mrssk was discovered to be Force-sensitive by members of the Jedi Order and was trained as a Jedi Knight. Mrssk was an enigma among the Trandoshan species due to his Force sensitivity and his alignment with the Jedi and the Galactic Republic. During his Jedi career, Mrssk became acquinted with the Jedi Master Vannar Treece, a Jedi activist who led independent \"knight errant\" operation against Sith warlords in the Grumani sector."}, {"tag": "h3", "text": "Operation Influx"}, {"tag": "p", "text": "In 1032 BBY, Treece learnt that the Sith Lord Daiman had begun mining baradium—a volatile compound used in the manufacture of explosives including thermal detonators—on the planet Chelloa and was exporting large quantities of the compound to munitions factories near the front line. Treece feared that Daiman's baradium advantage would end the stalemated conflict in the Grumani sectory by giving him a distinct advantage over his Sith competitors and thus pose a greater threat to the Republic in the future.Treece subsequently gained authorization from Supreme Chancellor Genarra to launch Operation Influx. This was a three-stage operation that involved infiltrating the Daimanate by landing at Oranessan, a key transport hub; disrupting export operations on Bardium; and extraction to the Republic via a direct hyperspace route leading to neutral space."}, {"tag": "p", "text": "Treece had learnt about the baradium operations from his old friend and undercover Jedi operative Gorlan Palladane, the leader of the Chelloan resistance. Palladane and his Rodian mechanic friend Skodo had used a stolen transmitter to reactivate a hyperspace relay and communicate with Treece. However, the Sith Lord Odion had been monitoring the transmission and made preparations to invade Chelloa. The nihilistic Sith Lord believed that the planet's high concentration of baradium created an imbalance in the Force and thus had to be destroyed.Treece assembled a motley volunteer force of Jedi that included friends who had worked in earlier \"knight errant\" operations with him, Jedi who distinguished themselves in other combat operations, and other acquaintances who owed him personal favors."}, {"tag": "p", "text": "Since Dorvin had worked in earlier operations with Treece, he was recruited for Operation Influx. Other members of the team included the Celegian Dorvin Eltrom and the Quarren Jedi Master Berluk, who had earned distinction in combat. Treece was also taking advantage of a loophole in Genarra's edict that allowed Jedi Knights sixteen days of free travel anywhere in the galaxy between their regular routine of serving three months in law enforcement patrols and nine months of active service on the Republic's contracting frontiers. Another member of the strike team was Treece's former apprentice Kerra Holt, a young Human girl who had been orphaned during the Chagras Hegemony's conquest of her homeworld of Aquilaris Minor in 1042 BBY. This marked Kerra's first return to her home sector after spending much of her adolescence with the Jedi on Coruscant."}, {"tag": "h3", "text": "Insertion at Oranessan"}, {"tag": "p", "text": "The first stage of Operation Influx went smoothly with the Jedi team safely arriving on a starship at Oranessan. While descending into the planet's atmosphere, they intercepted and shot down a personnel shuttle carrying flight crew to a spaceport where a fleet of Daimanate Heavy-Lift Starcrossers was awaiting departure for a delivery run to Chelloa. The shuttle crashed on top of a hillcrest in the mud flats and the Jedi quickly retrieved the fallen crew's cloaks and identification badges."}, {"tag": "p", "text": "After killing a group of Daimanate sentries, the Jedi commandeered an empty Starcrosser transport from the spaceport's landing zone and prepared to depart for Chelloa. The Jedi planned to use the transport to take them to Chelloa, but discovered that the transport's navigation computer was missing its activation cylinder. While the transport was still able to fly, it was unable to make a hyperspace jump. Mrssk explained to his fellow Jedi that while it was standard protocol for Republic-registered vessels to carry their activation cylinders aboard the vessel, the Sith Lord Daiman did not allow his men to keep the devices aboard his ships to reduce desertion rates among his forces."}, {"tag": "p", "text": "While Master Treece considered shifting to their fallback which involved heading back to their Jedi starship and using it to shoot down the departing Daimanate transports, Kerra disagreed because Daiman could easily re-route other ships within his realm to Chelloa. Undaunted by the challenges, Holt stole a replacement cylinder from a nearby hangar, and after fitting the device, the Jedi departed Oranessan."}, {"tag": "h3", "text": "Death on Chelloa"}, {"tag": "p", "text": "During the second part of the operation, the Jedi strike team landed at the spaceport town of Jenith where they overwhelmed a small Daimanate security force with the assistance of the Chelloan resistance. Their attack was interrupted by the arrival of Sith Lord Odion's forces which had deployed a kinetic corruptor that ignited a large area of the surface. The ensuing explosion killed many Jedi, Daimanate guards and miners within the vicinity. Mrssk himself was killed during the explosion while Treece was slain by Odion during a lightsaber duel."}, {"tag": "p", "text": "The sole survivor was Kerra Holt who was sheltered by Palladane. She would go on to evacuate the planet's 63,000 inhabitants to the safety of Republic space after Daiman ignited the planet's surface with his own kinetic corruptors at the end of the Chelloan affair. Despite Mrssk's death on Chelloa, the Jedi and the Republic continued with their effort against the Sith who were finally defeated at the Seventh Battle of Ruusan in 1000 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mrssk was first introduced as a supporting character in the new comic Knight Errant comic series which debuted in August 2010 with the release of Knight Errant 0 during Celebration V. His story background was developed by John Jackson Miller, drawn by artist Federico Dallocchio and colored by Michael Atiyeh. He also appeared in the short story Star Wars: Knight Errant: Influx which was also written by Miller and explored the prelude on Oranessan prior to the events in the Aflame story arc. This short story first debuted on October 19, 2010 where he had a small speaking role consisting of just one line. Mrssk was killed off in Star Wars: Knight Errant: Aflame 1, the first issue of the Star Wars: Knight Errant: Aflame story arc which was first released on October 13, 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}