{"url": "Msqito", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Creatures of Kubindi", "Category:Creatures of unspecified diet", "Category:Flying creatures", "Category:Insects", "Category:Jungle and forest creatures", "Category:Oviparous species", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Msqito"}, {"tag": "p", "text": "Msqitos were a species of large flying insects native to the planet Kubindi. While the species laid their eggs near water, as adults they lived in forests, such as the Silver Forest of Dreams."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Msqitos were flying insects native to the planet Kubindi, a world plagued by frequent solar flares. The insects had a relatively large wingspan and had bodies of an equal length to the height of an adult Human, a species who, on average, stood at 1.8 meters tall."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Msqitos would lay their eggs near bodies of water, and then each day, all those that hatched would make their way to another habitat together as a flock. Adult members of the species inhabited forested areas."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the bounty hunter Dengar, along with several other bounty hunters, traveled to Kubindi in 0 ABY, he encountered a flock of msqitos in the Silver Forest of Dreams and nearly crashed his JumpMaster 5000, Punishing One, after swerving to avoid hitting them. The Rebels Luke Skywalker, Han Solo and Leia Organa, who followed the hunters to the planet, witnessed a flock of newly hatched msqitos making their way to the Silver Forest of Dreams from a nearby lake, one of which an aquabeast attempted to eat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Msqitos first appeared in Star Wars Missions 6: The Search for Grubba the Hutt, a 1998 novel written by Dave Wolverton as part of the Star Wars Missions series. Neither source makes clear their level of sentience."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}