{"url": "Mubasa_hock", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Hutt food"], "nodes": [{"tag": "h1", "text": "Mubasa hock"}, {"tag": "p", "text": "Mubasa hock, named mubasa hok in Huttese, was an expensive dish created by the Hutt species. It was served in the Sith Academy on the planet Odacer-Faustin in the year 3645 BBY and was also available in Hutt eateries on the planet Tatooine during the reign of the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mubasa hock was an expensive dish that was edible to both the Human and Hutt species, the latter calling it mubasa hok in Huttese and often serving it in a bowl alongside several other dishes, all of which would be eaten in a random order. It could be served as a stringy lump and could be eaten alongside canned montra fruit. Using utensils to eat the hock was optional."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mubasa hock was served in the galaxy as early as 3645 BBY, when the Sith Acolyte Jura Ostrogoth ate a portion of hock while in the dining hall of the Sith Academy on the planet Odacer-Faustin. During the reign of the New Republic, the Human scholar Ebenn Q3 Baobab recommended that his Human readership of his publication Galactic Phrase Book & Travel Guide try mubasa hock—albeit while wearing gloves—should they find themselves in any of the Huttese eateries of the Mos Eisley spaceport on the planet Tatooine. Baobab mentioned the dish as one of his favorite Hutt cuisines in the section of the book dedicated to the Huttese language, where he also provided the translation from Basic and described all Huttese cuisine as \"casual.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mubasa hock was first mentioned in the Galactic Phrase Book & Travel Guide, written by Star Wars sound designer Ben Burtt in 2001. It later appeared in the 2010 novel Red Harvest, written by Joe Schreiber. No explicit connection exists between mubasa hock and mubasa sauce, which appeared in the 2009 novel Rebel Force: Renegade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}