{"url": "Muftak/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Authors", "Category:Males", "Category:Talz", "Category:Tatooinians", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Muftak"}, {"tag": "p", "text": "Muftak was a male Talz seen in Chalmun's Spaceport Cantina."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Muftak was orphaned on the steps of Docking Bay 12 of the Mos Eisley spaceport on Tatooine. He grew up among the cantina's regular, local customers, performing odd jobs to make a living. He always knew that he was different from almost every other race that passed through Mos Eisley, but he couldn't learn who or what he was. He searched out information from his friend, Momaw Nadon, but Nadon had never seen a Talz before."}, {"tag": "p", "text": "In time, Muftak found and adopted the abandoned Chadra-Fan female named Kabe, and the two were nearly inseparable. Together they were known as pickpockets and thieves, with Muftak providing the brawn, while Kabe provided the brains."}, {"tag": "p", "text": "Just after the Millennium Falcon blasted out of Mos Eisley, Muftak and Kabe decided to rob Jabba Desilijic Tiure's Mos Eisley townhouse, where Mosep Binneed had established the Hutt's treasury and financial headquarters. They were rewarded when they were able to rescue a datadot from Barid Mesoriaam, who was being tortured by Jabba for information on the Rebel Alliance. Muftak and Kabe barely escaped, but were paid 15,000 credits and a pair of travel vouchers signed by Grand Moff Wilhuff Tarkin. They fled Tatooine, traveling to both Alzoc III and Chad before visiting other planets."}, {"tag": "p", "text": "During this time, Muftak wrote his autobiography, Sands in Winter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although uncredited, Muftak was played by Laine Liska in A New Hope.[source?]"}, {"tag": "p", "text": "According to a 1978 memo, Muftak was going to be named Cullatran in A New Hope. The name \"Muftak\" was given to this character in Star Wars: The Roleplaying Game."}, {"tag": "p", "text": "On set, Muftak went by the nicknames of Spider-Man and Four Eyes.[source?]"}, {"tag": "p", "text": "In 1979, Muftak appeared in a 30 second commercial produced for the U.S. Department of Transportation. He was drunk, and his Duros friend helped him home."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}