{"url": "Multi-Altitude_Assault_Transport", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Gunship classes", "Category:Low Altitude Assault Transport variants"], "nodes": [{"tag": "h1", "text": "Multi-Altitude Assault Transport"}, {"tag": "p", "text": "The Multi-Altitude Assault Transport (MAAT) was an aerial vehicle that was used by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Multi Altitude Assault Transport was an evolution of the Galactic Republic's Low Altitude Assault Transport repulsorlift gunship and was a rugged, combat ready repulsorcraft used by the Empire to deploy its stormtroopers in a variety of environments, as well as conditions. Its design was very similar to the LAAT except for the addition of two more wings above the primary wings, reminiscent of an ARC-170, and armor on the bubble-cockpits."}, {"tag": "p", "text": "Like its predecessor, the MAAT was armed with a variety of weapons which included missile launchers and laser cannons. However, while the LAAT was primarily used to land troops on planetary surfaces, the MAAT instead was capable of transporting stormtroopers to much higher altitude locations such as upper atmosphere installations as well as starships hanging in low orbit of a world."}, {"tag": "p", "text": "A modified MAAT was even capable of flying short distances through space in order to reach capital ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A gunship of this class was present during the Battle of the TIE Fighter Construction Facility in 3 BBY, where it attempted to send in Rahm Kota's reinforcements against the facility's stormtrooper contingent. Before it could land, it was destroyed by Galen Marek."}, {"tag": "p", "text": "The Rebellion would use these, along with the LAAT/is, to transport troops across the battlefield in both space and planetary battles during the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}