{"url": "Multi-Environment_Tracked_Transport", "categories": ["Category:Legends articles", "Category:Czerka Arms products", "Category:Sandcrawlers"], "nodes": [{"tag": "h1", "text": "Multi-Environment Tracked Transport"}, {"tag": "p", "text": "The Multi-Environment Tracked Transport (M-ETT), also known as a sandcrawler, was a tracked vehicle manufactured by Czerka Corporation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "At the time of its release it was one of the most sophisticated ground vehicles available for sale. The enormous transport, used often in deserts, could hold enough resources to keep its crew well-stocked in the harsh desert environment. Climate control inside the vehicle also helped ward off the effects of the desert. The vast space within could allow the M-ETT to transport large quantities of supplies to settlements, eliminating the need for frequent trips. Sometimes, however, the vehicles broke down, occasionally stranding their crew deep in the arid wastes of the worlds they operated on."}, {"tag": "p", "text": "The M-ETT was designed to be used in environments where repulsorcraft would be prohibitively expensive or difficult to use, able to run on a wide variety of surfaces. The M-ETT's tracked locomotion was especially good for arid worlds such as Tatooine, where unstable ground and sand dunes made moving in wheeled vehicles and walkers difficult, and sandstorms caused repulsorlifts to malfunction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The KOTOR Campaign Guide Web Enhancement 1 from Wizards of the Coast's website was the first source to identify this type of sandcrawler. Though the supplement is illustrated by a Jawa sandcrawler from Star Wars: Episode IV A New Hope, the era and description suggest it is meant to refer to a type of sandcrawler first seen in Star Wars: Knights of the Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}