{"url": "Multi-Troop_Transport", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems repulsorcraft", "Category:Multi-Troop Transports", "Category:Trade Federation vehicles"], "nodes": [{"tag": "h1", "text": "Multi-Troop Transport"}, {"tag": "p", "text": "The Multi-Troop Transport (MTT) was a heavily armored repulsorlift transport vehicle manufactured by Baktoid Armor Workshop and used by both the Trade Federation during their Invasion of Naboo and later the Confederacy of Independent Systems to transport B1-series battle droids before and during the Clone Wars. During the Clone Wars, it was used to transport B2-series super battle droids."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Manufactured by Baktoid Armor Workshop for the Trade Federation and later the Confederacy of Independent Systems, the Multi-Troop Transport was a heavy, broad-shouldered, snub-nosed repulsorlift vehicle designed to transport battle droids into combat. Massive, lumbering, imposing vehicles, the 35.94 meter long and 10.45 meter tall MTT was considered a troop carrier, a tank, and a siege ram. It was difficult to stop at a maximum speed of thirty-one kilometers per hour, and when compared to the Armored Assault Tank also used by the Federation and Confederacy, it was extremely capable in its role."}, {"tag": "p", "text": "With its hulking forward hull, sloping front end, and small aft hull, the MTT had a vaguely elephantine silhouette. A small armored cockpit was mounted atop the towering hull, directly above a large, thick, circular hatch, where two OOM pilot battle droids served as the vehicle's operators. These two pilot droids directed the vehicle according to the instructions received from a Lucrehulk-class Battleship. One of the pilots would serve as an engineer and a gunner. Much of the interior was given over to the hydraulically-powered droid deployment rack, a long rotating assembly that carried a total of one hundred and twelve deactivated B1-series battle droids or twelve B2-series super battle droids. In order to deploy the droids, the MTT was required to cease movement, open the hatch, and extend the rack, where the droids were then quickly deployed and activated, creating an instant infantry formation."}, {"tag": "p", "text": "For defensive purposes, the Multi-Troop Transport was armed with forward-mounted twin light blaster cannons, as well as forward-mounted twin heavy blaster cannons. They were additionally equipped with close-ranged sensors."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Multi-Troop Transports were utilized by the Trade Federation, and later the Confederacy of Independent Systems, to deposit over a hundred battle droid infantry troops into the thick of combat on battlefields. Assisted by an orbital Lucrehulk-class Battleship, which sent an activation signal to the droids, the MTT deployed its stowed soldiers into their battle-ready humanoid configuration."}, {"tag": "p", "text": "MTTs were typically supported by phalanxes of Armored Assault Tanks, which cleared the path ahead to allow the troop transports to deploy their units, although MTTs were also used to support front lines and front ranks comprised of AATs. Multi-Troop Transports were themselves deployed from within C-9979 landing craft, which carried eleven MTTs each."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Numerous Multi-Troop Transports were deployed from landing craft during the Invasion of Naboo. Disgorged into the planet's swamps, MTTs bulldozed anything in their path, from trees to native life-forms, and thirty-three of the large transports ultimately assisted in the occupation of Theed. They were later part of the Trade Federation Droid Army sent to confront the Gungan Grand Army on the Great Grass Plains. When the Gungans' deflector shields proved strong enough to withstand bombardment from Armored Assault Tanks, a line of MTTs deployed their B1-series battle droids to walk through the energy wall and engage the Gungans in single combat. The MTTs remained a fearsome presence throughout the battle, some closing in to trap the Gungan army, and once the deflector shield generators were destroyed, many Gungans became vulnerable to the transports' laser fire."}, {"tag": "p", "text": "MTTs were used by the Confederacy of Independent Systems during the Clone Wars, transporting infantry troops to numerous battlefields, and many were painted in Confederacy livery."}, {"tag": "p", "text": "Multi-Troop Transports were used by the Dowutin Hunters, mercenaries active during the Galactic Civil War who fought for both the Galactic Empire and the Alliance to Restore the Republic. These transports were modified, donning a predominantly green and yellow color scheme likened to that of their Dowutin operators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Starwars.com Encyclopedia listed the length of this vehicle as 25.94 meters, while the newer Databank lists it as 35.94 meters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}