{"url": "Multopos", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Aquatic sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Multopos"}, {"tag": "p", "text": "The Multopos were a sentient species indigenous to the planet Baralou."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Their diet consisted of small herbivores and plants. The Multopos were tall and muscular with thick, moist skin that was mottled grey to light blue in color. They had muscular legs and thin, long arms. Trailing from the forearms and legs were thick membranes that aided in swimming. Each limb had three digits and their hands were webbed. Their heads had long snouts, with three sets of gills immediately below the lower jaw. Multopos could breathe both air and water and could withstand the extreme pressures found in ocean depths. Their large, bulbous eyes were set deeply into their skulls. Any Multopo that spent more than one day out of water would quickly become dehydrated."}, {"tag": "p", "text": "Because of their amphibious nature, Multopos could only mate in water, and their eggs must be kept in water for the entire development period. The young could not leave the water until they were about six local years old."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Multopos formed tribes and generally resided toward the center, and thus the safest, portions of an island. Multopos tribes were quite traditional. Individuals stayed with the tribe they were born and raised with. There was very little individuality in their society, as each Multopos was wholly dedicated to the tribe. They spent a great deal of time caring for the young as well as hunting and gathering plants. The tribes were loosely organized; the Multopos normally followed the lead of the tribe member showing the most initiative. Multopos tribes were isolated from one another, although the species as a whole was curious and peaceful. The most important function of the tribe was to raise more Multopos. Each Multopos tribe had several canals to keep their eggs alive between storms. Multopos eggs and infants were cared for in these canals, and several adults would watch the canals at all times."}, {"tag": "p", "text": "The Multopos were constantly engaged in a vicious war with the Krikthasi, another sentient species native to Baralou. The Multopos developed stone level technology and traded with the Krikthasi through barter. They also allowed free-traders gather gems from their islands in exchange for goods. However, due to their ignorance of the true worth of the gemstones, the Multopos would trade a one kilogram Sasho gem worth five thousand credits for a blaster pistol and some power packs. Multopos would approach curious visitors and attempt to speak with them in a pidgin version of Basic. They built simple structures out of soil and sand, which they mixed with adhesive from certain tree trunks. The resulting buildings were sturdy, but very light and float in water."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}