{"url": "Munch-fungus/Legends", "categories": ["Category:Legends articles", "Category:Edible fungi", "Category:Twi'lek food"], "nodes": [{"tag": "h1", "text": "Munch-fungus"}, {"tag": "p", "text": "Munch-fungus was a species of edible fungi native to the planet Ryloth, the Outer Rim homeworld of the Twi'lek people. One of several fungal strains that contributed to the traditional diet of the indigenous Twi'leks, munch-fungus was a versatile food that could be eaten raw or cooked in a variety of culinary dishes. Possessed of a naturally spongy consistency and bland flavor, munch-fungus could nevertheless be prepared and seasoned to suit a multitude of tastes, especially by an experienced cook."}, {"tag": "p", "text": "When ground into a fine powder, combined with water, and kneaded into dough, munch-fungus could be baked into loaves of bread. Regarded as tasty, munch-fungus bread could be kept in reserve for many days without spoiling. Raw munch-fungus could be served in a soaking bowl of warm broth, and the Kala'uun cantina known as Mal'aa's Kitchens often provided munch-fungus broth as an accompaniment to rycrit stew. The cantina's owner, a matronly Twi'lek woman named Mal'aa, was also willing to teach even the most inexperienced cooks to properly prepare meals using munch-fungus."}, {"tag": "p", "text": "During the reign of the Galactic Empire, two Twi'lek brothers sold a wide selection of local fungi in the city of Kala'uun. Along with glow- and burn-fungus, the brothers harvested munch-fungus from the lower caverns of Kala'uun in large quantities, bringing daily cartloads of their fungal goods into the city every morning. Commonly known as the \"Fungus Brothers,\" the siblings typically sold munch-fungus for two credits per handful."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Munch-fungus was first introduced to the Star Wars universe in the Star Wars roleplaying game book Platt's Starport Guide, written by Peter M. Schweighofer and published by West End Games in February 1995."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}