{"url": "Munto_Codru/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Alliance planets", "Category:Galactic Alliance Remnant planets", "Category:New Republic planets", "Category:Pakuuni sector planets"], "nodes": [{"tag": "h1", "text": "Munto Codru"}, {"tag": "p", "text": "Munto Codru was a remote and backwater world in the Outer Rim Territories located within the Codru system on the Overic Griplink, between Pakuuni and the Calamari sector. Its sole sentient species were the Codru-Ji, who were born as canine wyrwulfs before metamorphosis upon reaching maturity."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Much of the planet's landmass was covered by rugged mountains which were interlocked by large forests. A large proportion of Munto Codru also appeared to be covered by oceans. The planetary capital was at Capital Codru which contained the headquarters of the government as well as the planetary spaceport and the Forbidden Castle. A series of ornate stone castles were scattered across Munto Codru."}, {"tag": "p", "text": "These castles were produced not by the Codru-Ji, but by an unknown extinct civilization. Their thin rock walls appeared to most visitors to be translucent and were decorated with mysterious symbols and arcane petroglyphs, causing a sense of mystery and awe to many offworld visitors. Despite these wonders, many Codru-Ji avoided these castles as they considered them to be haunted. However, they were sometimes used as provincial capitals."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the planet was located within Separatist space."}, {"tag": "p", "text": "For the most part, Munto Codru remained isolated over the centuries, with the Galactic Republic and Galactic Empire leaving the planet alone. What little industry Munto Codru could sustain was devoted almost entirely to the survival of the native Codru-Ji. As a result of this, the Codru-Ji were able to concentrate on their own complicated internal politics. Leading Codru-Ji families were often the target of \"coup abductions\"—ritualized kidnappings of children by political rivals. These abductions almost always ended with the payment of ransoms and the safe return of the children."}, {"tag": "p", "text": "In 14 ABY, the New Republic Chief of State Leia Organa Solo visited Munto Codru with her children Jaina, Jacen and Anakin as part of her tour of remote member worlds. Unfortunately, her children were kidnapped by agents of Hethrir, the leader of the Empire Reborn, as part of his campaign against the New Republic's authority. Hethrir used the tradition of political kidnappings on the world as a cover, and had his Empire Youth Proctors infiltrate the compound in a skiff and detonate a pressure bomb, which knocked out everyone within its range. Hethrir then took the children off-planet; they would later be rescued."}, {"tag": "p", "text": "Following the demise of Hethrir and his Empire Reborn, the planet joined the Galactic Alliance. In 130 ABY, Munto Codru was under the control of Governor Vikar Dorn, who turned it over to Darth Krayt's Galactic Empire. Despite this, the Galactic Alliance Remnant still had some influence on the world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Munto Codru in the Kanchen sector, which is actually located in the Core Worlds."}, {"tag": "p", "text": "The Star Wars Roleplaying Game Revised Core Rulebook mistakenly refers to the planet as \"Montu Cordu.\" Star Wars: Rebellion: Prima's Official Strategy Guide misspells the planet as \"Munto Codro.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}