{"url": "Murgoob", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Duloks", "Category:Males"], "nodes": [{"tag": "h1", "text": "Murgoob"}, {"tag": "p", "text": "Murgoob, also known as the Great Murgoob and Murgoob the Cranky, was the oracle for King Gorneesh's tribe of Duloks on the Forest Moon of Endor. By 3 ABY, Murgoob had lived for more than 600 seasons. He looked the part, walking with a noticeable stoop and leaning heavily on a twisted, wooden staff. He had an unkempt, gray beard that hung down to his belly and long, gray head-hair that he bound with a cord. The oracle lived as a hermit in his lair, a rotted-out tree stump far from his tribe's village in the Dulok Swamp."}, {"tag": "p", "text": "Decades before the Battle of Yavin, Murgoob participated in the Ewok–Dulok War, a conflict between his tribe and the Ewoks of Bright Tree Village over control of the forest. In a battle that would still haunt him decades later, Murgoob saw the Duloks driven back to their swamps by a formidable Ewok battle wagon. When Murgoob's nephew, the shaman Umwak, approached him in 3 ABY with news that the wagon had been rebuilt, the two hatched a scheme to steal it and use it against the Ewoks' Soul Trees. Murgoob joined the attack, but an Ewok saboteur destroyed the war machine before it could do any real damage. Murgoob and his tribemates fled once again to their marshland home."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Murgoob was born into a tribe of Duloks on the Forest Moon of Endor decades before the Battle of Yavin. By the time his band had come under the rule of King Gorneesh, Murgoob was rumored to have seen hundreds of seasons. About 600 seasons before 0 BBY, Murgoob took up residence in a large tree stump on the periphery of the Dulok Swamp. There, he resided as a hermit, avoiding contact with his kin. At some point, he was named his tribe's oracle."}, {"tag": "p", "text": "Hundreds of seasons before 3 ABY, Murgoob's tribe fought the Ewok–Dulok War with the Ewoks of Bright Tree Village. In a bid to conquer the enemy once and for all and to take over their territory, axe-wielding Dulok warriors marched on the Ewoks' Soul Trees to cut them down and break the enemy's spirit. However, an Ewok battle wagon, built by Erpham Warrick, stymied the attack. With the advantage theirs, the Ewoks pushed the Duloks back to their swampland home. This defeat plagued Murgoob for decades afterward."}, {"tag": "h3", "text": "Return of the battle wagon"}, {"tag": "p", "text": "Over the years, Murgoob cloistered himself in his tree stump hermitage. In 3 ABY, however, he was disturbed. His tribe's queen, Urgah, and Murgoob's nephew, Umwak—never a favorite of Murgoob's, and now making the unbelievable claim that he had been named the tribe's shaman—brought ill tidings: a Dulok scout had reported that the Ewok battle wagon had been restored. The oracle panicked; his immediate instinct was to hide, but Umwak pressed him for information. Murgoob related the story of the battle he had witnessed so long ago. His nephew then made an interesting proposition, suggesting that perhaps the Duloks could steal the battle wagon and use it against the Ewoks. Murgoob was intrigued and declared that with such a weapon, the Duloks could take over the Ewoks' forests once and for all. The queen and the shaman departed, leaving Murgoob to his solitude."}, {"tag": "p", "text": "A short time later, Murgoob's nephew returned with news that the Duloks had managed to steal Erpham Warrick's war machine, but needed advice on how to best employ it. Murgoob knew just the trick: if they could destroy the Ewoks' Soul Trees, it would be a tremendous psychological blow against the enemy to which Umwak agreed. He asked his uncle to join the campaign, but the oracle opted instead to get some shuteye."}, {"tag": "p", "text": "A loud splash woke Murgoob from his nap and prodded him to investigate. To his irritation, the oracle found that someone had actually had the audacity to impersonate him and had even ordered the tribe to make an \"attack\"—landing the battle wagon in a river. Murgoob unmasked the impostor with his clawed hands. His worst fears were confirmed: it was an Ewok, Wicket W. Warrick. The tribe placed the interloper in a cage aboard the battle wagon and prepared for the real assault. Murgoob took up position at the contraption's fore, alongside the battering ram."}, {"tag": "h3", "text": "Assault on the Soul Trees"}, {"tag": "p", "text": "Now pointing in the right direction, the battle wagon rolled out with Murgoob aboard. King Gorneesh ordered a stop near Bright Tree Village, where he taunted his Ewok rivals and threatened to destroy the Soul Trees. The Ewok leader, Chief Chirpa, vowed that the Ewoks would defend the trees at all costs."}, {"tag": "p", "text": "The assault began in earnest. The battle wagon barreled through the Ewok defenses, shrugging off arrows as Dulok warriors hurled spears. As the Soul Trees grew nearer, that of Erpham Warrick stood front and center. Suddenly, Duloks began falling from the wagon left and right. Murgoob turned toward the source of the commotion and saw that the young Ewok had escaped from his cage along with a wokling companion named Malani. Murgoob barely had time to mutter a curse before the Ewoks pulled back the battering ram and sent his slight frame flying. A bush broke his fall, but Murgoob's role in the battle was at an end."}, {"tag": "p", "text": "The rest of the attack went no better. Somehow, the Ewoks managed to repel Gorneesh himself and to destroy the battle wagon before it could reach its target. Defeated once more, Murgoob and the Duloks slumped back to their swamp."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By 3 ABY, Murgoob was a truly venerable specimen of his species. Like most Duloks, he had green body fur and pink eyes, but his age was evident in his facial wrinkles, missing bottom tooth, and long, gray beard and head hair. His eyebrows and mustache were light green, and his nose was gray. Murgoob bound his head hair into a tuft and wore no clothing except a cord about his waist. He walked hunched over and supported himself on a gnarled wooden staff."}, {"tag": "p", "text": "Other Duloks in his tribe regarded Murgoob with mixed emotions. On the one hand, he was regarded as a wise sage; he did go by the name \"Murgoob the Great,\" after all. When he did show his face, the Duloks followed his commands readily, as the Ewok Wicket W. Warrick discovered when he impersonated the oracle. Murgoob was also thought to be a bearer of good fortune, and Umwak was eager to have his uncle join the assault on the Ewoks' Soul Trees to bring it good luck. In 3 ABY, Murgoob was rumored to have kept himself stolen away for 600 seasons. Not even the Dulok king, queen, or shaman knew what Murgoob looked like, which allowed the Ewok Wicket W. Warrick to impersonate the oracle without anyone being the wiser. The fact that he had gone unseen for generations shrouded Murgoob in a veil of mystery; Urgah decided to accompany Umwak to visit him out of sheer curiosity. Still, the shaman Umwak dreaded visits with his uncle. Murgoob's tribe held him in such regard that when Gorneesh encountered the Ewok-in-disguise, the king felt compelled to flaunt his leadership skills in front of what he took to be the shriveled oracle himself."}, {"tag": "p", "text": "Murgoob lived in an old, decrepit, hollow tree stump somewhere on the outskirts of the Dulok Swamp. The oracle rarely ventured from his home, and he did not make it easy for others to find him: those who came for advice could only reach his hovel via a treacherous pathway of mossy stones that crossed a pond to his short front door. The Dulok oracle addressed pilgrims from within the structure in an echoing, ominous voice. Only a few fire-lit windows that belched puffs of smoke as he talked betrayed the presence of Murgoob inside. Pilgrims seldom found a friendly reception. Murgoob was known for his love of solitude and unfriendly temperament, which had earned him the dubious sobriquet, \"Murgoob the Cranky.\" Some visitors were greeted only with the oracle's admonition to turn around and go away."}, {"tag": "p", "text": "Murgoob disliked his nephew, Umwak. Even after the younger Dulok had reached adulthood, his uncle regarded him as little more than a pup. Murgoob greeted the news that Umwak had made it to the post of shaman of the tribe with derisive disbelief. Murgoob also reserved a special hatred for Ewoks. He nursed a grudge decades after Erpham Warrick's battle wagon had prevented the Dulok conquest of Bright Tree Village. Furthermore, he remembered the war machine with fear. The ancient Dulok eagerly took part in the renewed campaign to accomplish the task that had gone unfinished years ago."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Murgoob first appeared in \"Wicket's Wagon,\" an episode of the Ewoks animated series that first aired in 1985, where his voice was provided by voice actor Eric Peterson. Artist Robin Pronovost and author Daniel Wallace have listed the episode among those that best exemplify the villainous nature of the Duloks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}