{"url": "Murkhana", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems planets", "Category:Corporate Alliance locations", "Category:Galactic Empire planets", "Category:Murkhana locations", "Category:Tion Cluster planets"], "nodes": [{"tag": "h1", "text": "Murkhana"}, {"tag": "p", "text": "Murkhana was a planet in the Outer Rim Territories. Known for its natural beauty, it was a major tourist attraction in the last years of the Republic Era. During the Clone Wars, the world became a major Separatist bastion; consequently, much of its environment was destroyed by a Republic orbital bombardment. By the Imperial Era, Murkhana was an impoverished, polluted world crippled by Imperial sanctions and a ruined environment. The planet was also a crime haven that was dominated by smugglers and crime lords such as the Sugi Faazah. In 14 BBY, the insurgent leader Berch Teller stole Moff Wilhuff Tarkin's corvette Carrion Spike whilst the latter, along with Darth Vader, were investigating a communications cache in Murkhana City."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "Murkhana was a world in the Outer Rim Territories, near the edges of the Tion Cluster. It was inhabited by several different species including Koorivar, Aqualish, Gossams, Sugis, Gran, and Chagrians. Prior to the Clone Wars Murkhana was noted for its spectacular natural beauty; the planet's oceans, black beaches, sheltered coves, and particularly its coral reefs drew tourists from across the Cluster."}, {"tag": "p", "text": "As a result of years of orbital bombardment and beam weapon assaults during the Clone Wars, Murkhana's ecosystem collapsed; the planet's coastal coral reefs were killed off by rising sea temperatures, with its black beaches reduced to vast expanses of quicksand. Its sheltered coves degenerated into stagnant shallows inhabited by gelatinous sea creatures, which rose to the evolutionary fore following the extinction of the planet's fish. Acid rain damaged the planet's infrastructure and bleached the landscape, and left the sky perpetually overcast. While still breathable, the atmospheric toxicity was so strong that, by 14 BBY, beings were still encouraged to wear transpirators."}, {"tag": "h3", "text": "Murkhana City"}, {"tag": "p", "text": "One of Murkhana's major centers was Murkhana City, which had graceful, spiraling structures. The city hosted numerous structures including Argente Tower, a former Corporate Alliance landing field, and an abandoned Corporate Alliance medcenter. Due to the Clone Wars, much of Murkhana City lay in ruins and was littered with wrecked Separatist and Republic war droids, walkers, tanks, and starships. Due to sanctions, the local government had been unable to rebuild the economy and Murkhana City's substantially reduced population came to rely upon the black market for the most basic of goods."}, {"tag": "p", "text": "Murkhana City's streets were inhabited by famished animals, smugglers, and hoodlums. Due to the wartime pollution, many children were born with hideous birth defects. Many of the city's shops were closed with cantinas being some of the few functioning businesses. The Galactic Empire also maintained a compound in Murkhana City that included the residence of the Imperial ambassador. Due to the dangerous crime levels and hostility towards the Empire, the ambassador rarely ventured outside the Imperial compound without wearing stormtrooper armor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Prior to the Clone Wars, Murkhana's coral reefs and black beaches were popular with tourists from throughout the Tion Hegemony. The planet's population sided with the Confederacy of Independent Systems during the Clone Wars and its main center Murkhana City hosted a Corporate Alliance presence. During the war, the planet was used by Count Dooku to broadcast Separatist propaganda shadowfeeds on the HoloNet, prompting a series of Republic attacks led by Captain Wilhuff Tarkin which foiled Dooku's intentions."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Following the end of the Clone Wars, Murkhana was occupied by Imperial forces including the Twelfth Army. Immediately after the war, the planet was also the site of one of Darth Vader's very first missions for the Empire during which he affected the execution of, at the very least, a Black Sun racketeer. This enabled the Sugi crime lord Faazah to dominate the criminal underworld in Murkhana City."}, {"tag": "p", "text": "Due to Imperial sanctions, the planet's local government was unable to rebuild the economy. The Imperial ambassador to Murkhana regarded her posting as a hellish assignment due to the antipathy of the local population. She was blamed for every Imperial tax increase and every minor change to the legal system. The strong level of anti-Imperial sentiment manifested in the defacement of military recruitment posters and graffiti of hand-scrawled insults attacking the Emperor. Smugglers were respected by the local population since they were the only ones providing basic goods albeit at exorbitant rates. Crime lords also exerted influence by protecting the local population from thieves and murderers."}, {"tag": "p", "text": "In 14 BBY, the now-Moff Tarkin and Darth Vader visited Murkhana City to investigate the appearance of a communications cache at the former Corporate Alliance medcenter, which fueled rumors of a plot to disrupt the HoloNet. The communications cache had supposedly been discovered by the Koorivar Imperial asset Bracchia and his Imperial Security Bureau case officer Stellan. However, the cache had been deliberately planted by Vice Admiral Dodd Rancit, a rival of Tarkin and the Director of the Naval Intelligence Agency."}, {"tag": "p", "text": "Rancit was secretly conspiring with the disaffected former Republic Intelligence officer Berch Teller, who had become the leader of an insurgent group opposed to the Empire. While Vader and Tarkin were inspecting the communications cache, Teller and his followers stole Tarkin's stealth corvette Carrion Spike, which they used to launch a series of hit and run raids against the Empire. After commandeering Faazah's starship Parsec Predator, Tarkin and Vader pursued Teller and his followers offworld. Working together, Tarkin and Vader uncovered Rancit's treachery and snuffed out Teller's insurgency."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Murkhana first appeared in Star Wars canon in James Luceno's 2014 novel Tarkin. Before that, Murkhana appeared in Luceno's 2005 Star Wars Legends novel Dark Lord: The Rise of Darth Vader. Murkhana's inclusion in Tarkin was because it fit into a role that was part of the story Luceno was writing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}