{"url": "Musmuris_Reetgeet", "categories": ["Category:Canon articles", "Category:Alliance Military members", "Category:Males", "Category:New Republic Army personnel", "Category:Ranats"], "nodes": [{"tag": "h1", "text": "Musmuris Reetgeet"}, {"tag": "p", "text": "Musmuris Reetgeet was a Ranat male who served in the Alliance to Restore the Republic and later the New Republic during the Galactic Civil War. He participated in the climactic Battle of Jakku where Reetgeet and his squad were tasked by General Carlist Rieekan with infiltrating and capturing the Imperial Immobilizer 418 cruiser Glaciate."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Imperial Era, Musmuris Reetgeet joined the Rebel Alliance and its successor government, the New Republic. As a Ranat, Reetgeet encountered prejudice and was sidelined until the Battle of Jakku. Despite having not served aboard an Imperial starship, Reetgeet was picked as part of a squad that was assigned to capture the Immobilizer 418 cruiser Glaciate during the Battle of Jakku. His skill set was his ability to see through infrared and his sharp teeth that could chew through duracrete plate."}, {"tag": "p", "text": "His fellow squad members were former Imperial personnel. Reetgeet and his squad used a captured Imperial assault shuttle to board the Glaciate. They breached the hull and entered through the engine room. After fighting their way aboard the ship, the New Republic boarders reached a chamber and removed their space suits. Reetgeet then used his sharp sense of smell to crawl through the ship's systems while the others stood guard. Traveling through the vents, Reetgeet reached the reactor governor and wired in the New Republic's bypassed code, disabling the Glaciate. While his comrades contacted General Carlist Rieekan, Reetgeet savored victory while watching through the porthole and contemplated being promoted to captain."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Musmuris Reetgeet was a male Ranat. As a Ranat, he had small infrared eyes, large incisors, and sharp teeth. Reetgeet joined the Rebel Alliance and the New Republic but also encountered prejudice there and was sidelined until the Battle of Jakku. Reetgeet used his sharp sense of smell to make his way through the Immobilizer 418 cruiser Glaciate and disable the ship's reactor governor, allowing the New Republic to capture the vessel. Reetgeet had hopes of becoming a captain."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Musmuris Reetgeet was first mentioned in a short \"in-universe\" autobiographical passage in Daniel Wallace's 2017 reference book Star Wars: On the Front Lines."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}