{"url": "Mustafar_Sith_holocron", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Sith holocrons"], "nodes": [{"tag": "h1", "text": "Mustafar Sith holocron"}, {"tag": "p", "text": "The Mustafar Sith holocron was an old holocron found on the volcano world of Mustafar around 1.5 years after the Battle of Yavin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The holocron had been lost on Mustafar an unknown period of time before the Galactic Civil War. Some time after the Battle of Yavin, a mining droid came across the relic in the wilderness of Mustafar, but as these droids lacked interest in such things, the unit transferred the coordinates to the mainframe and moved on to continue with its work. Shortly thereafter, the mining droid malfunctioned and was not able to return for repairs."}, {"tag": "p", "text": "Sometime after this event, the protocol droid Q4P3 learned of the discovery when communicating with other droids of the Mensix Mining Facility. Q4P3 was in search of another relic, called the \"Codex,\" for his master Pann and was convinced that he had finally found the desired item. The protocol droid was not equipped to travel over the volcanic landscape, so he had to wait at the Mensix Mining Facility to find a helpful being. In 1.5 ABY, he met a well-armed spacer that agreed to travel to the droid wreck and recover the coordinates from the droid's memory banks. The obtained data led the spacer to the site of ancient ruins, where he dug out the relic from a pile of rubble. As soon as he held the holocron in his hands, he was encountered by several Trinity Assassins of the Force organization the Blackguard that guarded the relic."}, {"tag": "p", "text": "When the spacer returned to Q4P3, the droid studied the relic and confirmed that it was not the \"Codex\" he was searching for. While most of the stored data seemed to be corrupt, he was able to discern a fragment of the data: \"...was going according to plans until yesterday. The weakling Jedi has some sort of secret weapon and I can feel the effects of it already now. I can sense that our master knows what it is, but he has revealed nothing, only forced us to press on even harder...\""}, {"tag": "p", "text": "Q4P3 paid the spacer a handsome reward and let him keep the holocron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The holocron was a reward in Trials of Obi-Wan, the third add-on to Star Wars Galaxies prior to its closure on December 15, 2011. After finding the mining droid and recovering the holocron, the player had to fight several attacking Trinity Assassins and return to Q4P3. The holocron could be activated every 60 minutes and enhanced the combat capability of the player for a short time."}, {"tag": "h2", "text": "Appearances"}]}