{"url": "Mustafarian", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Insectoid sentient species", "Category:Mustafarians", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Mustafarian"}, {"tag": "p", "text": "Mustafarians were an insectoid sentient species native to the volcanic Outer Rim mining world of Mustafar of which there existed two distinct subspecies: the tall, thin Northern Mustafarians, and the short, stocky Southern Mustafarians."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "An insectoid sentient species, Mustafarians were noted to be hardy and well adapted to survive their homeworld of Mustafar's extreme temperatures. Both subspecies had distinct roles in society as well as differing physical attributes, with Northern Mustafarians being of a taller build and reaching heights of roughly 2.3 meters, while the shorter and stronger Southern Mustafarians often reached heights of 1.5 meters. Northerners had less resistance to high temperatures than their Southern brethren, whose tough skin could better resist heat. Both forms of Mustafarians had blaster-resistant skin, but they still needed armor to protect themselves while working around lava as it was very dangerous. Some Mustafarian clan leaders were known to be able to manipulate lava using the Force."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Mustafarians lived in underground caves created by Mustafar's native lava fleas as they ate through the planet's crust. Living mostly in underground buildings designed in the shape of kahel cave fungus, most of their species only ventured to the surface in order to mine the valuable minerals from the lava flows, or for a coming-of-age ritual in which a young Mustafarian must saddle up on a lava flea and leap over a raging lava stream without any protective clothing. Northern Mustafarians often became guards and expert lava flea riders, while Southern Mustafarians handled all heavy labor, although they could too ride lava fleas. Members of the Mustafarian species spoke an insectoid, buzzing language of the same name."}, {"tag": "p", "text": "Mustafarians often fashioned armor from the heat-resistant shells of lava fleas and wore breath masks while working near lava, which made them appear mysterious and uniform to outsiders. Floating on heat-shielded craft, many Southern Mustafarians on the surface wore this protective armor in order to scoop lava into giant cauldrons attached to metal rods, which could be carried away by DLC-13 mining droids."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic era"}, {"tag": "p", "text": "Although they evolved separate in underground caves on Mustafar, the Northern and Southern Mustafarians worked together to collect valuable minerals from their homeworld's lava flows and had a trade agreement with the Techno Union. As a result, some aligned themselves with the Confederacy of Independent Systems during the Clone Wars. Several Mustafarians present with the Separatist Council on Mustafar at the end of the war were slaughtered by Darth Vader during his mission to eliminate the Separatist Council, which had gone into hiding on Mustafar."}, {"tag": "h3", "text": "Defying the Empire"}, {"tag": "p", "text": "Years later Vader returned to Mustafar aboard a Naboo Royal Starship. A Mustafarian chieftain Kkkt spotted the ship plummet towards the surface and later sent a scout party to check it out. Comprising of four Mustafarians—Bbbl, Rrrn, Sssp, and one other—the party were attacked by Vader, who killed Bbbl and the other Mustafarian. He then used a haunted Sith mask to possess Sssp and Rrrn retreated back to Kkkt to tell him about what he saw."}, {"tag": "p", "text": "Shortly after, Vader and the Sith spirit possessing Sssp began building a structure to channel the dark side energies from a Sith cave. When the structure failed to channel it right, it became wrecked, and the two Sith started again. The attempts also affected the rest of Mustafar, causing lava storms to erupt on the clans. Kkkt came in contact with the rest of the clans and they planned to destroy this structure before it destroyed their homes. Kkkt led this newly formed army to attack the newly built fortress. They outnumbered the Imperial garrison ten to one, but Vader still slaughtered many of them. Kkkt and the other chiefs then used the Force to channel a lava flow and flood the battlefield. With the garrison wiped out, Vader retreated back to the fortress and Kkkt's remaining forces began trying to destroy it. Vader, however, channeled the Force through it and it obliterated the last of the Mustafarian army."}, {"tag": "p", "text": "Kkkt was not the last Mustafarian to attack the fortress, as Criakan led his own army to destroy it. As they entered, they overran the defending Lava Troopers and found Vader's aide Vaneé. Criakan threatened him, but Vaneé pointed out Vader standing behind the Mustafarians. Subsequently, Vader proceeded to kill the invaders. Priestess Sssl of Clan Rrrt also led an attack on the fortress, leading an army of plague-infected Mustafarians to infect troopers around the complex and break into it. Vader faced them and was bitten by one of the infected troopers. However, the bite had only been on his cybernetic-arm and Vader used the Force to take control of the infected Mustafarians, making them destroy Sssl and themselves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}