{"url": "Mutanda", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Empire planets", "Category:Low-gravity planets", "Category:Mutanda locations", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Wornal sector planets"], "nodes": [{"tag": "h1", "text": "Mutanda"}, {"tag": "p", "text": "Mutanda was a planet in the Killaniri system. The planet was a rolling land of grasslands, jungles, and natural wonders. In addition to the sentient Horansi, the world had many different species of big game animals, resulting in a booming legalized safari trade. Primarily, Mutanda was a planet for exotic hunting vacations and was easily accessible because of the spaceport on the satellite of Justa. However, the encroachments of poachers resulted in the extinction of many species of Mutandan wildlife."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mutanda was a planet in the Killaniri system. The planet was a rolling land of grasslands, jungles, and natural wonders. The sentient race, the Horansi, were actually divided into four distinct subspecies. In addition to the Horansi, the world had many different species of big game animals, resulting in a booming legalized safari trade. However, the encroachments of poachers resulted in the extinction of many species of Mutandan wildlife."}, {"tag": "p", "text": "Mutanda, like the Killaniri system, were part of the galactic community for hundreds of years. Primarily, Mutanda was a planet for exotic hunting vacations and was easily accessible because of the spaceport on the satellite of Justa."}, {"tag": "p", "text": "Mutanda was primarily a temperate plains planet, with wild, open grassland, dotted with copses of trees. The planet was generally warm and arid, with light gravity, few rains and a light but breathable atmosphere. The arid plains had few rains—primarily at the onset of the cooler winter season—and were often under drought conditions. The rare streams, rivers, and watering holes were areas of prime contention amongst rival Horansi tribes and wild animal herds. The mountain and forest regions saw much more rain, also primarily during winter, but they were still quite dry and water was a precious commodity."}, {"tag": "p", "text": "Many \"common\" species of the galaxy were also found on Mutanda. Several species grew to larger than typical sizes on this world, and invariably, all of the species were aggressive and dangerous."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Mutanda was comprised of three continents: Sess'inu, A'sako, and Cel'con. The Justa starport was a great subterranean complex, with surface-level docking facilities for up to fifty light freighters. Larger bulk transports were assigned orbits around the satellite. Jointly owned by BlasTech Corporation, Czerka Weapons, and Blethern Gas Industries, this was truly a corporate facility. All of the personnel were dependent upon the corporations and the prothium refining stations for their livelihood. Ships not owned by these corporations were charged exorbitant fees for the services the starport provided: approximately two hundred percent of standard costs."}, {"tag": "p", "text": "However, there was also a great deal of opportunity aboard the starport, which was a bustling trade city. The companies generally ignored illegal activities if they were handled with secrecy, and the station became a haven for mercenaries. Many Horansi came to the station and were hired out as scouts, or were very useful in opening up trade with Horansi tribes on the surface of Mutanda. A great deal of trade was also geared to the many hunting expeditions that came to Mutanda, since most of these tourists had a great deal of disposable income."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}