{"url": "Mutiny_on_the_Rand_Ecliptic/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Battles of Bestine", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mutiny on the Rand Ecliptic"}, {"tag": "p", "text": "The Mutiny on the Rand Ecliptic was an insurrection on board the Imperial II-class frigate the Rand Ecliptic in the Bestine system. The mutiny was incited by two cells on board the the ship, both trying to defect to the Rebel Alliance and operating independently of each other. One cell, led by First Mate Biggs Darklighter, sabotaged the frigate's systems before escaping in TIE/LN starfighters. In the resulting chaos, the ship's second mate, Derek Klivian led another cell in taking command of the bridge, discovering two more rebel cells in the process."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Two major figures in the mutiny, Derek \"Hobbie\" Klivian and Biggs Darklighter, were assigned to the Rand Ecliptic after their graduation from Prefsbelt Fleet Camp. In the academy, they had participated in a group of idealistic cadets idly dreaming about overthrowing the Empire. An informant sold out the other members of the group to the Academy Commander, but Darklighter and Klivian were not discovered, as they had not participated in the meeting in which the informant was present. Klivian and Darklighter never learned what happened to their friends, but the event cemented their anti-Imperial attitudes and led them to seriously contemplate defection to the Rebel Alliance. During their time in the academy, Darklighter and several classmates made contact with the Rebellion on a trip to the planet Bestine. Biding their time, the cadets played the part of loyal Imperials, loudly applauding a speech given to their graduating class by Grand Moff Wilhuff Tarkin. By the time of their graduation, Biggs and Hobbie's relationship had deteriorated, with Darklighter hoping to be stationed far from his former friend."}, {"tag": "p", "text": "Against Darklighter's hopes, he was assigned to be first mate on the same ship where Klivian was to be second mate, the Imperial II-class frigate Rand Ecliptic, under the command of Captain Heliesk. Serving dual roles as junior crewmen and TIE/LN starfighter pilots with the frigate's Twilight Squadron, the two both formed small rebel cells among the crew and made plans to defect to the Rebellion, each unknown to the other. In addition to the groups led by Darklighter and Klivian, there were two other rebel cells aboard the frigate that revealed themselves only after the mutiny had begun."}, {"tag": "p", "text": "During a routine sector patrol, the Rand Ecliptic met a frigate that failed to provide proper Imperial identification. Twilight Squadron, led by Darklighter, was deployed to engage the ship, and ordered to destroy the suspected Rebel vessel, or disable it so that the Ecliptic's crew could interrogate the passengers. Darklighter directed his TIE pilots to safely disable the frigate, which identified itself as the Lark, a vessel belonging to the Camblian Order of Eedoq ferrying younglings to the Clarion Scholars Academy on Daemen. Against Darklighter's orders, one of the pilots, Tars Nandy, fired a shot that destroyed the ship. Although Klivian witnessed Nandy's actions, Darklighter was unable to find the perpetrator, and Captain Heliesk dismissed the massacre, noting that it would save them days of interrogation. The apparent indifference from the Captain angered Darklighter, who invited his rebel friends, including Peate Kurin and Delund, to a secret meeting to plan their defection, unwilling to take part in another massacre."}, {"tag": "h2", "text": "The mutiny"}, {"tag": "p", "text": "While on his way to the meeting's concealed location, Darklighter encountered Klivian in a passageway. Suspicious of each other, Darklighter waited for Klivian to pass before opening the meeting room's access panel, while Klivian returned to investigate, eavesdropping on the rebel cell. Despite their distance from sanctuary and the limited life support capacity of their TIE fighters, their complicity in the destruction of the Lark pressed the rebels into action: they had just resolved to jump ship at the next opportunity when they noticed Klivian's shadow outside the hidden compartment. Unaware of the second mate's rebel sympathies, Darklighter's group seized Klivian, attempting to kill him before he could reveal his discovery.\nKlivian detonated a concussion grenade, giving him a chance to escape and beginning the mutiny on the Rand Ecliptic."}, {"tag": "p", "text": "As the effects of the grenade wore off, Darklighter and his friends sabotaged the frigate's systems, doing as much damage as they could to cover their escape in TIE fighters stolen from the hangar, heading galactic north to rendezvous. Meanwhile, taking advantage of Darklighter's disruption, Klivian led his cell in taking command of the Rand Ecliptic, discovering the frigate's other rebel cells and losing his left arm, among other injuries, in the process. The rebel mutineers allowed a group of Imperial loyalists in the crew to flee in the frigate's remaining TIE fighters, with the exception of Tars Nandy, who Klivian detained for his massacre of the Lark, and Captain Heliesk, who was extracted from his quarters for his knowledge of Imperial communications codes. In reality, Heliesk was a Rebel Alliance sympathizer and operative codenamed Starfire, but was unable to reveal his allegiance for fear of breaking his cover."}, {"tag": "p", "text": "Searching the Sululluub asteroid belt without success for a safe harbor, Darklighter and his companions, running out of air and fuel in their fighters, made the decision to return to the Rand Ecliptic and steal the supplies they needed. Surprised at the lack of resistance, the rebels discovered that the ship had changed allegiance during their absence. After learning about the events on board the Rand Ecliptic from acting-captain Klivian Darklighter declined to use his higher Imperial rank to take over the ship, saying that Klivian had earned the right to command the Rand Ecliptic until Rebel Alliance said otherwise, and that he was happy to continue to serve as the first mate."}, {"tag": "p", "text": "Some time after taking command of the frigate, the mutineers were pursued by a group of TIE fighters. With the assistance of Lindy, a friend of Klivian's stationed at Bestine, Darklighter offloaded the ship's cargo in their pursuers' path, destroying the starfighters and allowing the frigate to jump to hyperspace and escape to the Rebel Alliance."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After joining the Rebel Alliance and turning over the Rand Ecliptic, Klivian received cybernetic enhancements, including a prosthetic arm, to repair the injuries he had sustained during the mutiny. Stationed at the Rebel base on Yavin 4, a group of defectors including Darklighter, Klivian, Kurin, and Delund formed a starfighter unit called the Ecliptic Evaders. Rebel General Jan Dodonna used the Rand Ecliptic and the Evaders, flying their captured TIE fighters, to steal X-wing starfighters from an Incom Corporation assembly facility."}, {"tag": "p", "text": "The mutineers' actions would impact the career of their former tutor at the Prefsbelt Academy, Captain Soontir Fel. When two of his best students defected, ruined a group of TIE fighters along the way, and stole a brand new frigate, Fel fell to disgrace and was sent to the 181st Imperial Fighter Wing as a punishment."}, {"tag": "p", "text": "Later Klivian told a slightly altered version of the events to Luke Skywalker who was curious to hear stories about his late friend, Biggs Darklighter. Klivian claimed that he and Darklighter had worked together to stage the mutiny, with Captain Heliesk's covert support."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The short story Mutiny on the Rand Ecliptic by Michael Stern tells a different story about the mutiny than the one presented in the Star Wars: Empire story arc, Darklighter. Although neither version has been identified as more accurate, this article presents the events of the latter for the sake of clarity."}, {"tag": "p", "text": "According the short story's version of events, the mutiny was first suggested by Captain Heliesk to Klivian after a stop at the Imperial Navy Yard on Bestine to take possession of a consignment of rubindum ore, during which Klivian intended to defect to a local rebel cell along with Darklighter. As \"Starfire\", Heliesk was in fact the cell's Alliance contact, and in a ploy to deliver the rubindum to the Rebellion without blowing his cover,  arrived with a stormtrooper escort to \"arrest\" the cell's members, including Klivian's friend Lindy, and ordered Klivian and Darklighter to bring them aboard the Rand Ecliptic. Dropping the word \"Starfire\" into the conversation and a rank cylinder into Klivian's hand, the Captain met Darklighter and Klivian in private, and instructed the rebels to stage a mutiny to help him protect his status as a valuable spy for his influential station in the Empire and to deliver their cargo of ore to the Rebel Alliance."}, {"tag": "p", "text": "The mutineers threatened to activate the ship's self-destruct to force the Imperial crew to abandon ship, and with Lindy's rebels manning the bridge, took the Rand Ecliptic off planet. Although the Imperial Navy Yard launched its complement of TIE fighters in pursuit, Darklighter's dumping of half of the consignment of ore created a small-scale asteroid field in their path, allowing the frigate, its cargo, and its rebel crew to reach the Alliance without exposing Heliesk's involvement."}, {"tag": "p", "text": "A cut scene from A New Hope that was later used in the A New Hope radio dramatization, A New Hope novelization and Marvel Star Wars #1 established that Biggs joined the Rebellion after the capture of the Tantive IV at the beginning of Episode IV. However, in X-Wing: The Official Strategy Guide it is stated that Biggs participated in the Rebel Alliance's theft of the Death Star plans, which occured prior to the events on Tatooine. Years later, the comic story Star Wars: Empire: Darklighter revealed that Biggs had already joined the Rebellion, and kept the whole truth from Luke in an attempt to protect him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}