{"url": "Mutiny_on_the_Far_Orbit", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim", "Category:Events of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Mutiny on the Far Orbit"}, {"tag": "p", "text": "In 0 ABY, a mutiny occurred on the Imperial EF76 Nebulon-B escort frigate Far Orbit while the vessel was in the Outer Rim Territories of the galaxy. After months of planning, mutineers led by Commander Dhas Fenoep Vedij, the second-in-command of the frigate, seized the Far Orbit from Captain Vocis Kenit and his troopers after the mutineers overwhelmed the Imperial loyalists. Under Vedij, the Far Orbit then became a privateer frigate for the Alliance to Restore the Republic shortly after the Imperial loyalists were kicked off the ship via escape pods and the Far Orbit's shuttles."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the year 0 ABY, during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, the Imperial Navy's EF76 Nebulon-B escort frigate Far Orbit was under the helm of Captain Vocis Kenit, with his second-in-command being Commander Dhas Fenoep Vedij. However, Kenit was not particularly liked by the crew of the Far Orbit, as he was a bully and martinet in personality, and maintained discipline with the ship's security, which consisted of a platoon of stormtroopers and a platoon of Imperial Navy troopers. Vedij, who also disliked Kenit, began planning the start of a mutiny after his brother, Elon Vedij, was transferred to the Far Orbit, making the pair suspect that the two of them would soon be disposed of by the Empire. That was because their parents had been killed two days prior to Elon Vedij's transfer to the frigate in an accident that Dhas Vedij believed was designed to silence his father, who was a vocal opponent of the Empire. Vedij then continued to plan and plot for months."}, {"tag": "p", "text": "Around that time, the Far Orbit was tracking a group of pirates known as the Silent Blades in the Outer Rim Territories for several weeks and finally managed to corner them in an asteroid belt. In an attempt to break the standoff that followed, Kenit had the Far Orbit's TIE Series starfighter complement attack the pirates in the asteroid belt, which ended with an Imperial victory but resulted in the loss of all the Imperial pilots and their fighters, including Elon Vedij. After the death of his brother, Dhas Vedij gained the trust and support of the crew for the mutiny and convinced most of the Imperial Navy troopers to either help with the mutiny or stay in their quarters during. Following news of the Empire's destruction of the planet Alderaan reaching the Far Orbit, an Alderaanian shiphand was beaten by Kenit's men for suspected treason. Vedij circulated a rumor that the shiphand was being beaten for being Alderaanian and used the outrage and the men's support of the Commander to start the mutiny."}, {"tag": "h2", "text": "The mutiny"}, {"tag": "p", "text": "As the mutiny commenced, the Imperial stormtroopers were trapped by security bulkheads after being distracted by a false report of a riot. The Far Orbit's lone COMPNOR Observation officer was overcome, and, after Vedij announced the mutiny, around two-thirds of the entire crew joined him in the effort. Those who did not join him did not resist and were put with the captured stormtroopers. The mutiny then ended with the Far Orbit being controlled by Vedij and his forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once the Far Orbit was secure, Vedij and some of his men personally escorted Kenit and seven of the Captain's loyalists to the ship's escape pods at blasterpoint. Following the threats Kenit directed at Vedij, which revolved around Vedij being tortured and punished, Kenit and the seven others were put off the ship in escape pods. Likewise, the rest of Kenit's loyalists and stormtroopers were ejected in escape pods or in some of the frigate's shuttles. Vedij then informed the crew via the ship's comm unit that Kenit had been expelled from the ship, and that the Far Orbit would be traveling to the Core Worlds, as most people who participated in a mutiny tended to go toward the Outer Rim instead. Imperial forces later picked up Kenit's escape pod, and he was punished for failing in his command of the Far Orbit."}, {"tag": "p", "text": "Half of the Far Orbit's remaining crew decided to jump ship rather than stay aboard, leaving the frigate crewed with just enough people to keep it running under the command of Vedij, who took the title of captain. After the mutiny, the Far Orbit had six months of remaining supplies and two remaining shuttles, though all the escape pods were jettisoned to put off the Imperials. The ship went on to become a privateer frigate for the Rebel Alliance and seized a convoy of freighters, Shipment 1037, starting a string of successes for the Far Orbit as it continued as a privateering vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mutiny was first mentioned in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games's Star Wars: The Roleplaying Game and had the same theme of the previous publication Pirates & Privateers, as it followed the privateering vessel Far Orbit. The mutiny starts off the story of the playable campaign."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}