{"url": "Muun/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Enslaved species", "Category:Mammalian sentient species", "Category:Muuns", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Muun"}, {"tag": "p", "text": "Muuns were a thin, tall humanoid species from the frozen world of Scipio, though they also had a large colony on the mineral-rich planet of Muunilinst. The founders of the InterGalactic Banking Clan, the largest banking organization in the galaxy, Muuns were known throughout the galaxy for their excellent financial and mathematical skills. Seeking economic stability, the Galactic Empire exempted Muuns from their wide-spread non-Human persecution, in order to utilize Muuns and their economic finesse."}, {"tag": "h2", "text": "Biology, appearance, and traits"}, {"tag": "p", "text": "Muuns were tall and gaunt humanoids with thin bodies and elongated heads with hairless craniums. They also had pasty-white/pale pink to grey skin, most likely because the vast majority of the species did not like traveling, even on-planet, and usually stayed indoors. Muuns also had tiny ears in the middle of the sides of their heads. In addition, they had flat noses and slim mouths. Muun voices often sound nasal due to their small noses. Muuns had long arms and legs, making them appear very gaunt. They also had very thin waists and long, thin fingers. Members of the species also had three hearts, one normal heart and two that were consciously controlled, a trait often used to increase blood flow in low temperatures. This also may have contributed to a longer life-span."}, {"tag": "p", "text": "Muuns were extremely intelligent, and both greedy and cautious when it came to business ventures. They were lured to profitable and vulnerable economic situations or opportunities, yet took long thought before committing themselves to a business deal. Muuns' talent with money stemmed from their extremely valuable mathematical and statistical skills. Muun children were known to calculate complex mathematical formulas as quickly as most adults of other species could. In addition to being greedy and cautious, Muuns also deemed themselves to be a reserved, mature species, capable of controlling their emotions, and deemed other species as immature, and felt no remorse in exploiting them, if need required them to do so. Muuns possessed a drive to compete with other races and even among themselves, which also contributed to higher rates of economic output anywhere Muuns were located. Muuns also had a fundamental respect for fairness and justice, however, and regarded a contract as almost a sacred trust. Muuns were known to always follow the letter of the law, though often not the spirit."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Muuns believed in tradition and established a culture based on merit and intelligence. A class-hierarchy developed around this worldview, valuing financiers, lawyers, engineers, and diplomats as the highest levels of society. Commoners rarely left the surface of their planet as upward mobility was limited, reserved for only the most gifted of children who passed rigorous examinations."}, {"tag": "p", "text": "Muun culture, indeed, Muun life, revolved around economy and finance. Intense competition among co-workers encouraged economic growth, increased production, and superior work ethic. Since Muuns tended to shy away from fighting and physical pursuits, Muun society used alternative means for their planet's protection, using their vast financial resources to purchase massive floating defense platforms to defend their planet from attack. The InterGalactic Banking Clan (IGBC), a largely Muun-run organization, was known to utilize hired mercenaries to enforce their policies and collect payments and debts."}, {"tag": "p", "text": "Muun reliance on mathematics leaked over into their language, which was a collection of um and eh sounds of varying pitch, similar in some ways to Binary."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Early in their history, the Muuns founded the InterGalactic Banking Clan, which came to span not only the galaxy, but smaller satellite galaxies as well. While Muuns originated on Scipio, they colonized the planet Muunilinst early in the IBC's history and made it a major hub of activity. Because of its immense mineral wealth, Muunilinst was used to give weight to the Galactic credit, making its importance in galactic society almost incomparable to many, if not most Core Worlds."}, {"tag": "p", "text": "Throughout the time of the Galactic Republic, Muuns had a knack for funding potentially profitable enterprises throughout its sector, regardless of ethics or loyalty. Muunilinst provided much of the funding for the nearby Human colony world of Sartinaynian, which, ironically, broke away from the Republic because of anti-alien sentiments. The banking clans of Muunilinst were uninterested in these prejudices. They funded colonies, trade guilds, and corporations all along the Braxant Run. At some point in their history the Muuns also colonized the planet of Mygeeto, which, much like Muunilinst itself, would become wealthy as an important financial center."}, {"tag": "p", "text": "Eventually, both Muunilinst and Sartinaynian came to be member worlds in the Republic, and Muunilinst became one of the greatest financial powers in the galaxy. The power and influence of the Banking Clan was largely unchecked as the Republic fell into decline and corruption, and with the looming threat of the breakdown of law and order, the IGBC invested in thousands of Hailfire droids to discourage customers from defaulting on their loans."}, {"tag": "p", "text": "Prior to the Clone Wars, IGBC Chairman San Hill was approached by the leader of the Separatist movement, Count Dooku. San Hill helped finance the Confederacy of Independent Systems, believing it very plausible that the Confederacy could conquer the Republic. San Hill also used secret Banking Clan codes used for transferring bank statements and depositing money to clients to establish the Shadowfeed Network, a secret Confederate analogue to the HoloNet, used to distribute propaganda to the galaxy. It was also used as a means to allow Confederate leaders to transmit untraceable and untappable messages to their subordinates, making the Banking Clan an invaluable member of the Confederacy."}, {"tag": "p", "text": "Consistent with its reputation for playing both sides against the middle, Muunilinst simultaneously backed the Republic and the Confederacy during the Clone Wars. Alliances with the Confederacy, however, led to Separatist forces building droid factories and munitions depots on Muunilinst, over the objections of the native Muuns. Despite its economic importance, the Republic was left with no other option than to invade Muunilinst and destroy the Confederate strongholds. This led to a series of ruinous battles."}, {"tag": "p", "text": "During the Battle of Muunilinst in 22 BBY, Obi-Wan Kenobi, Anakin Skywalker, and Voolvif Monn retook the planet for the Republic, but at great cost. The battle devastated the Muun cities, sparing none, and led the galaxy to the brink of financial ruin."}, {"tag": "p", "text": "Muunilinst later became the financial center of the Galactic Empire. Emperor Palpatine harbored no fondness for non-Humans, but the mineral riches of Muunilinst were too important for the stability of Imperial credit and he even had a Sith Master that was a Muun, the last non-Human to rule the Sith Order before the Republic was dissolved. Muuns' lending and business operations were hampered by harsh Imperial decrees and the presence of Imperial monitors stationed throughout the world's financial institutions. Muunilinst was no more loyal to the Empire than it was to the Republic or Confederacy, but found it expedient not to undermine Imperial power, reasoning that, no matter the outcome of the Galactic Civil War, the victor would be forced to keep doing business with the Muuns and the IGBC. It remained part of the Imperial Remnant during the New Republic years, protected by two Golan III battle platforms. Amazingly, but again consistent with their reputation, even while a part of the Imperial Remnant, Muunilinst still became the guarantor of the New Republic credit. This infuriated the Moffs, but they were powerless to move against the IGBC without destabilizing the Imperial credit."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the alien intruders attacked the Imperial Remnant. In a coordinated strike, the Yuuzhan Vong decimated the forces protecting Muunilinst. The planet itself was bombarded from orbit, reducing it to a wasteland from which the Yuuzhan Vong plucked any survivors for use as slave labor. By 40 ABY, Muunilinst had recovered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of San Hill was created for the movie Star Wars: Episode II Attack of the Clones, released in May 2002, as the leader of the InterGalactic Banking Clan. His name first appeared in a February 2002 article on the HoloNet News website, and a picture of both him and Vo Lapeet appeared in another HoloNet News article one month later. That article also established that the Banking Clan was headquartered on Muunilinst, a planet that had been introduced in Timothy Zahn's 1997 novel Specter of the Past as a financial world. San Hill's species was not named in Episode II, its novelization, nor in much of the movie's supplementary reference books, and instead was first established in Galactic Power Brokers, an article featured in the tenth issue of Star Wars Gamer magazine (May 2002)."}, {"tag": "p", "text": "Two previous Expanded Universe works contain characters who could easily be retconned as Muuns. The first, the animated segment of The Star Wars Holiday Special, contains two unnamed characters on Panna who look like Muuns. When asked, Leland Chee specifically stated that the two aliens may be Muuns. Another possible Muun is Lord Graemon, an Imperial-allied banker who is described as \"a lean man wearing the traditional Muunilinsti banker's shawl and pendant\" in Star Wars: The Hand of Thrawn Duology."}, {"tag": "p", "text": "In Star Wars: Empire at War: Forces of Corruption, Muuns are incorrectly depicted as being identical to Humans in loading screens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}