{"url": "Muunilinst_10_LAAT", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Low Altitude Assault Transports"], "nodes": [{"tag": "h1", "text": "Muunilinst 10 LAAT"}, {"tag": "p", "text": "This Low Altitude Assault Transport was used by The Muunilinst 10 during their mission to Hypori. It was heavily modified and sported a unique paint job."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The ship's most striking feature was its paint job. A glaring rancor's mouth was painted on the nose, just below the cockpit and covering the frontal turrets. The spine and wings were painted blue, as were the missile pods with the exception of some panels. A pattern of jagged blue isosceles triangles extended from the spine down the sides of the fuselage, and a similar pattern of white triangles was present on the back edge of the wings."}, {"tag": "p", "text": "The gunship was also heavily altered from a standard LAAT/i, with features such as a modified cockpit, a bomb bay, and jamming signal technology. The side-mounted composite-beam laser bubble turrets were removed, and it is possible that the wing-mounted turrets were as well, since they did not fire when the gunship engaged the droid army or General Grievous. A long, narrow barrel similar to those of the laser cannons was added to the front of the mass-driver missile launchers, giving them an appearance similar to the ventral weapons on the Republic Troop Transport."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Muunilinst 10 was sent to Hypori to rescue the survivors from the encounter with General Grievous. Their gunship, flying at just under two meters, was able to sneak past hundreds of droids, and drop remote control detonators before they took notice. After dropping off Captain Fordo and his team, the gunship rose to a vantage point and began firing at the super battle droids that had begun to charge their location."}, {"tag": "p", "text": "Shortly after this, Fordo called for backup. The pilot of the LAAT immediately broke off and flew to the Muunilinst 10's position, where the ARC Troopers had encountered General Grievous and were losing ground fast. The gunship opened fire on the droid general with both its anti-personnel laser turrets and mass-driver missile launchers."}, {"tag": "p", "text": "Grievous evaded the entire barrage of fire, retreating to a safe distance from the gunship. The ARC Troopers then successfully rescued the Jedi Masters Ki-Adi-Mundi, Aayla Secura and Shaak Ti, loading them and the remaining troopers onto the gunship and taking off, detonating the previously dropped charges to clear their escape route."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rancor pattern on the nose of the ship is a reference to real-life fighter planes with similar paint schemes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}