{"url": "Mygeeto_Campaign", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Battles in the Outer Rim", "Category:Battles of the Great Jedi Purge", "Category:Battles of the Outer Rim Sieges", "Category:Clone Wars campaigns"], "nodes": [{"tag": "h1", "text": "Mygeeto Campaign"}, {"tag": "p", "text": "The Mygeeto Campaign, also known as the assault on Mygeeto, was a three-year campaign of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. It consisted of several battles, including the Third Battle of Mygeeto and the Fourth Battle of Mygeeto, the latter of which took place during the Outer Rim Sieges. Jedi General Ki-Adi-Mundi and the 21st Nova Corps were deployed to Mygeeto to capture it from the Separatists during the campaign. However, during the campaign, Mundi was executed by his clone troopers under Order 66."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The campaign to take Mygeeto was fought for three standard years. During the Third Battle of Mygeeto, Jedi General Depa Billaba and her battalion fought against General Grievous and his forces. While Grievous managed to escape, the Republic was victorious and Colonel Coburn Sear was killed. However, mere months later, a Fourth Battle of Mygeeto began. During this battle, Jedi General Ki-Adi-Mundi led the 21st Nova Corps against the Separatist Droid Army. However, during the battle, Supreme Chancellor Palpatine issued Order 66, which compelled all of the Grand Army of the Republic's clone troopers to turn on and execute their Jedi commanding officers via secret control chips implanted in their brains. Mundi attempted to rally his troopers on a bridge spanning a chasm between two city blocks, with enemy droids destroying several tanks, but his troops had been given their new directive."}, {"tag": "p", "text": "The troopers complied, and moments later the clones near Mundi stopped charging. Confused, Mundi turned around and was blasted by his troopers' fire. The surprised Jedi Master managed to kill three Marines by deflecting their fire before succumbing to his troops' shots. Prior to Order 66, Jedi General Jaro Tapal's 13th Battalion was ordered to Mygeeto, but the Chancellor's order ultimately meant they never arrived, as the battalion was killed after a skirmish aboard Tapal's flagship, the Albedo Brave, which ended with the warship's destruction and the escape of a mortally-wounded Tapal and his Padawan, Cal Kestis, in an escape pod to Bracca."}, {"tag": "p", "text": "After killing Mundi, Clone Commander CC-1138 \"Bacara\" and the Nova Corps continued fighting to take out Mygeeto's final Separatist positions. The Clone Wars formally ended less than a day after Order 66 was issued when Chancellor Palpatine, truly the Dark Lord of the Sith Darth Sidious, sent his new apprentice, Darth Vader, to Mustafar to kill the Separatist Council and shut down the Separatist Droid Army. At the same time, Palpatine formally proclaimed the transformation of the Republic into the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}