{"url": "Myhr_Rho", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Business owners and executives", "Category:Cathar", "Category:Males", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Myhr Rho"}, {"tag": "p", "text": "Myhr Rho was a tour guide who ran the \"Skywalker Tour\" in the wake of the Battle of Endor. A member of the Cathar species, he was born on the planet of the same name, but was raised on the arid Outer Rim Territories world of Tatooine. Rho hated the planet, and he was unable to find honest work in Mos Eisley. During the early years of the Galactic Civil War, he spent most of his time in Chalmun's Cantina, drinking away his worries."}, {"tag": "p", "text": "When the Alliance to Restore the Republic won the Battle of Endor in 4 ABY and Emperor Palpatine died, Rho joined in the city-wide celebration in Mos Eisley. He later learned that Luke Skywalker, a hero of the Alliance, had originally hailed from Tatooine; inspired by the plays performed at the cantina by Cebann Veekan and Ackmena, Rho decided to start the \"Skywalker Tour.\" Rho's tour took visitors to pivotal locations in Skywalker's life, such as the Lars homestead and the Great Pit of Carkoon. This venture was short-lived, however, as Rho encountered difficulties from B'omarr Monks and Tusken Raiders."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and lack of career"}, {"tag": "p", "text": "Born on Cathar but raised on the Outer Rim Territories world of Tatooine, Myhr Rho had aspired to own and run a successful business since he was a cub. However, the remoteness of Tatooine made it difficult for him to find employment. Most of the operations conducted on Tatooine were of an illegal nature, and Rho sought to avoid such avenues as much as possible. He had always hated his adopted homeworld; the heat of the planet's twin suns, Tatoo I and Tatoo II, forced him to cut his Cathar mane short so that he would not overheat. Additionally, Rho found the light on the planet uncomfortable, as Cathar were naturally nocturnal."}, {"tag": "p", "text": "Rho tried to save money for passage off Tatooine, but he continued to spend the accumulated funds on temporary comforts. Eventually, he began spending most of his time in Chalmun's Cantina, in Mos Eisley. In 0 ABY, Rho was present in the cantina when a meeting between the patron Krelman and bartender Ackmena was broadcast to other systems. During the broadcast, the cantina's wallscreen displayed a message from an Imperial officer, announcing a curfew due to recent spy activity. The curfew forced all present, Rho included, to depart the cantina and return home, but Rho and his fellow patrons refused to leave. Ackmena attempted to get her customers to return to their homes, but they would not cooperate. Rho and the other patrons began vehemently protesting, prompting Ackmena to offer a free round of drinks on the house. The bartender then began singing; during her routine, Rho lurched toward her, attempting to embrace her. In response, Ackmena placed Rho in the custody of the bouncer, Tork, who ejected the unruly Cathar from the establishment."}, {"tag": "p", "text": "In 4 ABY, news of Emperor Palpatine's first death at the Battle of Endor reached Mos Eisley, changing Rho's outlook to a more optimistic one. Celebrations in Mos Eisley continued for weeks after the battle, and Rho began thinking of ways in which he could take advantage of the new level of freedom the denizens of the galaxy were presented under the New Republic."}, {"tag": "h3", "text": "The Skywalker Tour"}, {"tag": "p", "text": "Much to his surprise, Rho learned that Luke Skywalker, a prominent figure in the Rebel Alliance, and often heralded as a hero, had originally hailed from Tatooine. At Chalmun's Cantina, Rho was inspired by the plays performed by actor Cebann Veekan and Ackmena based on the exploits of Skywalker, and the Cathar decided to put all of his resources into researching the Alliance hero, particularly his life on Tatooine. Realizing that he could turn a profit from his research, he deduced that once the adventures of Luke Skywalker became more widely known, people would become curious about what he had done while on Tatooine. With what little money he had left, Rho purchased a sail barge and started what he called the \"Skywalker Tour.\""}, {"tag": "p", "text": "The tour entailed trips to key places in Skywalker's life on Tatooine, specifically: the location where C-3PO and R2-D2's Tantive IV escape pod crashed in 0 BBY, the Lars homestead, and Ben Kenobi's hut, which the Cathar had restored. Rho eventually added Jabba's Palace and the Great Pit of Carkoon to the itinerary. In Jabba's Palace, Rho hung a replica of the carbonite block that had held Han Solo in 4 ABY. The tour, which ran daily, was initially a great success for Rho, and he eventually came to believe that Tatooine wasn't as bad as he had originally thought. However, Rho soon ran into trouble from both the B'omarr Monks that occupied Jabba's Palace, who resented his tour's intrusion into their contemplative silence, and Tusken Raiders that reacted violently to his excursions near Kenobi's hut. These complications combined to have Rho end the Skywalker Tour."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Myhr Rho, an enterprising and charming man, always aspired to reach loftier heights than the ones given to him as a cub, although his home planet of Tatooine provided scant opportunity for enterprise. He did not want to be involved with anything remotely violent or dangerous, but unfortunately for Rho, most of the jobs on Tatooine involved both. In the wake of the Battle of Endor, however, Rho's enterprising came to the fore, and he took advantage of Luke Skywalker's fame, until complications led to the canceling of his enterprise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of \"Myhr\" was first mentioned in the first volume of the Star Wars Technical Journal, published in 1993. The character was described as an \"enterprising, catlike fellow\" and was identified as the owner of the \"Skywalker Tour.\" Myhr would go unused in canon for thirteen years, until 2006, when Benjamin Christopher Norton Dawe retroactively consolidated him with a character from The Star Wars Holiday Special through the StarWars.com Hyperspace feature, \"What's The Story?\""}, {"tag": "p", "text": "The Holiday Special character had originally been dubbed \"Lion Man\" during the production of the show. While most actors playing aliens in the show had been wearing flexible masks, both the actor playing \"Lion Man\" and the one playing \"Baboon Man\" (later identified as Cebann Veekan) had to wear heavy makeup, which had been designed by Rick Baker. The actor underwent a lengthy, two-hour-long process of having the makeup applied, and suffered from the heat of the lighting on the 24-hour-long shoot of the show's \"Cantina scene.\" The \"Lion Man\" also appeared sporadically and randomly in the non-canon game Star Wars: Yoda Stories. In 2006, the \"Lion Man\" was used in the \"What's the Story?\" feature, and Dawe, noting the character's catlike appearance, remembered Myhr from the Technical Journal."}, {"tag": "p", "text": "Giving the character the surname of \"Rho,\" Dawe applied Myhr's name and story to the \"Lion Man,\" effectively consolidating the two characters. He originally identified Rho as a member of a completely new catlike species, but in the editorial process, StarWars.com staff changed the new species to the established one of Cathar, from 1994's Star Wars: Tales of the Jedi - Dark Lords of the Sith. StarWars.com staff also added a reference to the character of Cebann Veekan, who had been simultaneously developed through the \"What's the Story?\" program."}, {"tag": "p", "text": "Following these developments, Rho was also mentioned in Star Wars: The Official Starships & Vehicles Collection 26, published by DeAgostini."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}