{"url": "Mynock", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Ergovorous creatures", "Category:Food creatures", "Category:Non-sentient species", "Category:Space-borne creatures", "Category:Twi'lek food"], "nodes": [{"tag": "h1", "text": "Mynock"}, {"tag": "p", "text": "Mynocks were a bat-like parasitic species that hailed from the world of Ord Mynock. Even so, they also thrived in asteroids and could survive in realspace, with some even living within Exogorths. For sustenance, they could eat the energy supply of starships."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A species of silicon-based bat-like parasites native to the planet Ord Mynock, Mynocks chewed on the power cables and energy conductors of starships, and could drain a ship's entire power supply. Some said that mynocks could feed on so much energy that they became \"spark-drunk\". They reproduced by splitting in two and growing new creatures from each half. Mynocks were capable of surviving in the atmospheres of planets and the vacuum of space, though only a few varieties lived on planets. They were also known to inhabit asteroid fields, thriving on asteroids, and the gullets of exogorths, where they shared in its meals and were part of its internal ecosystem. Mynocks were remotely related to Grallocs and Tibidees, large flying creatures native to Stygeon Prime who were also a nuisance to starpilots."}, {"tag": "h2", "text": "Mynocks in the galaxy"}, {"tag": "h3", "text": "As a food"}, {"tag": "p", "text": "When seasoned properly, mynocks were able to be consumed by carbon-based lifeforms. Mynock roasts were known to occur on Ardennia. Mynock Cloud City and Mynock Coronet City were spicy dishes made from mynock that were popular with Twi'leks. Some hunted mynocks to supply space stations and colonists with regular meat rations. Oga Garra's staff at her cantina kept pickled mynock on hand to use as an ingredient in drinks."}, {"tag": "h3", "text": "As a term"}, {"tag": "p", "text": "Soresu, the third style of lightsaber combat, was also known as the Way of the Mynock."}, {"tag": "p", "text": "The saying \"We're sitting mynocks\" was used during the assault on Seelos by Ezra Bridger when he, members of the Spectres, and three clone trooper veterans, Rex, Wolffe, and Gregor, were under attack by a TIE fighter on an old Clone Wars era All Terrain Tactical Enforcer."}, {"tag": "p", "text": "The proper term of venery in Galactic Basic Standard for mynocks was a scold of mynocks."}, {"tag": "h3", "text": "Encounters with mynocks"}, {"tag": "p", "text": "At one point during the Galactic Civil War, Commander Tylux of the Imperial-class Star Destroyer Bellicose led his ship on a chase to capture a spy of the Alliance to Restore the Republic in order to not fail the Sith Lord Darth Vader, eventually commanding the Bellicose to pursue the Rebel ship into an Exogorth that lived in an asteroid field. The Star Destroyer rammed through the space creature, with a number of mynocks that lived inside it taking the opportunity to latch on and feast off the Bellicose. Damage caused by the mynocks and asteroids cost the destroyer its tractor beam, shielding, and brought damage to the ship's hull. Thus, one of Tylux's Imperial officers suspected the rebel had led them into a trap, although the spy had actually been surpirsed by the Star Destroyer's action. The mynocks continued their feast as five Rebel starships arrived to reinforce the spy, firing upon the Bellicose as the crew abandoned the destroyer."}, {"tag": "p", "text": "In 3 ABY, a short time after the Battle of Hoth, the crew of the Millennium Falcon attempted to hide from Vader's personal starfleet in the Hoth asteroid belt, landing in what they assumed to be a cave. In reality, they landed in the gullet of an Exogorth named Sy-O. Unlike other Exogorths, Sy-O loved mynocks and welcomed them into their internal ecosystem. After several mynocks attacked and Captain Han Solo realized what they were standing in, the Falcon and its crew escaped Sy-O."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mynocks first appeared in Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}