{"url": "Myo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Abyssins", "Category:Galactic Outdoor Survival School instructors", "Category:Males", "Category:Scouts"], "nodes": [{"tag": "h1", "text": "Myo"}, {"tag": "p", "text": "Myo was a vicious Abyssin scout who was a native of the desert planet Byss in the Outer Rim Territories. As a youth, he proved himself to be a fearless warrior, surviving three tribal Bloodings on his homeworld. He lived most of his life in isolation from his fellow Abyssin after being captured by a Rodian slaver named Malak and taken off-world. Myo was able to escape his captor while her starship was refueling at Kinun Depot, however, and eventually befriended the Bith musician Lirin Car'n, who provided him with passage to the arid world of Tatooine."}, {"tag": "p", "text": "Myo became a regular patron of Chalmun's Cantina, becoming fast friends with many of his fellow drinkers, including Car'n, Lak Sivrak, and Dorlar. Dorlar eventually offered Myo a position working for the Galactic Outdoor Survival School, and the Abyssin served as a desert instructor for at least two years during the Galactic Civil War. Like all Abyssin, Myo possessed amazing regenerative abilities, which aided him greatly when living in barren conditions, as well as in brawls."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Myo was a hulking, cyclopean Abyssin from the Outer Rim Territories world of Byss. Byss was a barren, desert planet, and the various Abyssin tribes fought over the scarce amounts of water in skirmishes called Bloodings. In each Blooding, opposing tribes would fight with each other at an oasis until one tribe had no one left standing; at that point, the victors were awarded the right to consume the water. Casualties were extremely high, so few survived more than a handful of Bloodings in their life. From a young age, Myo proved himself to be a particularly vicious, fearless, and ill-tempered combatant, even among his fellow Abyssin, and while still an adolescent, he participated in no less than three separate Bloodings, emerging on the victorious side in each of them."}, {"tag": "p", "text": "Myo loved the deserts of his homeworld, so he was angered when a small time slaver named Malak captured him and took him off-world. Malak, a female Rodian, specialized in the capture and sale of primitive and exotic species and had a penchant for leading violent raids against unsuspecting communities, like those on Byss. Longing to return to the desert, Myo eventually escaped Malak's clutches around 1 BBY, freeing himself from her ship while it was refueling at Kinun Depot. He chanced upon a Bith musician named Lirin Car'n, who acted as a backup kloo horn player in a popular musical act named Figrin D'an and the Modal Nodes. The two became fast friends and when Car'n offered Myo passage to Tatooine—a world not unlike his homeworld—the Abyssin could not pass up the opportunity to return to desert terrain."}, {"tag": "h3", "text": "Survival expert"}, {"tag": "p", "text": "Myo was able to indulge his violent tendencies again on Tatooine, and he embroiled himself in many fights. His natural regenerative abilities allowed him to shrug off otherwise grievous injuries, though they also helped mold him into a desert survival expert. Myo became a mercenary, as well as an associate of Lirin Car'n, and often frequented the Mos Eisley cantina with the Bith; with Myo being something of an alcoholic, spirits were the fastest way to win the Abyssin's friendship. Myo also befriended a Shistavanen named Lak Sivrak, another being who frequented the Mos Eisley cantina. In 0 BBY, Myo and Car'n witnessed a Jedi Master named Obi-Wan Kenobi attack another of the tavern's patrons, the Aqualish Ponda Baba, with a lightsaber, though the spectacle only held Myo and his fellow drinkers' attention for a moment."}, {"tag": "p", "text": "Several weeks later, Myo encountered a friendly Brubb named Dorlar who served as an instructor in the Galactic Outdoor Survival School—GOSS. Myo took a shining to Dorlar, who was more than willing to provide him with a large amount of alcohol and other amenities, and eventually the Brubb offered him a position working as an instructor for GOSS; the organization had lost a desert assistant and had no one to fill his position for the coming term. Knowing that slavers were still looking to recapture him, Myo agreed and accompanied Dorlar to the planet Thrantin. Myo worked almost exclusively in desert zones, becoming one of GOSS's most trusted staff members after two years in their employ."}, {"tag": "p", "text": "The leader of the Galactic Outdoor Survival School, Barosa Warren, was firmly opposed to the Alliance to Restore the Republic, although Myo, like many other GOSS staff members, cared little for politics and simply followed whatever orders he was given. Lak Sivrak, Myo's old friend from Mos Eisley, was in fact a prominent scout for the Alliance, and he believed that Myo would make a good recruit for the Rebellion if the Abyssin could be kept away from Warren for long enough."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Myo was known for his violent, primitive nature, and he had a reputation as one of the best combatants on Tatooine. He had a very short temper, and any perceived insults against him were punished promptly and severely; if someone even muttered the term monoc in his presence, he would start a fight with them. He was even known to take others' lives for poking fun at his eye. Because of his desert upbringing and his regenerative abilities, Myo was able to survive in barren, waterless areas for a long period of time, eventually becoming a well trained, expert survivalist. However, Myo did have another, friendlier side to him, and he often socialized with other patrons of Chalmun's cantina. Myo's personality differed slightly from his fellow Abyssin, as he lived most of his life in isolation from members of his species, who had a strong sense of community."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An unnamed cyclopean creature appeared in Star Wars: Episode IV A New Hope in 1977, who was initially to be called \"Cyceyed\" in 1978. That name, however, was lost to time, and the Star Wars Customizable Card Game established that the character was actually Myo, an Abyssin who debuted in a West End Games sourcebook titled Alliance Intelligence Reports. Alliance Intelligence Reports established Myo's backstory as a mercenary and survival expert. In A New Hope, Myo was portrayed by uncredited creature designer Phil Tippett, who was reported to be scrawny in comparison to Myo. Tippett wore a slip-on mask designed by Laine Liska, which had limited mouth and eye articulation. The mask was also used in The Star Wars Holiday Special."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}