{"url": "Myostim_unit", "categories": ["Category:Legends articles", "Category:Medical tools"], "nodes": [{"tag": "h1", "text": "Myostim unit"}, {"tag": "p", "text": "A myostim unit was a muscle-building device that used a sensor field coupled with an adjustable electromyoclonic broadcaster to maintain and increase muscle tone, in lieu of exercise."}, {"tag": "p", "text": "Users of myostim units included Roa, Xizor, and Gordus Grime."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The myostim unit was originally developed to combat muscle atrophy on planets with low gravity; however, this did not remain the unit's primary function for long. It found use as a trainer for athletes and exercise enthusiasts galaxy-wide as a means for freeing up their time for other ventures while still remaining physically fit. While expensive, Myostim units were smaller than traditional exercise gear, making their transportation significantly more convenient for the user."}, {"tag": "p", "text": "In addition to use by athletes, it was suspected that myostim units found favor with bounty hunters and mercenaries."}, {"tag": "p", "text": "Myostim units did not come without their share of negative consequences. Prolonged use of the unit was thought to cause a certain amount of muscle dependency on the machine's sensor field. Those that suddenly ceased using the myostim unit after years of repeated exercise with the device experienced rapid and extreme muscle atrophy. Regular exercise was, reportedly, incapable of curbing this advanced muscle loss. In addition, it was theorized that regular exposure to the unit's sensor fields would cause a certain amount of damage to a user's electro-neural system; however, the symptoms recorded varied greatly from one species to another. It was suspected that this side-effect could result in problems with coordination and judgment, with an emphasis on extremely stressful situations. As a result, many medical examiners came to regard the myostim unit as dangerous."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The myostim unit is very similar, in function, to real world Electrical Muscle Stimulators."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}