{"url": "Mystery_motif", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Mystery motif"}, {"tag": "p", "text": "A mystery motif written by John Williams first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, in accompaniment to \"The Force Theme.\" Its usage is pervasive in the 2002 Attack of the Clones soundtrack, composed by John Williams and performed by the London Symphony Orchestra. The leitmotif is an arpeggio figure in a minor key, ascending and descending in a succession of notes. The motif has multiple variations, sometimes having a conjunct, undulating motion."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "An arpeggio figure, the mystery motif shares its notes with the opening melody of \"The Force Theme,\" though the motif omits the third note of \"The Force Theme\" and is instead played in minor key. Utilized in Star Wars musical score as a leitmotif for mystery, the motif ascends and descends in a succession of notes, and has multiple variations: one variation has a conjunct, undulating motion."}, {"tag": "h2", "text": "Usage"}, {"tag": "h3", "text": "In Star Wars"}, {"tag": "h4", "text": "Return of the Jedi"}, {"tag": "p", "text": "The mystery motif is first played in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, as Luke Skywalker watches the burning of his father's funeral pyre on Endor. The motif is played once by woodwinds in the track \"Light of the Force,\" in accompaniment to \"The Force Theme.\""}, {"tag": "h4", "text": "Video games"}, {"tag": "h5", "text": "1993–2005"}, {"tag": "p", "text": "The mystery motif is played with varying harmony in combat levels of the 1993 video game Star Wars: X-Wing immediately after the player exits hyperspace. The game was scored by Peter McConnell, Michael Z. Land, and Clint Bajakian, and its music AI was programmed by Lawrence Holland. In addition, McConnell and Land handled the iMUSE electronic system."}, {"tag": "p", "text": "The mystery motif is used in the 1995 video game Star Wars: Dark Forces, scored by Clint Bajakian. The arpeggio is first played in the title screen. In the 1998 video game Star Wars: Rogue Squadron, composed by Chris Hülsbeck, the motif is played in the track \"Where is the ship?\""}, {"tag": "p", "text": "Both Kreia and the Sith Triumvirate's motif in the 2004 video game Knights of the Old Republic II: The Sith Lords, for which the music was composed by Mark Griskey, contain the mystery motif. The motif is played in the opening menu of the 2005 Revenge of the Sith video game."}, {"tag": "h5", "text": "The Old Republic"}, {"tag": "p", "text": "In the Collector's Edition soundtrack of the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic, the mystery motif is continuously played following \"The Force Theme\" in the track \"Peace, The Jedi Consular.\""}, {"tag": "p", "text": "The motif is played multiple times in the game itself. In the Jedi Knight storyline, the motif is played as the Jedi Knight witnesses Jedi Master Orgus Din collapse a tunnel leading the Flesh Raiders to the Jedi Temple on Tython. The motif is again played as the Jedi Knight, Grand Master Satele Shan, and the Sith Lord Scourge discuss the Voss Mystics who ruled the planet Voss."}, {"tag": "p", "text": "Variations of the motif form a significant part of the music that was composed for and played during the flashpoint \"Kuat Drive Yards.\" Set in the Kuat Drive Yards during the Battle of Kuat of the Galactic War, the flashpoint was released in the 2014 digital expanion Star Wars: The Old Republic: Galactic Starfighter."}, {"tag": "p", "text": "At the end of the 2020 \"Echoes of Oblivion\" story in Star Wars: The Old Republic: Onslaught, a digital expansion to the Star Wars: The Old Republic video game, the mystery motif is played as former Jedi Aryn Leneer approaches former Jedi Grand Master Satele Shan about Leneer's latest encounter with Darth Malgus in the Dantooine Jedi Enclave. The mystery motif is also played when the Alliance Commander, Arn Peralun, and Aryn Leneer are lost while tracking down Malgus in the Enclave. The motif is followed by Aryn Leneer's theme as Leneer uses Force empathy to follow Malgus trail."}, {"tag": "h4", "text": "Films"}, {"tag": "h5", "text": "Prequel trilogy"}, {"tag": "p", "text": "In the Star Wars: Episode II Attack of the Clones, the motif is first heard in the track \"Return to Tatooine,\" in cue \"2m5 Library Scene\"—at the Jedi Archives, where Obi-Wan Kenobi was searching for the planet Kamino. Later, it sounds with the cue \"3M1 Finding Kamino\", when Kenobi first makes planetfall on Kamino and encounters its rainy environment. It is next heard in the cue \"3M6 The Meeting With Fett\", when a Kaminoan-ridden aiwha emerges from Kamino's ocean and flies around Tipoca City, immediately prior to Obi-Wan's meeting with Jango Fett. The motif is later heard in the cue \"3M8 Rainy Ramp and Anakin's Nightmare\", when Obi-Wan makes his report to the senior Jedi from a Kamino landing platform (featured in \"The Meadow Picnic\" on the released soundtrack). The leitmotif also accompanies the plotting of the Separatist Council on Geonosis, as well as Cliegg Lars' narration of the Tusken Raider abduction of Shmi, the mother of Anakin Skywalker. When Yoda senses Skywalker's fall to the dark side after Shmi's death from his quarters on Coruscant, the motif is played until Yoda mentions sensing death echoing from Skywalker's fall, and \"The Imperial March\" is played instead. When the Supreme Chancellor accepts emergency powers from the Galactic Senate, the descending figure preceding the main motif is played and twisted into a brief rendition of \"The Emperor's Theme.\" The score continues with the conspiracy motif before transitioning to the Palpatine's machinations motif for Palpatine's acceptance speech."}, {"tag": "p", "text": "A variation of the motif sounds in \"Council Meeting,\" cue 3m1 of Star Wars: Episode III Revenge of the Sith's soundtrack, again written by John Williams. It is followed by four notes that forms the first four notes of Ahsoka's Theme, first heard in the Star Wars: The Clone Wars film written by Kevin Kiner. The motif is also used as a musical flourish to \"The Force Theme\" in the track \"Goodbye Old Friend,\" as Obi-Wan Kenobi's blue Eta-2 Actis-class light interceptor departs Commander Cody's Venator-class Star Destroyer in the Coruscant system for Utapau."}, {"tag": "h5", "text": "Sequel trilogy"}, {"tag": "p", "text": "The motif is played backwards in the 2015 Rey's Theme, which was produced as part of the soundtrack for Star Wars: Episode VII The Force Awakens. The 3M1 cue is reused by composer Gordy Haab with some variation in the 2017 video game Star Wars Battlefront II for its Kamino loading screen."}, {"tag": "p", "text": "In Star Wars: Episode IX The Rise of Skywalker, the Attack of the Clones track \"Return to Tatooine\" is reused for the rooftop scene beteeen Zorii Bliss and Poe Dameron. The mystery motif is included, and sounds when Bliss lowers her helmet's eye-shields. In the same 2019 film, the leitmotif is played in forte, overlaying the Force drain scene and increasing in speed, pitch, and volume as Darth Sidious takes the power of Rey and Ben Solo for himself. Music from the \"Fate\" TV Spot produced in the lead-up to The Rise of Skywalker brings together \"The Force Theme\" with the mystery motif, although music is not present in the film's soundtrack."}, {"tag": "h4", "text": "Television"}, {"tag": "p", "text": "In the Star Wars: The Clone Wars TV series, which was also scored by Kiner, the motif appears in the episode \"Voices,\" as Qui-Gon Jinn guides Yoda through the misty swamps of Dagobah, teaching the Jedi Grand Master about the Force and immortality."}, {"tag": "p", "text": "In the 2014 Star Wars Rebels episode \"Fighter Flight,\" just after Ezra Bridger frees farmers who were captured by the Galactic Empire in Imperial Troop Transports, the mystery motif trails \"The Force Theme\" in a manner similar to that of the \"The City in the Clouds\" track from the 1980 film Star Wars: Episode V The Empire Strikes Back's soundtrack. The mystery motif shares the same notes and motion of notes as in \"The Force Theme,\" although they are instead played in minor key. In the 2016 episode \"The Protector of Concord Dawn,\" the mystery motif appears and is further developed by composer Kevin Kiner as the Spectre Sabine Wren plants explosives at the Protectors Camp on Concord Dawn."}, {"tag": "p", "text": "In Star Wars: The Bad Batch's episode \"Aftermath,\" a quick, rhythmic ostinato of the motif is played towards the end of the track \"Battle Simulations.\""}, {"tag": "h3", "text": "In other media"}, {"tag": "p", "text": "Variations of the leitmotif are used in various BBC productions released from the 2000s onwards. John Williams employed the motif in various films which he scored, including Harry Potter and the Philosopher's Stone, A.I. Artificial Intelligence, Harry Potter and the Chamber of Secrets, The Adventures of Tintin, and The BFG."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}