{"url": "Mytaranor_Slaving_Council", "categories": ["Category:Legends articles", "Category:Slaver organizations"], "nodes": [{"tag": "h1", "text": "Mytaranor Slaving Council"}, {"tag": "p", "text": "The Mytaranor Slaving Council was a slaving group operating in the Mytaranor sector during the Galactic Civil War."}, {"tag": "p", "text": "The Slaving Council sold slaves to important mining companies wanting to extract resources on Mytaranor. It became famous because of its affordable prices and its excellent catalog."}, {"tag": "p", "text": "The mobile headquarters of the council was the dungeon ship Vanquisher. At any given moment, the jail included an average of 800 prisoners, plus 200 slavers and/or guards, with most of them in the Vanquisher."}, {"tag": "p", "text": "The Slaving Council noticed that able-bodied species such as Gamorreans, Gigorans and Wookiees received higher prices, so they resorted to using bounty hunters to capture them. The Council also dealt in Bothans, Mon Calamaris and Quarrens. This led to them clashing with the Alliance to Restore the Republic, as the Alliance not only included Wookiees and other enslaved species among its files, but was also opposed to slavery. At one point, the council was brought to almost extinction when it clashed with Moff Julstan's Sector Fleet. Only the intervention of Black Sun Vigo Lonay saved them."}, {"tag": "p", "text": "Rebel agent and Wookiee Tirranna wrote an extensive report on the Slaving Council, including descriptive information on her personal objection towards slavers and her hope of someday having a chance to kill each of them with her bare hands. Other Rebel officers such as General Airen Cracken and commander Derembus Sitnalta also wrote reports on the council, but they were unable to keep a neutral point of view."}, {"tag": "p", "text": "The Mytaranor Slaving Council might have been responsible for the capture of Shistavanen scout Yurdak Fav."}, {"tag": "h2", "text": "Known members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}