{"url": "MythBusters_Star_Wars_Special", "categories": ["Category:Real-world articles", "Category:Miscellaneous television productions"], "nodes": [{"tag": "h1", "text": "MythBusters Star Wars Special"}, {"tag": "p", "text": "The MythBusters Star Wars Special is the season premiere of the 2014 season of the Discovery Channel science entertainment show testing urban legends, old wives' tales, proverbs, film scenes and more. Set in and around San Francisco, where the show's cast is based at M5 Industries Inc., it featured the cast – including four who had worked on Star Wars films, were Industrial Light & Magic alumni or both in original co-hosts Jamie Hyneman and Adam Savage and Build Team members Grant Imahara and Tory Belleci – testing three scenes from the movies, eventually choosing one from each original trilogy installment. A later episode hosted by Savage and Hyneman featured prequel trilogy myths."}, {"tag": "h2", "text": "Myths and Results"}, {"tag": "h3", "text": "Summary"}, {"tag": "h3", "text": "Death Star Hook Swing"}, {"tag": "p", "text": "To test this scene, Adam and Jamie broke it down into three components:"}, {"tag": "p", "text": "As an added finale, just after giving the Plausible verdict, the three of them made their escape as the stormtroopers chased and shot at them."}, {"tag": "h3", "text": "Swinging Ewok Log Ram"}, {"tag": "p", "text": "This was the myth that the Build Team (Grant, Tory and Kari) tackled, and they did so by first devising a steel-reinforced wooden structure that could support two 10,000-pound, 10-foot-long and 5-foot-wide logs swinging towards a target in between with a combined 2 million joules of energy if raised to the proper height for testing."}, {"tag": "p", "text": "During their proof of concept test, they were unable to get their preferred 45° angles for each log, and so for the full test, they lowered the logs and target vehicle, reinforced the structure and lengthened the cables suspending the logs. They also used an armored truck with the Imperial emblem to represent an Imperial armored vehicle like an All Terrain Scout Transport. When aimed at the back of the cabin, the logs knocked the truck's side panels off the frame, leading them to declare the myth plausible even though Tory reasoned that such a weapon would be hard to time and aim. As a bonus, they put an Imperial dummy in the driver's seat and targeted the cabin with the logs, dealing heavy damage."}, {"tag": "h3", "text": "Tauntaun Sleeping Bag"}, {"tag": "p", "text": "In order to test this scene/idea, Adam and Jamie modeled a tauntaun with similar characteristics to that of a polar bear with an outer layer of fur and foam rubber in place of blubber. For the insides, they used sodium polyacrylate (waterlock) dyed blue, both by itself and inside vinyl tubes and pouches representing organs and intestines, warmed in a bath to 99 °F (37 °C) – the body temperature of a recently deceased arctic animal."}, {"tag": "p", "text": "For Luke, the two of them utilized a human body simulaid christened Thermo-Boy – a ballistics gel dummy with heat coils representing arteries and temperature that could be calibrated, which Jamie had created in 2012 to test another movie myth: whether Jack Dawson (Leonardo DiCaprio)'s death in Titanic was preventable. A pump with a heater was attached, having been calibrated to simulate the heart and human metabolism, as well as a sensor to monitor body temperature."}, {"tag": "p", "text": "To simulate the cold climate on Hoth, and Adam and Jamie built an insulated chamber inside a food refrigeration facility and loaded it with dry ice to achieve a temperature of −40 °F (−40 °C), citing Hoth: Under the Ice, which states that the temperature on Hoth is between -30 °C and -60 °C and stating that they had checked this wiki."}, {"tag": "p", "text": "Once Thermo-Boy had been loaded into the tauntaun, the two of them had been moved into the chamber and Thermo-Boy had cooled to 95 °F (35 °C), reasoning that Luke had been mildly hypothermic when Han had found him, Adam and Jamie started to monitor his temperature. They cited that it takes a snow climber 2-3 hours to build a snow cave under adverse conditions and gave Han 2.5 hours to build a shelter given that he is capable and had Luke's lightsaber. For Luke to survive, they further reasoned, he would have had to last that long inside the tauntaun without his body temperature falling to 82 °F (28 °C) – the upper limit of severe hypothermia, at which organ failure and death can start to occur.. At the end of the test, Thermo-Boy had only cooled to 92 °F (33 °C), and Adam and Jamie deemed the myth plausible, explaining that a mammal carcass is mostly water and therefore has a strong ability to retain heat."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}