{"url": "Mythology", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 14"], "nodes": [{"tag": "h1", "text": "Mythology"}, {"tag": "p", "text": "Mythology was a comic appearing in Star Wars Tales 14 and collected in Star Wars Tales Volume 4 and Star Wars Legends Epic Collection: Rise of the Sith Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "One dark night, Obi-Wan Kenobi reveals to his master a fear of displeasing him. His master, Qui-Gon Jinn, senses this as an attachment and tells him a myth concerning an ancient Jedi Master and his apprentices."}, {"tag": "p", "text": "When the Jedi Order was in its infancy, the Knights were searching for Force-sensitives to swell their numbers. A master known as Shang-Troy Thanabo traveled to Boranall following a call of the Force. When he lands, the Force guides him to a pregnant woman, and the children in her belly. Aiding in the birth of the children, he takes them as his apprentices, and they go out into the galaxy to do great deeds."}, {"tag": "p", "text": "Many years later, the twins and their master encounter a woman. The twins fall in love with her, but she only loves one of them and the other grows jealous. Eventually he disguises as his brother and enters their house. However, the woman recognizes the birthmark that is their only physical difference."}, {"tag": "p", "text": "Her cries summon the other brother, who is enraged to find his brother with his wife. Their battle agitates Thanabo who comes running. Despite Thanabo's and the woman's attempt to calm the brothers, they are unsuccessful. Thanabo is caught in the fray and killed, enraging the brothers further. Their battle eventually expands until the entire world is consumed in a blast of Force energy, becoming a star."}, {"tag": "p", "text": "Qui-Gon explains that the star symbolizes the endless battle and chaos between the brothers, and to avoid it, the Jedi shun attachment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}