{"url": "Mythrol", "categories": ["Category:Canon articles", "Category:Mythrol", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Mythrol"}, {"tag": "p", "text": "The Mythrol were a sentient humanoid species with amphibious traits."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Mythrol had amphibious traits such as gills and fins on their heads. They had thoraxes which had to be \"evacuated\" and could molt. Young Mythrol could produce a sweet musk. After molting, their faces would become barbed. Mythrol at a younger age were referred to as \"fledglings.\""}, {"tag": "h2", "text": "Mythrol in the galaxy"}, {"tag": "p", "text": "Around 82 BBY towards the end of the High Republic Era, a Mythrol male worked as a chef for President Jamie Brasen at his estate on the planet of Begamore."}, {"tag": "p", "text": "Prior to 9 ABY, a fledgling Mythrol was in the employ of Magistrate Greef Karga on Nevarro, before he stole from him and fled. Sometime later, he resided on the ice planet Maldo Kreis within a bar, where he was harassed by a group of trawlers until the Mandalorian bounty hunter Din Djarin entered. After dealing with the trawlers, Djarin captured the Mythrol and turned him over to the Bounty Hunters' Guild. Sometime later, the Mythrol was allowed by Karga to work off his debt to him through three hundred and fifty years of indentured servitude. During that time, he aided Karga, Din Djarin, and Marshal Carasynthia Dune in infiltrating and destroying a remnant Imperial base."}, {"tag": "p", "text": "In 35 ABY, the post-fledgling Mythrol Junn Gobint managed fuel supplies for the Resistance during their war against the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mythrol species first appeared in Chapter 1 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on November 12, 2019. While writing the visual dictionary for the 2019 film Star Wars: Episode IX The Rise of Skywalker, Lucasfilm Story Group member Pablo Hidalgo made a connection between The Mandalorian's Mythrol and the similar looking background alien Junn Gobint in Episode IX. Taking the television character's background as a \"fledgling\" into account, Hidalgo established in the dictionary that the independently designed aliens belonged to the same species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}