{"url": "N-1L_Light_Starfighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Naboo starfighter classes", "Category:Theed Palace Space Vessel Engineering Corps products"], "nodes": [{"tag": "h1", "text": "N-1L Light Starfighter"}, {"tag": "p", "text": "The Naboo N-1L Light Starfighter was the predecessor to the better-known N-1 starfighter."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The N-1L Light Starfighter was smaller and slower than the 11 meter-long N-1 starfighter, and did not pack as much of a punch in terms of firepower, though they were armed with two laser cannons. The starfighter sported the characteristic trademark of the Monarch of Naboo,[source?] a chromium finish on the bow. The fighter was colored yellow across the rest of the craft and the two engine units. They were constructed at Naboo airbases and flown by a single pilot and an astromech droid of the Naboo Royal Space Fighter Corps."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The N-1L starfighters were the predecessors to N-1 Starfighter, and this class still saw frontline service when used by the Royal Space Fighter Corps during the Invasion of Naboo in 32 BBY, serving as part of the forces defending city of Harte Secur against attacking Trade Federation B1-Series battle droids and OX9 labor droids. These fighters also were used to attack the Federation garrison during the Spinnaker occupation. In both cases, the Royal Naboo Security Forces were unsuccessful against the Trade Federation Droid Army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The N-1L Light Starfighter appeared in the 2001 video game Star Wars: Galactic Battlegrounds and its 2002 expansion pack. They were the Naboo civilization's basic fighter unit, and were encountered during the Trade Federation campaign and were constructable in multiplayer. A picture of it is used to represent the fighter unit in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}