{"url": "N-1_assembly_site", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Military bases", "Category:Naboo locations", "Category:Naboo Underground", "Category:Nal Raka Criminal Empire"], "nodes": [{"tag": "h1", "text": "N-1 assembly site"}, {"tag": "p", "text": "The N-1 assembly site was a facility on the planet of Naboo used to construct the Security Force's N-1 starfighters. The assembly site was attacked during the Trade Federation Invasion of Naboo in 32 BBY."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The site consisted of the assembly buildings, a command post, and a runway where completed N-1 starfighters waited for their pilots. The whole complex was situated in the northern frozen mountains of Naboo."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to 32 BBY, the base was taken over by Borvo the Hutt and his Nal Raka Criminal Empire. When the Trade Federation invaded Naboo in 32 BBY, the Droid Army moved quickly to secure all points of resistance. The assembly site was quickly blockaded and the smuggler who ran the facility was cut off. The Royal Naboo Security Forces, in disarray from the invasion, sent two Security Officers to find a way to fight the Droid Army. Captain Kael and Lieutenant Gavyn Sykes rescued the smuggler, a Hutt named Borvo. The pilots escorted him and his freighter to the site. They fought through mines and droid starfighters to the assembly site. In response, the Droid Army attempted to raze the site. The pilots, assisted by one of the Hutt's pilots, commenced strafing runs against the Federation tanks, saving the facility."}, {"tag": "p", "text": "Though the immediate threat had been taken care of, and the assembly site had taken heavy damage, surviving N-1s rested on the landing strip. The pilots switched their vehicles for the new starfighters and took off to to strike back at the Trade Federation forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This facility appeared in a mission in the 2000 video game Star Wars: Episode I: Battle for Naboo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}