{"url": "N-K_Necrosis", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Battle droids", "Category:Imperial projects and operations", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "N-K Necrosis"}, {"tag": "p", "text": "N-K Necrosis was a highly advanced combat droid created from the body of the late General Grievous of the Confederacy of Independent Systems during the Galactic Civil War. Doctor Nycolai Kinesworthy, a cybernetic scientist, was hired by the Galactic Empire to create the Necrosis droid. Dubbing the project \"N-K,\" Kinesworthy established a shop in the Myyydril Caverns on the planet Kashyyyk to begin work on the droid. He eventually hired the scientist Treun Lorn to help advance the project. After Lorn hired the assassin droid IG-72 to retrieve a pair of outdated IG-100 MagnaGuards to serve as N-K's bodyguards, the dark side Prophetess Merili led the two scientists to one of Emperor Palpatine's secret storehouses on Utapau, where she provided them with the mechanical body of the cyborg Grievous."}, {"tag": "p", "text": "After placing an advanced droid brain in the mechanical body, Kinesworthy dubbed the completed project \"N-K Necrosis,\" and renamed the aging MagnaGuards \"NK-3.\" The NK-3s instructed Necrosis on how to fight with a lightsaber, with Necrosis wielding a double-bladed lightsaber that contained the Bane's Heart crystal. At some point around the Battle of Yavin, Lorn stole Necrosis and his NK-3 bodyguards to use them for his own purposes. In 1.5 ABY, a group of spacers investigated the lower regions of the Myyydril Caverns at the behest of Kinesworthy. During their investigations, the group inadvertently aided Lorn in activating Necrosis. They then defeated both N-K Necrosis and his bodyguards before taking whatever they deemed valuable."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "During the Galactic Civil War, Doctor Nycolai Kinesworthy, a highly regarded cybernetic scientist, was employed by the Galactic Empire to construct an advanced combat droid. Kinesworthy's study of death and its aspects helped him to create a cutting-edge droid brain. With that complete, the doctor dubbed his project \"N-K,\" a reference to his own name. Kinesworthy recruited a well-known scientist named Treun Lorn, who helped him move the project beyond a theoretical stage. Both scientists then transferred the project to the Wookiee homeworld of Kashyyyk. There, the project was presented to the planet's Imperial overseer, the dark side Prophetess Merili, who allowed Kinesworthy to host the project within the Myyydril Caverns on Kashyyyk."}, {"tag": "p", "text": "After Lorn hired the assassin droid IG-72 to round up two outdated IG-100 MagnaGuards, which were to serve as bodyguards to the advanced battle droid, Merili took both Kinesworthy and Lorn to the planet of Utapau. At one of Emperor Palpatine's secret storage warehouses there, she gave the two scientists the droid body of Grievous, the dead Confederate cyborg general who had been killed at the end of the Clone Wars. The droid body later hosted Kinesworthy's experimental droid brain and be reanimated into the advanced combat droid, N-K Necrosis. The two MagnaGuards—renamed \"NK-3\"—instructed the reanimated Grievous how to fight with a lightsaber, utilizing the same fighting techniques that Grievous taught the MagnaGuards nearly two decades earlier. Necrosis carried a variety of weapons, as well as the deed to Grievous's starfighter, the modified Belbullab-22 starfighter Soulless One. Necrosis chose a double-bladed lightsaber containing the crystal Bane's Heart, an artifact that once belonged to the Sith Lord Darth Zannah, as his primary weapon. He was also presented with the weapon that had destroyed Grievous: a modified BlasTech blaster that had been dubbed the \"Grievance Striker.\" The droid carried a Utapaun Nightblade as well."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "At some point around the time of the Battle of Yavin in 0 BBY, Lorn kidnapped Necrosis and his bodyguards for his own means and stored them deep within the Myyydril Caverns. In 1.5 ABY, however, a group of spacers investigated the depths of the Myyydril Caverns during the height of the Galactic Civil War, at the behest of Kinesworthy. During their investigation, the spacers found the cave where Necrosis had been stashed, which was protected by a watchful B1-Series battle droid. The droid gave the spacers a quest to find a special crystal, which had the ability to bring Necrosis to life. After the spacers retrieved the crystal in another region of the caverns, the battle droid gave the spacers access to the cave where Necrosis was kept. Inside, the spacers spoke to Lorn, who demanded they hand over the crystal. After the spacers complied, Necrosis and his two NK-3 bodyguards appeared and engaged the group in a fierce battle. The spacers defeated and destroyed both Necrosis and his NK-3 guards. They also looted the destroyed droid bodies, taking anything that was deemed valuable, which included Bane's Heart, other weaponry, the deed to the Soulless One, and parts of Necrosis's droid body."}, {"tag": "p", "text": "The looted parts of Necrosis's droid body, which were considered valuable components, were sold on the Invisible Market. Supposedly, Necrosis's duraplast armor mask had been purchased by a high-ranking Imperial admiral, rumored to be Grand Admiral Thrawn, as a Kaleesh work of art."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Due to the advanced heuristic programming from Kinesworthy's new droid brain, N-K Necrosis had traits similar to the former host of his body, the late General Grievous, though Kinesworthy assured Necrosis that he was better. Along with the considerable fighting prowess that he had acquired through training with the NK-3s, Necrosis also acquired an almost Human penchant for analysis, and often wondered whether he was in fact superior to Grievous and not simply a shell of him. Necrosis found himself pondering who Grievous had been, feeling something akin to envy toward the living intelligence that had once inhabited the body. While serving under Lorn, Necrosis referred to him as \"master.\""}, {"tag": "p", "text": "N-K Necrosis was highly advanced in melee combat and used the same lightsaber techniques that Grievous once taught his MagnaGuard bodyguards during the Clone Wars. Unlike other lightsaber crystals, Necrosis's, the Bane's Heart crystal, was alchemically-treated, thus making the overall weapon more powerful. Both Necrosis and his NK-3 guards favored melee combat over a ranged variant. Since Necrosis had stronger armor, he was more powerful than his NK-3 droids. Necrosis's droid body, made of duranium alloy, had the appearance of a Krath war droid. While the entire body was cybernetic, a notable feature was the inclusion of LX-44 legs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "N-K Necrosis first appeared in the MMORPG online game Star Wars Galaxies. In April 2005, a month before the theatrical release of Star Wars: Episode III Revenge of the Sith—in which Grievous appears—Sony Online Entertainment, the creator of Star Wars Galaxies, released the game's second expansion, titled Rage of the Wookiees. The expansion introduced the planet of Kashyyyk into the game, including the non-player character N-K Necrosis. Upon killing the NPC, N-K Necrosis commonly dropped a deed to Grievous's starfighter, a cybernetic arm, and a semi-rare weapon. In some looting cases, the weapon would be substituted with another cybernetic arm. More rarely N-K Necrosis dropped the Bane's Heart lightsaber crystal."}, {"tag": "p", "text": "Author Abel G. Peña mentioned the character N-K Necrosis in two stories regarding Grievous's life: Unknown Soldier: The Story of General Grievous from Star Wars Insider 86, and The Story of General Grievous: Lord of War, a StarWars.com Hyperspace online supplement. Necrosis is also given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}