{"url": "N-X_Police_Cruiser/Legends", "categories": ["Category:Legends articles", "Category:Air vehicles", "Category:Naboo starfighter classes", "Category:Police vehicles", "Category:Theed Palace Space Vessel Engineering Corps products"], "nodes": [{"tag": "h1", "text": "N-X Police Cruiser"}, {"tag": "p", "text": "The Naboo N-X Police Cruiser, most commonly called the Police Cruiser, was the atmospheric version of the N-1 starfighter, although it was also capable of sub-orbital flight."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was nine meters long and resembled the yellow N-1 aside from a third engine module, lack of an astromech droid, and the blue paint scheme, though both were remarkably similar in appearance and performance."}, {"tag": "p", "text": "The light alloy armored hull on the N-X was similar to the N-1 and also gave the fighter its speed and maneuverability. This made the N-X starfighter an excellent patrol craft and good for atmospheric missions. However, when forced to engage heavier or more numerous enemies, its weakness became apparent. In such situations, the pilot had no alternative but to activate the overthruster and withdraw to friendly supporting units."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The N-X was a recent addition to the Royal Naboo Security Forces during the Invasion of Naboo. The N-X was designed and manufactured by Theed Palace Space Vessel Engineering Corps which also developed the highly successful N-1. The RSF garrison in Theed received the first squadron of these fighters a year before the Battle of Naboo. Other Naboo city-states had since started to receive their own N-X squadrons. Because of their likeness to the N-1s, they were often used as training vessels."}, {"tag": "p", "text": "During the occupation of Theed by the Trade Federation, a mixed force of N-X and N-1 fighters liberated a Trade Federation internment camp, this successful mix of vehicles brought the Trade Federation's droid forces into disarray days before the Trade Federation Droid Control Ship was destroyed in orbit over Naboo. During the Clone Wars, the N-X continued to serve the Naboo by combating both pirates and Separatist forces in the Naboo system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The N-X Police Cruiser first appeared in the 2000 video game Star Wars: Episode I: Battle for Naboo. It was later available in the 2001 video game Star Wars: Starfighter by using the cheat code \"BLUENSF\", only after the player has achieved a gold medal on all previous missions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}