{"url": "N3-A2", "categories": ["Category:Legends articles", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "N3-A2"}, {"tag": "p", "text": "N3-A2, sometimes known as 3-A2, was a protocol droid originally owned by crimelord Nirama."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When Nirama decided that N3-A2 had outlived its use, he decided to get rid of it, as its memory banks included sensible information. However, a faction of Nirama's Organization that opposed to his rule, The Cell, managed to get hold of N3-A2 and reprogrammed it to serve them. Nirama's lieutenant Ari Melast, secretly a Cell member, was involved in this operation."}, {"tag": "p", "text": "The Cell also deceived Nirama's master of properties Jobril, so that Jobril would follow orders from The Cell while believing to be serving Nirama. The Cell wanted to use both Jobril, N3-A2 and some independent agents who had previously worked for Nirama, in a plot to weaken him. Should the scheme work, Nirama would replace some loyal employees in his weapon storage asteroid Rothe Gate."}, {"tag": "p", "text": "Jobril brought the independent agents to Rothe Gate and N3-A2 received them there. The droid asked them, supposedly in the name of Nirama, to look for proofs linking certain \"suspects\" to The Cell. N3-A2 provided them with a datapad that had been sliced to forge the needed proofs."}, {"tag": "p", "text": "The scheme attracted Nirama's attention, and the crimelord in person went to Rothe Gate. The Cell then decided to assassinate Nirama there and then. They also decided to stage a distraction by planting a bomb on N3-A2 and making it kill the independent agents, as all of them knew too much. Melast herself planted the explosive in the droid's circuitry, near her personal control chip."}, {"tag": "p", "text": "Both the agents's and Nirama's murders were botched, although it is unclear whether N3-A2 was destroyed in the explosion or not."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As of 32 BBY, N3-A2 was an old droid with a limited memory capacity. It moved with constant creaks and its obsolete voice modulator made it repeat syllables or words sometimes."}, {"tag": "p", "text": "N3-A2 had yellow eyes, but when the bomb was installed in his hip, they changed to green because of the explosive's nuclear energy source."}, {"tag": "h2", "text": "Appearances"}]}