{"url": "Assassin/Legends", "categories": ["Category:Legends articles", "Category:Assassins", "Category:Criminal occupations"], "nodes": [{"tag": "h1", "text": "Assassin"}, {"tag": "p", "text": "Assassins were beings or machines trained to kill other beings, either for hire or for political gain."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Members of the profession were referred to by many euphemisms and epithets: \"problem solvers\" in the Corporate Sector Authority, \"exterminators\" in the Outer Rim Territories, and \"slayers\" in the Core Worlds. Whatever their name, most professional assassins were concerned solely with credits, though some killed for political or religious reasons, or merely for love of killing. This made assassins simultaneously the best-paid and most-despised members of the galaxy's underworld."}, {"tag": "p", "text": "Though assassination was illegal on most planets, on some, such as Umbara, assassinations were part of society."}, {"tag": "p", "text": "Many bounty hunters who had no objections to killing their targets or working for criminals straddled the line between assassin and bounty hunter."}, {"tag": "h3", "text": "Types of assassins"}, {"tag": "p", "text": "Orders of assassins in the galaxy included the Assassin's Guild, the Fpi Assassins, the Loag, the Malkite Poisoners, and the GenoHaradan."}, {"tag": "p", "text": "While assassins could come from a variety of sentient species, some species were disproportionately represented in the profession. These included Anzat, Tyluun Night-Soarers, Kerestians, Bartokk, Noghri, and Blood Carvers."}, {"tag": "p", "text": "Droids built to kill, such as IG-88A, HK-47, 4-LOM, and ASN-121, were known as assassin droids."}, {"tag": "p", "text": "Clone assassins were specialized clone troopers trained to kill Jedi with the art of Teras Kasi."}, {"tag": "p", "text": "Sith assassins were minions of the Sith who specialized in stealth and infiltration in order to kill the enemies of the Sith Lords."}, {"tag": "p", "text": "Jedi hunters were assassins who specialized in killing Jedi. General Grievous, Galen Marek, and Darth Vader were well-known Jedi hunters, the last playing a major part in the Great Jedi Purge. Many Jedi hunters were Sith; many others were simply skilled combatants with a hatred for the Jedi."}, {"tag": "p", "text": "Bounty hunters would almost always kill for bounty, although some captured living people. Hunters such as Jango Fett, Zam Wesell, Boba Fett, Zuckuss, Bossk, 4-LOM, and Dengar were sometimes referred to as assassins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}