{"url": "NTB-630_naval_bomber/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Galactic Republic starfighter classes", "Category:Incom Corporation products", "Category:Subpro Corporation products"], "nodes": [{"tag": "h1", "text": "NTB-630 naval bomber"}, {"tag": "p", "text": "The NTB-630 naval bomber was a bomber manufactured during the Clone Wars by the Incom and Subpro Corporations. Built for at least one pilot and designed to attack capital ships in space, the NTB-630 was better armed and more maneuverable than the similar PTB-625 planetary bomber. The Republic Navy employed many of these bombers during the Clone Wars, and Jedi Master Wom-Nii Gnaden piloted an NTB-630 bomber during the Battle of Crombach Nebula."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The NTB-630 naval bomber was jointly produced by the Incom and Subpro Corporations during the Clone Wars. The NTB-630 was more heavily armed and armored than its close cousin, the ARC-170 starfighter, and the similar PTB-625 planetary bomber. With a narrow spaceframe flanked by at least two large engines, the NTB-630 resembled other Incom/Subpro starfighters such as the Z-95 Headhunter, the PTB-625, and the ARC-170. The NTB-630 was created to deliver its payloads while engaged in space battles, and was therefore also more maneuverable than the PTB-625, allowing it to get close to capital ships and avoid their turbolasers as it executed bombing runs. The bomber was crewed by at least one pilot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The bomber saw common use by Galactic Republic forces during the Clone Wars. Jedi Master Wom-Nii Gnaden piloted an NTB-630 during the Battle of Crombach Nebula, and crashed into the Munificent-class star frigate Tide of Progress XII after his bomber was damaged, causing the Jedi to lose control of his ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The NTB-630 naval bomber was first mentioned in Star Wars: Revenge of the Sith Incredible Cross-Sections, a 2005 book detailing vehicles seen in the film Star Wars: Episode III Revenge of the Sith. This page was reprinted in 2007 in Star Wars: Complete Cross-Sections. Later, the bomber was mentioned in the Databank entry of the ARC-170 starfighter on StarWars.com, and it also received its own entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}