{"url": "Naare%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Naare's lightsaber"}, {"tag": "p", "text": "Naare's lightsaber was a red lightsaber used by the Sith agent Naare during the Search for the Kyber Saber. While posing as a Jedi in an attempt to manipulate Rowan Freemaker into finding the Kyber Saber, Naare kept her Sith lightsaber hidden. Rowan eventually discovered the Sith blade during Naare's rescue mission on Tatooine to rescue the Freemakers. He stole the Sith lightsaber and wielded it during a mission to recover golden orbs from the third moon of Takodana. Naare reclaimed the Sith lightsaber from Rowan during a duel on Naboo but the boy stole her blue lightsaber. Naare later wielded the Sith lightsaber during her encounters with the Freemakers on Zoh, Hoth, the Freemaker Garage, and Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Secret weapon"}, {"tag": "p", "text": "The Sith agent Naare kept two sets of lightsabers: a blue lightsaber and a red one. When interacting with the Freemakers, Naare hid her red Sith lightsaber. During a private meeting with Emperor Palpatine and Darth Vader, Naare unsheathed her Sith lightsaber to indicate that she was willing to use force against Rowan Freemaker should the need arise."}, {"tag": "p", "text": "While training with her Sith lightsaber in her private apartment, Naare was contacted by Darth Vader, who reminded her to hurry up with recovering the Kyber Saber crystals. Naare subsequently took part in mission to rescue Zander Freemaker and left her Sith lightsaber behind."}, {"tag": "h3", "text": "Rowan's interregnum"}, {"tag": "p", "text": "Despite her efforts to conceal the blade, Rowan subsequently discovered the Sith lightsaber while hiding inside the Eclipse Fighter during Naare's mission to rescue the Freemakers from the Hutt crime lord Graballa and his henchmen. Rowan stole the Sith lightsaber and later used it to convince his family of Naare's true identity. After fleeing Naare, Rowan brought it along to Takodana. Rowan briefly used the Sith lightsaber to confront several Varactyls during the Freemakers' mission to the Third moon of Takodana. However, he relented and made peace with the varactyls after realizing that the pirate Hondo Ohnaka had sent them to steal varactyl eggs."}, {"tag": "p", "text": "Rowan later wielded Naare's Sith lightsaber during a duel with Naare at the Emperor Palpatine Museum. Naare eventually gained the upper hand and retook her Sith lightsaber. Before she could kill Rowan with both her Jedi and Sith lightsabers, Rowan used the Force to collapse an N-1 starfighter on display above. This triggered a chain explosion that destroyed the Museum. Before the museum collapsed, Rowan stole Naare's blue lightsaber and left Naare with her red Sith lightsaber."}, {"tag": "h3", "text": "Hunting the Freemakers"}, {"tag": "p", "text": "After tracking down the Freemakers to the junkyard world of Zoh, Naare activated her Sith lightsaber during a confrontation with the Freemakers. Before she could fight Rowan, the former Sith clone Jek-14 and urged the Freemakers to leave. Naare and Jek-14 then used their Force powers to summon and hurl large pieces of debris and junk at each other. Naare then used the Force to bury Jek-14 beneath a mountain of rubble. Naare and Graballa then pursued the Freemakers to Hoth, where the seventh Kyber Saber crystal was hidden. However, Jek survived the skirmish."}, {"tag": "p", "text": "Following a skirmish involving the Freemakers' improvised walkers and Naare and Graballa's starships, Naare activated her Sith lightsaber when confronting Rowan. However, she was run over by the Imperial officers Durpin and Plumestriker, who were fleeing a mother wampa and her child."}, {"tag": "p", "text": "Naare later brought the Sith lightsaber when she and Graballa's forces when to ambush Rowan's older brother Zander and older sister Kordi Freemaker at the Freemaker Garage aboard the Wheel. She was about to torture Zander and Kordi with her lightsaber when Rowan returned with Roger and engaged her in a lightsaber duel. Despite Rowan's improved lightsaber skills, Naare still managed to steal Roger's head. After overpowering the Freemakers, she used her Force powers to drive out Graballa and his henchmen."}, {"tag": "p", "text": "Naare then reforged the Kyber Saber and launched an attack on the galactic capital of Coruscant in a failed bid to overthrow Palpatine. After Rowan Freemaker used the Force to summon the Kyber Saber out of her hands, Naare ignited her Sith lightsaber. Rowan used the Kyber Saber to build several walls but Naare sliced through them with her Sith lightsaber. However, Rowan used the Kyber Saber to summon debris which enveloped Naare, causing her to drop her lightsaber. Ultimately, Rowan decided not to kill her and fled with the stolen Kyber Saber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Naare's Sith lightsaber first appeared in the first season of LEGO Star Wars: The Freemaker Adventures, which ran on Disney XD from June 20 to August 29, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}