{"url": "Naare", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Females", "Category:Force-sensitives", "Category:Humanoids", "Category:Personnel of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Naare"}, {"tag": "p", "text": "Naare was a Force-sensitive humanoid female Sith who served the Galactic Empire. During the Galactic Civil War, she was tasked by Emperor Palpatine and Darth Vader with locating the Kyber Saber. In the course of her mission, Naare encountered the Force-sensitive Rowan Freemaker; who was a member of the Freemakers, a family of scavengers. She pretended to be a Jedi and offered to train Rowan in the ways of the Force. Over time, her Sith tendencies began to show and the Freemakers gradually realized that she was a Sith agent of the Empire."}, {"tag": "p", "text": "After losing Rowan, Naare joined forces with the Hutt crime lord Graballa and his henchmen to hunt down Rowan and obtain the Kyber Saber crystals. Graballa wanted half the Kyber crystals so that he could build a resort. Working together, Naare and Graballa managed to collect all but one of the Kyber crystals. Following a lengthy pursuit throughout the galaxy, Naare managed to lure Rowan out of hiding by torturing his brother Zander and sister Kordi. Rowan proved to be a tough opponent for Naare during a confrontation at the Freemaker Garage."}, {"tag": "p", "text": "However, Naare learned about the location of the last Kyber crystal from Rowan's B1-series battle droid Roger. Using Roger's head, she discovered the location of the last crystal and reforged the Kyber Saber. Armed with the new weapon, she rebelled against the Emperor and used the Kyber Saber to inflict heavy casualties on Imperial forces in Coruscant. Despite crowning herself as Empress, she was thwarted by Rowan Freemaker who reclaimed the Kyber Saber and destroyed it by throwing it into the volcanoes of Sullust. Naare was then kidnapped by Graballa, who had her frozen in carbonite as punishment for her treachery."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Meeting the Freemakers"}, {"tag": "p", "text": "During the Galactic Civil War, Naare was sent by the Sith Lords Emperor Palpatine and Darth Vader to the planet Nal Kapok to find the Kyber Saber. She instead found Rowan Freemaker and his B1-series battle droid companion R0-GR and saved them from a dianoga. She then told Rowan about the Kyber Saber, and how it was broken into separate kyber crystals. Later, she helped Rowan rescue his siblings, Kordi Freemaker and Zander Freemaker, from stormtroopers. After escaping Nal Kapok, Naare accompanied the Freemakers to their garage in The Wheel, a space station in the Abrion system."}, {"tag": "p", "text": "However, she was secretly an agent of the Galactic Empire. When she was alone, she contacted her Sith masters, who expressed dissatisfaction with her lack of progress in obtaining the kyber crystals. Naare defended her actions by saying that she needed to gain the boy's trust and pointed out that Rowan could lead them to the crystals. Her explanation satisfied Palpatine, who added that she should be ready to consider other alternatives. Naare concurred and ignited her red lightsaber."}, {"tag": "h3", "text": "Trouble with Graballa"}, {"tag": "p", "text": "After gaining the trust of the Freemakers, Naare began training Rowan in the ways of the Force. Her first lesson was to teach him how to levitate a brick. The young twelve-year old was bored and began playing with her blue Jedi lightsaber until Naare told him to concentrate. Seeking the Kyber Saber crystals, Naare then showed Rowan a holomap and asked him to let the Force guide him. Rowan detected the presence of a kyber crystal in the Belgaroth asteroid field. Naare then tried to convince Rowan's older sister Kordi to let her take her brother there. When Kordi refused, Naare tried to play a mind trick on her. However, her mind trick failed and are argument broke out between the two."}, {"tag": "p", "text": "While Naare remonstrated with Kordi, Rowan took the opportunity to leave with Roger on one of Zander's \"Z-wings\" for the Belgaroth asteroid field. There, Rowan and Roger discovered that a Hutt crime lord named Graballa had obtained the kyber crystal for himself. Meanwhile, Naare and the other Freemakers traveled to the Belgaroth system in separate vessels; with Naare traveling in her personal starship, the Eclipse Fighter and the Freemakers in their ship the StarScavenger. Rowan and Roger were quickly captured by Graballa, who attempted to feed them to his nexu Smiley."}, {"tag": "p", "text": "While Kordi and Zander distracted Graballa by trying to sell a Z-wing made out of junk, Naare freed Rowan and Roger and managed to silence Smiley with the Force. Graballa rejected the deal and spotted Naare trying to sneak away with Rowan and Roger. A gun battle soon broke out inside Graballa's space station. Naare, the Freemakers, and Roger managed to escape in their Z-wing and smashed a hole through Graballa's space station. In the process, Graballa's kyber crystal was also sucked into the vacuum of space. Graballa dispatched several starfighters after the intruders."}, {"tag": "p", "text": "The Freemakers and Naare fled into the Belgaroth asteroid field. After their Z-wing took several hits, Naare used the Force to carve a path through the field and to destroy several of Graballa's starfighters with asteroids. Graballa's bounty hunter Dengar narrowly escaped being hit by an asteroid. After escaping Graballa's henchmen, the Freemakers and Naare returned to their ships. While reflecting on the day, Rowan regretted causing his siblings trouble and Naare to lose her kyber crystal. Naare overheard the conversation and was visibly enraged. Before she could destroy the StarScavenger with her ship's laser cannons, Rowan sensed the presence of the second kyber crystal. After the boy recovered it, Naare professed to be proud of her student."}, {"tag": "h3", "text": "Rescuing Zander"}, {"tag": "p", "text": "Later, back at the Wheel, Naare received a call from Darth Vader, who demanded an update on the kyber crystals since his master was getting impatient. Their conversation was interrupted by Rowan and Kordi, who had come to seek Naare's help. Their older brother Zander had been taken captive by the Imperial Star Destroyer Vendetta after taking out Wick Cooper's vintage N-1 starfighter on a joyride. Naare was initially unwilling to help and suggested that losing Zander would mean one less mouth to feed. This shocked Kordi but Rowan saw it as a test of his ability to become a Jedi."}, {"tag": "p", "text": "Naare reluctantly agreed to help but insisted on traveling in her own ship, the Eclipse Fighter. Meanwhile, the Freemakers traveled in a modified Class-D cargo container fitted with TIE solar panels. Despite a faulty transponder, the Freemakers managed to land in the Vendetta's hangar bay. Naare followed suit and knocked out two stormtrooper sentries by slicing the floor under them. When Rowan asked how she got permission to land, Naare claimed that her ship had a cloaking device. Kordi was suspicious but Naare reminded them that they had to save Zander."}, {"tag": "p", "text": "Naare and the Freemakers made their way to the detention block. On the way, they passed two Imperial officers who saluted Naare, recognizing her. When the Freemakers noticed, Naare claimed she played a mind trick on them. Naare then pretended to use the Force to unlock Zander's cell. Heading back to the hangar bay, Naare and the Freemakers were corned by Darth Vader. Naare slipped away into the garbage chute, leaving her friends to face the Sith Lord and his stormtroopers alone. After Darth Vader took the N-1 starfighter on a joyride, Naare ordered the TIE fighter pilots to pursue the ship, claiming that the rebels had escaped on it."}, {"tag": "p", "text": "After the rebels managed to recapture the N-1 starfighter, Naare and the Freemakers returned to The Wheel. After parking the Eclipse Fighter, she slipped away to let the Freemakers deal with Cooper, who was incensed by the damage done to his starfighter by Zander's joyride."}, {"tag": "h3", "text": "Trip to Cloud City"}, {"tag": "p", "text": "While training Rowan how to levitate objects, Naare received a private hologram call from the Emperor and Darth Vader, who asked her about the progress of finding the Kyber Saber. When Naare told them that she had only recovered two Kyber crystals, Vader suggested that the boy was deceiving her. Later, she learned from Roger that the Freemakers had traveled to Cloud City in the gas giant Bespin on a special mission for Lando Calrissian. Naare traveled to Cloud City on the Eclipse Fighter in the hope of finding the third Kyber crystal. The mission was complicated by the presence of Graballa's henchmen Dengar, Baash, and Raam; who were hunting for Rowan."}, {"tag": "p", "text": "While on Cloud City, Naare was contacted by the Emperor and Vader who threatened her should she fail in her mission. Naare was soon caught up in a struggle between the Freemakers, Graballa's henchmen, and several stormtroopers. Despite much difficulty, the Freemakers and Naare managed to escape with Lando's special treasure back to The Wheel, while Naare was knocked unconscious thanks to a hit on the head from Lando's suitcase. Once regaining consciousness, she learns that the special treasure was Lando's cape, as she passed out again, this time from shock and frustration."}, {"tag": "h3", "text": "Keeping up the disguise"}, {"tag": "p", "text": "Later, Naare stayed behind at the Wheel while the Freemakers traveled to Kashyyyk to obtain a wroshyr wood dashboard for the Twi'lek captain Ignacio Wortan. Following an adventure, the Freemakers and Roger managed to obtain the dashboard and the third piece of the Kyber Saber. Naare praised Rowan after her apprentice presented the third Kyber Saber crystal to her."}, {"tag": "p", "text": "While the Freemakers entertained the rebels Princess Leia Organa and Luke Skywalker, Naare traveled to the Imperial Palace on Coruscant for a progress report with the Emperor and Darth Vader. The two Sith Lords quizzed her relentlessly about her progress in obtaining the Kyber Saber crystals. A visibly angry Naare later returned to The Wheel where she was greeted by Rowan, who had returned from a trip with Skywalker. When Rowan presented her a flower, it began to wilt. As a result, Rowan came to suspect that she was a Sith."}, {"tag": "p", "text": "Following the visit to Coruscant, Darth Vader and the Emperor continued to torment her about her lack of progress in obtaining the Kyber crystals. After conferring with the two Sith Lords by hologram, she discovered that the Freemakers had left for the desert world of Tatooine. Zander had been offered a job by the podracer pilot Ben Quadinaros, who was participating in the 29th Annual Bricklayers' race at Mos Espa. However, Graballa had set a trap to capture Rowan and obtain the Kyber Saber crystals."}, {"tag": "p", "text": "After the race, the Freemakers were pursued by Graballa's henchmen and took refuge in a wrecked sandcrawler. Unable to return to the StarScavenger, Zander and Kordi appealed to Naare for help. The undercover Sith traveled to Tatooine on her Eclipse Fighter and fought with Graballa's henchmen. She managed to rescue Rowan and hid him inside the Eclipse Fighter. While she rescued Zander, Kordi, and Roger from Graballa's henchmen, Rowan discovered that she owned a Sith lightsaber; confirming that she was indeed a Sith. While the Freemakers and Naare traveled back to The Wheel, Rowan hid her Sith lightsaber."}, {"tag": "h3", "text": "Cover exposed"}, {"tag": "p", "text": "Following the events on Tatooine, Rowan told the other Freemakers and Roger about Naare's true Sith identity. Later, Naare visited the Freemaker garage only to be told they were asleep. However, Naare overheard the other Freemakers speaking and used her blue lightsaber to force her way into their garage. She discovered the Freemakers preparing to depart on the StarScavenger. When Rowan confronted her, Naare responded that the Jedi were gone and that she had helped hunt down and destroy them. Following a brief struggle, the Freemakers managed to flee on their ship."}, {"tag": "p", "text": "Naare pursued the StarScavenger on her Eclipse Fighter and managed to knock out the ship's rear deflector. Zander then steered the Freemakers' ship into space traffic in an attempt to lose Naare. During the pursuit, she contacted them via hologram and offered to spare their lives if they handed Rowan over. However, Zander managed to clip the Eclipse Fighter's wings and flee into hyperspace. Humiliated, Naare returned to the Freemaker's garage in her wrecked fighter only to run into Graballa and his henchmen. After learning that Graballa wanted to use the proceeds from the Kyber Saber crystals to build a beachside resort and buffet, Naare proposed that the two factions work together to hunt down Rowan. In return for Graballa's crew repairing her ship, Naare proposed that they split the Kyber crystals; a deal which Graballa happily accepted."}, {"tag": "h3", "text": "Alliance with Graballa"}, {"tag": "p", "text": "Since Naare had obtained the Kyber Saber's hilt and two Kyber crystals, the Freemakers decided to collect the other crystals first before she could reassemble the Saber. However, Naare learned about their plans and movements through a tracker she had planted on Roger's transmission pack on Tatooine. Naare traveled with Graballa's starship Rancor's Fist to Takodana where she stole the fourth Kyber Saber crystal, which Maz Kanata had given Rowan. She then departed on the Eclipse Fighter."}, {"tag": "p", "text": "The Freemakers then traveled to the ocean world of Ningoth where they obtained another Kyber crystal with a giant anglerfish in return for bartering their Bubbly Snubbly's spotlight. However, Naare and Graballa learned of their presence and traveled to Ningoth. Following a struggle, Naare managed to obtain the fifth Kyber crystal and departed into space with Graballa's ship. When Graballa complained about the damage that the seawater had caused to the Rancor's Fist's engines, Naare reassured him that she had a way to track the trash-pickers."}, {"tag": "p", "text": "Naare and the bounty hunter Dengar then followed the Freemakers to Naboo where they cornered them at the Theed Hangar, which was now part of the Emperor Palpatine Museum. Naare engaged Rowan in a lightsaber duel and quickly overwhelmed the young boy with her mastery of the dark side. Before she could finish off Rowan, he collapsed a nearby N-1 starfighter, which triggered an explosion that devastated the Museum. Naare managed to retrieve the sixth Kyber Saber crystal but the Freemakers escaped into space. Monitoring the Freemakers, she discovered that the seventh crystal was on the frozen world of Hoth."}, {"tag": "p", "text": "However, the Freemakers realized that Naare was monitoring them and instead traveled to the junkyard world of Zoh after disabling Roger's transmitter. There, the Freemakers encountered the former Sith clone Jek-14, who revealed himself as the Maker of Zoh. Jek-14 reluctantly trained Rowan in the ways of the Force. However, the Freemakers encountered trouble when the droid N-3RO convinced the other droids that the Freemakers posed a threat to their idyllic existence. When Roger objected to N-3RO's actions, the B1-series battle droid reattached his transmitter; immediately alerting Naare in an attempt to save the Freemakers and Jek-14."}, {"tag": "p", "text": "Naare and Graballa arrived and quickly engaged the Freemakers and Jek-14. Naare took on Jek-14 in a Force duel and told the Freemakers to leave while he fended off the Sith. When Naare taunted him for being a failure, Jek replied that it was better than being a Sith pawn. Eventually, Naare succeeded in seemingly crushing him to death by burying Jek under a mountain of junk. Rowan and his family escape and challenged Naare and Graballa to a race to Hoth, where the last crystal lay. Naare and Graballa pursued the StarScavenger to Hoth."}, {"tag": "h3", "text": "Confrontation on Hoth"}, {"tag": "p", "text": "Naare and Graballa traveled on their starships to Hoth. As they pursued the StarScavenger, the Eclipse Fighter and the Rancor's Fist was caught in a violent snowstorm. While Graballa and his men were unable to see through the avalanche, Naare was able to sense the StarScavenger through the Force. She managed to fire on the StarScavenger but Rowan managed to repair the damage with the Force. The Freemakers managed to dodge a mountain but Naare and Graballa's ships collided with it. Naare, Graballa, and his henchmen survived the crash but were bruised."}, {"tag": "p", "text": "Eventually, Rowan and his siblings managed to obtain the seventh Kyber crystal and managed to seek shelter at Echo Base, which was now occupied by two Imperial officers Durpin and Plumestriker. Plumestriker managed to alert Naare, who rushed over to Echo Base with Graballa's forces. The Freemakers managed to muster a snowspeeder and an AT-AT walker to fight Naare and her allies. During the skirmish, Naare managed to shoot down Rowan and Zander's snowspeeder before being shot down by Kordi's walker. In response, Naare unleashed an avalanche which toppled the AT-AT walker that Kordi and Roger was riding. Before she could confront the Freemakers, she was trampled by Durpin, Plumestriker, and the pursuing wampas."}, {"tag": "p", "text": "The Freemakers managed to hide in a cave but Naare contacted them via hologram. She issued an ultimatum offering to let the Freemakers leave if Rowan relinquished the last Kyber crystal to her. Rowan pretended to comply but handed Naare and her allies an ice crystal instead. Naare attempted to reassemble the Kyber Saber but it shattered into fragments. By the time she realized the Freemakers' deception, the Freemakers has escaped Hoth aboard the Star Scavenger. In an attempt to prevent Naare from obtaining the seventh crystal, Rowan and Roger departed on a shuttle to an unknown planet."}, {"tag": "h3", "text": "Trap on the Wheel"}, {"tag": "p", "text": "Without Rowan and with the transmitter on Roger disabled, Naare and Graballa were unable to find the seventh Kyber Saber crystal. Naare was annoyed when Emperor Palpatine called her up to remind her that Empire Day was approaching and that he wanted the Kyber Saber as a gift. When Graballa tried to cheer Naare up by telling her he had spies all over the Galaxy looking for Rowan, she used the Force to hurl Graballa and his entourage out of the room. While meditating, Naare received news from Graballa that his spies had spotted Zander and Kordi. Naare then came up with a plan to lure Rowan out of hiding by hurting his older siblings."}, {"tag": "p", "text": "Putting her plan into action, Naare and Graballa traveled to the Freemaker Garage on the Wheel where they cornered Zander and Kordi. Despite being put into chains, the two Freemakers refused to cooperate. However, Naare decided to torture them psychologically by destroying several of their belongings. She damaged Zander's ship StarScavenger and starships and burned Kordi's credits. Naare succeeded in luring Rowan and Roger back to The Wheel. Before Naare could commence on a second round of torture, Rowan and Roger arrived back on their ship."}, {"tag": "p", "text": "In Naare's absence, Rowan had improved his lightsaber combat skills and his mastery of the Force. During the duel, Naare demanded to know the location of the seventh Kyber crystal only for Rowan to reveal that he had left it behind on the unknown planet. After a prolonged round of fighting, a frustrated Naare demanded that Rowan reveal who had trained him. At that point, Roger interjected and revealed that he had indirectly trained the boy by letting him view footage of several Jedi from the Clone Wars including Mace Windu, Obi-Wan Kenobi, and Anakin Skywalker."}, {"tag": "p", "text": "Naare quickly realized that Roger knew the location of the last Kyber Saber crystal and beheaded the droid with a swish of her lightsaber. After taking Roger's head, she used the Force to trap Zander, Kordi, and Rowan under rubble. When Graballa demanded that Naare honor her side of the deal to give him half of the Kyber crystals, Naare double-crossed the Hutt and used the Force to drive Graballa and his men out of the garage. She then used Roger's head to access the planet's location and departed on the Eclipse Fighter. However, the Freemakers survived and resolved to stop her from harnessing the Kyber Saber."}, {"tag": "h3", "text": "Showdown on Coruscant"}, {"tag": "p", "text": "Using the information store in Roger's head, Naare traveled to the unknown planet where Rowan had hidden the seventh Kyber Saber crystal. The droid tried to reason with her but Naare was determined to reforge the Kyber Saber. After assembling the Kyber Saber, Naare was contacted by Emperor Palpatine, who was celebrating Empire Day and was annoyed that Naare was touching his prized weapon. However, Naare told the Sith Lord that she was determined to be Empress and vowed to shatter her master into a thousand pieces. Meanwhile, Rowan came up with a plan to trick Naare into handing the Kyber Saber to him by posing as Emperor Palpatine."}, {"tag": "p", "text": "Forewarned, Emperor Palpatine assembled a fleet of TIE fighters, Gozanti cruisers, and two Imperial-class Star Destroyers to intercept Naare. However, the Sith used her Kyber Saber to destroy the Imperial fleet. After smashing through the Imperial defenses, Naare landed at the Imperial Palace, which had once been the Jedi Temple. She marched into Palpatine's office only to encounter a cloaked Rowan. Before Naare could kill Rowan, Palpatine returned with reinforcements in the form of two AT-AT walkers, which he used to blast the palace."}, {"tag": "p", "text": "Using the Kyber Saber, Naare quickly disabled the two AT-AT walkers. She then climbed to the spire of the Imperial Palace and proclaimed herself Empress. Naare was met with boos and jeers from an assembled crowd of Imperial citizens that included Wick Cooper. Enraged, Naare used the Force to levitate their platform and to shatter it in midair. Fortunately for the citizens, they were saved by Kordi and Zander, who were flying the StarScavenger. At the height of her power, Naare was challenged by Rowan, who used the Force to summon the kyber crystals to him. As a result, the Kyber Saber shattered and reformed in Rowan's hands."}, {"tag": "p", "text": "Screaming furiously, the Sith savagely attacked the young Freemaker. Following a brief struggle, Rowan used the Force to summon debris and trap Naare. Emperor Palpatine, who was witnessing the skirmish, urged Rowan to kill the rebellious Sith. However, the Freemaker took the opportunity to escape with the Kyber Saber to the StarScavenger which fled through Coruscant's cityscape. Despite the best efforts of the Imperial military to stop the Freemakers, they managed to flee into hyperspace following a protracted skirmish. While Palpatine was distracted, Naare attempted to flee only to be cornered by Graballa, Dengar, Baash, and Raam. She was put into chains and subsequently frozen in carbonite by Graballa as retribution for breaking their deal."}, {"tag": "h3", "text": "Frozen in carbonite"}, {"tag": "p", "text": "During a mission to obtain embersteel wings from Graballa, Kordi found Naare, who was still frozen in carbonite, aboard Graballa's starship Rancor's Fist."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Naare was a light-skinned black-haired humanoid woman with white facial tattoos. She wore Jedi robes and wielded blue- or a red-bladed lightsaber depending on whether or not she wanted to pass herself off as a Jedi. When Naare revealed her dark side nature, her eyes turned yellow and her tattoos turned red. While Naare tried to pose the persona of a kindly Jedi Master, she was a manipulator who sought to obtain the Kyber Saber crystals for Emperor Palpatine and, ultimately, herself. Her malevolence manifested on several occasions as in her failed attempt to play mind trick on Kordi Freemaker and frequent outbursts of anger."}, {"tag": "p", "text": "While Naare claimed that she was a Jedi Master who could instruct Rowan in the ways of the Force, she was merely trying to use the boy to find the Kyber Saber crystals. As a Sith impostor, Naare was not an effective and patient teacher. Naare also did not honor agreements that she made with other people including the Hutt crime lord Graballa. Despite making an agreement to share the Kyber Saber crystals with him, Naare later reneged on the deal so that she could reforge the Kyber Saber. Naare had an antagonistic relationship with her Sith masters Emperor Palpatine and Darth Vader, whom she hated for reminding her of her failures. After obtaining the Kyber Saber, Naare was consumed by delusions of power and greed and attempted to overthrow Emperor Palpatine."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Sith, Naare was skilled in lightsaber combat and could also summon the Force to levitate various objects. She was capable of using the Force to devastate buildings and to hurl large numbers of individuals. She owned both a red and blue lightsaber; the latter of which fell into the hands of Rowan. Naare's Force powers were enhanced by the Kyber Saber, which allowed her to destroy many ships and structures with relative ease. In addition, Naare was a skilled pilot and owned a starship called the Eclipse Fighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Naare is voiced by Grey Griffin and serves as the primary antagonist of the non-canon 2016 Disney XD children's animated television series LEGO Star Wars: The Freemaker Adventures. Pablo Hidalgo hinted that Dryden Vos, the main antagonist in Solo: A Star Wars Story could be the same species as Naare, given that they both appear to be physically identical to Humans save for their color-changing facial tattoos."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}