{"url": "Naboo_Abyss/Legends", "categories": ["Category:Legends articles", "Category:Bodies of water", "Category:Naboo locations", "Category:Natural formations"], "nodes": [{"tag": "h1", "text": "Naboo Abyss"}, {"tag": "p", "text": "The Naboo Abyss was the general term used to describe the labyrinth of cavernous tunnels and lava tubes that permeated from the surface of Naboo to its plasmic core."}, {"tag": "h2", "text": "Geology"}, {"tag": "p", "text": "The intricate network was formed over many eons as the plasmic magma of the core seethed and simmered away its rocky surroundings. The Abyss was largely submerged in a vast, underground ocean. Plasmic bursts would, at times, heat the water to extreme temperatures before erupting on the surface."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Gungans had populated the underwater realm for seven millennia. Aquatic vehicles, such as the tribubble bongo, were used for travel purposes. The Gungans dominated the upper regions of these 'underwaterways', which served as highways between their underwater cities: the Paonga Strait beneath Lake Paonga connected Otoh Gunga to the Gungan sacred place."}, {"tag": "p", "text": "In 32 BBY, Qui-Gon Jinn, Obi-Wan Kenobi, and Jar Jar Binks traveled through the lowest regions of the Abyss (very near to the core) to reach the capital city of Theed on the other side of the planet, per the request of Boss Nass. Boss Nass felt secure in the knowledge that they would fail to successfully navigate the treacherous waters."}, {"tag": "h2", "text": "Fauna"}, {"tag": "p", "text": "The Abyss was notorious for its massive, carnivorous beasts. The colo claw fish and sando aqua monster were two of the largest sea creatures to inhabit the region, the latter which grew to sizes exceeding 200 meters. The opee sea killer made regular use of rocky outcroppings for ambush attacks."}, {"tag": "p", "text": "Many species had bioluminescent patterns or patches on their skin, which helped them identify themselves to others, locomote in the dark and attract prey. Others had sophisticated ocular abilities which helped them illuminate the darkness. Most were cold-blooded or had developed surface-area to body mass ratios that would allow them to preserve their body heat and ration energy. The laa, yobshrimp, tee, mee, see, ray, and faa all lived in the Abyss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}