{"url": "Naboo_(people)/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Human races", "Category:Naboo", "Category:Planetary cultural groups"], "nodes": [{"tag": "h1", "text": "Naboo  (people)"}, {"tag": "p", "text": "The Naboo (singular \"Naboo\"), sometimes known as the Royal Naboo, were the Human inhabitants of the planet Naboo. They were not native to the world, but they became the dominant intelligent life-form there."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Naboo descended from the Grizmalltian Humans who fled a violent revolution on their planet. Led by spacer Kwilaan, they colonized Naboo and settled in the mountains and great grass plains around 3900 BBY. For a time, the stranded colonists lived as a nomadic tribe and wandered in the Gallo Mountains in search of a site they could settle. They subsequently arrived at the Dee'ja Peak, and they started a farming community on that land, equipped with wind turbines. Over time, other communities were founded, and they gradually evolved into cities."}, {"tag": "p", "text": "At first, the colonists clashed with the indigenous Gungans, a species of land-dwelling amphibians. After years of bloody conflicts between the two people, those who had renamed themselves \"the Naboo\" chose to reinvent their culture. They decided to place pacifism and rationalism above all other values, and elected a queen to govern themselves. The Naboo had changed from a group of greedy adventurers to a pacific society with a tradition of selecting their rulers based on intelligence rather than might."}, {"tag": "p", "text": "Around 868 BBY, Republic officials approached the descendants of the Grizmalltian colonists with an offer to join. Despite their current difficulties, the Naboo accepted. While they remained spatially isolated from the rest of Republic space, the Naboo soon began trading with other systems."}, {"tag": "p", "text": "Cultural differences led to tension between the two peoples—but direct conflict was rare. Over time there was more conflict between the various Human settlements than between the Naboo and Gungans. The Gungans believed the Naboo to be \"pompous cowards\" while the Naboo believed the Gungans to be \"barbarians.\" This attitude lasted until Queen Amidala united the Gungans and Naboo to fight the Trade Federation in the Battle of Naboo."}, {"tag": "p", "text": "Naboo politics often involved large numbers of teenaged Naboo in government work, a result of the Naboo ideal of valuing inner purity and innocence over political ability. This often resulted in individuals receiving positions far beyond their own level of competence and being left vulnerable to manipulation, such as the case of Queen Amidala and Senator Palpatine."}, {"tag": "h2", "text": "Culture"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "Naboo was a sparsely inhabited planet, shared by two intelligent species: the native Gungans and Humans, who immigrated from the Core World Grizmallt. Due to Naboo's relative isolation from the rest of the galactic community, no other sapient species had settled on the planet by 32 BBY, although ethnographers linked to the Galactic Republic correctly predicted this scenario would likely change in the following decades, given the planet's attempt to increase interstellar commerce. During Queen Jamillia's reign, Naboo loosened immigration restrictions and accepted Clone Wars refugees, which totaled 625 million beings. By 1 BBY, the long-distance travel company Naboo Spacelines was active. Indeed, given time, the number of offworlders on Naboo grew to up to 1% of the total planetary population."}, {"tag": "p", "text": "The thinly scattered settlements on Naboo were mainly dedicated to ranching and mining, and concentrated in the main and southern landmasses. They were separated by large tracts of land, and the Naboo historically didn't shown much interest in the commercial development of these wilderness areas."}, {"tag": "p", "text": "Artistic and intellectual pursuits were the main drive in Naboo society, while also embracing nonviolence and rationalism in dispute resolution, never resorting to physical aggression. The Naboo were known for their love of peace, cordiality and warmth. Strangers would be met with smiles, bows and helpfulness by the planet's residents. The natives felt there was an art to living, and their cuisine, architecture and clothing all reflected this assumption. Xenosociologists postulated that the Naboo emphasis on pacifism and art was a reflection of a cultural bias, instead of a genetic predisposition, since the Naboo were never completely shut off from the rest of the galactic community for enough time for them to evolve into a separate species. Much like Alderaan, the planet Naboo prided itself on peace and diplomacy, and its capital Theed was a popular Star Tours destination due to its long, rich history and the fact that important figures in galactic history such as Padmé Amidala and Palpatine hailed from the planet."}, {"tag": "p", "text": "Community service was mandatory for all citizens between the ages of 12 and 20."}, {"tag": "p", "text": "Privacy was very valuable to the Naboo. Around 18 BBY, the planet maintained no global registry of citizens, as people seemed to know each other through a system of clans and families. After Amidala's death, Naboo customs prevented questions on the fatherhood of her twins, and no medical reports were drafted."}, {"tag": "p", "text": "Both Gungan and Naboo cultures had a strong relationship with water, although the Nabooans believed that the restorative and meditative qualities of this element were best regarded from dry land, unlike the Gungans, who built their society underwater. Gungans revered nature and attempted to harmonize it with their civilization, while the Naboo followed a similar philosophy."}, {"tag": "p", "text": "The city of Moenia was considered a retreat for artists and intellectuals by the time of the Galactic Civil War."}, {"tag": "h3", "text": "Interspecies relations"}, {"tag": "p", "text": "The Naboo were raised to think of the amphibious Gungans as barbarians. Gungans, in turn, were offended that many of the Naboo would think themselves superior to the natives."}, {"tag": "p", "text": "Both societies were greatly intertwined economically, if not politically. Traders on the fringes of Naboo towns carried on vital commerce between them and the native Gungans."}, {"tag": "p", "text": "After the Trade Federation invasion of the planet, Gungans and Naboo increased cooperation in defense policy. Both groups developed action plans to resist future possible sieges and exchanged technologies. The Gungans' shield expertise, allied with the Naboo power-generation technology, allowed for a global defense system that was capable of quickly repelling orbital bombardments and intrusive landings. This new defense policy received widespread support from the populace."}, {"tag": "h2", "text": "Language"}, {"tag": "p", "text": "The Human Naboo possessed their own distinct language, although many of them also spoke Galactic Basic Standard. Omar Berenko's epic poem \"Defense of Naboo\" was a notable example of a work written in the Naboo. They also developed their own alphabet, known as Futhark, a style of traditional, handwritten calligraphy which was derived from the Royal Script of Grizmallt. While Futhark was the official form, the reliance of all of its letters on ovals made it hard to read. This difficulty led to an adaptation to the more practical Futhork. In the last decades of the Galactic Republic, the art of writing in Futhork was still taught at schools, although even the farmers could write in both Futhork and Aurebesh fluently. In the height of the New Republic, the use of the Futhork alphabet was already three and a half millennia old."}, {"tag": "h2", "text": "Philosophy"}, {"tag": "p", "text": "Naboo philosophy emphasized the concept of \"peaceful existence,\" although this idea started to gradually erode during the Separatist Crisis."}, {"tag": "p", "text": "The planet had a significant percentage of acclaimed philosophers, as a result of an educational system that actively stimulated artistic and intellectual skills. Some of them eventually became so famous and important that they were immortalized as monumental statues on the forecourt of Theed Royal Palace and over the balustrade of the Theed Coliseum. Governor of Naboo Sio Bibble was a notable philosopher from the planet."}, {"tag": "h2", "text": "Art"}, {"tag": "p", "text": "Naboo culture was primarily focused on art and learning, and by the time of the Trade Federation's invasion of the planet, it had gained a considerable reputation for having some of the most accomplished artists and philosophers in the galaxy. Additionally, artisans, architects and urban planners were all valued highly in Naboo society."}, {"tag": "h3", "text": "Architecture"}, {"tag": "p", "text": "With the reign of King Jafan, the Naboo entered an era of unparalleled prosperity, which gave them the opportunity to focus on education and all kinds of art, including that of architecture. Along with urban planners and artisans, architects came to be highly regarded in the Naboo society, and one of the monarch's closests advisors bore the title of Chief Architect."}, {"tag": "h4", "text": "Underlying philosophy"}, {"tag": "p", "text": "The Naboo thought of their cities as further adornments to their homeworld's landscape, which prompted them to preserve as much of the planet's natural beauty as possible. From afar, a typical Naboo city looked like a sprawl of stone walls, peaked towers, gilded cupolas, and sculpted archways—the appearance of which acted as a counterpoint to the surrounding greenness. The whole capital city of Theed was considered to be the crown jewel of the Naboo architecture. It had been designed to radiate outward from the Royal Palace while making sure that central edifice would always the dominate the skyline. In the last decades of the Galactic Republic, the capital was noted for its harmonious unity of style, which was due to the extensive rebuilding it had gone through over time. The Naboo's permanent quest for architectural elegance was reflected even in the most practical buildings. For example, the Plasma Refinery Complex was noted for its regal appearance that was said to rival that of actual palaces elsewhere in the galaxy."}, {"tag": "h4", "text": "Characteristics"}, {"tag": "p", "text": "The dominant architectural style, referred to as \"classical Naboo style,\" featured extensive use of porticoes, domed roofs, and circular plans. Many important buildings, including the Theed University and most of the Royal Palace's structure, were rotundas. Even the structures with a polygonal base were often topped by one or several circular domes, although flat roofs were not rare. In truth, some of the most squarish buildings, such as the Guido's Tower or the Palace's Turret Room were noted for belonging to a more ancient style. Other prominent example of the circular plan was the Theed Coliseum, a large funnel-shaped sports stadium that stood on its own plaza, or the grand hemispherical Palace Courtyard. Other common types of buildings included tiered towers supported by round-topped archways."}, {"tag": "p", "text": "The typical Naboo cupolas were made of verdigris, while the walls of the building themselves were made of polished, light brown to yellow sandstone. The streets and plazas were also paved with sandstone-like flags, which could be laid out in a circular pattern. Sometimes, in villages and smaller town, the roofs were reddish-brown clay tiles. In the inside, the most prestigious buildings were walled with slabs of marble varying in color from gray to red. In addition to the many windows that doted most edifices, creating an atmosphere of serenity, flowering vines were allowed to grow freely on the walls. Filigreed bridges spanned across the many tributaries of the Solleu River that flowed through the city. Fountains were also a common sight, forming a distant backdrop to the ambient noise. The modern Naboo architecture seamlessly blended all those historic design facets with such technologies as communication systems, automatic doors and area-specific climate control. Contrary to what could be seen on city-planets such as Coruscant, they were very few towering skyscrapers on Naboo. The building's delicate color scheme and rounded rooftops gave them a very soft, comforting appearance. On the whole, with its low, convex, and condensed appearance, the classic Naboo architecture was the very antithesis of the Neo-Classical style favored in the cities of Muunilinst, where most buildings consisted of towering, angular and austere spires."}, {"tag": "h3", "text": "Music"}, {"tag": "p", "text": "Naboo maintained the Theed Music Hall, a theater where popular musical entertainment took place. The Hall contained a stage and a pit, from which specialized droids would come out and play music for the benefit of the audience. By the time of the Invasion of Naboo, harpist Hela Brandes was the Music Advisor for the Naboo Royal Advisory Council. Brandes would later join efforts with fellow musicians Bongiovi, Augara Jowil and Tofli Argala to persuade famous composer Beezar Pert to come out of retirement for a charity concert. The concert was held in the Theed Palace Plaza and sold out, with all profits being used to support children orphaned by the Clone Wars on both sides of the conflict."}, {"tag": "p", "text": "The Naboo also created a genre of music known as shudderup, although it was particularly disliked by the Gungans. Although often played in the streets for money, it was also the style of noted singer and quetarrist Bongiovi."}, {"tag": "h3", "text": "Literature"}, {"tag": "p", "text": "The Royal Archives of Naboo was an institution on the planet that was known to record historical documents, such as the personal memoirs of former Palace Guard Pars Varqom during the Invasion of Naboo and its aftermath. The archives had at least 2,453 volumes."}, {"tag": "p", "text": "The Naboo generally had good knowledge of poetry, as even the lowliest laborers could be seen debating the merits of one classical poet over another. Omar Berenko, one such poet, wrote \"Defense of Naboo,\" a poem considered by many to be disturbing yet imaginative. Galactic Emperor Palpatine, a Nabooan, was also a prolific writer on political topics, authoring books such as The Paths to Power (30 BBY), Absolute Power (19–18 BBY), Book of Sith (19–18 BBY) and Principles of Power (c. 16 ABY)."}, {"tag": "h3", "text": "Visual arts"}, {"tag": "p", "text": "Some of the art hailing from Naboo took the form of paintings that exhibited a style consisting of short, thick strokes of paint on a canvas, aiming to capture the essence of the subject, rather than its details. Its object of study could be either astronomical objects such as suns and moons or individuals. At least one painter based on an abandoned castle north of Theed employed this ensemble of techniques, around the final years of the Old Republic. In Theed itself, the Parnelli Museum of Art was home to objects of art."}, {"tag": "h3", "text": "Performing arts"}, {"tag": "p", "text": "The Theed Coliseum and the Naboo Puppet Theater both provided performing arts spectacles in the capital."}, {"tag": "h3", "text": "Symbols"}, {"tag": "h2", "text": "Lifestyle"}, {"tag": "p", "text": "The Naboo saw their refined way of life as a birthright."}, {"tag": "p", "text": "In cosmetics, the Naboo were known to enjoy perfumes and fragrances, as evidenced by the existence of a perfumery in the beach town of Port Landien."}, {"tag": "h3", "text": "Cuisine"}, {"tag": "p", "text": "Human Nabooans enjoyed wine, and produced certain kinds of rare or prestigious beverages, such as the Tarul, Blossom and Domaine de la Maison sur le Lac wines. The Domaine de la Maison sur le Lac was famous enough to be favored by high-ranking officials of the Galactic Senate of the Republic, such as Senators Padmé Amidala, Onaconda Farr, Bail Prestor Organa, Mon Mothma, and Lolo Purs. Certain criminal groups such as the Mummers were also known to produce and trade illegal alcoholic beverages and spices."}, {"tag": "p", "text": "The reptavian gamebird Nuna was highly appreciated for culinary use, and Gungans feasted on them during holiday festivities.[source?] Shaak pot roast, a dish based on roasted shaak meat, was also very popular on Naboo. In some special or formal occasions, the Naboo five blossom bread was served. For dessert, Theed was credited as the source of the plasma cloud, a fusion of Gungan and Naboo cuisines created during the cultural mingling post-Invasion of Naboo. Plasma cloud recipes required carefully infusing the egg whites of the Pikobi, a flightless avian native to Naboo, with plasma mined from the planet. When properly prepared, the resulting dish was considered light and refreshing."}, {"tag": "p", "text": "During wartime, the Royal Naboo Security Forces would build large animal nurseries and food processing centers, where collected food from Muja fruit bushes, farms and hunted or raised animals such as nerfs, banthas and fish would be processed."}, {"tag": "h3", "text": "Sports and hobbies"}, {"tag": "p", "text": "Racing sports were popular on Naboo. The city of Keren hosted the Keren City Street Race, which featured famous Podracers of the likes of Ben Quadinaros. After the planet's victory against the Trade Federation, the friendly Victory Races of Naboo were organized, and saw the participation of Naboo and Gungans alike. Naboo citizens also took up the fast-moving Odupiendo racing, and the planet was known for its tracks. Even though it was banned from most civilized star systems and extremely dangerous to Humans, Podracing was practiced on Naboo, as evidenced by the Lianorm Raceway, a 10.5 mile-long course set up on the planet."}, {"tag": "p", "text": "The planet was also the origin of the aquatic Theed quoits, a game played on water with a palm-sized ball known as a quoit. It was said to have evolved from a carnivorous fish hunting technique. Grand Admiral Gilad Pellaeon was known to play Theed quoits. In 1 ABY, the Aerie Casino opening near Moenia was marked by a blood sport competition between various exotic animals pitted against each other. The eventual winner was a Lokian flit, which defeated a Dathomiri malkloc in the final match."}, {"tag": "p", "text": "Children commonly played a game called Kaadu-and-aliens during the early Imperial Period."}, {"tag": "h3", "text": "Fashion"}, {"tag": "p", "text": "On Naboo, clothing was often used a form of social communication. For instance, during the Trade Federation invasion, the citizens of Theed made subtle use of Naboo color and fashion symbolism to express their support or opposition to the Queen Padmé Amidala's policies. The Education Regent of Naboo Lufta Shif wore gentle and flowing teaching robes, reflecting the belief that learning was best encouraged by inspiration rather brute force or threat. The Queen herself wore clothes that made her look taller and larger through the use of wide shoulders and massive headpieces. In fact, the use of Naboo royal costume was highly codified and one of the most intricate in the galaxy. High-ranking bureaucrats or politicians who employed refined fashion were sometimes derisively labeled \"stuffed shirts.\" Around the time of the Invasion, men often wore coats made of basketweave-like heavy fabric with typical Naboo-style bloused sleeves."}, {"tag": "p", "text": "The wealthy citizens of Naboo sometimes wore embroidered clothes ornated with Futhork calligraphy. In the same vein, some engineers of the Theed Hangar like Simon Jabesq would label their duty helmet with their name in Futhork letters."}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "In Naboo design, aesthetics were prioritized over utility, and handcrafted, elegant shapes were given preference. A fine example of the Naboo style was the J-type 327 Nubian royal starship, a diplomatic vessel that showcased artful contours and a mirroring silver chromium finish, fully hand-polished by artisans."}, {"tag": "h2", "text": "Science, technology and education"}, {"tag": "p", "text": "Under Queen Amidala's rule, professor Lufta Shif held the post of Education Regent in the Naboo Royal Advisory Council. Theed was home to a institutions of learning such as Theed University, the Royal Academy, the Theed Royal Library, the Royal House of Learning, the Theed School of Technology and Engineering and at least one private school. The city of Keren also maintained a municipal Government Education Center inside its City Government Complex."}, {"tag": "p", "text": "Among important science and technology companies from the planet were Plasma Energy Engineering, Naboo Technologies, Theed Arms, Theed Palace Space Vessel Engineering Corps, the Royal Engineers and the Gungan BullbaBong."}, {"tag": "h2", "text": "Media"}, {"tag": "p", "text": "The Naboo Herald was a notable news publication from the planet. Journalist Ista Kezever was a known collaborator by 1 ABY, publishing the article \"Galaxy in Review ... Intergalactic Report 12.1\" about changes in politics and technology. During Veruna's reign, politician Padmé Amidala was beloved by media outlets on the planet, nicknaming the Princess of Theed the \"Herald of the New Age.\""}, {"tag": "h2", "text": "Politics"}, {"tag": "h3", "text": "Law"}, {"tag": "p", "text": "Under Naboo law, the scent of millaflowers for therapeutic use could only be extracted and sold by licensed drug manufacturers."}, {"tag": "p", "text": "For Naboo judges, the murder of a Royal Naboo Security Forces officer was a most serious crime, only one step below assassinating the monarch."}, {"tag": "p", "text": "Despite the Naboo belief that biological age mattered little, the full legal adulthood among them was set at twenty-one, as opposed to a younger seventeen on both Corellia and Alderaan. Additionally, a youth could not be freed from the influence of a parent or guardian before reaching that age."}, {"tag": "h2", "text": "Social conventions"}, {"tag": "p", "text": "During funeral rites, grandmothers would usually dress the body of their grandchild and prepare it for the \"last journey.\""}, {"tag": "p", "text": "Bouquets of odorous millaflowers were popular gifts among the Naboo since ancient times. In fact, the gift of millaflowers had acquired a deep significance, which is why that practice was part of many meeting rituals, both on public occasions or on private encounters. By offering such a bouquet the giver would signify that he or she was pleased to be in the recipient's company. By accepting them, the recipient would express his or her trust toward the giver."}, {"tag": "h2", "text": "Festivities and holidays"}, {"tag": "p", "text": "The planet traditionally celebrated the anniversary of its adhesion to the Galactic Republic in a festivity known as the Festival of Light. Theed also hosted the annual Theed Festival of the Arts during the Galactic Civil War, where it showcased the work of some of Naboo's most prominent artists. At that time, the city of Moenia was one of the hosts of the annual Galactic Moon Festival, an event with eerie and ghoulish themes. It was organized by the Hutt crime lord Jabba Desilijic Tiure, and it saw regular participation of citizens and spacers, who dressed up in costumes handpicked by Jabba. The seaside town of Kaadara was also chosen the host of the second Ewok Festival of Love, held annually."}, {"tag": "p", "text": "The Naboo also gathered to celebrate naturally occuring events, such as the blooming of a pink flower that blossomed once every eighty-eight years and the springtime festival of Glad Arrival, held by the Pastoral Collective in Lake Retreat."}, {"tag": "h2", "text": "Famous Naboo"}, {"tag": "h3", "text": "Military"}, {"tag": "h4", "text": "Royal Security Forces (RSF)"}, {"tag": "p", "text": "Leaders of the RSF"}, {"tag": "p", "text": "Pilots and Soldiers"}, {"tag": "h4", "text": "Republic military personnel"}, {"tag": "h4", "text": "Imperial military personal"}, {"tag": "h3", "text": "Monarchs"}, {"tag": "h3", "text": "Other notables"}, {"tag": "h3", "text": "Politicians"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}