{"url": "Naboo_(people)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Human races", "Category:Naboo", "Category:Planetary cultural groups"], "nodes": [{"tag": "h1", "text": "Naboo  (people)"}, {"tag": "p", "text": "The Naboo (singular \"Naboo\"), also known as Naboolians, were a cultural group of humans from the planet Naboo. Contrary to the native Gungans, with whom they shared their world, the Naboo originated offworld as human colonists from Grizmallt. The Naboo aristocrats were known for their sartorial extravagance. Unlike the Gungans, who were a proud warrior species, the human colonists of Naboo were peaceful. This contrast of ideology caused tension between the two civilizations for centuries."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Naboo valued culture and beauty, which was reflected in their everyday attire. Children wore graceful clothes made of natural materials."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Naboo originated as a group of human colonists who fled the war-torn Core World of Grizmallt thousands of years before the Clone Wars. Led by Kwilaan, the colonists crashed on the homeworld of the Gungan species and established their presence there. They ventured into the Gallo Mountains and created a farming community at Dee'ja Peak."}, {"tag": "p", "text": "At first, the Gungans tried to avoid contact with the colonists, retreating in the planet's waterways. When the humans and Gungans finally met, however, their relations soon turned to hostility. After fighting over territory and resources for a long time, the two species eventually resolved to simply live apart and ignore each other."}, {"tag": "p", "text": "Following the end of their conflicts with the Gungans, the Naboo had to deal with internal wars, as their various city-states broke into factions and engaged in open warfare. Eventually, each side became unified in its own way, which heralded a Great Time of Peace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}