{"url": "Naboo_Royal_Advisory_Council/Legends", "categories": ["Category:Legends articles", "Category:Legislatures", "Category:Naboo organizations"], "nodes": [{"tag": "h1", "text": "Naboo Royal Advisory Council"}, {"tag": "p", "text": "The Naboo Royal Advisory Council was the governing body of the planet Naboo during the time of the Galactic Republic and later, the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Royal Advisory Council was formed to assist the Monarch of Naboo in managing day-to-day affairs, and was led by the planetary Governor from the capital city of Theed. The Council was made up of men and women in control of specific ministries in Theed, and included ministers for architecture, music, the sciences, and education. The governor of Rori also had a seat on the council. It was noted that there had never been a minister of war during the Great Time of Peace. The Council frequently altered its composition, so as to bring in a range of scholars, artists and interested community members. Council sessions were held in the throne room of the Theed Royal Palace."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though members of the Advisory Council were captured during the Invasion of Naboo and temporarily replaced by the Occupation Council, the Council was reinstated following the end of Nute Gunray's occupation, and remained a vital part of Naboo's government throughout the Clone Wars and the Galactic Civil War. Queen Kylantha refused to disband the Council after the dissolution of the Imperial Senate, a move that was a point of concern for many Imperial officers."}, {"tag": "h2", "text": "Known Council members"}, {"tag": "h3", "text": "King Veruna's rule (c. 33 BBY)"}, {"tag": "h3", "text": "Queen Amidala's rule (c. 32 BBY)"}, {"tag": "h3", "text": "Queen Jamillia's rule (c. 22 BBY)"}, {"tag": "h3", "text": "Queen Neeyutnee's rule (c. 21 BBY)"}, {"tag": "h3", "text": "Queen Apailana's rule (c. 19 BBY)"}, {"tag": "h3", "text": "Queen Kylantha's rule (c. 3 ABY)"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The reference book Secrets of Naboo limits the number of the councilmen to five, one permanent and four rotating. It also lists the four rotating positions as \"Music Adviser,\" \"Master of Sciences,\" \"Chief Architect\" and \"Educational Regent.\" However, other sources such as Star Wars: Invasion of Theed Adventure Game mention additional positions, including \"Minister of Culture\" and \"Assistant Minister of Internal Affairs.\" Additionally, more than five advisers appear together in Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}