{"url": "Naboo_Royal_Space_Fighter_Corps/Legends", "categories": ["Category:Legends articles", "Category:Naboo organizations", "Category:Naboo Royal Space Fighter Corp"], "nodes": [{"tag": "h1", "text": "Naboo Royal Space Fighter Corps"}, {"tag": "p", "text": "The Naboo Royal Space Fighter Corps (NRSFC), also known as the Royal Naboo Starfighter Corps, was part of Naboo's Royal Security Forces dedicated to protecting the citizens of Naboo which fought at the Battle of Naboo. By the time of the Galactic Civil War, it was best known as the Naboo Planetary Defense (NPD)."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Naboo Royal Space Fighter Corps were formed by Ars Veruna, as a means to renegotiate their contracts with the Trade Federation from a position of strength."}, {"tag": "p", "text": "The pilots of this small corps flew Theed Palace Space Vessel Engineering Nubian-1 J Starfighters, commonly known as the Naboo Starfighter. As implied by the name, the N-1 J used dual Nubian radial sublight engines and an R2-series astromech droid for hyperspace coordination and navigation."}, {"tag": "p", "text": "Although the NRSFC was strictly made up of volunteers, the pilots trained and drilled on a regular basis in their fighters. Their primary task was to serve as honor guard for the Queen or Senator, but the NRSFC saw their fair share of action in the Naboo space battle, where they destroyed a Trade Federation Droid Control Ship with the help of young Anakin Skywalker."}, {"tag": "p", "text": "The Space Fighter Corps comprised at least five starfighter squadrons: Alpha Flight, Bravo Flight, Delta Flight, Echo Flight, and Victor Flight. At the time of the Invasion of Naboo, all three were under the command of Captain Ric Olié, who flew as Bravo Leader during the orbital part of the Battle of Naboo."}, {"tag": "p", "text": "After the Battle of Naboo, the Space Fighter Corps began accepting Gungan applicants into its ranks. One such recruit, Toba, founded a new squadron comprised entirely of Gungan pilots, called Iron Cesta Flight. Iron Cesta Flight used the new G-1 starfighter, designed for extended periods of independent operation and sustained combat, to police the Naboo system and hunt pirates preying on the traffic between the planet and the newly established Ohma-D'un colony."}, {"tag": "p", "text": "The pilots of the Space Fighter Corps were known as a devil-may-care group, many of whom gained experience in off-planet Republic pirate fighter groups. While serving in the Space Fighter Corps, few pilots ever left the Chommell sector, though some of the more skilled—or merely lucky—were chosen to fly royal escort duty to Coruscant."}, {"tag": "p", "text": "Members of Bravo Flight, including Porro Dolphe, escorted Senator Padmé Amidala's diplomatic barge to Coruscant during the Separatist Crisis, during which they suffered losses in an assassination attempt."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the time of the Galactic Civil War, the Naboo Planetary Defense was mostly tasked to deal with pirates in the Naboo system. Circa 1 ABY, the NPD defeated the Naboo pirates and their leader Rezunin Starwing."}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Z-95-AF4 Headhunter had become the RSF primary starfighter. Other vessels included T-65 X-wing starfighters for ace pilots, G1-M4-C Dunelizard fighters, Firespray-31-class starships and deep space scanner transports. Nevertheless, N-1 starfighters were still in operation during the Uprising on Naboo in 4 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}