{"url": "Naboo_pirates", "categories": ["Category:Legends articles", "Category:Naboo organizations", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Naboo pirates"}, {"tag": "p", "text": "The Naboo pirates were a pirate group active in the Naboo system during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Naboo pirates were based in a bunker located in the Gallo Mountains, on the planet Naboo. Their main activity was the kidnappings of wealthy people in order to get ransom. They were also present in the Naboo system. In space battles, the pirates flied Kihraxz assault fighters and M3-A Scyk fighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Battle of Yavin, the pirates kidnapped several Naboo noble all over the planet and kept them prisoners in the Pirate Bunker for ransom. People captured included Demitri Firewatcher's master, Hanna S'kiyah's sister, and even several members of the royal family. Demitri Firewatcher therefore solicited the help of a spacer while he was in the city of Keren to rescue his master. Firewatcher used rumors of treasure in the bunker to further catch the spacer's interest and recommended that a group be formed to overwhelm the more numerous pirates. In the meantime, Hanna S'kiyah also begged a spacer in Theed to rescue her sister because she did not have enough money to pay a ransom. A spacer also met a man known as Ketter Yaaran in the Kaadara cantina to get information about the pirates and their bunker."}, {"tag": "p", "text": "Circa 1 ABY, the pirates suffered a major setback when they lose several starfighters, including their leader Rezunin Starwing, during an engagement with the Naboo Planetary Defense."}, {"tag": "p", "text": "Soon thereafter, a number of pirates were recruited by the wanted murderer Hunnos Jarkey after he escaped the Royal Naboo Security Forces. However, Jarkey and all pirates were killed during a RSF assault on Hunnos Jarkey's Ranch. Later, Vance Groten recruited RSF agents to eliminate a group of Naboo pirates near the city of Dee'ja Peak."}, {"tag": "p", "text": "The same year, Jabba the Hutt's bounty hunter Bronell dispatched a spacer to the pirate bunker in order to retrieve information about a CorSec officer who owned money to Jabba, as well as to the pirates."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}