{"url": "Naboo_religion", "categories": ["Category:Legends articles", "Category:Culture of Naboo", "Category:Religions"], "nodes": [{"tag": "h1", "text": "Naboo religion"}, {"tag": "p", "text": "Naboo religion was polytheistic, with the Naboo worshiping many allegorical deities, such as the Goddess of Safety. The deity of Shiraya reflected many aspects common to lunar worship found in many Human cultures."}, {"tag": "p", "text": "Naboo ancient philosophers were revered and honored as enlightened gurus, and with the reverence of family ancestors, formed an important aspect in Naboo religious traditions. Paired statues of semi-legendary or archtypical gurus were prominently displayed in ranks on either side of the steps leading to the Theed Royal Palace. Natural elements also had an important role in their religion, and among them was the symbol of fire; the Naboo believed a dead body had to be cremated within two days to return the life force of the dead to the planet's core. The ashes were then thrown from the bridge between the temple and the Livet Tower, and into the Solleu River before its plunge over the cliff. The Naboo thought Chaos was kept unreachable thanks to seven impassable doors, and that is why seven laser gates were designed to protect the pit of the Plasma Refinery Complex on Naboo."}, {"tag": "p", "text": "Many devoted holy men and women formed monastic communities and orders, such as the Brotherhood of Cognizance, which focused on a particular deity or an enlightened guru. These religious orders were governed by a pontifex and had a monastic hierarchy typical of many Human religious orders. Often the more ascetic orders were found in remote and isolated locations, preferring a life spent in solitude, without worldly distraction and centered on peaceful contemplation."}, {"tag": "p", "text": "Religion's rites were performed by priests and priestesses such as Maxiron Agolerga, who presided over the secret wedding ceremony of Padmé Amidala and Anakin Skywalker."}, {"tag": "h2", "text": "Sources"}]}