{"url": "Nack_Movers%27s_residence", "categories": ["Category:Canon articles", "Category:Coruscant apartments"], "nodes": [{"tag": "h1", "text": "Nack Movers's residence"}, {"tag": "p", "text": "Nack Movers's residence, located in Coruscant's Jrade District during the Clone Wars, was the skyrise apartment of Nack Movers and his live-in girlfriend, Ione Marcy, until he was killed there by Marcy and her girlfriend, Movers's bodyguard Cassilyda Cryar. The murder scene was examined by the Coruscant Security Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nack Movers's residence was a skyrise apartment located on the planet Coruscant in the upper east side of the Jrade District. Nack Movers, a Trandoshan hit man who was well known in the Coruscant Underworld, lived there during the Clone Wars with his girlfriend, Ione Marcy. It was also frequented by Cassilyda Cryar, Marcy's partner and Movers's hired bodyguard, until she and Marcy killed him by poisoning his drink with Sennari. He knocked over furniture and his claws tore through a painting of the three beings together when he collapsed."}, {"tag": "p", "text": "The pickpocket Bannamu told Jedi Padawan Ahsoka Tano that the apartment was Marcy's when Tano questioned him about stealing and selling her lightsaber to Movers. By the time Tano and Jedi Master Tera Sinube arrived, Movers was already dead. Marcy pretended to be distraught over the death and lied to the Jedi while Cryar hid in another room with the lightsaber. When the Padawan investigated further, Cryar kicked her and attempted to ignite the lightsaber. As soon as Tano recognized it as hers, Cryar realized she was facing a Jedi and broke a window to escape using her natural agility as a Terrelian Jango Jumper. While Tano pursued the thief, Sinube placed a tracker on Marcy's back and asked her probing questions about how Movers had apparently been poisoned and had discrepancies in her story and demeanor. When the police droids arrived, Marcy fled in her airspeeder and used her wrist comm to warn Cryar. The couple fled together to a train station, but were soon captured and arrested."}, {"tag": "p", "text": "Inspector Tanivos Exantor Divo of the Coruscant Security Force subsequently documented the state of the apartment for the police investigation into the murder. The analysis droid Russo-ISC produced a blood sample analysis for the crime scene examination report."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}