{"url": "Nadiri_Starhawk_Expansion_Pack", "categories": ["Category:Real-world articles", "Category:Star Wars: Armada Wave VIII"], "nodes": [{"tag": "h1", "text": "Nadiri Starhawk Expansion Pack"}, {"tag": "p", "text": "The Nadiri Starhawk Expansion Pack is a supplement to the tactical naval warfare game, Star Wars: Armada, published by Fantasy Flight Games. The expansion features a detailed miniature of a Starhawk-class battleship. It was released on January 31, 2020."}, {"tag": "h2", "text": "Publisher's Summary"}, {"tag": "p", "text": "The Starhawk-class battleship was the first capital ship commissioned by the nascent New Republic Defense Fleet after the Battle of Endor. Assembled at the Nadiri Dockyards from the salvage of captured Star Destroyers, the Concord served as the flagship for Commodore Kyrsta Agate during the capture of the infamous Kuat Drive Yards, while the Amity and the Unity joined her in time for the climactic Battle of Jakku. There, all three Starhawks bore the brunt of the battle to destroy the Galactic Empire. But how your galactic battles play out is up to you."}, {"tag": "p", "text": "As the largest ship in the Rebel fleet, the Nadiri Starhawk can stand against any opposing force, even the fearsome Super Star Destroyer, and the Nadiri Starhawk Expansion Pack provides you with everything you need to add this large ship to your Rebel fleet. This expansion comes complete with one ship and speed dial, four command dials, two ship cards, and fifteen possible upgrade cards, including the courageous commander Kyrsta Agate. After you deploy, Agate allows you to gain 1 non-scatter defense token, which you may discard to resolve the its effect during your \"Spend Defense Tokens\" step, provided your speed is not 0."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The Nadiri Starhawk Expansion Pack contains 1 miniature, plus a maneuver dials and action tokens, as well as ship and upgrade cards."}, {"tag": "h3", "text": "Ship components"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Ship cards"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}