{"url": "Naescorcom/Legends", "categories": ["Category:Legends articles", "Category:Company stubs", "Category:Conglomerates", "Category:Naescorcom products"], "nodes": [{"tag": "h1", "text": "Naescorcom"}, {"tag": "p", "text": "Naescorcom was a manufacturing conglomerate led by seven core members from planets in the Outer Rim. At the suggestion of two of its members, the company established a large manufacturing facility—the floating city Ipsus—on Genarius in 36 BBY. The Cularin system's position would allow easy distribution of product to both the Core and Outer Rim, and also points in-between."}, {"tag": "p", "text": "As some of the representatives were reluctant to take the risk, Naescorcom agreed to commit an initial 50,000,000 credit budget to build Ipsus, pending the first gain (which had not been reached as of 32 BBY). Furthermore, a Naescorcom board was to become the remote ruling body of Ipsus city, and the facilities would be managed by two Naescorcom operation overseers destined there."}, {"tag": "p", "text": "Naescorcom believed that diversification in product lines would lead to success. Their manufacturing facilities often produced multiple items that had little relation. Ipsus, for example, produced textiles and thermal detonators."}, {"tag": "p", "text": "Naescorcom was also known for their strict practices: When they found that slicer Loa Tibeeme had been among the slicers who stole secret data from them, Naescorcom offered Tibeeme a \"forced\" employment as a computer security agent in Ipsus, to pay for her crime. Tibeeme was forced to accept the deal. Other employees, such as Ipsus's Line Two archivist Nui Gneppe, worked there by their own will."}, {"tag": "p", "text": "Naescorcom leaders of Ipsus had claimed mining rights on the inhospitable moon of Ulbasca, disputing the rights of rival company SoroSuub, even though none of them have ever made a real effort to mine there."}, {"tag": "p", "text": "At some point before 32 BBY, Naescorcom employed El'Tar Miskin as a shipping clerk, but he mixed up two shipments, sending textiles to Outer Rim pirates and thermal detonators to a Coruscant orphanage. Miskin could have been executed for the failure, but he was instead fired."}, {"tag": "p", "text": "During the Clone Wars, Naesorcomm hired Renna's Transport Service to deliver them a shipment of thermal detonator components. However, the freighter carrying the shipment was captured by the Red Fury Brotherhood."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}