{"url": "Naga_Sadow/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with conflicting sources", "Category:Dark Lords of the Sith", "Category:Darths", "Category:Force ghosts", "Category:Males", "Category:Near-Human Hybrids", "Category:Religious workers", "Category:Sith alchemists", "Category:Sith Councilors", "Category:Sith Masters", "Category:Sith sorcerers", "Category:Sith species"], "nodes": [{"tag": "h1", "text": "Naga Sadow"}, {"tag": "p", "text": "Darth Naga Sadow was a master Sith alchemist and Dark Lord of the Sith who, in 5000 BBY, took the Sith Empire to the brink of galactic domination in the Great Hyperspace War. A half-breed Sith from Ziost, Sadow ruled over a secret citadel on the moon Khar Shian, where he became one of the most powerful Sith magicians of his time. A member of the ten-member Sith Council under Dark Lord of the Sith Marka Ragnos' reign, Sadow's preached an expansionist philosophy put him at odds with much of the isolated Empire's establishment. Sadow was considered a major candidate for Dark Lord after Ragnos' death, leading him into a power struggle with conservative rival Ludo Kressh that only ended with the surprise arrival of two explorers from the far-off Republic."}, {"tag": "p", "text": "Sadow saw opportunity in the two explorers—siblings Gav and Jori Daragon—and used the suspicion and fear raised by their arrival to foment war with the Republic. Along the way, Sadow shattered Kressh's forces at Khar Delba, leaving no challengers to his authority. With Kressh seemingly out of the picture, Sadow gathered together all the Sith Lords and built a formidable military force to conquer the Republic, while also taking Gav Daragon as his Sith apprentice. When the time was right, Sadow and his forces launched a massive surprise attack on the Republic, a many-pronged strike aimed at conquering the important Koros system while seizing the Republic capital of Coruscant. For his part, Sadow stayed isolated in his Sith meditation sphere, augmenting his forces with illusory beasts and ships."}, {"tag": "p", "text": "Sadow's efforts initially met with great success, and he was on the cusp of victory when events turned against him. Gav Daragon turned coat once back home and attacked Sadow in his meditation sphere, breaking his concentration and dissipating his illusions. His momentum halted, Sadow killed Daragon and fled home, only to find a still-alive Ludo Kressh waiting for him with his own army. Sadow managed to deal his rival a final defeat before immediately being forced into battle again with a pursuing Republic force. Seeing he could not win, Sadow escaped with a daring run through the twin stars of the Denarii Nova, and making his way to the uninhabited moon of Yavin 4. Sadow practiced his alchemy alone there for decades, building massive temple complexes, before voluntarily placing himself in suspended animation. He was awoken some 600 years later by a fallen Jedi named Freedon Nadd, who learned the former Dark Lord of the Sith's secrets before killing him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Naga Sadow was born on the planet Ziost in the Sith Empire, a rich but isolated civilization concealed from the greater galaxy by the difficult-to-navigate nebula known as the Stygian Caldera. Around two thousand years before Sadow's lifetime, the Second Great Schism led to war between Jedi, with a cadre of dark siders defeated and forced to flee. They went on to discover, conquer and interbreed with the Sith species, becoming the Sith Lords and establishing their \"lost\" empire. Sadow was an heir to this legacy, being a Sith Pureblood—a hybrid of the Sith and their Human Dark Jedi conquerers. While Sadow had Sith features, including red skin and tentacles on his face, the hybrid also boasted a strong bloodline—one of the purest Jedi lineages in the Sith Empire."}, {"tag": "p", "text": "Despite the empire's splendor in the so-called Golden Age of the Sith, Sadow grew up in an age where the Sith civilization faced many crises. Being so far removed from the rest of the galaxy stagnated the Sith Empire's economic growth and technological knowledge, while the old aristocracy had died off to be replaced by half-caste warriors consumed with quests for power. Meanwhile, the specter of the Jedi and the Galactic Republic hung over Sith society like a boogeyman, with fearful rumors constantly circulating that the Republic was planning the overthrow of the Sith Empire. Sadow was raised from birth to fight these threats and eventually came under the tutelage of the Sith Lord Simus, who served as both a teacher and a mentor to Sadow. Simus would serve as a guiding figure throughout Sadow's life, even after he was beheaded in a duel with Dark Lord of the Sith Marka Ragnos, as he used his Sith powers to keep his head alive in a crystalline jar. By 5000 BBY, Sadow had grown in stature among the Sith Lords, becoming a member of the ten-member Sith Council, serving alongside his mentor Simus."}, {"tag": "p", "text": "As was the custom of Sith Lords at the time, Sadow set about building his own personal army, but typically unorthodox as he was, Sadow absorbed outside cultures into his service instead of drawing his forces exclusively from his enslaved population. Sadow soon became well-known among the Sith Lords of his time, and preached an expansionist philosophy for a number of years. While Sadow was nominally in control of the world of Khar Delba, the world was just a decoy— Sadow's true work occurred on a secret stronghold on the dark side of the moon Khar Shian, where he found it better to further his research into the dark arts. Among the dark side pursuits that Sadow embarked on during this time was a fruitless search for the Muur Talisman—an ancient Sith amulet with the power to turn people into monstrous rakghouls. Sadow competed with a number of other Sith Lords of the time to find the Talisman first. As part of this pursuit, Sadow translated the Codex of the long-dead Sith Lord Karness Muur, creator of the Talisman."}, {"tag": "h3", "text": "Claimant to the Sith legacy"}, {"tag": "p", "text": "Towards the end of Marka Ragnos' century-long reign as Dark Lord of the Sith, Sadow had begun to covet the position for himself. Sadow had grown to resent what he saw as the Sith's stagnation, as they wallowed endlessly in their riches. Sadow believed it was time for a change, and when Ragnos passed away in 5000 BBY, he would have his chance. Ragnos' death was immediately followed by a grand funeral procession through Korriban's Valley of the Dark Lords, led by Sadow's greatest rival for the throne of Dark Lord, Ludo Kressh. Sadow arrived late, as Ragnos' sarcophagus was already on its way to its tomb, and when the tardy Sadow ascended the steps of Ragnos' newly-built tomb to take his place in the ceremony, Kressh ordered him to turn back, saying that he was shaming Ragnos' memory. An indignant Sadow stepped up to state his claim for the title of Dark Lord of the Sith, something which was immediately opposed by the much more conservative Kressh—in accordance with the Sith traditions, the only logical way to resolve this impasse was for Sadow and Kressh to do battle. Facing off on the threshold of Ragnos' tomb, the two Sith Lords dueled with Force-imbued blades, as it quickly became apparent that this would be a fight to the death."}, {"tag": "p", "text": "Neither would get the chance to claim a victory, however, as Marka Ragnos' spirit appeared with a warning: the Golden Age was nearing its end, and the Sith would need to fight the correct battles or else be destroyed. As the Sadow and Kressh pondered the dead Dark Lord's words, they were interrupted by an unexpected sight: a starship of unknown origin descending into the Valley of the Dark Lords. When the ship landed, two Humans disembarked, proclaiming themselves to be emissaries from the Galactic Republic interested in setting up a trade relationship with the Sith civilization. The pair—Gav and Jori Daragon, in truth fugitives who had chanced upon Korriban after making a blind hyperspace jump to escape trouble on their native Koros Major—were swiftly seized as spies. Although Kressh wanted to kill them immediately, Sadow thought the Daragons could be the key to new Sith conquests, and had them imprisoned for questioning on Ziost."}, {"tag": "p", "text": "For Sadow, the Republic was a vast new field to conquer, but it could also be a unifying force for an increasingly split Sith Empire, and a distraction from political weaknesses on the homefront. With the Daragons in chains, Sadow met with the rest of the Sith Council at Ziost's Sith Citadel to discuss their fates. While several of the Council agreed with Kressh that the visitors should be put to death, Sadow made an impassioned plea to keep them alive, as their knowledge of the rest of the galaxy could lead to greater Sith domination and control. Sadow knew well the value that Humans could bring, as he had made good use of the scientific skills of the descendants of Human Tapani refugees that had been enslaved by the Sith generations before, and often included Humans among his entourage."}, {"tag": "p", "text": "Despite Sadow's plea, the Council still voted to kill the Daragons. However, the ever-ambitious Sadow still had the galaxy on his mind, and he put a plan in motion to rescue the explorers and bring the rest of the Sith Council around to his side. As Sadow watched from his secret fortress on Khar Shian, a Sith soldier loyal to Sadow snuck into the Daragons' ship and stole a pair of Republic blasters. Once the weapons were in hand, Sadow quickly raided Ziost with a small strike team, freeing the Daragons and killing all witnesses using one of the Republic blasters, including his old teacher, Simus. Sadow left the weapon behind at the scene, and departed to allow the rest of the Sith Lords to draw their own conclusions. Sadow deposited the Daragons at his secret citadel on Khar Shian, before promptly returning to Ziost to see if his strike had had the effect he desired. Sadow arrived to find that everything had gone according to plan: the Sith Council was in a panic, and the Republic was to blame. Feigning shock at Simus' death, Sadow loudly proclaimed that it was time for the Sith to strike back, and officially announced his intentions to seize the title of Dark Lord. To Ludo Kressh's horror, several of the Sith Council backed Sadow's claim, and Kressh left in a huff with his supporters, proclaiming that he would become the true Dark Lord. Not willing to let this stand, Sadow ordered his supporters, each of whom controlled a dozen worlds, to call their ships and warriors to battle. Things had come to a head, and Naga Sadow and Ludo Kressh were finally going to war."}, {"tag": "h3", "text": "Consolidating power"}, {"tag": "p", "text": "In the meantime, Sadow split the Daragons up, keeping Gav Daragon with him on Khar Shian and sending his sister Jori to his decoy fortress on Khar Delba. In Gav Daragon, who had once been a low-level initiate of the Jedi Order in his younger days, he found someone with a strong, if untrained, talent in the Force. Sensing promise in Daragon, Sadow took him under his wing as an apprentice and began to teach the young man Sith magic. With all-out war with Ludo Kressh looming, Sadow had a traditional tattoo applied to his forehead by Sith pincerbugs, an act which most believed made his claim to the seat of Dark Lord official. Soon afterward, he received information that Ludo Kressh had his men guarding the Daragons' captured ship, the Starbreaker 12."}, {"tag": "p", "text": "Realizing an opportunity, Sadow sent several of his Massassi warriors to kill Kressh's guards and seize the ship, leaving no witnesses and leaving Sadow's emblem behind at the scene. Sadow's Massassi flew the Starbreaker 12 back to Khar Delba, getting there just before Kressh attacked the world, just as Sadow had foreseen. Having planned for this eventuality, Sadow allowed Kressh, backed by the forces of his allies Horak-mul and Dor Gal-ram, to batter his fortresses on Khar Delba with a rain of laser fire from their battleships. Although completely unconcerned about Kressh's firepower, Sadow feigned panic, quickly ushering Jori Daragon to the recovered Starbreaker 12, claiming he was protecting her from torture and death at Kressh's hands. In fact, Sadow simply wanted her to escape alone, so he could follow her trail back to the unsuspecting Republic, while keeping her brother Gav with him as his apprentice."}, {"tag": "p", "text": "Jori Daragon, who did not believe she had any reason not to trust Naga Sadow, completely fell for the Sith Lord's feigned concern and followed his instructions to escape back to her home—unbeknownst to her, Sadow had outfitted her ship with a tracking device. While Kressh's bombardment continued, Daragon managed to evade the laserfire in the Starbreaker 12 and jump to hyperspace. Once Daragon was clear of the battlefield, Sadow put the second part of his plan into motion, calling his fleet from its hiding place on the dark side of Khar Shian. The fleet's arrival and sudden attack took Kressh completely by surprise, as another level of subterfuge tore Kressh's ranks apart: several of Sadow's Sadow'een assassins, posing as crewmembers on Kressh's battleships, attacked and killed Horak-mul and Dor Gal-ram and commandeered their vessels. Withering laserfire from both within and without forced Kressh into an ignominious retreat. Sadow's tactical masterpiece at Khar Delba cemented him as the undisputed ruler of the Sith Empire, while Daragon's escape back to the Republic had set the stage for a Sith invasion of the rest of the galaxy at large. His fleet and power only growing, Sadow knew the time was coming to strike, and he rallied all the rest of the Sith Lords to join his impending conquest of the Galactic Republic."}, {"tag": "p", "text": "With Ludo Kressh out of the picture, Naga Sadow began furiously preparing for his attack on the Republic, working his Massassi workers' fingers to the bone repairing the damage done to his citadel on Khar Delba and raising his fleet. Now the undisputed Dark Lord of the Sith, Darth Naga Sadow was pledged the allegiance of all the rest of the Sith Lords and their armies. Sadow also kept himself busy grooming Gav Daragon—who was becoming increasingly morally conflicted at the prospect of attacking his home in the Republic—as his dark apprentice, although he often found himself having to lie to keep the young Human in the fold. While his war fleet was being fully readied, Sadow gathered the other Sith Lords to a war council on Khar Delba, which was interrupted by an unexpected arrival: Ludo Kressh, who broadcast an anti-Sadow transmission to the Sith Lords at the same time that his flagship was spotted approaching Khar Delba. Dismissive of Kressh's \"prattle,\" Sadow ordered Daragon to press a button on a nearby control panel, promising it would block Kressh's transmission. When Daragon pressed the button, however, Kressh's flagship violently exploded, and the obstacle that was Ludo Kressh was seemingly gone for good. Daragon was stunned, even more so when Sadow revealed that they had the location of their Republic target due to a tracer he had placed on the Starbreaker 12. Sadow had no time to argue with his young apprentice, however—before the explosion in Khar Delba's atmosphere had even subsided, he proclaimed the time had come to launch his attack."}, {"tag": "h3", "text": "Sadow's star war"}, {"tag": "p", "text": "Sadow was able to put together an extremely formidable fighting force with remarkable quickness, as ships, ground troops and war beasts flocked to him from every corner of the Sith worlds. Once the moment of truth came, Sadow gathered his invasion fleet at Khar Shian. His plan was set: the Dark Lord would lead the war effort from his Sith meditation sphere, which would be the heart and mind of the Sith attack. To give his forces a psychological edge, Sadow planned to keep to his meditation sphere, using Sith magic to create illusions that would make his forces appear much more formidable than they were."}, {"tag": "p", "text": "Over objections from Gav Daragon, Sadow intended to leave Sith Space undefended and toss his entire strength at the Republic. Furthermore, Sadow placed Daragon, who had no command experience, in charge of one of his flagships. Once everything was set, Sadow called for his fleet to launch to hyperspace, proclaiming that the Republic would be theirs. Locking onto the beacon from the Starbreaker 12, the Sith fleet soon arrived at the ship's location within Republic space. Sensing no Humans aboard—the ship had recently been taken from Jori Daragon by a creditor, Ssk Kahorr—Sadow ordered the ship's destruction, and next dispatched his fleet as according to his war plan. Gav Daragon and the main fleet would strike quickly to consume the Koros system, while another part of his forces would strike at the very heart of the Republic."}, {"tag": "p", "text": "As his fleet departed, Sadow retired in his meditation sphere to the Primus Goluud system, where he began working on conjuring his illusions. In a bold move, Sith forces began the war with a direct attack on Coruscant itself, the capital of the Republic, part of a many-pronged Sith assault. Led by Sith Lord Shar Dakhan, the Sith invasion force on Coruscant was bolstered with Sadow's illusions to make it appear tens of thousands of ships strong, while Daragon's group laid siege to the Koros system against a combined army of Tetan military and pardoned Kirrek rebels."}, {"tag": "p", "text": "In the run-up to his attempt to take Kirrek, Sadow sent Kaleesh fallen Jedi Saes Rrogon to seek out rare Lignan crystals, which had the ability to bolster a dark side user's Force power. Sadow delayed his attack until Rrogon found a significant deposit on Phaegon III, and with combat already raging on Kirrek, Sadow personally dispatched one of his most trusted captains, Yaru Korsin, to mine those crystals. However, both Korsin's Omen and sister ship Harbinger were lost to a Jedi attack. Sadow's campaigns in this sector of the galaxy initially met with great success, as Sadow's spotty knowledge of the region actually worked in his favor, granting his forces a degree of unpredictability. But while he seemed on the verge of victory, at a critical moment came a circumstance Sadow had not planned for. After encountering his sister Jori in the burning streets of his home city of Cinnagar, Gav Daragon had a change of heart and fled the battle in his warship, tracking Sadow to the Primus Goluud system."}, {"tag": "p", "text": "After finding Sadow's meditation sphere, Daragon blasted it with a powerful laser shot, breaking Sadow's concentration and forcing many of his apparitions to disappear across the galaxy. On Coruscant, an outnumbered contingent of Jedi and Republic soldiers had been backed up to the steps of the Galactic Senate, and the confusion led to a Republic counterstrike that ultimately defeated the Sith. His vessel damaged but not destroyed, Sadow sent a transmission to Daragon, asking him to come to his listing sphere so they could meet face to face. Daragon obliged only to realize he had been tricked, as a furious Sadow had abandoned the ship and trapped him there, promising to deal with him later. By then, a Sith victory seemed a much more unlikely proposition, a hope dimmed even further after reinforcements from Ronika overcame the Sith forces on Kirrek."}, {"tag": "p", "text": "Sadow's grab for the Republic was falling apart, and as Empress Teta's forces reaffirmed their claim to the Koros system, the Empress herself, along with Jori Daragon, followed Gav's hyperspace trail to Primus Goluud. Sadow recalled the battered remnants of his fleet, and immediately attacked when the enemy ships arrived. Sadow was outgunned, but he had an ace in the hole: the power of Sith magic. Within the battleship Corsair, Sadow used the Force to trigger a massive supernova in the star Primus Goluud, covering his retreat and consuming Gav Daragon, still trapped in the meditation sphere. But in Daragon's last moments, he had given his sister a critical piece of intelligence: Sadow had left the Sith Worlds abandoned to attack the Republic, and Empress Teta had a chance to put an end to the Sith Empire in one fell swoop."}, {"tag": "h3", "text": "Flight, exile and death"}, {"tag": "p", "text": "With the Sith invasion shattered at Coruscant, Koros Major and Primus Goluud, only a few ships remained to limp back to Sith Space with Sadow. His assault on the Republic had been decisively repelled, but Sadow did not believe the war was over and planned on licking his wounds, raising new forces and preparing for a second go-around. However, Sadow had an unexpected welcoming party once he returned home: Ludo Kressh, who had staged his own death at Khar Delba, gathered his own forces and proclaimed himself Dark Lord of the Sith in Sadow's absence. With little time to recover after Primus Goluud, Sadow found himself engaged in another battle, this against his oldest rival in the skies above Korriban. Kressh nearly overwhelmed Sadow's battered ships, but one of Sadow's doomed pilots made a suicide run on Kressh's flagship, killing the would-be Dark Lord and breaking his remaining forces' will to fight. To his shock, yet another fleet soon emerged from hyperspace: Empress Teta and her ships from the Koros system, which had followed his trail from Primus Goluud. Sadow vowed to fight to the death, but he and his fleet had nothing left. Once his defeat was apparent, and Empress Teta demanded his surrender, Sadow realized that he only had one chance to emerge alive. Sadow had his few remaining ships assemble a blockade, while he made a run for the twin stars of the Denarii Nova."}, {"tag": "p", "text": "As Sadow's Corsair made the treacherous journey between the Denarii Nova's binary stars, pursued by Tetan forces, Sadow—much like he did at Primus Goluud—used Sith magic to cause solar flares and cover his retreat. As she watched the destruction of Sadow's blockade and her ships in pursuit of the Sith Lord, Empress Teta mistakenly believed that Sadow had to have been killed, and ordered her fleet back to Republic space. But Sadow had escaped in the Corsair, the last ship remaining in his mighty Sith invasion fleet. Sadow eventually stumbled across the uninhabited, uncharted Yavin system, containing the lush moon Yavin 4, where Sadow decided to make a new start. Sadow quickly set his remaining Massassi to work, taming the jungle and raising a series of massive temples. Sadow used one of these temples to conceal his Corsair, the only ship that could have taken him off the jungle moon."}, {"tag": "p", "text": "On Yavin 4, Sadow continued his studies of Sith alchemy, learning how to assert his will on the natural order of the universe. His Sith Empire unmade, Sadow instead set his sights on creating a race of warriors powerful enough to protect what remained of his legacy. To this end he experimented upon his Massassi slaves, twisting and mutating them into powerful beings filled with violence and hate. Sadow also experimented on other creatures, including a larval space slug that had attached itself to the Corsair en route to Yavin 4. Not seeing any use for the beast after several unsuccessful attempts to tame it, Sadow decided to mutate it into a giant monster that could swallow a Jedi in one bite: the colossal Sith wyrm, which continued to live deep under Sadow's temples for centuries. However, Sadow soon faced a challenge from a tribe of intelligent, cultured and independent Massassi that had managed to escape his experiments. Resenting Sadow's uncontested rule, the Massassi tribe struck at Sadow's temples, and even though the Dark Lord had anticipated their aggression, the Massassi tribe fought through Sadow's twisted warriors and forced a face-to-face confrontation. As Sadow commended the Massassi tribesmen for their bravery, hundreds of Sadow's brutes flooded the chamber and took the attackers captive, for Sadow to subject them to the same alchemical processes that turned their brothers into mindless beasts."}, {"tag": "p", "text": "After decades practicing his Sith alchemy undisturbed, Sadow decided that it was time to place himself in a suspended animation chamber that would keep his body alive for centuries, making a vow not to return until the fires of conflict had burned out and a new apprentice had risen to bring about a Sith golden age. That day came around 4400 BBY, when he was discovered and awakened by a curious Jedi named Freedon Nadd, who had stumbled upon Yavin 4 during his quest to learn more of the dark side. Believing that Nadd was the apprentice for whom he had been waiting for centuries, Sadow taught Nadd his Sith secrets, only for his newfound apprentice to eventually turn on and kill him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Sadow's attack on the Republic, and his daring escape from pursuit at Korriban, would in turn inspire subsequent generations of Sith, including future Dark Lord of the Sith Exar Kun, who learned Sadow's tale from Jedi Master Vodo-Siosk Baas' holocron while still a Jedi Padawan. Guided by the spirit of Freedon Nadd—who had become a powerful Sith Lord himself— and fascinated by forbidden dark side knowledge Kun followed Sadow's trail to Yavin 4, finding his ancient temples and the descendants of his Massassi slaves, who had devolved into mutated primitives."}, {"tag": "p", "text": "The Massassi captured Kun and sentenced him to die, but through an exertion of his considerable dark side power, Kun destroyed the massive Sith wyrm left over from Sadow's experiments and earned the Massassi's loyalty. Kun in turn banished Nadd's spirit and discovered Sadow's buried Corsair, using the ship in his own unsuccessful quest for Sith domination of the galaxy. Kun was not the only future Sith to discover knowledge of Sadow's alchemy. The Dark Lord Darth Sidious, who lived several thousand years after Sadow's time, found an ancient holocron containing detailed records of Sadow's work, recorded in the long-dead Dark Lord's voice. Sidious guarded this knowledge tightly, but found himself sorely tempted to include some of Sadow's work in The Creation of Monsters, the third volume of Sidious' Dark Side Compendium."}, {"tag": "p", "text": "Although Sadow's fleet was almost completely destroyed in the Great Hyperspace War, the Sith dreadnaught Omen—which Sadow had sent with Captain Yaru Korsin to mine Lignan crystals at Phaegon III—miraculously survived a Jedi attack to crash-land on the uncharted planet of Kesh. There, Korsin and some of his crew survived to conquer the native Keshiri and form a powerful, isolated Lost Tribe of Sith, which after generations dimly remembered Naga Sadow as Korsin's \"celestial ally.\" In 3000 BBY, however, a recording of Sadow's original orders sending Korsin to Phaegon III was discovered by Tribe members, causing a major furor. The Omen's sister ship, the Harbinger, also survived the disaster at Phaegon III, only to emerge almost five thousand years later after traveling through an unstable hyperspace tunnel."}, {"tag": "p", "text": "Sadow's personal records fell into the hands of the secret Jedi Covenant by the time of the Mandalorian Wars, which they used to launch their own pursuit of the Muur Talisman that had evaded Sadow's reach during his lifetime. Some other remnants of Sadow's Sith Empire survived the war as well, chased into deep space by the Republic. They followed a new Sith Emperor, who reconstituted the Sith Empire on the forgotten colony of Dromund Kaas and plotted his own attempt for galactic power. Some Jedi, including the respected Jedi Master Gnost-Dural, believed at one point this mysterious Sith Emperor to be none other than Naga Sadow himself, returned from exile. One agent of the new Sith Empire, Darth Zash, boasted a complete collection of Sadow's writings from Yavin 4."}, {"tag": "p", "text": "Long after the death of Naga Sadow, treasure hunters scoured the galaxy for a force crystal that presumably belonged to the Sith Lord. Although its existence was debated by the time of the Battle of Yavin, the explorer Riyan Kiner became utterly insane after spending his life looking for this fabled artifact."}, {"tag": "h4", "text": "Sadow's tomb"}, {"tag": "p", "text": "Sometime after Sadow's death, a \"Tomb of Naga Sadow\" was built on Korriban, its entrance marked with a large stone relief of Sadow's face, although Sadow's actual remains instead rested in a more modest tomb on Yavin 4. Sadow's tomb on Korriban, which contained an ancient Rakatan Star Map containing directions to the Rakatan Star Forge, became a nest of terentatek beasts that killed Jedi Knights Duron Qel-Droma and Shaela Nuur in 3993 BBY. The Sith Lord-turned-Jedi Knight Revan twice entered Sadow's tomb to find the Star Map, while in 3951 BBY his close friend Meetra Surik tried to enter the tomb as well but found its entrance blocked by fallen rocks. Although Sadow's Korriban tomb did not contain his remains, Sadow constructed droid sentries to protect its inner chambers, guarding among other things an ancient Dashade warrior known as Khem Val, who lived in stasis within the crypt's walls for centuries after being placed there by the Sith Lord Tulak Hord. Around 3643 BBY, a Sith acolyte managed to breach the tomb and acquire the Star Map, with the help of the freed Khem Val."}, {"tag": "p", "text": "Meanwhile, Sadow's actual resting place remained in relative obscurity, protected by the descendants of his Massassi slaves, and there Sadow's spirit continued to linger. During the era of the Great Galactic War, Sadow's tomb on Yavin 4 was discovered by the Jedi Master Barel Ovair and his apprentice Eison Gynt, who had tracked Sadow's legacy down in an attempt to dispel his spirit. After being attacked by Massassi guards, Ovair left Gynt behind and returned to Republic space, but Gynt survived to be possessed by Sadow. Several years later, Gynt, still under Sadow's thrall, dressed in Massassi garb and returned to Coruscant. Gynt publicly attacked Ovair upon his return, but Ovair defeated and slew him, neutralizing Sadow's spirit. Sadow's spirit was not completely gone, however. During one period of intense Force activity on the moon in 3637 BBY, Sadow's spirit manifested as a ghost in the jungles of Yavin 4."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A visionary, Naga Sadow was possessed of a driving ambition that led him not only to crave the title of Dark Lord of the Sith, but to dream of piercing the Stygian Caldera and bringing the splendor of the Sith Empire to the entire galaxy. More than that, Sadow was a rebel, believing that only he could determine his place in the galaxy, refusing to bow to tradition and daring to fight against what he saw as the Sith Empire's stagnation and complacency. This rebelliousness was fueled by a sense of responsibility he felt to his exile ancestors, whom he recalled as great Jedi who created a flame that Sadow refused to let burn out. As such, he rued what he saw as \"backwards thinkers,\" men like Ludo Kressh, who Sadow believed would lead to the Sith Empire's ruin. Pursuing opportunity wherever it arose, Sadow chafed at the isolationism of the Sith Empire, believing it to be a practical impossibility for such a sprawling body. It was this expansionist philosophy that came to define Sadow long before he ever became Dark Lord, as he became known as an impassioned speaker who consistently preached a new, progressive future for the Sith Empire. Sadow was also remarkably cunning, quick-thinking and tactically inventive; within days of the Daragons' arrival in Sith Space, Sadow had already formulated the plan that would bring him to the cusp of galactic domination, a plot that required him to brilliantly outmaneuver his greatest rival, Ludo Kressh."}, {"tag": "p", "text": "Sadow stood apart from the Sith establishment in every sense of the term, being one of the few to recognize the problems underlying the glory of the Sith Empire and dedicating his life to fighting them. Among the few of the Sith \"old guard\" that Sadow respected was his teacher Simus, but Sadow did away with his old mentor the minute that it suited him. Despite this, he was still a strong believer that the Sith Empire was superior to all alternatives, especially the \"oppressive system\" of the Galactic Republic. Sadow often displayed a strong disrespect for any who would oppose him, saving his most venomous invective for his rival Ludo Kressh, who disgusted the Dark Lord with his adherence to tradition and opposition to Sadow's progressive ways. Sadow craved contact with the unknown, and was always searching for chances to expand, dominate and control beyond the borders of the Sith Empire. He lacked the fear of the Republic and the outside galaxy that was common among the Sith of the day—to him, the Republic and the Jedi were not the hidden monsters that defeated his ancestors, just a new field to conquer. He also held none of the xenophobia that characterized many of his peers, such as Ludo Kressh. To Sadow, outsiders could be just as Sith as any born in the Empire, and Humans and members of other species often enjoyed high standing with the Dark Lord."}, {"tag": "p", "text": "Sadow's humaneness and even respect for different peoples and cultures stood in stark contrast to his belief that, as a powerful Sith alchemist, the natural order of the universe belonged to him and existed to be twisted to serve Sadow. Even his loyalest servants, the Massassi, existed only to defend him and pay him tribute, and he felt no remorse for twisting them into mindless beasts. All the destruction he could cause, including the death of a star system, was a small price to pay to further Sadow's aims. Sadow was adept at playing the role of caring host when it suited him, but it only ever lasted as long as it suited his purposes, he was vicious and precise in his strike once given an opening. In the end, however, Sadow's overconfidence wound up being his downfall, and he felt shamed by his loss of glory when forced into exile at the end of the Great Hyperspace War. Sadow stood 1.88 meters tall, and had brown hair and green eyes."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A powerful dark magician, Naga Sadow was remembered long after his death as a master of Sith alchemy who had the ability to twist the natural order of the universe to serve his purposes. With his magic, Sadow could transform the living into monstrous, brutal beasts, his own malformed servants of death— and, it was said, to give flesh to those spirits already departed. Sadow could also focus his gift of alchemy and magic into greater displays of Force power, including causing supernovas and solar flares to cover his retreat at the end of the Great Hyperspace War. But Sadow's power in the Force went beyond just the Sith alchemy that he was known, and feared, for. Sadow was incredibly potent at creating illusions, focusing his energy for such pursuits in his Sith meditation sphere. When in his sphere, Sadow had the ability to conjure hundreds of illusions at once and manifest them light-years away. Sadow's power of illusion was so great that he made it one of the focal points of his plan during the Great Hyperspace War. However, Sadow was not able to sustain these illusions when his concentration was even briefly broken, as it was when Gav Daragon turned on him at Primus Goluud."}, {"tag": "p", "text": "A brilliant strategist, Sadow's strengths lied not in direct confrontation, but in his mastery of the ability to intuit where his foe was weakest and then strike precisely and devastatingly. As a Sith Lord, however, Sadow was no stranger to individual combat, and was a match for Ludo Kressh with his favored Force-imbued Sith sword. Sadow often employed telekinesis while in single combat, pausing his sword strikes to pelt his opponent with stones using the Force. Sadow also proved himself handy with a Republic blaster in his breakout of Gav and Jori Daragon from imprisonment on Ziost, even though he had never seen a weapon of its type before and the Sith of the time largely fought with swords and spears. Sadow was fluent in his native Sith and the tongue of his Massassi slaves, as well as the Galactic Basic of his Jedi ancestors."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As one of the most powerful alchemists and Sith sorcerers of all time, much of Sadow's equipment was used to focus and augment his dark talents. Sadow was able to wield his greatest alchemical power on his Derriphan-class battleship, the Corsair, which had an array of crystals in a platform on the bridge. Through these crystals, Sadow was able to summon nigh-unlimited power, including the ability to obliterate stars themselves. Sadow also owned a Sith meditation sphere which served as his center for creating illusions, and he was able to achieve this at an incredibly large scale during the Great Hyperspace War. One of Naga Sadow's most striking possessions was the bejeweled Sith amulets that he wore on his hands, which he used to help focus dark side energy for his alchemical pursuits."}, {"tag": "p", "text": "The left amulet survived to eventually fall into the possession of Exar Kun, via the Massassi priest Zythmnr on Yavin 4. Years before the use of the lightsaber became common among Sith Lords, Naga Sadow did battle with a poisoned, Force-imbued Sith sword with which he became quite proficient. He also had his own suit of body armor, which survived past his death. Sadow's armor was elaborate and gold-plated, with a chest piece featuring a large, red eye and spikes on its pauldrons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Naga Sadow first appeared in the opening scene of Star Wars: Tales of the Jedi - Dark Lords of the Sith, a story arc in the Star Wars: Tales of the Jedi comic book series, written by Tom Veitch and Kevin J. Anderson and released in 1994. Sadow appears in a flashback to the end of his unsuccessful war on the Republic, a story that would later receive its own story arcs, Tales of the Jedi: The Golden Age of the Sith and Tales of the Jedi: The Fall of the Sith Empire, both written by Anderson, where Sadow appears as a main character. Sadow was originally illustrated by Chris Gossett during his initial appearance in Dark Lords of the Sith, and was drawn by Dario Carrasco, Jr. during his appearances in The Golden Age of the Sith and The Fall of the Sith Empire."}, {"tag": "p", "text": "Sadow's early mentions and his appearances in The Golden Age of the Sith and The Fall of the Sith Empire contain several inconsistencies between them. Tales of the Jedi: Dark Lords of the Sith's account of Sadow's backstory was heavily revised by the later comics: originally, Vodo Bass said that Sadow was a Sith sorcerer and member of an elite priesthood of pure Sith blood who fled to Yavin 4 after being banished from the Sith Empire for rebelling against the ruling Dark Lord, a Dark Jedi who ruled over the Sith people, and being branded a criminal by the Republic. Additionally, Star Wars Insider 26 places Sadow's defeat and flight to Yavin 4 at 4990 BBY, although later sources changed that date to 5000 BBY."}, {"tag": "p", "text": "These inconsistencies extended to the circumstances of Sadow's death. Although earlier sources remained ambiguous on Sadow's death, the Freedon Nadd entry in The Complete Star Wars Encyclopedia definitively states that Nadd destroyed Sadow's spirit, as do most other more recent Legends sources when referring to Naga Sadow's death. Before the release of the video game Star Wars: The Old Republic, IGN reported that the game's Sith Emperor was Naga Sadow, but subsequent sources confirmed that the Sith Emperor was not Sadow, but rather a Sith Lord from his Empire who avoided participation in the Great Hyperspace War. However, Sadow's spirit still appeared in The Old Republic along with other Old Republic supplementary materials, contradicting the sources saying that Nadd definitively destroyed Sadow. There are other discrepancies regarding Sadow's physical appearance. Although Sadow's Tales of the Jedi appearances consistently portray him as having the reddish skin typical of the Sith species as well as brown eyes, Sadow's depiction in The New Essential Guide to Characters shows him with a more Human appearance, with lighter skin and green eyes. As many other Sadow depictions are truer to his original comic appearance, this article treats his original appearance as being correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}