{"url": "Nagry", "categories": ["Category:Canon articles", "Category:Females", "Category:Imperial Navy officers of the Galactic Empire", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Nagry"}, {"tag": "p", "text": "Nagry was a female ensign in the Galactic Empire. She served Colonel Shakara Nuress of the 204th Imperial Fighter Wing on the Orbital One space station above the planet Pandem Nai. When the New Republic's Alphabet Squadron attacked the 204th at Pandem Nai, Nagry reported to Nuress when the captain of the corvette Lancer wished to flee the system, to which the colonel ordered that he recall into low orbit or Pandem Nai. When the pilot Nath Tensent boarded the station to confront Nuress, he knocked Nagry unconscious. Nuress was shot by Tensent shortly after, and died before being able to wake the ensign."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, Nagry served as an ensign in the Galactic Empire aboard the tibanna gas mining station Orbital One, located in the orbit of the planet Pandem Nai. She operated in the command center of the orbital station. Around a month after the Battle of Endor in 4 ABY, the Empire's 204th Imperial Fighter Wing, led by Colonel Shakara Nuress, occupied Pandem Nai and its orbital stations to use as a base of operations to restock and resupply Imperial forces."}, {"tag": "p", "text": "The 204th was soon attacked at Pandem Nai by the New Republic's Alphabet Squadron, a composition of five rebel starfighters each of a different model, which were backed by a battle group which formed a blockade outside the battle zone. During the attack, Nagry informed Nuress when the captain of the corvette Lancer requested clearance to flee Pandem Nai. Nuress told the ensign to recall the captain to low orbit. As the battle progressed, other staff in the command center were sent to carry messages after communications went offline. Nagry attended to her console whilst gripping a comlink simultaneously. After Major Rassus was sent to relay a message to the TIE squadrons in the hangars, only Nagry, Nuress and an Imperial sentinel remained at the command center."}, {"tag": "p", "text": "That was when the rebel pilot Nath Tensent entered the room with a pistol drawn. The rebel, wishing to talk to Nuress about the deaths of a former squadron of his at the hands of the 204th, slowly traversed the perimeter of the command center. When Tensent passed behind Nagry, she slipped her hand towards her hip. Suspecting that she was about to draw a blaster, the pilot thrust his fist onto the ensign's head, slamming it into the console. Nagry slumped onto her chair unconscious before sliding off onto the floor. After getting what he wanted from Nuress, Tensent shot the colonel in the chest and left. Nuress considered waking Nagry but died shortly after from her wound."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nagry first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}