{"url": "Nahdar_Vebb", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Healers and doctors", "Category:Jedi Generals", "Category:Jedi Knights of the Jedi Order", "Category:Males", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Nahdar Vebb"}, {"tag": "p", "text": "Nahdar Vebb was a male Mon Calamari Jedi Knight of the Jedi Order. From the planet Mon Cala, he was trained to be a Jedi by the Nautolan Jedi Master Kit Fisto, although when Fisto was called elsewhere, Vebb was forced to complete his Jedi Training on his own. He did so successfully, passing his Jedi Trials and becoming an accomplished Force healer. Shortly after, he was reunited with Fisto when the two both tracked the escaped Confederacy of Independent Systems leader Nute Gunray to the moon Vassek 3. After locating the fortress where they had tracked Gunray, the two Jedi along with a squad of clone troopers went inside. They quickly heard Gunray's voice, and wiped out the B1-series battle droids that accompanied it, with Vebb, much to the disapproval of Fisto, doing so with gusto. The group then approached the origin of Gunray's voice, only to find that it was a hologram, and Gunray was not actually there."}, {"tag": "p", "text": "After walking around the lair, they discovered statues of the cyborg General Grievous, revealing that it was his castle that they were in. At that point, Grievous landed in his starfighter and was quickly ambushed by the Jedi and clones. Vebb and Fisto began to fight against Grievous with their lightsabers and tried to use the clone troopers' cables to immobilize Grievous. However, Grievous was able to escape even as his midsection was cut in half by Fisto, attacking several clones and running away through a hidden door which he closed behind him. Grievous's pet roggwart, Gor, was later released by Grievous to attack the group. Vebb, Fisto, and Commander Fil fought it as best as they could, and were eventually able to kill it, though not without losing Fil in the process. Fil's death infuriated Vebb, and much to his former master's surprise, he declared that he would take revenge on Grievous. The pair then kept moving, and came to the control room. They were about to hurry inside, but Grievous's personal droid, EV-A4-D, alerted the cyborg. While Vebb and Fisto argued about what to do next, EV-A4-D closed the door, isolating Vebb on his own with Grievous and some of his MagnaGuards. While Vebb was able to take out the droids easily, he fared worse with Grievous. He was easily led into a trap and killed, much to the shock of Fisto."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and training"}, {"tag": "p", "text": "Nahdar Vebb was from the planet Mon Cala. He was trained as a Jedi by Kit Fisto, an accomplished Nautolan Jedi Master, although when Fisto was called elsewhere, Vebb was forced to complete his training on his own. Vebb was among the many Jedi during the Clone Wars who passed to Knighthood sooner than he ideally would have. He became an accomplished Force healer and tended to the wounded of the Republic Army. He also became a Jedi General and led troops into battle, thinking that he could lead them just as well as a more experienced Jedi could."}, {"tag": "h3", "text": "Looking for Gunray"}, {"tag": "p", "text": "Shortly after Nahdar Vebb completed his Trials, in 21 BBY, the Republic had taken Separatist leader Nute Gunray into custody, but with the help of Count Dooku, was able to escape. Master Kit Fisto, along with Vebb, his former Padawan learner, had both tracked Gunray to the moon Vassek 3 in the Vassek system. When Fisto was alerted by Jedi Master Luminara Unduli via a hologram that Vebb had also gone to the system, he remarked that it would be good to see him again. When Fisto arrived on Vassek 3, Vebb was already there, having landed in a fully-armed Nu-class shuttle."}, {"tag": "p", "text": "He congratulated Vebb on completing the Trials, and offered his apologies that he could not be there. Vebb admitted that he was indeed missed, but also told Fisto that it was an honor to finally serve beside him as a Jedi Knight. Clone Commander Fil told Fisto that the entrance had been located. Vebb used the Force to dissipate the fog from the entrance. Although Vebb and the clones were eager to cut open the door using a lightsaber and a thermal detonator, respectively, Fisto took a second look, and was able to make the doors swing open with the simple push of a button."}, {"tag": "p", "text": "The group walked in, with Fisto and Vebb leading. One of the clones remarked that it did not smell like droids to him. As they progressed down a hall, Fisto sensed that something was there, even though the clone's scanners were negative. A loud growl then indicated that the sensors were inaccurate. At that point, Nute Gunray's voice was able to be heard. He instructed a group of B1-series battle droids to stay on guard as the Jedi walked in. Fisto and Vebb began to smile in anticipation of what was about to happen."}, {"tag": "p", "text": "The pair took down the battle droids easily, although Vebb attacked one of the droids even after it had been disabled. This led to a scolding from Master Fisto. Vebb apologized for getting carried away. They then walked up to the chair where Gunray's voice was coming from. Vebb used the Force to swing around the chair, only to reveal a hologram of Gunray, as opposed to the actual Neimoidian. Gunray called them fools, and warned them that coming to the fortress would mean their doom. Vebb realized that the tracking beacon should have given away the fact that it was all a ruse, with Fisto also feeling that he should have known."}, {"tag": "h3", "text": "Lair of Grievous revealed"}, {"tag": "p", "text": "The holoprojector that had shown Gunray, which had turned itself off, lit up blue once again, this time with Count Dooku. Dooku apologized for the deception, and told them that while Gunray would not be available for capture, he could offer them an alternative prize. He then turned off his hologram, leaving the chair beeping with a flashing red light. Fisto speculated that Dooku was attempting to catch someone, with the Jedi as bait. Vebb wondered aloud who the trap had been set for. Intrigued, he pushed a button on the chair, which opened a tall set of doors. As they walked down the following hallway, they passed by statues of warriors. They then found a large room filled with heads of the cyborg General Grievous, revealing that they were in his lair."}, {"tag": "p", "text": "Above the planet, Grievous arrived in his starfighter. He received a message from Dooku, who told him that Darth Sidious expected more of him, and that more Jedi kills would be necessary. At the same time, Vebb found several Padawan braids in a glass case, and reasoned that they must have been trophies that Grievous had taken from Jedi he had killed. Fisto and Vebb then discussed who the trap was really for. Fisto did not think it made sense for Dooku to set a trap for his best general, and Vebb considered whether they were the bait or if Grievous was."}, {"tag": "p", "text": "Fisto received a message from a clone he had told to stay with the ship that a starfighter that matched that of Grievous's was headed their way. Vebb said that capturing Grievous could turn the tide of the war, with Commander Fil saying that with the element of surprise on their side, they could take him down easily. Fisto reminded the two of them not to underestimate him, and that a plan would be necessary."}, {"tag": "h3", "text": "Bout with Grievous"}, {"tag": "p", "text": "Grievous landed his starfighter in his lair's hangar, and was surprised by the absence of his guards. He was then ambushed by the Jedi and clones. Fisto asked for his cooperation and surrender, but Grievous ignited his four lightsabers and began to fight Vebb and Fisto. They exchanged blows, and Fisto instructed the clones to launch their cables in an attempt to immobilize Grievous. Vebb and Fisto continued to strike him with their lightsabers, trying to make sure that he would not get an opportunity to cut the lines."}, {"tag": "p", "text": "Fisto sliced Grievous in half at his midsection, but he was able to use his many limbs to crawl away. Vebb chased after Grievous, threatening to destroy him. With the help of Fisto, Vebb was able to knock away one of Grievous's lightsabers. Grievous jumped away, and grabbed one of the clone troopers to use as a shield. He threw the trooper at Vebb and knocked him to the ground. He then began to run away, using rungs on the ceiling to move quickly above the floor. Vebb called for them to cut him off, although as they chased after him, he turned around and attacked two clone troopers, disabling them. He then opened a secret door, went through it, and closed it behind him, leaving the remaining two clones and the Jedi trapped. Much to Fisto's disapproval, Vebb complained that he could have taken Grievous had the clones not gotten in his way. Fisto told him that they would take care of their wounded."}, {"tag": "p", "text": "As Vebb and Fisto tended to the clones, a field Vebb was trained in, Vebb asked permission from Fisto to go after Grievous himself, believing he was ready. Fisto told him that although he was no longer a Padawan, it did not necessarily mean he was ready to take on General Grievous. As Grievous watched via hologram, Fisto proclaimed that it was time they retreated, and they ran away. However, Grievous used his array of buttons to close the doors that the group would have used, and Fisto realized that a fight would be inevitable. Commander Fil told the clones who had not entered the lair to call the Bestine fleet for reinforcements."}, {"tag": "p", "text": "Unbeknownst to the clones, they were being watched by IG-100 MagnaGuards, one of whom used an RPS-6 rocket launcher to destroy their shuttle. R6-H5 then called up Master Fisto via comlink, informing him that Kit Fisto's Delta-7B Aethersprite-class light interceptor was under attack by MagnaGuards. Fisto told Arsix to get away, which he successfully did, but lost contact with Fisto. Grievous then appeared to the group via hologram, informing them that they had run out of time. Fisto asked him to come out of his hiding place, but Grievous invited them to \"experience all [his] home had to offer,\" and explained that it had been prepared for uninvited guests like them."}, {"tag": "h3", "text": "Attack of Gor"}, {"tag": "p", "text": "Vebb apprehensively told Fisto that he had a bad feeling about the situation. It was then that the floor fell out from under them. The Jedi were able to leap to safe ground, but both clones fell in. While one of the troopers immediately perished, Commander Fil used a cable on his blaster to temporarily cling to the wall. Vebb quickly ran to help him get back out, and with the help of Fisto, was able to do so. This took a great deal of strength from the two Jedi, and they had to sit down to regain their breath."}, {"tag": "p", "text": "Fisto, who at this point figured out that they were being watched by Grievous, told him that they were unimpressed with his home. Grievous told the group through the speaker that they would still provide sport for him. Having turned off the channel to the visitors, he told his pet roggwart, Gor, that it was time to \"entertain\" his guests. He was then operated on by his doctor droid, EV-A4-D."}, {"tag": "p", "text": "Vebb, Fisto, and Fil stood on guard with their weapons drawn. Just as Fisto warned that there could be things worse than Grievous there, a large door opened to reveal Gor. Gor roared at them as Fil's blasterfire did no damage. Vebb launched himself at the Roggwart and stabbed him in his back, although this only intensified Gor's rage. He swung his tail around, knocking down down Fil and nearly Fisto, who was able to duck. Gor then picked up Fil with his tail, and swatted Vebb away when he tried to help rescue him. Fisto struck Gor's face with his lightsaber, but he continued to hold Fil and even smashed him on the ground."}, {"tag": "p", "text": "Vebb sliced off a part of Gor's tail in order to release the Commander. Fisto then cut off his two front limbs and, after the roggwart fell to the ground, impaled his neck and killed him. However, it was not enough to save Fil, who had died. Vebb angrily held Fil in his arms, and vowed that he would destroy Grievous for Fil's death. Fisto sympathized with Vebb's pain, but had to remind him that revenge was not the Jedi way. Vebb did not hear Fisto, and insisted that the rules had changed due to the war. Fisto suggested that it was instead Vebb who had changed. Vebb and Fisto kept moving."}, {"tag": "h3", "text": "Vebb is overconfident"}, {"tag": "p", "text": "The pair hid next to a wall as Grievous walked by with his MagnaGuards. They observed as he entered the code to lock a door. Vebb realized that Fisto had been right, and that the exit led to the control room. However, they were being watched by EV-A4-D, who quickly alerted Grievous to their presence. Fisto ordered Vebb to hurry inside, but Vebb insisted that Fisto should go, and that he could hold off Grievous. While they argued, EV-A4-D closed the door in between the two Jedi, trapping Fisto in the control room and Vebb out of it."}, {"tag": "p", "text": "He ignited his lightsaber and said aloud that he had been waiting for this as three MagnaGuards approached him. He dealt with them with ease, using the Force as well as his lightsaber to take them down. However, down the hall was Grievous along with two more MagnaGuards. He inquired Vebb about the whereabouts of his master, and Vebb shot back that he would find out soon, and that Grievous could not defeat all of them. The two began to duel, with Grievous using two lightsabers against Vebb's one. Kit Fisto advanced towards EV-A4-D, who was watching the bout via an array of viewscreens. He took his lightsaber and cut the chair that the droid was sitting in in half, which decapitated EV-A4-D. He then turned his attention to the duel."}, {"tag": "p", "text": "Grievous and Vebb locked lightsabers, and as they struggled to gain ground, Grievous used his third arm to reach for a blaster and fired three shots through Vebb's abdomen. Vebb groaned as his body collapsed to the ground. As Fisto watched, he could only say the word \"no\" as he fell backward into the chair."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Grievous added Vebb's lightsaber to his collection and said to the camera, knowing that Fisto was watching, that he would kill them all. After a short duel with Grievous, Fisto was able to reclaim Vebb's weapon and escape. Dooku told Grievous in a holographic message that the victory over Vebb had been expected."}, {"tag": "p", "text": "Once Fisto returned to the Jedi Temple on the Core World of Coruscant, he gave a report to the Jedi High Council. He told Master Mace Windu that Vebb's heart had been in the right place, but had tried to answer Grievous's power with his own. Grandmaster Yoda affirmed that such an action was not the Jedi way, and that there was a danger of losing who the Jedi were due to the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Mon Calamari male, Nahdar Vebb elevated to the role of Knighthood quicker than he should have, and had trouble handling the pressure and reality of war. Vebb was very self-confident, and felt that he could lead troops into battle just as well as a more experienced Jedi could. A brash warrior, Vebb actively sought out conflict, and his youth was put on display as he only had one barbel under his chin. He struggled to keep his anger at the Separatists under control."}, {"tag": "p", "text": "During the mission to Vassek 3, Vebb was quick to suggest using physical force to open the door to the lair without even attempting to find a simpler solution. When Vebb, Fisto, and the clones encountered battle droids, Vebb destroyed them with zeal, even Force pushing their already broken-off fragments, much to the concern of Fisto. During Vebb's first bout with Grievous, he immediately threatened to destroy him without offering an alternative. After Grievous escaped, Vebb shirked the responsibility, insisting that had it not been for the clones getting in his way, he could have defeated the cyborg general. His vengeful, forceful mood was met with much disapproval from Fisto."}, {"tag": "p", "text": "After Grievous told the group via hologram that they would experience all his home had to offer, Vebb admitted he had a bad feeling about the situation. After Clone Commander Fil was killed, Vebb angrily suggested that he would take revenge upon Grievous, which led to an additional scolding from Fisto. Vebb asserted that in war only strength would prevail, and that the rules had changed. Fisto put forward that it may have been Vebb who had changed."}, {"tag": "p", "text": "When Vebb and Fisto were caught by EV-A4-D trying to go into the control room, instead of rushing in, Vebb proceeded to argue with Fisto about what their next move should be. Once they had been separated, Vebb eagerly sliced through Grievous's IG-100 MagnaGuards. During his fight with Grievous, Vebb placed too much value on matching his enemy's power with his own. Vebb had orange skin, yellow eyes, and stood 1.86 meters, or six feet and one inch tall."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A Force-sensitive, Nahdar Vebb was able to complete his Jedi training even when his master, Kit Fisto, was called elsewhere. Vebb took his Jedi Trials sooner than he ideally would have due to the Clone Wars. Nonetheless, he successfully passed them, and became an accomplished Force healer. He was skilled in lightsaber combat enough to defeat B1-series battle droids and IG-100 MagnaGuards, but was easily led into a trap by Grievous, who was trained in the Jedi arts by Dooku."}, {"tag": "p", "text": "During the mission to Vassek 3, when fighting against droids, Vebb did so eagerly. When Clone Commander Fil nearly fell into a pit, Vebb tried to  pull him out, but was not strong enough and needed the help of Fisto. He was able to assist Fisto in killing Grievous's pet roggwart, Gor. Vebb insisted on throughout the mission that he was ready to face Grievous on his own, but this was disproven when Grievous was able to kill him easily."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Nahdar Vebb wielded a blue lightsaber which he was skilled in using. His lightsaber, just like his master's, had a two way ignition system. He wore Jedi robes that were reminiscent of a traditional Mon Calamari uniform."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Conception and portrayal"}, {"tag": "p", "text": "Nahdar Vebb was created for the first season of the canon television series Star Wars: The Clone Wars. His character was first seen during the opening \"newsreel\" of the episode \"Rookies,\" which used footage from the episode he later returned in and made a full appearance, \"Lair of Grievous,\" where he was identified as Nahdar Vebb. He was voiced by Tom Kenny, who also provided the voice of Nute Gunray in the same episode."}, {"tag": "p", "text": "A major portion of Vebb's look, as well as conceptual art, was done by the Japanese production company Studio I.G. Vebb's design was inspired by Admiral Ackbar, the first Mon Calamari seen in the Star Wars franchise. Design and concept artist Kilian Plunkett explained that Vebb's clothing incorporated elements of Ackbar's uniform from Star Wars: Episode VI Return of the Jedi, such as the collar and cuffs of the sleeves, but was still intended to look just like Jedi robes should."}, {"tag": "p", "text": "The writer of \"Lair of Grievous,\" Henry Gilroy, also mentioned that Vebb was supposed to represent parts of the Jedi Order that had begun to feel the temptation to use power to win the war, which Gilroy did not consider to be the Jedi way. Supervising director Dave Filoni stated that Vebb was a representation of the direction the younger Jedi of the Order were going in."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "In the Databank entry for EV-A4-D, Nahdar Vebb's name is misspelled as \"Veb.\" Although \"Lair of Grievous\" states that Kit Fisto was not present at Vebb's Jedi Trials, the original StarWars.com episode guide states that Fisto had not seen his Padawan since the Trials."}, {"tag": "p", "text": "Lastly, the 2015 reference book Ultimate Star Wars states that Vebb lost his life to Grievous's roggwart, Gor, even though he was actually depicted as having been slain by Grievous. Not only does this contradict the episode, but it also contradicts Ultimate Star Wars itself, which correctly gives Vebb's killer as Grievous on a separate page. Although the page for Grievous in the 2019 follow-up reference book to Ultimate Star Wars, Ultimate Star Wars, New Edition, is copied from its predecessor, the error regarding Nahdar Vebb was corrected."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}