{"url": "Nahdar_Vebb/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conflicting sources", "Category:Jedi healers", "Category:Males", "Category:Mon Calamari", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Nahdar Vebb"}, {"tag": "p", "text": "Nahdar Vebb was a male Mon Calamari who served as a Jedi Knight during the Clone Wars between the Galactic Republic and Confederacy of Independent Systems. Vebb was the Padawan of Jedi Master Kit Fisto prior to the Clone Wars, but with the outbreak of the war, Fisto became a Jedi General in the Grand Army of the Republic and was unable to see Vebb's apprenticeship through to the end. Sometime around the beginning of the war, Vebb completed his training in his Master's absence and ascended to the rank of Jedi Knight. With the war still raging, Vebb joined the Republic's forces as a Jedi healer, enthusiastically working to combat the Confederate war machine. The conflict had a grave effect on the young Mon Calamari, driving Vebb to seek revenge for Separatist crimes against his homeworld of Dac and pushing him to embrace the violence of the struggle."}, {"tag": "p", "text": "In 22 BBY, Viceroy Nute Gunray, a leading member of the Separatist Council, escaped Republic captivity and stole a Republic corvette to flee. Vebb, Clone Commander Fil, and a group of clone troopers tracked the stolen vessel to the third moon of Vassek in the hopes of recapturing Gunray. Shortly after arriving, Vebb and the clones were met by the Mon Calamari's former Master, Kit Fisto, who had also been trailing Gunray. On the moon the Jedi and clones discovered a large fortress, and after continuing investigations inside the castle, they realized that they had been lured to the moon by Confederate Head of State Count Dooku as a test for General Grievous, the Supreme Commander of the Separatist Droid Army and a notorious Jedi hunter."}, {"tag": "p", "text": "Vebb and the others discovered that they were inside Grievous's lair and planned to engage and capture the cyborg general, but upon his return, Grievous killed most of the clones and escaped from Vebb, Fisto, and Fil. The three were trapped in the castle, and with Fil's death at the hands of the general's pet roggwart, Gor, Vebb became increasingly angered and aggressive. When he saw an opportunity to kill Grievous, Vebb acted against Fisto's orders and dueled the general. The Mon Calamari was slain by Grievous, but Fisto managed to retrieve Vebb's lightsaber from the general before escaping."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "A male Mon Calamari from the planet Dac, Nahdar Vebb was the second Padawan learner of his species to be assigned to the Nautolan Jedi Master Kit Fisto. Following the First Battle of Geonosis and the outbreak of the Clone Wars in 22 BBY, Fisto was called upon to serve as a Jedi General in the Grand Army of the Republic against the droid armies of the Confederacy of Independent Systems. Fisto's duties as a general kept him away from Vebb, forcing the apprentice to continue his training bereft of a master. Although the Mon Calamari had no memory of his homeworld, Vebb was deeply troubled by the devastation the Confederacy wrought upon Dac. Eager to bring the Confederate leaders to justice for his people's suffering, Vebb fought determinedly on the front lines of the war and was eventually called upon for promotion to the level of Jedi Knight."}, {"tag": "p", "text": "Vebb eventually passed the Jedi Trials and became a full-fledged Knight. With the Clone Wars raging across the galaxy, Vebb joined the Republic's forces as a Jedi healer, working to aid clone troopers and other Republic personnel who had been wounded in battle. Vebb helped the injured troopers to continue fighting despite their wounds. At some point over the course of the war, Vebb served with both the 21st Nova Corps and Clone Commander Fil's forces."}, {"tag": "h4", "text": "Tracking Gunray"}, {"tag": "p", "text": "In 22 BBY, Separatist Council member Viceroy Nute Gunray was captured by Republic forces after his failed attempt to bring the planet Rodia into the Confederacy, but Gunray escaped from Republic captivity with the aide of several Confederate agents. The Neimoidian fled in a stolen Republic frigate, and Vebb tracked the frigate's homing beacon to the rocky third moon of the Outer Rim planet Vassek alongside Fil and a small contingent of clone troopers. Shortly after making landfall in a Nu-class shuttle, Vebb and the troopers were met by the Mon Calamari's old master, Kit Fisto, who had also tracked Gunray to the moon. Fil reported to the two Jedi that the Republic frigate's tracking beacon had been pinpointed in the south end of a nearby gorge, and the group headed to investigate."}, {"tag": "p", "text": "In what Fisto considered an unnecessary show of Force ability, Vebb parted the dense fog that concealed the gorge, revealing a set of large, vaulted doors set into the rock face. As the Jedi and clones approached the doors, Vebb moved to slice through the entryway with his lightsaber; however Fisto took a calmer approach and examined the doors, finding a concealed switch that granted them access. Vebb and his comrades entered through the doors, finding a dark labyrinth of halls and corridors comprising a massive fortress that stretched far back into the gorge. While moving down the halls toward the only lit room, they heard the voice of Gunray ordering a group of B1-Series battle droids to protect him from his Jedi pursuers. In reality, the viceroy was only acting as bait for the Jedi; Fisto and Vebb were approaching a mere hologram of the Neimoidian."}, {"tag": "p", "text": "Believing Gunray to be seated in a large chair faced away from them, the Jedi began to cut through his battle droid guards. The young Vebb exhibited particular brutality during the fighting, Force-pushing the segments of droids that had already been destroyed. Once the battle droids were defeated, Vebb used the Force to spin the viceroy's chair around, revealing Gunray's hologram. The gloating viceroy explained to the clones and Jedi that they had walked into a trap shortly before being replaced by a hologram of Count Dooku, the Confederate Head of State. Dooku sardonically apologized for inconveniencing the Republic forces and claimed he would be offering them a different prize in place of Gunray. Dooku's image faded away, leaving a flashing button on the chair's control panel."}, {"tag": "p", "text": "Anxious for answers, Vebb pushed the button, revealing another dark hallway. At the end of the hall, the Jedi and clones came upon a room filled with spare cybernetic limbs, bringing them to the realization that they had entered the lair of General Grievous, the cyborg Supreme Commander of the Confederate Droid Army and a notorious Jedi hunter. Unbeknownst to Vebb, Fisto, and the clones, Dooku was using them as pawns in a test for Grievous, whose abilities as a general had been called into question after a recent string of Confederate defeats. The Jedi and clones continued to search the general's castle, and Vebb was angered upon finding a trophy room filled with items the cyborg had taken from the Jedi he had slain over the course of the war. Vebb's anger turned to excitement upon receiving a report that General Grievous's starfighter was approaching the moon, providing the Republic forces with an opportunity to kill the Confederacy's best general and turn the tide of the war."}, {"tag": "p", "text": "Grievous, who was unaware that Republic forces had infiltrated his lair, returned to his castle only to be quickly ambushed by Vebb, Fisto, and the clones. While the Jedi engaged the general, the clones fired grappling hooks at the cyborg's legs, preventing him from escaping. After Fisto severed Grievous's legs, Vebb attempted to kill the general while he was on the floor; however, Grievous blocked the attack and then beat Vebb back by throwing the corpse of a clone trooper at him. The cyborg retreated into the depths of his castle by using fixtures on the walls and ceiling, while Vebb and the clones gave chase. The Mon Calamari lost the general after a pair of clones were killed while trying to prevent the cyborg's escape. Vebb was infuriated by the loss, having believed he could have fought Grievous had the clones not been in the way. The Mon Calamari's old Master was troubled by his aggression and suggested that they instead focus on their wounded. With only Vebb, Fisto, Fil, and one other trooper still alive, Fisto decided that retreat was necessary, despite Vebb's determination to engage Grievous. The general, watching the remaining Republic forces in his lair's control room via holocam, sealed his castle, trapping Vebb and his comrades."}, {"tag": "h4", "text": "Hunted"}, {"tag": "p", "text": "Grievous, determined to kill all the intruders, activated a trap door where Vebb, Fisto, and the clones stood. Though the two Jedi leaped to safety, Fil and the only other surviving clone fell toward a molten incinerator vat. Receiving assistance from Fisto, Vebb saved Fil by grabbing onto his ascension cable, which the commander had fired at the ceiling. However, the other trooper fell to his death, and Vebb, Fisto, and Fil were soon confronted with Gor, Grievous's pet roggwart. After Gor grabbed the clone commander with his prehensile tail, Vebb attempted to save Fil, but he was knocked into a wall as Gor continued to slam Fil into the ground, killing the clone trooper commander. Attacking again, Vebb severed Gor's tail while Fisto drove his lightsaber into the beast's neck. With Gor dead, Vebb held Fil's dead body, swearing to avenge the trooper. Wary of his former Padawan's anger, Fisto reminded him that revenge was not the Jedi way, to which Vebb replied that the war had changed the rules and that strength was now required for survival. Still troubled by Vebb's actions, Fisto suggested that it was Vebb who had changed but nevertheless insisted that the two continue moving."}, {"tag": "p", "text": "Vebb and Fisto eventually arrived outside Grievous's control room. The general, who had been repaired by his medical droid, EV-A4-D, went in search of the two Jedi with a squad of his IG-100 MagnaGuards. Fisto was successful in opening the door to the hidden chamber by repeating the sequence that Grievous had entered into it, but EV-A4-D, monitoring the Jedi's progress from the control room, alerted Grievous to their presence over the castle's speaker system. As the general turned around and headed to confront the Jedi, Vebb insisted on staying to face the cyborg to allow his former Master to flee. Fisto ordered Vebb to follow, and while the two argued, EV-A4-D resealed the control room door, separating the two Jedi and trapping Vebb from safety. The young Mon Calamari, still determined to defeat Grievous, attacked and destroyed four of his MagnaGuards before engaging the general himself. Believing the general's death would alter the course of the war and bring justice to the galaxy, Vebb joyfully dueled the cyborg for a brief time. Upon entering into a saberlock, Grievous used one of his extra arms to repeatedly fire a DC-17 hand blaster into Vebb's abdomen, killing him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Having killed Vebb, Grievous claimed the fallen Jedi's lightsaber. From the control room, Fisto witnessed his former Padawan's death, and although grief-stricken, he was able to make it to the castle's south landing platform, where his Delta-7B starfighter was waiting. On the platform, Fisto briefly dueled Grievous and was able to reclaim Vebb's lightsaber before escaping. Fisto returned to the Jedi Temple on Coruscant, where he reported on the mission and Vebb's death to Jedi Masters Yoda and Mace Windu. Vebb's notable lack of self-control that went against his Jedi teachings caused Yoda to question the war's effects on the Jedi Order."}, {"tag": "p", "text": "Padawan Nuru Kungurama would offer his condolences to Master Fisto regarding the loss of Vebb."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nahdar Vebb had orange skin and a single barbel on his chin, an indication of his youth. He had yellow eyes and stood 1.86 meters tall. Although the strong-willed and forceful Vebb was honored to serve as a Jedi Knight, he was an impulsive individual who often sought conflict instead of peace, contrary to the Jedi Code. Vebb cared deeply for the well-being of his species and became consumed by his need to avenge the suffering the Mon Calamari experienced at the hands of the Separatist Council. During the war, he enthusiastically fought the Confederate war machine and looked forward to new missions and objectives. The young Mon Cal eagerly embraced the opportunity to travel to the third moon of Vassek with the news that Nute Gunray could be brought into his grasp, and was glad to once again be working alongside his former Master, Kit Fisto. While on the Vassek moon, Vebb insisted upon using the Force for simple tasks such as making his way through a dense fog bank and spinning Gunray's chair. Unlike Fisto's much calmer approach, Vebb was prepared to force his way into Grievous's castle with his lightsaber."}, {"tag": "p", "text": "While he was within the castle, Vebb became increasingly brutal, first in his dismembering of the battle droids and later during his attacks on Grievous. Upon discovering that he was indeed within the Confederate general's sanctuary, Vebb excitedly jumped at the opportunity to fight Grievous, both for the sake of the war effort and to avenge the Jedi who had been slain by the general. Vebb was angered after seeing the trophies that Grievous had taken from the Jedi he had murdered and attacked the cyborg mercilessly during their first encounter, attempting to destroy Grievous even after the general was pinned to the floor following the amputation of his legs. When Grievous escaped, an infuriated Vebb blamed the clone troopers for getting in his way."}, {"tag": "p", "text": "Despite his anger at the troopers, Vebb was greatly upset by the death of Commander Fil, swearing retribution on Grievous for the loss. Fisto reprimanded him for his anger, though Vebb's views on the matter went unchanged—the war had already taken its toll on the young Jedi, changing the Mon Calamari's outlook on proper actions for a Jedi. Vebb believed that veteran Jedi such as Fisto were unable to understand that conventional Jedi practices became obsolete in wartime. Although Vebb disagreed with his old Master, the Mon Calamari eventually gave his life so that Fisto could escape the castle."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Mon Calamari, Nahdar Vebb was capable of breathing under water for up to thirty hours. He was skilled in healing wounds through the Force and used this ability to aid Republic forces during the Clone Wars. Vebb was capable of clearing the air around Grievous's castle of the dense fog that covered the surrounding region. The Mon Calamari was also a skilled duelist, able to single-handedly defeat four IG-100 MagnaGuards and defend himself against Grievous for a short time, but was eventually slain by the cyborg."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vebb was skilled in wielding a lightsaber, and he wore Jedi robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nahdar Vebb was first mentioned in the 2008 Star Wars Insider 104 article \"Launch Pad,\" and later appeared in the 2008 first season of the Star Wars: The Clone Wars television series. His character was seen during the opening \"newsreel\" of the episode \"Rookies,\" and was later introduced in \"Lair of Grievous,\" in which he was voiced by Tom Kenny, who also provided the voice of Nute Gunray in the same episode. Vebb also appears in the 2011 video game LEGO Star Wars III: The Clone Wars, which replicates scenes from The Clone Wars, such as the mission to Grievous's lair, in a comical and non-canon fashion."}, {"tag": "p", "text": "Vebb's design was inspired by the first Mon Calamari in the Star Wars saga, Admiral Ackbar. The Jedi's clothing incorporates elements of Ackbar's uniform from Star Wars: Episode VI Return of the Jedi, such as the collar and cuffs of the sleeves."}, {"tag": "h3", "text": "Inconsistencies and non-canon material"}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia, which was published shortly before the original air date of \"Lair of Grievous,\" introduced inconsistencies in the character's backstory. While the episode and the young reader book The Clone Wars: Grievous Attacks! indicate that Vebb's training was completed during the Clone Wars, The Complete Star Wars Encyclopedia claims that his training was completed before that of Fisto's other Mon Calamari apprentice, Bant Eerin. Eerin's Knighthood was established in the young reader novel Jedi Quest: The Changing of the Guard, which takes place several years prior to the Clone Wars. The Changing of the Guard was published in 2004, four years before the release of both \"Lair of Grievous\" and The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "In video game portrayals of the mission to Vassek's third moon, Nahdar Vebb is conspicuously absent. In the non-canon computer game Path of the Jedi, available on Cartoon Network's official site, Ahsoka Tano, Anakin Skywalker, or Yoda are aiding Fisto in place of Vebb. Nahdar is also absent from the mission in the Nintendo DS version of the 2009 video game Star Wars: The Clone Wars: Republic Heroes."}, {"tag": "p", "text": "Nahdar Vebb is again seen in The Clone Wars Animated Comics, a series of short, non-canon videos based on LEGO products. In Episode 4: A Grievous situation, Vebb is placed in charge of a contingent of clones sent to Tatooine on a mission to find General Grievous, who was shot down over the planet by Jedi Master Plo Koon. After combing the desert with little luck, one of Vebb's troopers sights a column of smoke from the general's downed starship. Vebb travels to the crash sight with the clones, only to find Grievous sunbathing while EV-A4-D works to reattach the limbs he lost in the crash. The two enter into a short duel, but Grievous is forced to retreat when Koon arrives to provide support to Vebb. This video is available on the LEGO Star Wars website, and features the option to view the story from either the Republic or Confederate perspective."}, {"tag": "p", "text": "In LEGO Star Wars III's adaptation of \"Lair of Grievous,\" Vebb accompanies Fisto until the end of the mission. The two reach a landing platform, where they simultaneously battle Grievous and use a communications array to call Fisto's starfighter. When the starfighter arrives, Vebb and Fisto jump onto in. However, Vebb then charges Grievous and is cut to pieces off-screen, his remains falling into Fisto's hands."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}