{"url": "Assassination_of_Thrackan_Sal-Solo", "categories": ["Category:Legends articles", "Category:Assassinations"], "nodes": [{"tag": "h1", "text": "Assassination of Thrackan Sal-Solo"}, {"tag": "p", "text": "In 40 ABY, an assassination was carried out on Thrackan Sal-Solo on Corellia."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After having multiple assassins sent after him, Han Solo decided it was time to stop Thrackan Sal-Solo. While on Corellia, Han and Leia Organa Solo met with Dur Gejjen, who provided Han with the floor layout to the G.O., where Thrackan was."}, {"tag": "p", "text": "After meeting Thrackan on Corellia to discuss a job to help defend Centerpoint Station, Boba Fett was asked by Dur Gejjen to kill Thrackan, while the two were touring the area. Offered one million credits, Boba accepted the job."}, {"tag": "p", "text": "While inspecting the area where Thrackan was, Han crossed paths with Boba, who forcefully took Han to a building and told him that he wanted to use Han as bait to find his daughter, Ailyn Vel (since Han had a contract on his head that Ailyn had accepted). Han revealed that Ailyn had been captured, and thus he was useless as bait. However, as it was Han's son Jacen Solo that had captured Aiyln, it was worked out that, in turn for getting an opportunity at Thrackan while with Boba, Han would get Ailyn released."}, {"tag": "p", "text": "Later in Slave I, Boba told Han that he would be the one killing Thrackan, but Han could still have a shot at him if he liked. Han, not exactly happy, went along still, and Fett gave the plan, using an image of the building layout—which he mapped earlier with his helmet when touring the place with Dur—to show how they would enter and eventually exit."}, {"tag": "h2", "text": "The assassination"}, {"tag": "p", "text": "As Thrackan was still awaiting Fett's response as to whether or not he would accept the job of protecting Centerpoint with large force of Mandalorians, Fett, his granddaughter Mirta Gev, and Han (in a spare set of Mandalorian armor) entered the building freely. Fett requested to Thrackan that they talk in private, and they headed into a sound-proof room that connected to an escape tunnel. Fett began discussing Centerpoint, and Han leapt over the desk in the room, strangling Thrackan. Thrackan then revealed that he tipped off the authorities at Coruscant, letting Aiyln get captured to thus lull Han into a false sense of security so the other assassins he sent could catch up with Han. Fett stopped Han, and decided he would indeed be the one to kill Thrackan for betraying his daughter, but Mirta stepped in as well and shot Thrackan three times in the head. Fett then shot him twice more to make sure he was dead, and the trio then escaped via the tunnel."}, {"tag": "p", "text": "They were pursued by guards and eventually reached a bunker, briefly exchanged fire with the guards, then ran into another tunnel. Eventually after stopping the guards and reaching the end of the tunnel, they entered into a park, and Han called Leia to come pick them up."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "An emergency meeting was called with the leaders of all of the political parties. A coalition of the Democratic Alliance and the Corellian Liberal Front emerged to govern Corellia, with Dur Gejjin leading it, and with an advisory role being served by the Centerpoint Party, after an agreement between all parties. The administration of the coalition stated that they believed the assassination was carried out by Alliance agents, much to the benefit of Boba, Han, and Mirta."}, {"tag": "h2", "text": "Appearances"}]}