{"url": "Najib", "categories": ["Category:Legends articles", "Category:Mammalian sentient species", "Category:Najibs", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Najib"}, {"tag": "p", "text": "The Najib were a sentient species indigenous to Najiba, in the Faj system."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Najib were short bipeds, who evolved from simian stock. They possessed two thick arms and legs, and each wide hand had five fingers. Their faces were dominated by a short, snout-like nose with a bony ridge that ran between their eyes and over the top of their heads. They also had long, mane-like hair and whiskery beards on their faces. Their wide mouths were filled with formidably sharp teeth."}, {"tag": "p", "text": "Najib were very well-muscled beings. Because of their stature, they weren't as powerful as species such as Wookiees or the Houk, who were well known for their strength. They were, however, proportionately just as strong."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Najiba, the Najib homeworld, was considered by some to be a backwater planet. While it was located a mere one-hour's hyperspace travel from the Issor system, the world remained isolated from much of galactic society. During one half of its elliptical orbit, Najiba passed near a hazardous asteroid belt known as the \"Children of Najiba,\" at which time all travel to and from the planet was restricted. It was this asteroid belt that prevented the Najib from becoming part of the galaxy at large for thousands of years. Even after contact, their world was inaccessible for much of the year, and trade was infrequent."}, {"tag": "p", "text": "Because of Najiba's irregular orbit and its low axial tilt, the planet remained in a state of near-perpetual springtime. This also created frequent storms, however, which manifested in both rain and electricity. The Najib made their homes in the wetlands of their world. The Byzal canyon was located on Najiba, and was very popular with swoop racers. The planet also boasted a considerable degree of criminal activity."}, {"tag": "p", "text": "The Najib were a boisterous people, and individuals often found it incredibly difficult to turn down an opportunity to eat, drink, or spend time with good company. Passing by a cantina without buying a few drinks was quite a feat for a Najib. While they were a jovial species, they could also be suspicious - especially of strangers - and were ferocious combatants. Najib highly prized their friendships, and were incredibly loyal; nothing angered a Najib more than when one of their friends were threatened. They were also known for being highly adaptable, and due to this, they were rarely caught off guard."}, {"tag": "p", "text": "Though, in later centuries, Najiba would be a part of the Galactic Republic, the Najib had their own planetary government as well. Before contact from the Republic, the largest governmental body on the planet were the local tribes. After contact, however, the tribes banded together to form a \"governing tribe\", which handled galactic affairs such as trade. Each tribe elected an official who would join the governing tribe. These officials would then live and work together, making decisions for the good of the entire species.\nWhile the Najib had access to hyperspace technology, they did not possess the means to create it themselves. They produced little more than feudal-level goods and services, yet these were enough to gain them access to wider trading opportunities. Despite the difficulty in travel, their world was also home to several mining and trading operations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Najib evolved from cave-dwelling primitive primates. They eventually moved out of these caves and began to make their homes in the wetlands of their world, possibly hunting migratory herd animals to survive. The paintings on their ancestors' cave walls would be rediscovered in later eons."}, {"tag": "p", "text": "Najiba was discovered by scouts from the Galactic Republic during its formative years, but due to the difficulty in reaching the world, the Najib themselves weren't contacted until the last few centuries of the Republic's reign. Once contacted, the Najib were interested in learning about the offworlders, but remained suspicious for a time. Eventually, they agreed to join the Republic, and became a part of the galactic government."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}