{"url": "Nakari_Kelen", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic members", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Nakari Kelen"}, {"tag": "p", "text": "Nakari Kelen was a human female who served in the Alliance to Restore the Republic during the Galactic Civil War. Born on the desert planet Pasher, Nakari was the daughter of Fayet Kelen, owner of Kelen Biolabs. Nakari, an expert shot with a slugthrower, worked with Luke Skywalker on an important mission for the Rebellion, during which the two developed romantic feelings for each other. She was killed on Omereth when an explosion sent shrapnel into her body, leaving Skywalker to lament feelings that had been left unsaid."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kelen's mother was sent to the spice mines of Kessel, along with the members of her band, Hakko Drazlip and the Tootle Froots, for writing the subversive song \"Vader's Many Prosthetic Parts.\" The sentence was issued personally by Darth Vader, leading Kelen to hate him and become sympathetic to the Rebel Alliance. Her father, Fayet Kelen, supported her actions, though not publicly, as he had his own business, Kelen Biolabs, to run. Shortly after the Battle of Yavin, Kelen joined lieutenant Luke Skywalker on a number of missions, the overall thrust of which were to rescue the Givin Drusil Bephorin from the clutches of the Galactic Empire so that the Rebel Alliance could employ her skills in cryptography. During the mission, the two built a developing romance and Luke Skywalker shared with her that he had the power to use the Force. Though the mission was ultimately successful, Kelen was killed in the line of duty, saddening Skywalker, who not only had romantic feelings for her, but had come to generally enjoy her company and respect her as a person."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kelen was ambitious and driven. She had a grudge against the Empire for what they had done to her mother and also felt a strong sense of justice, that it was important to prick the hide of the Empire in whatever way possible. Despite her somewhat jaded nature, she had not allowed the Empire to dampen her spirits. She possessed a sharp but genuine sense of humor and displayed a genuine zest for enjoying life when possible. She kept up a series of running jokes with Luke Skywalker and enjoyed spirited conversations with him. She could display a jealous streak at times, but not to the point of pettiness. Luke Skywalker considered her to be \"good for him,\" as she did not seem to have the crushing expectations of him that certain other individuals had displayed. She admitted to having a certain picture of him upon hearing of blowing up the Death Star, but was pleasantly surprised by the individual she discovered. She loved her father, but sometimes found his behavior, such as referring to his employees as \"minions,\" puzzling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}