{"url": "Nal_Hutta/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederation planets", "Category:Hutt Empire planets", "Category:Hutt Space planets", "Category:Mid Rim planets", "Category:Nal Hutta locations", "Category:Planets with shipyards", "Category:Shadowports", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Y'Toub system", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Nal Hutta"}, {"tag": "p", "text": "Nal Hutta (Glorious Jewel in Huttese), also known simply as Hutta, was the capital of Hutt Space and was located in the Y'Toub system. It was formerly known as Evocar and was the original home world of the Evocii, who were ousted by the Hutts in 15,000 BBY, who migrated from their original home world of Varl along with their servants the t'landa Til. The planet was controlled by the ancient ruling Hutt families, who also ruled its moon Nar Shaddaa from Nal Hutta and became the new capital of Hutt Space."}, {"tag": "h2", "text": "Geography and Culture"}, {"tag": "p", "text": "Nal Hutta, or as it was originally known, Evocar, was a very large planet, however it lacked natural heavy metals meaning its density was less than that of most worlds. The planet was originally a lush jungle world with vast oceans, though the Hutts eventually transformed it into a polluted and barren wasteland."}, {"tag": "p", "text": "Once it became known as Nal Hutta, much of the surface became covered by flat, marshy bogs, stagnant, muddy puddles and patches of sickly marsh grass inhabited by insects and spiders. The few other species to survive the Hutt's environmental changes mutated and adapted to the pollutant laden environment. Some, like the Chemilizard were able to extract nutrients from the industrial waste of the Hutts. Others developed extensive chemical defenses. The areas still habitable by the native species were viciously competed for making the many of the species on Nal Hutta some of the most aggressive animals in the galaxy."}, {"tag": "p", "text": "The atmosphere was also polluted by strip-mining operations and heavy industrialization, and a greasy rain drizzled down on the surface, although its terrain was not to the extent of Dagobah. Raw materials were constantly strip-mined from the planet's surface and shipped to Nar Shaddaa for processing and export."}, {"tag": "p", "text": "The capital city, Bilbousa and the Guarja Shipyards were located on the planet."}, {"tag": "p", "text": "The Huttese translation of Nal Hutta into Glorious Jewel stemmed from the nearby massive, radioactive gas cloud, which contained the planet Ganath."}, {"tag": "p", "text": "The planet was ruled by the oldest Hutt families, known as the Clans of the Ancients, who watched over the activities of both Nal Hutta and Nar Shaddaa from their homes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Hutt Empire"}, {"tag": "p", "text": "Evocar was home to the humanoid Evocii. Prior to 15,000 BBY, the Hutt settlers owned a small province on Evocar. Due likely to their legendary greed, the Hutt's ownership of Evocar continued to grow through business deals where they traded their technology with the relatively primitive Evocii for portions of land."}, {"tag": "h3", "text": "Old Republic"}, {"tag": "p", "text": "Following the destruction of the Hutt home-world of Varl in 15,000 BBY, the Hutts collaborated with Vippit lawyers from Alee in buying out the planet from the Evocii, regarding it as a suitable new home. Using both legal and violent measures, the Hutts established themselves as the rulers of the planet and renamed it Nal Hutta, as the new capital of Hutt Space, the successor of the Hutt Empire. Hutt palaces, amusement parks and other constructions were built all over Evocar, and the Evocii could do nothing about it. The Hutts destroyed the planet's lush mountainous rainforests, terraforming the planet into what they considered paradise."}, {"tag": "p", "text": "The Evocii appealed to the Galactic Republic, however the contracts signed were legally binding, and the Republic ruled in favor of the Hutts. Many of the Evocii were eventually evicted by the Hutts, and relocated to the planet's fifth moon, which would later be known as Nar Shaddaa, the Smugglers' Moon. The Hutts then destroyed the remaining Evocii agriculture and whatever was left of the original terrain and then terraformed (destroyed) any remaining patches of land. Most of the Evocii who remained on Nal Hutta were enslaved to build the cities of Nal Hutta."}, {"tag": "p", "text": "The few remaining Evocii not enslaved in the cities banded together into rebel tribes to harass the Hutts and their interests, ultimately they were defeated and exterminated. The resettled Evocii were exploited as indentured labor to build the cities of the moon. Although the Vertical City was only starting to be built, it quickly began to prosper along with Nal Hutta. When the cities of Nal Hutta were completed, the Evocii were relocated to assist the Evocii on Nar Shaddaa, along side Nar Shaddaa's native Ganks. Five centuries later, the entire moon was urbanized and the Evocii were freed of their labor by the Hutts. The Evocii then took refuge in Nar Shaddaa's under-city, along with the Ganks and began to mutate into savages due to various technologies practiced on the moon."}, {"tag": "p", "text": "For about eleven thousand years, Nar Shaddaa, and to a lesser extent, Nal Hutta itself, rivaled Coruscant as the hub of interstellar trade. With the disruption of the Ootmian Pabol hyperspace route around 4000 BBY, Nal Hutta and its moon gradually devolved into havens for smugglers, pirates, and other criminals."}, {"tag": "p", "text": "During the Dark Wars in 3951 BBY, Nal Hutta was enslaving refugees after buying them from the Exchange in the Refugee Sector on Nar Shaddaa.\nDuring the Great Galactic War beginning in 3681 BBY between the reconstituted Sith Empire and the Galactic Republic, the Hutts managed to remain neutral, ensuring their world remained exactly as they liked it."}, {"tag": "p", "text": "In the conflict with the Eternal Empire, a gizka infestation forced a quarantine on the cargo ports of Nal Hutta."}, {"tag": "p", "text": "Nal Hutta continued to serve as the Hutts' base during the Clone Wars and the world was generally left undisturbed by the galaxy-wide conflict. The Hutt Grand Council was situated on Nal Hutta during the war, apart from Jabba Desilijic Tiure, who operated out of Tatooine and had Gardulla Besadii represent him in person."}, {"tag": "p", "text": "It was to Nal Hutta Ziro Desilijic Tiure fled after his prison break in 22 BBY, where he was incarcerated by the Council for refusing to hand over a holo-diary which contained the council's many crimes. After escaping the Council's prison, he and his girlfriend Sy Snootles fled across murky swamplands to Mama's hut, where he borrowed her starship and fled to Teth, pursued by two Jedi Masters; Quinlan Vos and Obi-Wan Kenobi."}, {"tag": "p", "text": "Later in the War around 21 BBY, after escape on Coruscant, Cad Bane, Moralo Eval, and Obi-Wan Kenobi (disguised of Rako Hardeen) made their way to Nal Hutta, where Kenobi, to Bane's incredulity, intended to crash their HCT-2001 Dragonboat-class Reugeot 905 freighter into the swamps to get Republic authorities off their trail. Surviving the crash, the three of them abandoned the freighter and made their way to the Bilbousa Bazaar, a marketplace in the planet's capital city, Bilbousa. There, Kenobi hoped they could buy a new starship, though Bane pointed out that as they undoubtedly had a bounty on their heads for escaping, they first had to replace their prison fatigues. To re-equip themselves with bounty hunting gear, Bane took them to Pablo's Pawnshop, a choice venue of his that was operated by the pawnbroker Pablo. At the pawnshop, Bane found some new armor and equipment, including a new hat. As Kenobi had suspected, Bane sprayed Kenobi with knockout gas as they were departing, leaving Kenobi to be arrested by the local authorities. However, Kenobi turned the frequency of the tracking device over to his captors, who shot Bane and Eval's ship down. Kenobi, meanwhile, escaped from captivity and purchased another ship, and when Bane and Eval found him smugly waiting for them, they agreed to make him a partner in their scheme and captured by Nikto Guards and escape. After Three Bounty Hunters leaving Hutta on Personal Luxury Yacht 3000, Jedi Knight Anakin Skywalker and Jedi Padawan Ahsoka Tano on T-6 shuttle, who is visiting the Chancellor and is still unaware of the secret mission, does not take this decision well, and Palpatine exploits this by deliberately sending him After some brutal questioning of the locals on Anakin's part, the two Jedi learn about the next likely whereabouts of the fugitives ship, since the ship seller decided to fuel up the ship only just enough to force them to seek out his brother's refueling station on Orondia. After spotting their quarry as they prepare to leave, Anakin decides to ram the ship into submission and board it in midflight, but is foiled by Bane and a subsequent crash-landing of both parties resulting from the furious chase through a local fuel-processing facility."}, {"tag": "p", "text": "In later arround 20 BBY, after Death Watch and the Sith set out to assemble an army of followers, beginning their search at a fortress on Mustafar belonging to the leaders of a branch of the Black Sun crime syndicate, negotiations with the syndicate branch's Falleen leaders were quick to sour, leading Savage Opress to kill them while Maul recruited the organization's Captain of the Guard, Ziton Moj, who authorized an alliance in the fallen leaders stead with freshly gained supplies and a battalion of Black Sun foot soldiers in tow, Pre Vizsla and Maul were approached by Lom Pyke, leader of a Coruscanti spice-dealing Pyke Syndicate, the Pykes moved to willingly join the growing assembly. The Sith Lord Darth Maul formed a criminal organization called the Shadow Collective and he wished to secure a partnership with the Hutt Grand Council on Nal Hutta, in addition to his Black Sun and Death Watch allies. There, Death Watch attended to the Sith's injuries before Vizsla invited Darth Maul to talk, during which the two found they had a mutual enemy in the form of the Jedi Order, with Jedi Master Obi-Wan Kenobi equally despised by both men. Upon that shared animosity, Maul and Vizsla founded an alliance in pursuit of mutual benefit: the Sith would aid Death Watch in deposing Duchess Satine Kryze of the New Mandalorians, while Death Watch would assist the Sith in their plans to punish Kenobi for his actions against Maul a decade prior. With their newest allies, the hutts summoned five bounty hunters Embo, Marrok, Latts Razzi, Sugi and Dengar, sugi hurl a knife at Maul's head. Before it could reach its target, Opress halted it and the knife went hurling back to the feet of the anooba, Marrok. Jabba then had his bounty hunters eliminate the two Sith Lords and Vizsla. The two Sith merely swatted the guards aside while Vizsla used his flamethrower to help cover their retreat. By the time the flames had fanned, the Sith and Vizsla had a head start on their escape. Death Watch set out for Hutta with a small attack force was comprised of three Kom'rk-class starfighters loaded with squads of Death Watch foot soldiers and three Sarisa-class gunships headed toward Nal Hutta and landed at the Hutt Council Chamber and Bounty hunters Escape. Though the mission ended as a failure, Oruba was captured by Bo-Katan and her soldiers. Oruba stated he knew not of where his allies were hiding. Maul then ordered for Opress to kill him as the elder Hutt proved useless to them, but Oruba stated that his allies were holed up in Jabba's palace on the Outer Rim world of Tatooine. Still, Maul had Opress kill Oruba. They then set course for Tatooine."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "During the Galactic Civil War, the Galactic Empire established nominal control over Nal Hutta, but for the most part the Hutt ruling families were left to control day to day affairs, with the Empire stepping in only when searching for Rebel sympathizers or other criminals."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Nal Hutta was conquered following an orbital bombardment by the extragalactic aliens in retaliation for the Hutts' treachery in 26 ABY. The Y'Toub system was surrounded by several of the Yuuzhan Vong's most deadly warships. Several organic creations were sent to Nal Hutta and its moon Nar Shaddaa for multiple purposes. Different types of bacteria killed most of the inhabitants, before processing their remains into the soil of Nal Hutta."}, {"tag": "p", "text": "All of the technology on the planet was broken down and also absorbed into the soil, thus turning Nal Hutta into a lifeless barren world. However, the Hutts still remained for two years during the Yuuzhan Vong's rule. The Yuuzhan Vong Vongformed the lifeless barren surface of Nal Hutta (into an unknown result) to suit themselves, resulting in the second complete change of the planet's terrain. This process was ongoing, and the Yuuzhan Vong reached out from the Y'Toub system, swallowing all of Hutt Space, and desolating the Cartel territories in the process."}, {"tag": "p", "text": "As a result, a Hutt underground was formed, and the New Republic raided the world in 28 ABY. The Hutt families and the resistance movement abandoned Nal Hutta as their base of operations of the empire at the close of the Vong war in 28 ABY, moving instead to the desert planet of Tatooine, a world on which the Hutts historically had a heavy presence beyond Hutt Space."}, {"tag": "h3", "text": "Legacy era"}, {"tag": "p", "text": "Despite the efforts of the Yuuzhan Vong, their introduced vegetation and fauna failed to thrive on both Nal Hutta and Nar Shaddaa due to the entrenched Hutt ecosystem. In 29 ABY, they abandoned the vongformed planet and moon. Over the following decades, the Hutts would gradually reclaim both Nal Hutta and its moon. There were also criminals that were fortunate enough to have survived the Yuuzhan Vong War who took shelter on the now vongformed planet as well as Nar Shaddaa."}, {"tag": "p", "text": "Like its moon in 40 ABY, it would not openly ally itself with the Five Worlds and remained independent. However, Nal Hutta did join the Confederation during the Second Galactic Civil War, although the Hutts themselves were relatively neutral. Later in the war the Hutts finally joined their fellow criminals, and were absorbed into the Confederation as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Nal Hutta in the Kanchen sector, which is actually located in the Core Worlds."}, {"tag": "p", "text": "The Clone Wars television series depicted the surface of Nal Hutta much as it had been described in previous sources. The series changed how the planet appears from space, however, depicting it as a ringed world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}