{"url": "Nakrikal_Singularity", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Grumani sector stars", "Category:Outer Rim Territories black holes"], "nodes": [{"tag": "h1", "text": "Nakrikal Singularity"}, {"tag": "p", "text": "The Nakrikal Singularity was a black hole that lay in the Outer Rim Territories' Grumani sector. It affected the navigation computers of starships traveling along the nearby Sanrafsix Corridor hyperlane. In 1032 BBY, the Sith Lord Arkadia Calimondra attempted to dispose of the mercenary transport Diligence by providing the vessel's commander, Brigadier Jarrow Rusher, with hyperspace coordinates that would unknowingly lead his ship into the Nakrikal Singularity."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Nakrikal Singularity was a black hole located in the Grumani sector, a part of the Trailing Sectors portion of the Outer Rim Territories. It lay to the galactic west of the Sanrafsix Corridor hyperlane."}, {"tag": "p", "text": "According to a cartographical survey and field report compiled by Jedi Master Vannar Treece by 1032 BBY, the Nakrikal Singularity tugged on the fabric of hyperspace. The report also stated that the black hole occasionally interfered with navigation computers aboard starships traveling along the Sanrafsix Corridor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While preparing to mount Operation Influx, a Jedi-conducted raid in the Grumani sector in 1032 BBY, Vannar Treece planned for the Jedi team to avoid the part of the sector containing the Nakrikal Singularity due to the danger posed by the black hole."}, {"tag": "p", "text": "That same year, after the mercenary transport Diligence, commanded by Brigadier Jarrow Rusher, arrived on the planet Syned, capital of the Sith Lord Arkadia Calimondra, the latter provided Rusher with hyperspace coordinates. Calimondra claimed that the navigational data would lead the mercenaries' ship out of her realm, the Arkadianate."}, {"tag": "p", "text": "However, since the Sith Lord wanted to dispose of the mercenaries, the coordinates would actually cause the Diligence to drop into the Nakrikal Singularity, leading to the death of everyone aboard the ship. The Diligence eventually followed another set of hyperspace coordinates instead, ones given to Rusher by the Bothan spy Narsk Ka'hane that led to space controlled by the Galactic Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nakrikal Singularity was first mentioned in Essential Atlas Extra: The Knight Errant Gazetteer, a 2010 StarWars.com article co-authored by Daniel Wallace, Jason Fry, and John Jackson Miller that served as a supplement to the 2009 reference book The Essential Atlas. The StarWars.com Online Companion to the Atlas placed the black hole in grid square N-17."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}