{"url": "Nal_Raka_Criminal_Empire", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Criminal syndicates and cartels", "Category:Nal Raka Criminal Empire"], "nodes": [{"tag": "h1", "text": "Nal Raka Criminal Empire"}, {"tag": "p", "text": "The Nal Raka Criminal Empire  was Borvo the Hutt's criminal organization."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "It was huge, having outposts on dozens of planets. Two such places were Naboo and Rori. It dealt mainly in smuggling, gunrunning and occasionally spice trading and slavery. During the Naboo crisis, Borvo's empire started to fall apart. After the Clone Wars, it regained its power and grew due to the Empire's strict control of goods and arms. Borvo had employees in every major city on Naboo, as well as making the Nal Raka Space in the Naboo system and taking over the Old Trade Federation Route."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "During the Invasion of Naboo, Borvo the Hutt was blocked on the planet and found himself forced to fight the Trade Federation alongside the Royal Naboo Security Forces."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Nal Raka Criminal Empire was considered by the RSF Intelligence Division as one of the four major criminal groups on Naboo, along with the Skaak Tippers, the Mummers and the Darkwalkers. Borvo's organization had hostile relationships with the Skaak Tippers and the Darkwalkers. Borvo also had problems with Gungans after the Battle of Yavin. After a group of Gungan traders crossed him, he sent his most feared champion, the Wookiee Mordran, to terrorize Gungans at the Gungan Sacred Place."}, {"tag": "p", "text": "Prior to the Battle of Yavin, Agent Niksel Frangee, a detective of the Corellian Security Force, infiltrated Borvo the Hutt's criminal organization. Frangee stayed undercover for the next six years and became one of the Hutt's most trusted employees. Circa 1 ABY, the CorSec investigation against Borvo the Hutt came to an end, leading to the discovery of Frangee as an undercover agent. After the spy tried to kill Borvo's henchman Dagorel, Borvo's guard therefore hired a spacer to murder Frangee. The spacer later took Frangee's detective badge and was ordered to go on Corellia to pass himself off as Frangee. Indeed, during his six years in infiltration, all of Frangee's direct superiors had retired and been replaced. Thus, nobody in the CorSec knew how Frangee looked like at the moment of his death. The spacer met one of the CorSec senior officers, Captain Thale Dustrunner, in the Coronet Capitol. Dustrunner fell for the ruse and took the spacer for the long lost agent. He ordered him to protect Aldalad, a witness who wanted to testify against Borvo, and Maerzen, who had discovered evidence against Borvo the Hutt. The spacer killed both of them and returned to Borvo, leaving the CorSec without any evidence against the Hutt crime lord. Eventually, Borvo concluded this messy crisis by assassinating his ex-business partner Montrus because of his close relationship with Niksel Frangee."}, {"tag": "p", "text": "Around the sme time, the Skaak Tippers and Darkwalkers blackmailed Hugo Eckener, the father of the indebted Karl Eckener, to force him to hire a spacer in order to attack Borvo Bunker, near Theed. One of Borvo's thug, Derm Worrit, operated out of the bunker during that time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}