{"url": "Nala_Se/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Females", "Category:Galactic Republic individuals", "Category:Healers and doctors", "Category:Kaminoans", "Category:Personnel of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Nala Se"}, {"tag": "p", "text": "Nala Se was a female Kaminoan who lived during the Clone Wars. During the conflict, Se worked out of the Republic's secret Kaliida Shoals Medical Center, a space station in the Outer Rim intended to facilitate the rehabilitation of wounded clone troopers. In 22 BBY, General Grievous, who had recently begun to attack Republic forces with the Confederate superweapon Malevolence, was directed by the Confederate Head of State Count Dooku to destroy the Kaliida Shoals Center, as it was the only medical facility for the treatment of injured clone troopers."}, {"tag": "p", "text": "Grievous' attack on the medcenter was anticipated by Jedi Knight Anakin Skywalker, who made preparations for a strike against the Malevolence while Se began the evacuation of Kaliida Shoals. To her dismay, she was unable to remove many clones from the center. Even with the arrival of the Malevolence, Se refused to flee the station and leave her patients behind. However, Skywalker and the Republic's Shadow Squadron arrived and engaged the Malevolence, which was forced to retreat before it could damage the station."}, {"tag": "p", "text": "Nala Se would later be transferred to a medical station near the planet of Ord Cestus, where she would serve alongside High Jedi General Kit Fisto. In the aftermath of a second battle on Geonosis, the station was designated to be the source of much-needed medical supplies for General Mace Windu's forces on Dantooine. However, the clones aboard the Pelta-class frigate TB-73, which was to retrieve the supplies, had been infected by mind-controlling parasites from the Geonosian battlefront. Upon emerging from hyperspace, the out-of-control frigate ran the risk of either colliding with the medical station or docking to spread the disease, but was stopped due to the efforts of Fisto and Jedi Padawans Ahsoka Tano and Barriss Offee."}, {"tag": "p", "text": "Throughout the rest of the war, Doctor Se was also one of the few individuals that knew about Clone Protocol 66, a secret directive encoded into the control chip of every clone in the Republic's military. Believing the chips acted as a safeguard against renegade Jedi, Nala Se went to great lengths to preserve the secrecy of Protocol 66 throughout the war, and once Order 66 was issued by Palpatine, every clone turned against their fellow Jedi Generals and Commanders, and thus bringing the start of the Great Jedi Purge. After the Republic was transformed into the Galactic Empire, Se continued her service and worked on the creation of clone stormtroopers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Overseeing Kaliida Shoals"}, {"tag": "h4", "text": "Evacuation"}, {"tag": "p", "text": "Nala Se was a female Kaminoan who lived prior to the rise of the Galactic Empire. During the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Se served the Republic as the administrator of the Kaliida Shoals Medical Center. Kaliida Shoals had been purchased by the Republic at the beginning of the war, and was adapted to function as a secret facility in the galaxy's Outer Rim that worked to rehabilitate injured clone troopers that had been bred on Se's homeworld of Kamino. As the only facility functioning in such a capacity, Kaliida Shoals was vital to the Republic's war effort."}, {"tag": "p", "text": "In 22 BBY, the Republic learned of a new Confederate superweapon, the Malevolence. A Subjugator-class cruiser, the Malevolence was outfitted with two large ion cannons. The ion waves it fired were capable of disabling entire fleets, leaving them vulnerable to the hundreds of turbolaser batteries on the ship's hull. Following the Malevolence's attack on a Republic medical convoy in the Ryndellia system, the ship's commander, General Grievous, was informed by the Confederate Head of State, Count Dooku, of the location of the Kaliida Shoals station. Dooku claimed that the destruction of Kaliida Shoals would leave the Republic without a treatment facility for injured clone troopers, greatly hindering the Republic's war effort."}, {"tag": "p", "text": "While the Malevolence headed toward Se's medcenter, Jedi Knight Anakin Skywalker prepared an attack on the battleship. After receiving word of the battle at Ryndellia, Skywalker surmised that Grievous's next target would be Kaliida Shoals, due to its proximity to Naboo, a planet close to the Ryndellia system. Skywalker ordered Admiral Wullf Yularen to contact Nala Se and warn her of the impending danger while he and his Padawan, Ahsoka Tano, led the Republic's Shadow Squadron in a mission to intercept and destroy the Malevolence."}, {"tag": "p", "text": "In the command tower of the Kaliida Shoals medcenter, Se was contacted by Yularen via hologram, who warned her of the Malevolence's approach and urged her to begin evacuating the station. Se knew that an evacuation of Kaliida Shoals, which was treating over 60,000 clones, would not proceed quickly enough to remove all of the wounded from harm's path. Se and Yularen's communication was joined by Jedi Master Obi-Wan Kenobi, who had recently learned of the impending attack. Kenobi had contacted the people of Naboo to request ships to assist in the evacuation, and was heading to Kaliida Shoals himself in the Negotiator, his flagship. After the communication was terminated, Se's clone medical aide questioned whether or not she believed in the Republic's ability to defeat the Malevolence, to which she replied that it was their only hope."}, {"tag": "p", "text": "Although the Malevolence began its journey to the medical station, it was forced to chart a lengthy course around the Kaliida Nebula. This, along with Skywalker's use of the Balmorra Run shortcut, allowed the Republic forces the possibility of intercepting Grievous before his attack. As both groups raced toward Kaliida Shoals, Se's evacuation proceeded slowly. She ordered that priority be given to patients in stable condition, while more critically injured troopers would have to wait for transport off station. Se conceded to a clone medic who was aiding in the evacuation that the patients confined to bacta tanks would be unmovable, and so focus should remain on those who could be safely transported."}, {"tag": "h4", "text": "Arrival of the Malevolence"}, {"tag": "p", "text": "By the time the Malevolence jumped out of hyperspace near the station, Se's efforts had only yielded a fifty percent evacuation. As the battleship approached the Kaliida Shoals medcenter, several Pelta-class frigates that were assisting in the evacuation attempted to flee; however, they were quickly disabled by the Malevolence's ion cannons. As Grievous opened fire on them, Skywalker's squadron arrived and engaged the Malevolence. During the fighting, nearly half of the Jedi's force was destroyed. Monitoring the battle from the medcenter, Se's clone aide encouraged her to escape the station, as the Republic's chances of victory were slim. Se refused, and remained on station even as it was targeted by the Malevolence's ion cannons. The station was saved, however, as Skywalker and his squadron were able to damage the warship's starboard cannon, resulting in an overload of the weapon. From the Kaliida Shoals command center, Se watched as an explosion caused by the overload crippled the Confederate cruiser. Shortly thereafter, Master Kenobi arrived with three Venator-class Star Destroyers to chase the Malevolence as it fled from the medical station."}, {"tag": "p", "text": "Before returning to battle, Skywalker and Tano landed on the Kaliida Shoals Medical Center. The two Jedi met with Se, who thanked them for their efforts and reminded them of the importance of the lives they saved. Skywalker agreed with her; however, he also told Se that he regretted the lives lost during the battle. After the Jedi Knight left to return to the engagement against the Malevolence, Se commented to Tano on her master's curious demeanor for a Jedi."}, {"tag": "h3", "text": "Continued threats"}, {"tag": "p", "text": "Sometime during the Clone Wars, the infamous bounty hunter Cad Bane came under the employ of Count Dooku, who wished for the Duros to travel to the Kaliida Shoals Medical Center and infect the troopers there with a virus that would ultimately cripple the entirety of the Grand Army. Bane was incarcerated by Republic officials before he could accomplish his mission, but soon escaped custody and moved to finish the job. He was pursued across several planets by a Jedi Knight, who eventually learned that Bane was headed for the Kaliida Shoals Center. The Jedi Knight traveled to the medical station and met with Nala Se, hoping the Kaminoan would have information regarding Bane's mission. Although Dooku's plot was revealed and Bane was defeated, the Jedi was too late to prevent him from infecting the trooper's bacta tanks with the virus. Jedi Master Mace Windu oversaw the damage control, and dispatched Jedi healers to the Kaliida Shoals Medical Center to stop the spread of the virus."}, {"tag": "p", "text": "Nala Se was later transferred off of Kaliida Shoals to serve on a medical station near the Outer Rim world of Ord Cestus. There, Se served under High Jedi General Kit Fisto alongside a number of clone medical officers. During the second battle on Geonosis, the Ord Cestus medical station was selected to be the source of medical supplies for General Mace Windu and his forces on Dantooine. The much-needed supplies were to be picked up by the Pelta-class frigate designated TB-73 that was returning from duty on the embattled Geonosis."}, {"tag": "p", "text": "Jedi Padawans Ahsoka Tano and Barriss Offee were placed in charge of the supply run and were escorted by the Grand Army's Tango Company. Before departing Geonosis, Tango Company was infected by parasitic, mind-controlling worms that were native to the planet. The infected clones betrayed their Jedi commanders and hijacked the vessel, but were defeated by Tano and Offee with the help of General Skywalker. Despite this, Offee was also infected by the worms and during a scuffle between the two Padawans on the frigate's bridge, the vessel's controls were damaged. The out-of-control frigate was prevented from colliding with the station and killing Se and everyone on board by a pair of tug ships which safely guided it in to dock."}, {"tag": "h3", "text": "Post-Clone Wars"}, {"tag": "p", "text": "By the end of the Clone Wars, Nala Se was still working on the creation of clone stormtroopers for the newly created Galactic Empire from the restructuring of the Galactic Republic. She proceeded to file a report to upcoming commanders in the Imperial Military that clone troopers made by them are indeed the best, and also made note of the incidents on Christophsis and Ringo Vinda. Her report was later included in the Imperial Handbook: A Commander's Guide, the official field manual for Commanders in the Imperial Military."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Contrary to the common demeanor of Kaminoans, Nala Se cared deeply for the clones under her care. As administrator of the Kaliida Shoals medcenter, Se led the only known facility that functioned to treat the Grand Army of the Republic's injured clone troopers. After learning of Grievous' plans to destroy Kaliida Shoals, Se made a valiant attempt to evacuate the injured clone troopers and transport them out of harm's way; however, the Kaminoan recognized that it would be impossible to evacuate the entire facility."}, {"tag": "p", "text": "Over the course of the evacuation, Se made sure to prioritize the order of evacuation, ensuring that the patients in stable conditions were moved first. Kaliida Shoals contained many troopers who required bacta tanks for rehabilitation, and these troopers were unable to be moved from the station; subsequently, they were among those who remained on station when the Malevolence arrived. Se refused to leave these troopers, even as the medcenter was targeted by the battleship's massive ion cannons. During Grievous's retreat, Se expressed her gratitude to Skywalker for his actions."}, {"tag": "p", "text": "Nala Se had a masterful knowledge of cloning techniques and had an innate talent for medical practices. She wore specialized equipment that allowed her to quickly access serum samples she was carrying on her belt, and utilized boots built specifically for the slender build of a Kaminoan foot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nala Se's first appearance was in the Star Wars: The Clone Wars television series episode \"Shadow of Malevolence\" on Cartoon Network. In the episode, Nala Se is voiced by Gwendoline Yeo, who would return to the series to voice several characters, including the Bettie-Bot VJ in \"Rookies\"\nand Peppi Bow in \"Blue Shadow Virus\". She would later appear in the eighth episode of the series' second season, entitled \"Brain Invaders.\" Although she has no lines in the episode and is not identified, the \"Brain Invaders\" episode guide indicates that the script identifies the Kaminoan on the Ord Cestus medical station as Nala Se."}, {"tag": "p", "text": "Clone Wars Gambit: Stealth, the fourth novel in the Star Wars: The Clone Wars series, included the character \"Nala Shan\"—a Kaminoan administrator of the Kaliida Shoals MedCenter. Despite the obvious similarities between Shan and Se, Nala Shan's name has yet to be confirmed as either a typo or a deliberately created new character, and thus the novel currently stands as only a possible appearance of Se."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}