{"url": "Nalia_Adollu", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Nalia Adollu"}, {"tag": "p", "text": "Nalia Adollu was a female Human Jedi Padawan from the Expansion Region planet Corsin. Following the Battle of Ruusan in 1000 BBY, Adollu was chosen to be the Padawan of the Pyn'gani Jedi Master Anno Wen-Chii. For at least five years, since 995 BBY, Adollu and her Master resided on Wen-Chii's homeworld of Polus. In 990 BBY, the Sith Lord Darth Zannah used Adollu's name and persona to sneak into the Jedi Temple on Coruscant in order to research information for her Master, Darth Bane."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The female Human Nalia Adollu was born around 1010 BBY in the tropical regions of the Expansion Region planet Corsin and was accepted into the Jedi Order. After the Battle of Ruusan in 1000 BBY, Adollu was chosen as a Padawan learner by the Pyn'gani Jedi Master Anno Wen-Chii. In 995 BBY, Adollu accompanied her Master to the Outer Rim planet Polus, Wen-Chii's homeworld, where they spent time studying the native species, hoping to learn more about how life evolved in the galaxy. In 990 BBY, while Adollu was still on Polus, her identity was used by the Sith Lord Darth Zannah, who infiltrated the Jedi Temple on Coruscant in order to find information regarding the parasitic orbalisk organisms that plagued her Master, Darth Bane. Zannah carried out her mission successfully, as Adollu had not been seen on Coruscant for five years."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An athletic, Force-sensitive Human female of average height, Adollu had long black hair. She possessed enough Force potential to be accepted as a Jedi Padawan and trained for at least five years under Master Wen-Chii."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nalia Adollu was first mentioned in the 2007 novel Darth Bane: Rule of Two, written by Drew Karpyshyn. She later received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}