{"url": "Nalz", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Males", "Category:Slaves", "Category:Spiners"], "nodes": [{"tag": "h1", "text": "Nalz"}, {"tag": "p", "text": "Nalz, also known as Spiky-boy, was a male Spiner bounty hunter and slave."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A member of an uncommon species, Nalz was a two-meter sentient covered by brown or black fur, with a short snout and black eyes. He also had spikes in his back, that he could rise using his shoulders's muscles."}, {"tag": "p", "text": "Nalz was born in a freak show, where he spent many years. Nalz's mother had read him history tales about how their species was powerful until their sun went supernova. Only a few thousand Spiners survived, and this is why, his mother said, the Spiners were not ruling the galaxy at that point. Instead, they were being mocked by their strange appearance and taken holorecords."}, {"tag": "p", "text": "Nalz's mother died during one show, which led to an audience success. Nalz hated the Jedi, supposed protectors of the galaxy, because of their inaction at that point."}, {"tag": "p", "text": "An orphan, Nalz was provided with a computer access to research about his own background. Whenever he was reading something horrible, his physical reactions could be enjoyed by the audience. Meanwhile, he discovered that he was a good researcher and he learned a lot. He was even planning a escape from the show."}, {"tag": "p", "text": "Before he could perform it, Chevin slaver Phylus Mon bought Nalz's freedom. Phylus Mon insisted that he did not want Nalz as a slave, but he wanted to negotiate a future contract with him. Nevertheless, Phylus Mon inserted an explosive near Nalz's heart. The device would kill Nalz should Phylus Mon die for any reason. The bomb could be deactivated if hit by an ion weapon, but Phylus Mon did not allow any ion weapon in his ship, the Animiasma. This mechanism was a security measure that Phylus Mon used in every one of his slaves. At the same time, Phylus Mon paid his slaves and insisted in calling them employees - but at the same time, all of them knew they could not leave Phylus Mon's service or they would die."}, {"tag": "p", "text": "Nalz became a member of an elite strike force tracking and killing the \"less desirables.\" Armed with a master blaster rifle, Nalz proofed he was agile, cunning and a good leader (although with some problem to accept orders). He was liked among those who worked with him; the opponents never knew of him until it was too late."}, {"tag": "h3", "text": "Sith Battlelord"}, {"tag": "p", "text": "In around 20 BBY, Phylus Mon asked him to work directly for him. Nalz understood he had no choice, but he would not have chosen otherwise."}, {"tag": "p", "text": "One month later, Nalz and some other minions of Phylus Mon were sent to the Cularin system. He spent the trip researching about a place he knew nothing about, and preparing a scheme to deal with the Jedi there. Nalz did not like the other minions, considering them either stupid or untrustworthy. They, in turn, considered Nalz a useless freak, with the Barabel bounty hunter Yerj nicknaming him Spiky-boy."}, {"tag": "p", "text": "Nalz and the other minions attacked the Almas Sith fortress in Cularin system. The fortress entrance was being protected by six Jedi, but Phylus Mon sent no less than thirteen minions, including his wampa bodyguard Ku-Kak. Phylus Mon's team killed four of the Jedi and defeated the other two."}, {"tag": "p", "text": "In the fortress, Phylus Mon performed a Sith ritual to transform Nalz and the others into Sith Battlelords: after a dangerous, life-threatening process, they were supposed to rise as powerful military commanders that could use Force powers to deal with insubordination of their troops. However, something went wrong with the ritual: Nalz and the other prospective Battlelords were stripped of their Force-essences, which would be stored in a large crystal."}, {"tag": "p", "text": "Phylus Mon left the fortress with the crystal, but without Kaarror and the other empty bodies. Those bodies would then be found by a search team sent by the Jedi in the Almas Academy. The bodies were sent to the Academy. There, the Jedi tried their best to recover the lost essences and restore them to their previous state."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "One player character in A Mon Alone can, at a certain point, enter this non-player character's body and use Nalz's statistics until his essence can be freed (which means Nalz's essence re-enters Nalz's body and the PC's essence returns to the PC's unconscious body), or until Nalz's body is killed in action. The text explains that some of the final scenes are so dangerous that they could easily kill the player characters - leading to the players getting angry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}