{"url": "Assault_Frigate_Mark_II", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic starship classes", "Category:Assault Frigates Mark II", "Category:Frigate classes"], "nodes": [{"tag": "h1", "text": "Assault Frigate Mark II"}, {"tag": "p", "text": "The Assault Frigate Mark II, also known as the Assault Frigate Mk II or just as the Assault Frigate, was a class of frigate that was deployed by the Alliance to Restore the Republic during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Assault Frigate Mark II, also referred to as the Assault Frigate Mk II or simply the Assault Frigate, was a class of frigate that was heavily modified and retrofitted from the Republic Era Dreadnought-class heavy cruiser manufactured by Rendili StarDrive. The large amount of modifications lowered the number of personnel needed to operate the vessel, and it also improved the starship's maneuverability and speed while maintaining the original Dreadnought-class's considerable amount of firepower. The Assault Frigate's appearance had little familiarity with the Dreadnought-class as much of the hull was modified or simply removed to improve speed and maneuverability, although it came at the cost of being able to endure less damage. As a result, a strong deflector shield generator was added to compensate for the loss of durability."}, {"tag": "p", "text": "The Assault Frigate cost 12,250,000 credits and was equipped with a medium-range sensor and a class 1 hyperdrive that acted as the primary and a class 12 as a backup. It used a navigation computer and had consumables for 1.5 years for its 4,820 officers and enlisted crew. 100 soldiers were also stationed aboard Assault Frigates, and the starship had a complement of either three starfighters or one shuttle, as well as an assortment of landspeeders, small shuttles, and ship's boats. For this, the Assault Frigate has one dedicated mount on the dorsal hull in addition to several internal hangars."}, {"tag": "p", "text": "The Assault Frigate was armed with fifteen medium turbolaser batteries that were evenly distributed to the bow, port, and starboard. It was also equipped with five port and five starboard light quad turbolaser cannons and fifteen heavy laser cannons that were forward-mounted and mounted on the port and starboard equally. Assault Frigates were able to outmaneuver Star Destroyers and threaten them in two-on-one and three-on-one engagements demonstrating that it could attack hostile capital ships above its weight class. This ability was analogous to the Rebel Alliance as a whole as it showed a smaller force defeating a larger one."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Assault Frigate had a multitude of roles within the Rebel Fleet of the Rebel Alliance. Due to its ability to attack larger warships, the Assault Frigate became a mainstay of Alliance operations. Assault Frigates served as command ships for Alliance forces in isolated sectors in the Outer Rim Territories, while others themselves served as escorts for larger command vessels. They also served as part of the defense of Alliance bases and space stations. The Assault Frigate could also act as a central command post for a contingent of Alliance agents and as a resource of reinforcements for a Rebel cell that sought to destroy a larger target such as a space station or warship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Assault Frigate was added to the Rebel Armada of the Rebel Alliance early during its founding and were used throughout the Galactic Civil War against the Galactic Empire. A task force of Assault Frigates was active during the war, and at one point suffered two losses."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}