{"url": "Assault_Frigate_Mark_II/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Assault Frigates Mark II", "Category:Frigate classes"], "nodes": [{"tag": "h1", "text": "Assault Frigate Mark II"}, {"tag": "p", "text": "The Assault Frigate Mark II was a light warship that saw extensive service with the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Assault Frigate Mk. II was a further development of the Dreadnaught-class heavy cruiser modification project, which produced the Mark I Assault Frigate. Although the modification procedures allowed for some variation between individual craft, the most common assault frigate configuration had large dorsal engine fins, and could operate with less than a third of the Dreadnaught's crew requirements (4,820 nominal / 1600 minimum) thanks to extensive automation systems."}, {"tag": "p", "text": "The Assault Frigate Mark II incorporated a shield generator based on Mon Calamari designs, as well as Calamari shield subsystems that allowed an increase in shield power for short periods."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rebel Alliance had a limited amount of capital ships in its fleet. To fill their need for warships, Rebel engineers started the AAF project."}, {"tag": "p", "text": "Using the design of the Dreadnaught-class heavy cruiser as a starting point, the original Assault Frigate was created. This design was further modified by dissident engineers at Rendili StarDrive, creating the Mark II. The Mark II shirked much of its predecessors' history however, moving away from the standard Dreadnaught model toward a more original design."}, {"tag": "p", "text": "After the Rebellion sympathies of this splinter group was discovered within their company, Rendili StarDrive brought an end to the Mark II project. Though the Mark II did not disappear completely, further production slowed to a trickle. However, the Mark I remained in common use even in the time of the New Republic. There were even a few still left in service during the Yuuzhan Vong War mainly used as Command Ships or Support Ships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}