{"url": "Naman_Fal", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cyborgs", "Category:Humans", "Category:Imperial Guardsmen", "Category:Korriban residents", "Category:Males"], "nodes": [{"tag": "h1", "text": "Naman Fal"}, {"tag": "p", "text": "Naman Fal was a male Human member of the Imperial Guard who served as a guard of the Dark Council."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Cold War, Fal took his son to the Sith Academy on Korriban where he could be trained as Sith. However, his son was weak in the dark side and would never have the talent in becoming a Sith since he was compassionate, kind, and talkative. The son really wanted to prove to him that he would be a Sith and make him proud. While Naman was tasked to stay on guard in front of the Dark Council Chamber, his son traveled to the tomb of Naga Sadow to recover an ancient relic, only obtainable using a mysterious crystal Naman Fal gave him. Outside the tomb he met a young sentry named Yashia. The son was in love with her, and the dark side had already faded since he cared about love and compassion towards her. However, this was the last time he would see her since he never made it out of the tomb, and his body was left to rot."}, {"tag": "p", "text": "When the Sith Acolyte arrived to meet Yashia, she pleaded to the acolyte to find the body and deliver it to Naman Fal. The Sith acolyte was able to locate the body when searching searching the tomb of Naga Sadow. The acolyte and companion took the remains of the acolyte's body back to the academy and meet Naman Fal. When they arrived to meet Naman, the Dark Honor Guardsman told them that this area in the academy was off limits for any Sith Acolyte to enter. Then when the Sith acolyte brought the bad news and showed the remains of Naman Fal's son, Naman Fal felt some sadness in him. He was then forbidden to leave his post under the rule of the Dark Council."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}