{"url": "Namana", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Drugs and medicine", "Category:Fruits and vegetables", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Namana"}, {"tag": "p", "text": "The planet Bakura was home to the namana, a species of tall, straight-trunked tree that was pale yellow in color. In addition to copious foliage and colorful blossoms, the tree produced a fruit. From this fruit, the Bakurans produced and exported products such as namana liquor and namana candies. These refined products were slightly addictive, stimulating the pleasure centers in Human brains. Namana-based exports became a major part of the Bakuran economy. In the wild, namana trees attracted both birds and cratsch; the latter was an arboreal predator that fed on namana-satiated birds."}, {"tag": "p", "text": "In 4 ABY, Bakura was invaded by the Ssi-ruu species. In order to combat the invaders, the Imperial leadership on Bakura agreed to a truce with the Alliance to Restore the Republic; this temporary peace was sealed with a handshake over goblets of namana nectar. The Bakurans later named a starship class, the Namana-class light cruiser, after the species. Several namana trees also grew on the planet Garqi, in a section of its Pesktda Xenobotanical Garden that was dedicated to exotic offworld species. These trees were burnt down by Jedi during the Yuuzhan Vong War in an attempt to hide from the Yuuzhan Vong the discovery that Vonduun crab armor was allergic to pollen from bafforr trees, which also grew in the garden."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The namana was a species of tropical tree that was pale yellow in color. Its trunk was straight and tall, with gracefully drooping branches that produced delicate blossoms amidst plentiful foliage. The namana tree produced an exotic fruit, from which a pale orange nectar could be distilled into a liquor. This viscous fluid was potable to Humans. While it initially produced a burning sensation in the throat, this gave way to a flavor reminiscent of jungle flowers and sweet fruit. Namana fruit could also be used to produce yellow-orange candies. Once processed, consumption of the fruit stimulated the pleasure centers of the Human brain. As a consequence, namana products were slightly addictive."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Natural history"}, {"tag": "p", "text": "The namana evolved on Bakura, a planet with plentiful rainfall that was located at the outer edge of the Wild Space Shiritoku Spur. Bakura was home to several species of birds, which were attracted to the namana trees for their fruit. After gorging themselves on the fruit, many birds dropped to the forest floor in a drunken stupor. These birds were then easy prey to the cratsch, a ferret-like, arboreal predator. Male cratsch marked out large copses of namana trees with musk glands located on their tails. They became particularly territorial of their namana trees during their mating season."}, {"tag": "h3", "text": "Cultivation"}, {"tag": "p", "text": "As early as 3639 BBY, namana was known of off-Bakura, as it was used as an ingredient in namana custard. Ambassador Rove of the resurgent Sith Empire referenced the juicy dessert as an idiom for cowardice. Around 150 BBY, Bakura was settled by the Bakur Mining Corporation, which established ore mines. However, as the ore veins began to diminish, the Bakuran economy began to founder; to counter this, the colonists diversified their exports. While the primary export was repulsorlift technology, the Bakurans also commercially harvested the namana fruit to produce candies and liquor for export. The fruit was also used in the cream pies and custard desserts that were served at Dex's Diner, a culinary establishment on Coruscant. In the period following the Clone Wars, several namana processing plants were established on Bakura, with numerous plantations on the southernmost part of the main continent, Prytis, and others on the continent Braad."}, {"tag": "p", "text": "The namana became a significant cultural icon for the Bakurans, and it was considered an insult to Bakura if an individual refused to drink namana nectar at a significant occasion. Some individuals wore clothing patterned with namana blossoms, while others, such as Defense Minister Blaine Harris, used canes made of namana wood. Namana wood was also used in several important Bakuran state buildings. Thick namana wood doors and namana paneling were used throughout the Bakur Memorial Building, the seat of the Bakuran government. Its richly decorated guest quarters also featured yellow namana wood paneling. The office of the Bakuran Prime Minister featured three-dimensional, colored glass representations of namana trees framing its windows. Namana trees were also found in Statuary Park, landscaped so as to provide the illusion of a large, undisturbed forest—a haven in the bustling city of Salis D'aar."}, {"tag": "h3", "text": "Truce at Bakura"}, {"tag": "p", "text": "In 4 ABY, shortly after the Alliance to Restore the Republic victory at the Battle of Endor and the concomitant death of Emperor Palpatine, the Bakurans were attacked by the Ssi-ruu species, and so sent a distress signal to the Imperial Fleet at Endor. There, the message was received by the Rebel Alliance, who sent a small taskforce to aid Bakura in the hope of persuading the planet into the Alliance. Princess Leia Organa, as lead Rebel negotiator, received a briefing on Bakura that included information on the economic value of the namana trees."}, {"tag": "p", "text": "Following a brief skirmish with the Ssi-ruuk upon their arrival, the Rebel contingent attended a banquet at the residence of Bakuran Prime Minister Yeorg Captison, at which several namana-based products were served—both namana nectar and candies. While the Imperials were initially skeptical of the Rebels' proclamation of Palpatine's death, confirmation arrived during the dinner. As a consequence, over a goblet of namana nectar, a historic truce was declared between the Galactic Empire and the Alliance in order to fight the Ssi-ruuk. The Imperial governor who agreed to the truce, Wilek Nereus, was addicted to namana-products. He endeavored to control his habit by limiting his intake to twice-daily namana candy snacks—often chewy namana twists eaten near an internal fountain—and only imbibing nectar in the evenings."}, {"tag": "p", "text": "As the combined defense against the Ssi-ruuk unfolded, Captison and Senior Senator of the Republic Orn Belden organized an airspeeder ride with Organa, in order to discuss possible links between Bakura and the Alliance. While they traveled to a secure location to speak freely, Captison passed the time by discussing innocuous topics, such as namana fruit harvests. However, shortly after they began discussing what it would take to persuade Bakuran civilians to rise up against the Empire, the three were arrested. The arrests sparked an uprising, and knowing the Imperials would try and secure Bakura's repulsorlift factories, Captison's niece, Gaeriel Captison, sliced into Imperial troopers' information banks and replaced their intelligence on the factory with data for a namana juice extraction plant. This confusion was compounded by Ssi-ruuvi forces landing on the surface and capturing Rebel commander Luke Skywalker. Skywalker had earlier been infected with Olabrian trichoids by Nereus, and on hearing of his capture the Imperial celebrated with namana nectar, believing that the trichoids would hatch inside Skywalker and later infest the Ssi-ruuk. His celebration was premature, however, as Skywalker escaped the Ssi-ruuk, and the Rebels defeated both the Ssi-ruuvi forces and, later, the Imperial forces, who broke the truce following the Ssi-ruuvi defeat."}, {"tag": "p", "text": "Shortly thereafter, Bix Arden-Govia, the progeny of two significant Bakuran families, returned to Bakura after cavaliering about the Shiritoku Spur and purchased his own namana plantation before reentering Salis D'aar high society. Several namana trees were also grown offworld in the Pesktda Xenobotanical Garden of Garqi. The garden had a complex of greenhouses dedicated to offworld trees, which included a grove of bafforr trees from Ithor. In the following years, the Bakurans developed several starship classes, naming one the Namana-class light cruiser."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "In 25 ABY, the Yuuzhan Vong invaded the galaxy. During a mission to Garqi, several Jedi Knights ventured into the Pesktda Xenobotanical Garden and discovered that the Vonduun crab armor worn by the extra-galactic invaders was allergic to bafforr pollen. In order to hide such a militarily significant discovery from the Yuuzhan Vong, the Garqi Resistance burned down the entire Xenobotanical Garden, including its namana specimens. Three years later, Galactic Federation of Free Alliances affiliate Han Solo and his now-wife, Leia Organa Solo, returned to Bakura with their daughter Jaina on a |mission to reestablish contact with the Bakurans. There, at a formal dinner, namana nectar was served. Jaina, who had long heard about the sweet nectar, sampled the liquor, although not enough to dull her senses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Kathy Tyers created the namana tree for her novel The Truce at Bakura, published by Bantam Spectra in 1994. Bakura, on which the story largely unfolded, was included in several reference books following the novel's release, often accompanied by a mention of its namana products. These works included three Essential Guides, the Star Wars Encyclopedia, and, ten years later, its successor, The Complete Star Wars Encyclopedia, all from Del Rey; Heroes & Rogues and The Truce at Bakura Sourcebook by West End Games, with the latter product significantly expanding on the namana trees; and Wizards of the Coast's Geonosis and the Outer Rim Worlds. Namana-based produced were also featured in \"Dining at Dex's,\" an in-universe menu for Dex's Diner, and referenced in the MMORPG Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}