{"url": "Namadii_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Churnis sector star systems", "Category:Galactic Empire star systems", "Category:Galactic Republic star systems", "Category:New Republic star systems", "Category:New Territories star systems"], "nodes": [{"tag": "h1", "text": "Namadii system"}, {"tag": "p", "text": "The Namadii system was a Mid Rim star system. It was a part of the Churnis sector and lay at the endpoint of the Namadii Corridor hyperlane. The system also contained the astronomical object Namadii."}, {"tag": "p", "text": "At various points in time, the Namadii system fell within the borders of the Galactic Republic, the Galactic Empire, and the New Republic. The military forces of the latter passed through the system on their way to the Adumar system in 13 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Namadii system was located in the Churnis sector, a part of the New Territories portion of the Mid Rim. It was situated at the endpoint of the hyperlane known as the Namadii Corridor, which linked it to the Ansion system. The Namadii system contained the astronomical object of the same name."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Namadii system lay in an area of space explored between 3000 BBY and 1000 BBY. During the Clone Wars of 22 BBY to 19 BBY, the system was located in the territory held by the Galactic Republic, and in the first campaigns of that conflict, the Seventh Sector Army of the Republic was tasked with fighting the military forces of the Confederacy of Independent Systems in the system's vicinity."}, {"tag": "p", "text": "The Namadii system was situated in territory under the control of the Galactic Empire by 17 BBY. By 12 ABY, it fell within the borders of the New Republic. A year later, military forces of the New Republic traveled through the Namadii system as they advanced along the Namadii Corridor toward a confrontation with the Imperial Remnant in the Adumar system of Wild Space. Around 25 ABY, the population of the Namadii system numbered from 1 million to 10 million."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Namadii system was introduced in the 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry, which placed it in grid square I-6."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}