{"url": "Nammo", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Alliance Fleet admirals", "Category:Males", "Category:Mon Calamari", "Category:New Republic Defense Force admirals and generals"], "nodes": [{"tag": "h1", "text": "Nammo"}, {"tag": "p", "text": "Nammo was a male Mon Calamari admiral who served in the Rebel Alliance during the Galactic Civil War. In 3 ABY, he commanded the MC80 Cruiser Defiance and her task force during the time of the Battle of Hoth."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the war, Nammo commanded the task force as they tried to make their bid to escape from Hoth deep into the Outer Rim Territories, following the infamous Battle of Hoth. Soon after the Battle, Nammo helped set up a hospital on a deep space platform as a means of helping those injured in the battle, he also stationed one of his pilots, Olin Garn on the nearby Brint-wo Colony. Garn's role was as an intermediary, escorting ships to the hospital who were known to be friendly to the Alliance, thus allowing the existence of the hospital to be hidden from the Galactic Empire."}, {"tag": "p", "text": "When the Empire eventually discovered, and seized, the hospital, it also retaliated against the Azzameen family, who had been trying to deliver bacta to the Alliance. With their father and elder brother dead and their business about to be seized by the Empire, the three youngest Azzameens sought out Defiance and her task group, on the advice of Olin Garn. When the arrived, Admiral Nammo welcomed them, allowing the three to stay on Defiance for a short while. Aeron Azzameen, knowing of her youngest brother's flying abilities, spoke with Admiral Nammo and persuaded him to allow Ace Azzameen to become a starfighter pilot."}, {"tag": "p", "text": "Admiral Nammo then proceeded in his campaign against Admiral Garreth Holtz, while he tried to lead his small fleet to safety. It was on Admiral Nammo's orders, during this campaign, that Commander Kupalo, an old friend of Nammo's, was recovered; although at the start of the operation, Nammo was unaware that Kupalo was among the prisoners of VTR-LX."}, {"tag": "p", "text": "Eventually, Defiance and her attendant vessels were able to escape Imperial pursuit and arrive deep in the Outer Rim, where they were able to recover somewhat."}, {"tag": "p", "text": "Nammo commanded Defiance during the Battle of Endor. In 6 ABY, he took elements of the New Republic Third Battle Group to Bilbringi, but he was defeated by Admiral Teren Rogriss and the 181st Imperial Fighter Group."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nammo was not actually mentioned by name in the game itself, he was simply an unnamed Admiral who gave backstory to each mission at the start of each briefing. The credits, however, would appear to name him as Admiral Nammo. Certainly, an 'Admiral Nammo' is listed in the credits, and the only character which this name fits is the commanding officer of Defiance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}