{"url": "Nandi", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Naboo", "Category:Waiters"], "nodes": [{"tag": "h1", "text": "Nandi"}, {"tag": "p", "text": "Nandi was a Human female who worked at House Naberrie's retreat house, Varykino, in Naboo's Lake Country, during the years leading up to the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nandi and her half-sister, Teckla Minnau, were born in the city of Parrlay on the planet of Naboo to a middle-class merchant family. They later lived with their older brother, Rehtul Minnau, in the capital city of Theed, where the two girls attended a private school to learn etiquette, hospitality, history, and the arts. When the Trade Federation invaded Naboo in 32 BBY, Nandi went into hiding in the swamps with Teckla and several Royal Naboo Security Forces members, but she was soon separated from her sister by the growing conflict, only to be reunited with her at the Celebration Parade. Nandi and Teckla then finished their schooling and went on to work for Senator Padmé Amidala as servants at Varykino, Amidala's family retreat."}, {"tag": "p", "text": "In 22 BBY, Amidala and her Jedi bodyguard, Anakin Skywalker, used Varykino as a sanctuary after two failed assassination attempts on the Senator's life. Nandi and Teckla served them their meal, including shuura fruit as dessert. At the end of the day, they said goodbye to the young couple and left the two alone."}, {"tag": "p", "text": "During the Clone Wars, Nandi was separated from Teckla once again when the latter left for Coruscant to act as one of Amidala's handmaidens. Later in the war, Nandi's sister was assassinated by the bounty hunter Embo on the planet Scipio."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Unlike Teckla Minnau, the character of Nandi is not seen in Star Wars: Episode II Attack of the Clones, but she appears in the film's script and novelization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}