{"url": "Assault_battle_droid", "categories": ["Category:Legends articles", "Category:B1 battle droid models", "Category:Trade Federation battle droid models"], "nodes": [{"tag": "h1", "text": "Assault battle droid"}, {"tag": "p", "text": "The assault battle droid or assault droid was a variation of the B1-Series battle droid used by the Trade Federation during the Clone Wars and the Separatist Crisis. Their standard armament of E-60R missile launchers, HX2 antipersonnel mines, and V-1 thermal detonators made them best suited for neutralizing enemy vehicles. These droids were also equipped with SE-14 blaster pistols for taking out close-range, individual targets."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Assault battle droids were B1-Series battle droid variants, stood 1.91 meters tall, with black sensors and tan plating constructed by Baktoid Armor Workshop.\nDuring the Clone Wars, the heavy assault droids stood out from the standard battle droids, with their dark red or blue torso, with occasionally other red markings similar to, but not to be confused, with OOM security battle droids. They had masculine programming"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Assault droids were produced by the CIS during the Clone Wars as anti-armored units used to destroy Republic turrets and vehicles on the battlefield using their primary weapon, the E-60R missile launcher. Supplementing the launcher was an SE-14 blaster pistol and 3 V-1 thermal detonators. They also deployed HX2 antipersonnel mines mines to guard important positions. They were seen on many battles, such as Geonosis, Kashyyyk, Rhen Var, and Muunilinst. Following the end of the Clone Wars, they saw action with Separatist holdouts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Assault droids first appeared in Clone Wars Chapter 2, and served as the Separatist heavy-weapons unit in the Battlefront series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}