{"url": "Nantex-class_territorial_defense_starfighter", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Confederacy of Independent Systems starfighter classes", "Category:Nantex-class territorial defense starfighters"], "nodes": [{"tag": "h1", "text": "Nantex-class territorial defense starfighter"}, {"tag": "p", "text": "The Nantex-class territorial defense starfighter, also known as the Geonosian starfighter or more simply as the Nantex-class starfighter, was a needle-shaped starfighter manufactured by Huppla Pasa Tisc Shipwrights Collective and used by the natives of Geonosis. Many saw service during the Clone Wars to defend the droid factories of the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Manufactured by the Huppla Pasa Tisc Shipwrights Collective on Geonosis, the Nantex-class starfighter was a territorial defense craft capable of flight in atmosphere as well as in the vacuum of space. The cockpit was situated on the top of the craft, where its bubble canopy afforded its single pilot a three-hundred-and-sixty degree field of view. The nimble starfighters had a sleek, needle-nosed design, with a laser cannon situated between the forward prongs. This emplacement fired purple lasers and could swivel to fire in a near-360 degree arc. The fighter utilized one hundred small tractor beam projectors to aid in precision aiming, and allowed for grappling with enemy vessels at close range. They were also painted with green markings reminiscent to those of the pygmy porlceetin, a large, poisonous creature found on Geonosis."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Nantex-class starfighter was the primary defensive craft of the Geonosians of Geonosis. Many were deployed during the First Battle of Geonosis, where two served as escort craft for Count Dooku on his speeder as he attempted to reach his solar sailer. The fighters were used throughout the Clone Wars to defend the planet's droid factories, and were affiliated with the Confederacy of Independent Systems. Nantex-class fighters fought in the Second Battle of Geonosis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}