{"url": "Nantex-class_territorial_defense_starfighter/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Confederacy of Independent Systems starfighter classes", "Category:Nantex-class territorial defense starfighters"], "nodes": [{"tag": "h1", "text": "Nantex-class territorial defense starfighter"}, {"tag": "p", "text": "The Nantex-class territorial defense starfighter, also known as the beak-wing fighter or simply the Geonosian starfighter, was a model of starfighter that was manufactured by Huppla Pasa Tisc Shipwrights Collective and designed for the exclusive use of the Geonosians when guarding their territories against intruders. During the Clone Wars, these small, speedy craft would see service with the naval and land forces of the Confederacy of Independent Systems in a small number of key battles, including the campaigns of Sev'rance Tann and the Battle of Muunilinst, as well as the First Battle of Geonosis itself that saw the opening shots of the galactic conflict."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Design and construction"}, {"tag": "p", "text": "The Nantex-class starfighter was a lean, needle-nosed fighter craft that possessed great speed and a high degree of agility and was specifically designed for use by pilots of the Geonosian species, who were drawn from a specific pilot caste within their society. Designed and built by Huppla Pasa Tisc Shipwrights Collective, the starfighter's frame was, like many other types of Geonosian starship, made from thin strands of pliable laminasteel, a long metallic substance that was also used in constructing Geonosian hives. During the construction process, this material was heated, then wrapped around the assembled inner components of the fighter. When the laminasteel hardened, it produced a strong and flexible aerodynamic frame that could hold itself well against heavy impacts. Once the frame was complete, engineers would fit the craft with magnetic hardpoints to which were mounted the primary engines and weapon. These mounts were completely modular, which allowed for the addition of various other components that may be required to fulfill special missions; these consisted of advanced sensor suites, booster rockets, or other additions. The primary engine orb was in a rotary socket, and in the center of this was an ignition chamber. High energy propellant particles were sent into the chamber and through a bottle field. The bottle field only allowed the highest velocity particles through the engine, leading to the ship's great speed."}, {"tag": "h3", "text": "Avionics"}, {"tag": "p", "text": "The Nantex-class fighter possessed a complex set of multi-axis control yokes that required a Geonosian's considerable manual dexterity in order to properly handle. In addition to this, vital performance feedback and systems information were forwarded to the pilot via a scent-stimulator mask that took advantage of the Geonosians' acute sense of smell; this mask could also be used to fly the craft remotely. These design features made it all but impossible for members of other species to even fly the craft, let alone use it in a combat situation. A single Geonosian pilot sat within a small cockpit, his head protruding up from the main frame into a transparent bubble canopy, which allowed for an unobstructed 360-degree field of vision."}, {"tag": "p", "text": "These pilots, raised in vast hives within their caste, were trained to hurl themselves at any enemy force with seemingly reckless abandon; from birth, each pilot was melded with the systems of a specific beak-wing, ensuring a lasting counterpart-level relationship between the two. This allowed for vastly improved reaction time when in combat."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The fighter's main weapon was a turret-mounted laser cannon that was cradled between its forward needle-like mandibles and seated within a magnetic bracket. This turret shot amethyst laser bolts, and its emplacement was modular, allowing for other weapons, such as an ion cannon, to be switched in and out as circumstances dictated."}, {"tag": "p", "text": "In addition to the modular weapon assembly, the Nantex-class fighter was also lined with one hundred small, independently-aimed tractor beam and repulsorlift generators. These extra systems could be used to give the starfighter increased maneuverability while flying within an atmosphere, limit the mobility of enemy craft, or allow the laser bolts fired from the fighter's main weapon to be guided and fired off-axis. The Nantex-class ship was thought of as a \"stealth\" vehicle, since its engine and weapons systems emitted very little ambient glow for sensors to pick up. This was used to the Geonosians' advantage when defending their home territory: whenever an intruding force threatened their homeworld, hordes of these craft would swarm out of the Geonosian asteroid field, ambushing any would-be attackers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre–Clone Wars roles"}, {"tag": "p", "text": "Prior to the onset of the Clone Wars, the Geonosians relied on the beak-wing starfighter as one of their primary defenses against unwelcome outsiders. The world of Geonosis was surrounded by a ring of asteroids that, while relatively stable, was made of many hundreds of thousands of individual rocks that ranged from the size of small pebbles to large bulk freighters, all of which served as superior positions from which to stage ambush raids. With their inherent maneuverability and the skill of their bonded pilots, Nantex-class fighters were able to negotiate the field in ways that other vessels could not."}, {"tag": "h3", "text": "Battles during the Clone Wars"}, {"tag": "p", "text": "Many Nantex-class fighters were used during the opening stages of the First Battle of Geonosis. A number of these craft, accompanied by Vulture droid starfighters, were sent to intercept the Acclamator-class assault ship Aken, which was carrying thousands of clone troopers who were accompanying the Jedi Master Yoda's mission to rescue those Jedi fighting in the Petranaki arena in the wake of their attempt to rescue Obi-Wan Kenobi, Anakin Skywalker, and Padmé Amidala. As the battle wound down, a pair of these craft protected Count Dooku from the pursuing LAAT/i carrying Obi-Wan and Anakin, as he fled to his personal hangar ahead of the impending Confederacy rout. As the target of assassination by Delta Squad, the Geonosian lieutenant Sun Fac attempted to flee his homeworld aboard a Nantex fighter, but he was shot down by the clone commandos before he could get away."}, {"tag": "p", "text": "A large number of Nantex-class fighters served with the Confederacy forces that participated in General Sev'rance Tann's campaign against the Galactic Republic, in which she was sent by her mentor, Count Dooku, to disrupt a secret project and acquire its results, the Decimator. On the worlds of Eredenn Prime, Tatooine, Alaris Prime, Sarapin, Aereen, and Krant, these craft would serve as air support for ground troops as well as a buffer force against the Republic's LAAT/is and Jedi-flown Delta-7 interceptors. The campaign saw initial success for the Confederacy, but with the leadership of Jedi General Echuu Shen-Jon, the clone forces would ultimately triumph. This resulted in the death of Tann and the destruction of most of her forces."}, {"tag": "p", "text": "Though the Geonosians did not sell these fighters to outsiders, they were seen being piloted by InterGalactic Banking Clan-owned and operated OOM pilot battle droids during the Battle of Muunilinst in which swarms of them, deployed from orbital gun platforms, faced off against the clone-piloted V-19 Torrent starfighters utilized by the Galactic Republic during the battle."}, {"tag": "p", "text": "Nantex-class starfighters were used to defend the primary droid foundry against the attacking Republic forces during the Second Battle of Geonosis."}, {"tag": "p", "text": "Late in the Clone Wars, Nantex-class fighters were part of General Grievous's task force during the General's attack on Belderone. It also served as the basis for the Commerce Guild fleet patrol craft."}, {"tag": "p", "text": "By 3 BBY, a Nantex-class fighter had been abandoned on the scrapyard world of Raxus Prime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nantex-class starfighter was first created for use in Star Wars: Episode II Attack of the Clones, but it was first seen in the video game Star Wars: Jedi Starfighter, which takes place just before and during the film. Within the game, these craft also mounted warhead launchers in addition to their laser cannons."}, {"tag": "p", "text": "Initially, the droid starfighter seen in Episode I was to be the primary air defense for the Separatists, but it was decided instead to give the Geonosians their own fighter craft. At one point, it was imagined that the fighter would be equipped with large sails, but that concept was instead folded into Count Dooku's solar sailer. When the air battle was cut, the fighter was instead slated to appear in a shot wherein a Republic attack gunship strafes a Geonosian airstrip, destroying the waiting craft. That shot was ultimately omitted."}, {"tag": "p", "text": "In the video game Star Wars: Galactic Battlegrounds: Clone Campaigns, the Nantex is presented as the \"Fast Geonosian Fighter,\" preceded by the Geonosian Fighter and succeeded by the Advanced Geonosian Fighter in the in-game tech tree for the Confederacy forces."}, {"tag": "p", "text": "The beak-wing, as featured in Star Wars: Battlefront, is flyable by any class of in-game character; this is likely gameplay mechanics."}, {"tag": "p", "text": "Although they are seen in Attack of the Clones and Jedi Starfighter flying upright, the Clone Wars series has depicted them as spinning constantly during flight rather than flying straight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}