{"url": "Nar_Bo_Sholla", "categories": ["Category:Legends articles", "Category:Hutt Empire planets", "Category:Hutt Space planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Nar Bo Sholla"}, {"tag": "p", "text": "Nar Bo Sholla was a Hutt Space world that was the homeworld of the poisonous spor crawler insect. It was a part of the Hutt Empire twenty-five millennia before the Battle of Yavin. In 25 BBY, the Human Morteos was born on Nar Bo Sholla. Three years later, it became one of the worlds that suffered damage as a result of an infestation of the structure-damaging arthropods known as stone mites. The Nar Bo Sholla system was conquered by the extra-galactic Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nar Bo Sholla was a terrestrial world located in the Nar Bo Sholla system of Hutt Space. The world was situated between the Irith and Keldooine systems on the hyperlane known as the Ootmian Pabol, while the Pabol Kreeta connected it to the Nar Kreeta system. The species of poisonous, deadly insect known as the spor crawler, which had adapted itself to burrowing in dirt and sand, was native to Nar Bo Sholla, although it eventually spread throughout the galaxy via black market trade."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A part of the Hutt Empire during the Xim Wars of 25,102 BBY–25,096 BBY, by the date 13:5:9 Nar Bo Sholla became one of the several worlds of the galaxy that experienced an infestation of stone mites—arthropods feeding on silicates and complex metals. An issue of the CoCo District Edition of the HoloNet News released on that date noted that Nar Bo Sholla reported damage to the world's structures from the infestation."}, {"tag": "p", "text": "The Human assassin Morteos was born on Nar Bo Sholla in 25 BBY, a fact which was noted in 7 ABY by New Republic General Airen Cracken in Wanted by Cracken, a datafile that served as a compilation of reports on various threats to the New Republic. At some point during the reign of the Galactic Empire, an entry of a holobrochure for the Tagge Holographic Museum of Chandrila dedicated to the spor crawler mentioned the creature's origin on Nar Bo Sholla. The Nar Bo Sholla system was conquered by the military forces of the extra-galactic Yuuzhan Vong at some point between 26 ABY and 27 ABY during their conquest of the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nar Bo Sholla was first mentioned in the 1993 Star Wars: The Roleplaying Game supplement Wanted by Cracken, which was written by Louis J. Prosperi for West End Games. The 2009 reference book The Essential Atlas placed the Nar Bo Sholla system, and therefore Nar Bo Sholla itself, in grid square R-10."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}