{"url": "Nar_Haaska", "categories": ["Category:Canon articles", "Category:Hutt Space astronomical objects", "Category:Outer Rim Territories astronomical objects", "Category:Shadowports", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Nar Haaska"}, {"tag": "p", "text": "Nar Haaska was a shadowport on the border of Hutt Space and the Outer Rim Territories. At some point by 10 BBY, Bandit Billie and her crew of shipjackers accosted the space yacht of the crime lord Jabba Desilijic Tiure, the Star Jewel, while it was on a layover on Nar Haaska. The theft attempt was thwarted, and the yacht subsequently changed course for a repair yard at Keldooine."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nar Haaska was a terrestrial astronomical object located on the Outer Rim Territories' border of Hutt Space, a part of the Slice. It was also situated in the grid square T-11 of the Standard Galactic Grid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the reign of the Galactic Empire, Nar Haaska was a shadowport. The pirate queen Maz Kanata marked its position on a galactic map included in the logbook that eventually came to be known as the Smuggler's Guide."}, {"tag": "p", "text": "At some point by 10 BBY, the Star Jewel, the space yacht of the crime lord Jabba Desilijic Tiure, made a stop at Nar Haaska. During the layover, the shipjacker Bandit Billie and her Taurill crew accosted the vessel, but their actions only resulted in slight damage to the yacht's landing gear and hull plating at the cost of wounds inflicted upon Billie by a Gamorrean vibroax. Bib Fortuna, Jabba's majordomo, eventually gained possession of the Smuggler's Guide from the would-be thief, and after changing the course of the Star Jewel to a repair bay at the celestial body Keldooine, Fortuna recorded the encounter on Nar Haaska in the book."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nar Haaska was first depicted in the new Star Wars canon on a galactic map in Star Wars: The Force Awakens Beginner Game, a 2016 Fantasy Flight Games' Star Wars Roleplaying boxed set. The world Nar Haaska was originally introduced in the Star Wars Legends continuity, where it was first mentioned in the 2009 reference book The Essential Atlas, written by Daniel Wallace and Jason Fry. In a 2009 article published on Suvudu.com, Fry noted that Nar Haaska was among those Hutt Space worlds created for The Essential Atlas that received \"Hutt-sounding\" names."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}