{"url": "Nar_Haaska/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire planets", "Category:Hutt Space planets", "Category:Trade worlds"], "nodes": [{"tag": "h1", "text": "Nar Haaska"}, {"tag": "p", "text": "Nar Haaska was a Hutt Space trade world. It was a part of the territory controlled by the Hutts by 25,000 BBY, and by 17 BBY, the world became a part of the Galactic Empire. During the Yuuzhan Vong War, the extra-galactic Yuuzhan Vong conquered the Nar Haaska system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nar Haaska was a rarely visited trade world located in the Nar Haaska system, a part of the Hutt Space portion of the Slice. Nar Haaska lay on a hyperlane that connected it to the planets Saqqar and Droxu—in Hutt Space and the Outer Rim Territories, respectively."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nar Haaska was located within the territory controlled by the Hutt species by 25,000 BBY, and the area of space surrounding the world was considered well-explored by 8000 BBY. During the first campaigns of the Clone Wars in 22 BBY, the Thirteenth Sector Army of the Galactic Republic was charged with engaging the military forces of the Confederacy of Independent Systems in Nar Haaska's vicinity. By 17 BBY, the world was situated in the territory formally controlled by the Galactic Empire."}, {"tag": "p", "text": "The population of Nar Haaska around 25 ABY numbered between 500 million to 1 billion. At some point between 26 ABY and 27 ABY, the Nar Haaska system was attacked by the military forces of the extra-galactic Yuuzhan Vong species during its conquest of the galaxy, and the star system remained under the invaders' control by 27 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nar Haaska was first mentioned in The Essential Atlas, a 2009 reference book co-authored by Daniel Wallace and Jason Fry, which placed it in grid square T-11. In a 2009 article published on Suvudu.com, Fry noted that Nar Haaska was among those Hutt Space worlds created for The Essential Atlas that received \"Hutt-sounding\" names."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}