{"url": "Nar_Kreeta", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Hutt Space planets", "Category:Mining planets", "Category:Rocky planets", "Category:Slavery worlds", "Category:Trade worlds", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Nar Kreeta"}, {"tag": "p", "text": "Nar Kreeta was a Hutt colony and major trade world, located at the nexus of the Pabol Kreeta and Pabol Sleheyron."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nar Kreeta featured a rocky landscape with mountains and canyons alongside large deserts and aquamarine seas."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Disciples of Ragnos Crisis"}, {"tag": "p", "text": "Nar Kreeta was a focus of the New Jedi Order's attention during the Disciples of Ragnos crisis. A mining guild running on Nar Kreeta informed the Jedi Praxeum on Yavin 4 that several elders of that guild had gone missing mysteriously. The guild suspected a Hutt connection but the local Hutt crime lord denied knowledge of any kidnapping."}, {"tag": "p", "text": "Jedi Jaden Korr was dispatched to investigate the matter. He covertly entered the Hutt's facility and soon uncovered the fate of the missing elders. The elders were among other captured Humans intended to be used as quarry in labyrinthine pit matches against a rancor, sponsored by the Hutt. The object of the betting was to wager on the last remaining Human to be killed. It became apparent to the Jedi that the building was actually a Rancor betting parlor."}, {"tag": "p", "text": "After fighting his way through the gambling parlors and bars, Korr found himself entering the pit. He systematically unbound the prisoners from their holding areas and led them through the labyrinth, warding off the rancor as it approached. After rescuing all sixteen of the captives, Jaden escaped the complex with the elders in his master's ship."}, {"tag": "h3", "text": "Yuuzhan Vong invasion"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Nar Kreeta was conquered and heavily Vongformed by the invaders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}