{"url": "Nar_Shaddaa_Flophouse", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with gameplay alternatives", "Category:Nar Shaddaa locations"], "nodes": [{"tag": "h1", "text": "Nar Shaddaa Flophouse"}, {"tag": "p", "text": "The Flophouse was a slum located in the docks owned by Vogga, a Hutt crime lord operating on Nal Hutta's moon, Nar Shaddaa."}, {"tag": "h2", "text": "Residents"}, {"tag": "p", "text": "The Jedi Exile, in her search for Zez-Kai Ell, interacted with or helped many flophouse residents."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Vogga Thugs"}, {"tag": "p", "text": "In one room, the Exile found two thugs plotting to get into Vogga's stash. She used their tactics and got in."}, {"tag": "h4", "text": "Mandalorians"}, {"tag": "p", "text": "In another room, she found some Mandalorians, and Mandalore convinced them to go to Dxun."}, {"tag": "h4", "text": "Lunar Shadow Crewmen"}, {"tag": "p", "text": "In another room, she found some Lunar Shadow Crewmen and got them a captain."}, {"tag": "h4", "text": "Bith scientist"}, {"tag": "p", "text": "In another room, she found a Bith scientist, who asked her to pick up an item from a Twi'lek. She found the Twi'lek dead, was attacked by a cleaning droid, and when she returned to the flophouse, the Bith was dead; killed by his own droid."}, {"tag": "h4", "text": "Lasavvou"}, {"tag": "p", "text": "In the next room, she found an Ithorian named Lasavvou who needed to pay off a fee. She got Lasavvou allowed to leave."}, {"tag": "h4", "text": "Lootra"}, {"tag": "p", "text": "In the next room, she found a refugee named Lootra. She had him reunited with his wife."}, {"tag": "h2", "text": "The large room"}, {"tag": "p", "text": "The large room belonged to Mira, the bounty hunter. She brought the Exile there on her way to see Visquis in the Jekk'Jekk Tarr, drugged her, took her Space Suit, and left. The exile later met Zez-Kai Ell in there."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nar Shaddaa Flophouse appeared in Star Wars: Knights of the Old Republic II: The Sith Lords, developed by Obsidian Entertainment. Several quests involving the residents are available to the player. If the player chooses the dark-side options, they can kill the crewman, Lasavvou, and Lootra. They will also fight Zez-Kai Ell in the large room."}, {"tag": "h2", "text": "Appearances"}]}