{"url": "Nar_Shaddaa_agri-utility_crop_sprayer", "categories": ["Category:Legends articles", "Category:Agricultural technology"], "nodes": [{"tag": "h1", "text": "Nar Shaddaa agri-utility crop sprayer"}, {"tag": "p", "text": "A  Nar-Shadda agri-utiility crop sprayer, referred to as a \"Narsh dirt-crate\" by clone commando RC-1309, was utilized by clone commandos of the Galactic Republic in the year 22 BBY. Housed within the Grand Army of the Republic's Fleet Support Air Station on the Mid Rim world of Ord Mantell, the crop sprayer was utilized by the Special Operations Brigade to transport the clone commandos assigned to Omega Squad to the Mid Rim planet Qiilura on their mission to apprehend Separatist scientist Ovolot Qail Uthan. After entering the planet's atmosphere, the vessel succumbed to a bird strike, destroying it's engines and sending the crop sprayer plummeting to Qiilura's surface, where it was destroyed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A crop sprayer repurposed for use by the Grand Army of the Republic's Special Operations Brigade, the Nar Shadda agri-utility crop sprayer was piloted by a astromech droid and had been stripped of its internal tanks and equipped with securing straps to contain at least four passengers. The vessel's bulkhead had further been lined with stealth sheeting, rendering its cargo invisible to scans or probes. Equipped with a console to which a datapad could be connected, the converted vessel transponder code had been set to broadcast its purpose as a crop sprayer hired to dress barq fields after a harvest."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Nar Shaddaa agri-utility crop sprayer was stored in Docking Bay D-768 of the Galactic Republic's Fleet Support Air Station, an auxiliary of Fleet Support located on the Mid Rim planet Ord Mantell in 22 BBY. Piloted by a single red R5-series astromech droid, the crop sprayer was used to transport the four clone commandos of Omega Squad to the Mid Rim world of Qiilura, where they were assigned to locate and neutralize Separatist scientist Ovolot Qail Uthan to suspend her progress on clone-killing nanovirus FG36. Under the guise as one of the many crop sprayers that frequented Qiilura after the barq harvest, the craft entered the temprate planet's airspace successfully. As it neared the final 100 kilometers to the designated drop point, the vessel collided with a number of a Qiiluran avian species, which proceeded to destroy it's engines and sent it spiralling to the planet's surface. The commandos quickly exited the craft using parachutes, but the crop sprayer crashed shortly after, exploding with it's pilot roughly 30 kilometers away from the planned target zone, according to an estimate by RC-1136."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nar-Shaddaa agri-utility crop sprayer appeared in the 2004 novel Republic Commando: Hard Contact, written by Karen Traviss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}