{"url": "Narglatch/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Creatures of Naboo", "Category:Domesticated creatures", "Category:Felines", "Category:Mammals", "Category:Narglatchs", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Snow and tundra creatures", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Narglatch"}, {"tag": "p", "text": "The narglatch was a stealthy apex predator which could be found in diverse environments, such as the Gungan swamps of Naboo or the frozen tundras of Orto Plutonia."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "The narglatch male had additional fleshy spikes, while females were smoother and slightly smaller. They both had non-retractable claws and a fan-like tail that acted as a rudder during high-speed chases and turns. The narglatch also had densely padded feet that made for silent footfalls."}, {"tag": "p", "text": "Males and females only commingled during mating season. Females were more fierce hunters than males, but males could chase a female from her kill. A pregnant narglatch always gave birth to twins, one of each gender. Since young narglatch could hunt immediately upon birth, mothers abandoned them. Cubs hunted together until maturity, making themselves less vulnerable to such Naboo creatures, as saw-toothed granks, veermoks, and even more mature male narglatch. As they approached maturity, the cubs separated."}, {"tag": "p", "text": "A solitary hunter, narglatch silently stalked and quickly killed its prey, usually kaadu or jimvu. Narglatch generally avoided deep water, although they were capable swimmers should the need arise. One of the few creatures they actively avoided were zalaacas."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "On the frozen world of Orto Plutonia, the narglatch were used as mounts by the primitive Talz. On Naboo, the Gungans would ride the sure-footed beasts across their planet and into battle. Though strong and fierce, the narglatch could easily be felled by blaster fire. The Orto Plutonian variety of narglatch was differentiated from the Naboo by a mane of fleshy tendrils or protrusions. Cubs were frequently seen as cute and taken as pets, but became very dangerous as they matured. Escaped narglatches were a threat on Coruscant."}, {"tag": "p", "text": "Around 1 ABY, the hunter Walker Luskeske asked a spacer to kill narglatches in the Gallo Mountains on Naboo and bring him fangs as trophies. In the meantime, a shuttle crashed in the Gallo Mountains. Tanoa Vills requested a spacer to eliminate rabid narglatches, including Grizzlefur, that gathered at the crash site in order to salvage research equipment. Around the same time, a pack of narglatches lived in the Naboo Crystal Cave and in the Narglatch Cave."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}