{"url": "Nariel_Pridence", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Jedi Knights of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Nariel Pridence"}, {"tag": "p", "text": "Nariel Pridence was a Human female Jedi Knight who served the Jedi Order during the Cold War between the Galactic Republic and the reconstituted Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3643 BBY, she was sent to the desert-planet, Tatooine to find the holocron of the Sith Lord Darth Nihilus. However, she had to face against Vaverone Zare, a servant of the Empire, who was also looking for the holocron. She was present inside Tookreek's cantina when she was forced to engage Chomm and his gang that were giving her trouble. Before engaging, a smuggler who had entered the cantina to talk with Tookreek took notice and warned the gang to leave her alone. Nariel swiftly slew all her attackers. She then exchanged formal introductions with the smuggler, she attempted to encourage them to change their ways and stop associating with criminals, before departing."}, {"tag": "p", "text": "Nariel later investigated an Imperial assault on Diago Hixan's summer palace and was surprised to find the smuggler involved in the fighting. The smuggler explained that the Imperials were sent by Zare, who attempting to broker a meeting with Diago, who possessed the holocron. The smuggler gave Nariel the location of Diago's hideout, the Lightspring. After expressing her thanks, the Jedi advised the smuggler not to follow, but the smuggler ignored her advice and did so anyway."}, {"tag": "p", "text": "Once all parties arrived at the Lightspring, tension began to grow before both Zare and Nariel attempted to use a mind trick to compel the smuggler to fight for her or drop their weapons respectively, but the smuggler proved too strong willed to be manipulated. Diago then ordered his droids to kill everyone. Nariel and the smuggler fought side-by-side against both Diago and Zare, killing them both."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nariel Pridence is voiced by Grey DeLisle."}, {"tag": "p", "text": "If the Smuggler character is male, he can flirt with Nariel, making her wish that if she wasn't a Jedi, she'd have known what to do in romantic situations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}