{"url": "Narl_(captain)", "categories": ["Category:Legends articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Narl  (captain)"}, {"tag": "p", "text": "Narl was an individual who lived during the Galactic Civil War. Captain Narl worked as a pilot for the GeneTech Syndicate."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Yavin, Narl captained a transport ship for the GeneTech Syndicate, a biotechnology company based on Talus."}, {"tag": "p", "text": "Circa 1 ABY, Captain Narl was ordered to transport a group of scientists and a cargo of bioengineered arachnes. Those arachnes were bioweapons secretly designed by the GeneTech Syndicate as the Parasophic Arachne program. The destination was the Imperial research facility on Nubia. However, during the trip, the ship's anti-grav and thruster control broke down and the vessel plowed into the side of a Talusian mountain, northeast of the city of Nashal. After the crash, Captain Narl organized the survivors in two group. One group was tasked with taking care of the wounded, establishing a camp and finding a way to get to Nashal. The second group was tasked with destroying any of the creatures that broke out of containment and escaped. The scientists aboard the ship were carrying a highly contagious virus designed to destroy the entire shipment of arachnes if necessary. However, the arachnes quickly molted into more powerful and intelligent creatures and completely overwhelmed the survivors. The ship's crew did their best to protect the scientists and the wounded but the arachne took one or two more of them every night. Captain Narl then issued tracking emitters for everyone to wear and gave the tracking device to his droid CV-4T. The survivors later established another camp on their road to Nashal while the Captain and some others went in search of the missing crew. Captain Narl decided to take the fight to the creatures and the group followed a trail of blood in order to beat the creatures at their source. The group followed and fought the arachnes in several caves in the mountains. However, the creatures had already grown to their fifth life stage, progressing far faster than anticipated and exhibiting new special attack features and intelligence. The creatures finally trapped the survivors in a cave and Captain Narl died trying to protect his men."}, {"tag": "p", "text": "In the meantime, the Corellian Security Force spotted the crash of Captain Narl's ship. Agent Taarna dispatched a spacer to investigate the crash site in the mountains and rescue any survivors. The spacer visited all the survivors' camps and arachnes' lairs but only found dead bodies. The spacer finally discovered that Captain Narl and all the other survivors were already been killed by the arachnes. This eventually led to the discovery of the Parasophic Arachne program, leading to a CorSec raid on the GeneTech Syndicate Lab."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Captain Narl was first mentioned in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Captain Narl was added to the game as part of the \"Genetic Potential\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}