{"url": "Narrow_Margin", "categories": ["Category:Legends articles", "Category:Air vehicles", "Category:Alliance to Restore the Republic starships", "Category:Shuttles"], "nodes": [{"tag": "h1", "text": "Narrow Margin"}, {"tag": "p", "text": "The Narrow Margin was a shuttle used by the Rebel Alliance hero Luke Skywalker to travel to the cities of Coronet, Theed and Anchorhead during the time of the Galactic Civil War. Accompanied by a group of Alliance commandos, he attempted to rally support for the Rebel cause and recruit soldiers for dangerous missions against the Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Narrow Margin was based off of the unremarkable design of airbus passenger shuttles commonly used throughout the many worlds of the galaxy. However, unlike the repulsorlift shuttles which were ostensibly used only for atmospheric travel between cities, the Narrow Margin was able, whether through its own capabilities or through other means, of being delivered between multiple planets. Metallic gray with red stripes, the Narrow Margin had four viewports on each side of the craft, and an elevated canopy containing the cockpit. The rear of the craft contained the ship's two engines, and a large boarding hatch. The craft also used a single retractable skid as a landing gear."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, following the Battle of Yavin in 0 BBY, the Narrow Margin was used to carry the Rebel Alliance hero Luke Skywalker and an accompaniment of Alliance commandos. Luke Skywalker and his Rebel compatriots traveled aboard the shuttle to a number of cities across the galaxy in an effort to rally support for the Rebel cause. Although they were nominally controlled by the Empire, the cities of Coronet City on Corellia and Theed on Naboo were at times occupied by the Rebel Alliance. During these periods of Rebel occupation, the Narrow Margin had a window of opportunity to make landings there, allowing Luke to conduct rallies without Imperial interference. Luke also used the Narrow Margin to travel to the small town of Anchorhead on Tatooine, which typically harbored individuals more sympathetic to the Rebellion. During these rallies, Luke attempted to recruit Rebel soldiers for dangerous missions against the Empire."}, {"tag": "h2", "text": "Behind the scene"}, {"tag": "p", "text": "The Narrow Margin appeared in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. During periods of Rebel occupation, Luke Skywalker would periodically land in this shuttle in the cities of Coronet on Corellia and Theed on Naboo. Because it was statically controlled by the Rebellion, the craft would also carry Luke to Anchorhead on Tatooine. During these visits, Luke would offer players of the Rebel faction up to eight different quests, half of which were designated as \"Combatant\" quests (to be carried out against Imperial non-player characters), and the other half of which were designated as \"Special Forces\" quests (to be carried out against Imperial player characters). Luke would stay in these cities for a period of fifteen minutes before departing. During the craft's arrival and departure, nearby players received a system message from the Narrow Margin to flight control announcing the ship's arrival/departure."}, {"tag": "p", "text": "The graphical appearance of the Narrow Margin was identical the one used for the generic passenger shuttles which carried players between connecting shuttle ports on various worlds. In the game, the passenger shuttles were evidently restricted to atmospheric travel (or at the very least, suborbital flight). However, the Narrow Margin carried Luke to three different planet's, suggesting that it may have been a starship capable of interplanetary travel. However, this article refrains from making this assumption, as the possibility of it being carried to other star systems by another craft cannot be completely ruled out."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}