{"url": "Narsk_Ka%27hane", "categories": ["Category:Legends articles", "Category:Bothans", "Category:Males", "Category:Sith minions", "Category:Slaves", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Narsk Ka'hane"}, {"tag": "p", "text": "Narsk Ka'hane was a male Bothan spy during the Republic Dark Age who worked as an independent operator, serving several different Sith Lords within the Calimondra family including Odion, Arkadia Calimondra, and the family matriarch Vilia Calimondra. In 1032 BBY, he was sent by Lord Odion to gather information on the Convergence Tactical Assault Vehicle being developed at the Black Fang research facility on Darkknell by rival Sith Lord Daiman, ruler of the Sith princedom known as the Daimanate. During the mission, he was overpowered by the Human Jedi Knight Kerra Holt who destroyed the datapad containing this information and stole his stealth suit, leaving him to be captured by Daiman. While in Daimanate captivity, Narsk was subjected to intensive torture and interrogation by Daiman, but refused to divulge his true employer. Thus, Daiman arranged for Narsk to be allowed to escape captivity by revealing information about a business deal involving the Quermian Sith Lord Ayanos Bactra transferring a mobile war university known as an arxeum to Gazzari. By allowing Narsk to escape, Daiman planned to lure the Bothan spy's true employer—his rival Odion—into a trap on Gazzari."}, {"tag": "p", "text": "As planned, Narsk escaped with some \"reluctant assistance\" from his Jedi enemy Kerra and made his way back to the Odionate. Within two standard days, three rival Sith fleets assembled on Gazzari, a volcanic clouded in metallic ash. While Bactra's fleet observed the battle from space, Odion's ground forces landed only to be attacked by Daiman's forces. However, during the ensuing battle, Odion's forces gained the upper hand through the deployment of a siege tower known as the Death Spiral, which inflicted heavy casualties on Daiman's forces and destroyed the arxeum. In the middle of the battle, Narsk was contacted by his true employer—matriarch Vilia—who ordered the Bothan to transmit a message ordering Odion and Daiman to end their sibling rivalry and attack Bactra's forces since the Quermian Sith Lord was an outsider who had outlived his usefulness to the family. Thus, Narsk played a pivotal role in bringing about the collapse of the Bactranate, which was subsequently divided up by several Sith Lords including Odion, Daiman, Lioko, and Malakite. His perennial Jedi adversary Kerra also resurfaced during the battle: destroying the Death Spiral and evacuating thousands of student refugees from the arxeum to safety on the Human mercenary Jarrow Rusher's troopship Diligence."}, {"tag": "p", "text": "Following the fighting on Gazzari, Narsk disappeared and later resurfaced on the Dyarchy world of Byllura, where he participated in the Arkadianate invasion of that planet. While in the service of the female Human Sith Lord Arkadia Calimondra, Narsk encountered Kerra and Jarrow again on Arkadia's capital of Calimondretta on the icy world of Syned. Later, he would help Kerra and Jarrow escape from Arkadia into Republic space."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Narsk Ka'hane was raised solely by his aunt on the planet Verdanth in the Bothan community. Nearly every year, a new Sith Lord was taking over the planet and the Bothans always supported the new ruler without resistance. As a slave of the various successive Sith warlords, Narsk received assignments from various rulers. Once, he was harvesting rimebats from the caverns on Verdanth in a stealth suit. Later, he was tracking escapees, worked as a nonmilitary scout and as a saboteur. However, he never married nor had any children. Finally, when there was a power vacuum on the planet because two Sith Lords had destroyed each other, Narsk went into space and studied the balance of power there."}, {"tag": "p", "text": "During the last decades of the Republic Dark Age, Narsk ended up serving under the Sith Lord Vilia Calimondra, the family matriach of a vast family of Sith warlords within the Grumani sector. Like other agents, Vilia needed him to gather information as well as to serve her grandchildren and to create challenges for them so that they are prepared for a future war against the Republic and the Jedi. From her, Narsk learned more about Sith space and the whole galaxy than most people. Due to tensions between her seven children over who would inherit a vast empire, Vilia proposed a competition known as the Charge Matrica where she would bequeath all her holdings to the heir that conquered the most territory. The Charge Matrica had begun in 1066 BBY and eventually descended into internecine fighting among Vilia's children after Xelian, the mother of Odion and Daiman, declared war on Chagras. In the end, Chagras triumphed and became the titular ruler of the Chagras Hegemony. However, Vilia still lived and maintained much of her empire."}, {"tag": "p", "text": "By 1042 BBY, Chagras was ready to challenge the Galactic Republic, which had been reduced to a rump state around the Core Worlds and Colonies. However, his death in 1040 BBY ended the shaky truce among Vilia's grandchildren who went to war with each other. This sparked the Second Charge Matrica with Vilia willfully perpetuating the conflict by encouraging her grandchildren to fight each other. She regularly held a series of bequests to resolve disputes and to distribute territories and assets to her children. Vilia was happy to maintain this status quo since it prevented the emergence of a strong claimant who could challenge her grip over family affairs."}, {"tag": "p", "text": "Vilia also had an implant inserted into his head that enabled him to received coded transmissions while doing fieldwork. As an agent of Vilia, Narsk took up missions from several Sith Lords and his reputation grew over time. At at unknown time prior to 1032 BBY, Vilia also provided him a Cyricept Personal Concealment System, Mark VI stealth suit with an embedded tracking device. Narsk treasured this state-of-the-art stealth suit which had been developed on Coruscant, the Republic capital, and smuggled through secret networks into Vilia's empire. The Mark VI stealth suit had also been specially modified by Vilia's technicians to enable her to track Narsk's whereabouts. While the suit was deactivated, it silently pinged the secret communications network Vilia had used to monitor her family."}, {"tag": "h3", "text": "Captive of the Daimanate"}, {"tag": "h4", "text": "Trials on Darkknell"}, {"tag": "p", "text": "In 1032 BBY, he was serving the Sith Lord Odion. On a mission to gather intelligence about and destroy the Convergence Tactical Assault Vehicle. This was a military starship being constructed by Odion's brother and rival Daiman at the Daimanate Dynamic Testing Facility on Darkknell. For this operation, he posed as a machine tool operator from Nilash. After studying the traffic patterns and shifts of the guards, he sneaked into the facility multiple times with his stealth suit and loaded information about the ship onto his datapad. Finally, he installed a baradium thermal charger in the facility. But on leaving the building, he was chased by what he thought would be one of Daiman's Correctors on the rooftops. Narsk stole a speeder bike from the Personal Transport Assembly Shop but was eventually stopped by the Human woman who turned out to be the Jedi Kerra Holt who did not support any of the Sith Lords. To his horror, she destroyed Narsk's datapad with the information, triggered the explosion and left him without his stealth suit handcuffed in a garbage bin, where he was eventually found by Daiman's Correctors."}, {"tag": "p", "text": "Following the bomb blast, Daiman's Correctors combed the area, rounding up suspects for questioning including Narsk himself who was brought to the sentry station on Administrative Way. Most of these suspects were homeless vagrants who lived on the streets of Xakrea. During interrogation, Narsk tried to maintain his cover identity that he was a machine operator who had been robbed. However, Daiman's Correctors were able to sense through the Force that he was lying and hiding something inside his mind. Narsk was himself interrogated by Lord Daiman who used mind-reading to discern that the Jedi woman Kerra had also infiltrated on Darkknell. Under pressure from Daiman's mental prodding, Narsk broke down and confessed that he had been near the Black Fang facility, but refused to divulge who he was working for."}, {"tag": "p", "text": "After several more days of interrogating and torturing Narsk, Daiman had the Bothan suspended at the top of a large public arena in a circular gyroscopic torture wheel within the Sanctum Celestial. Since he had no platform to support his feet, Narsk was forced to rely on his arms, which caused a great physical and emotional strain to his already emaciated and beaten body. Daiman and his entourage including his female Woostoid aide Uleeta were seated on a suspended platform at the center of the arena. When Narsk made a snide thought on Daiman's narcissism, Daiman sensed Narsk's thoughts and retaliated by unleashing Force lightning on the Bothan, enough to torment him but not to kill him. Daiman then taunted Narsk by telling the Bothan that if he and Kerra had intended to hurt him, they had failed to change his course. Daiman then remarked that the Bothan and the Jedi woman had given him exactly what he had wanted."}, {"tag": "h4", "text": "An Unwitting Sith Pawn"}, {"tag": "p", "text": "Daiman then contacted the Quermian Sith Lord Ayanos Bactra on a priority communications channel via a holographic projector. During this meeting, Daiman explained to the Quermian the details of the attack, and displayed the captive spy Narsk. In response, Bactra claimed to have no prior knowledge of the strike, or any recognition of the Bothan spy who had been partially responsible for the loss of the research facility. While referring to Narsk, Bactra also commented that his kind tended to meddle in things that were above them. In order to resolve the temporary weakness in the Daimanite defenses created by the loss of the testing center, Daiman requested that Bactra supply him with an arxeum, a mobile university devoted to the development of war sciences. Bactra agreed to the proposition, promising to hand over an arxeum to Daiman on the world Gazzari, in return for Bactranite forces being granted passage across Daimanite space to the world Vellas Pavo, for six weeks. Vellas Pavo was the site of mines extracting the superconductor Gadolinium, which were competing with Bactra's own superconductor interests. Daiman's aide Uleeta speculated that Bactra had planned to destroy the Vellas Pavo facilities for his own strategic interests."}, {"tag": "p", "text": "Throughout the meeting, Narsk's gyroscopic torture wheel continually rotated and slowed down at irregular intervals, causing the Bothan much discomfort. The Jedi Kerra Holt was also present during the holo-conference since she had used her newly acquired stealth suit to evade the security. Both Narsk and Daiman sensed her presence of at the doorway but she was able to elude detection. Narsk also heard Daiman discussing with Bactra his plans to visit the mobile research facility on his flagship Era Daimanos. At the end of the holo-transmission, Daiman had Narsk's prison platform lowered, and it landed on a cushion of anti-gravity force before striking the floor. Daiman then ordered his two Gamorrean sentries to move the wheel-like prison into a secluded maintenance area."}, {"tag": "p", "text": "In reality, Daiman had planned to use the arxeum to lure his estranged older brother Sith Lord Odion into a trap on Gazzari. Throughout the holo-conference, Daiman had programmed Nark's gyroscopic torture wheel to slow down whenever anything important was said since Daiman had made secret arragements for Narsk to escape and leak the information back to his master Odion in order to lure him into a trap. As part of his plan, Daiman ordered his Gamorrean guards to loosen Narsk's bonds. During a subsequent military briefing session, Daiman addressed his generals and outlined his battle plans. Besides his regular military forces, Daiman also enlisted the services of several mercenary groups including the Human Jarrow Rusher, the Togorian Kr'saang, and the Toong Mak Medagazy. The specialist battalions would depart Darkknell at sunset, each making hyperspace jumps to different destinations. In four standard days, they would reassemble on Gazzari. Since Gazzari was a volcanic world shrouded in metallic ash, Daiman regarded it as a perfect site for an ambush. As part of the plan, Odion's forces would enter the Gazzari where they would be assaulted by Daiman's gun emplacements, which were hidden behind the volcanic ash. Daiman also had his flagship Era Daimanos prepared for a hyperspace jump."}, {"tag": "p", "text": "Meanwhile, Narsk encountered his Jedi adversary Kerra in the maintenance unit. When Narsk asked Kerra if she had come to return his stolen property, Kerra replied that depended on what information the Bothan told her and how quickly he disclosed it. Narsk agreed to trade the information in return for his freedom, stressing that he was not in the business of helping Jedi. Narsk quickly revealed that Daiman was going to Gazzari on his flagship. When Kerra inquired whether this trip was connected to Daiman's dealings with Bactra, Narsk only agreed to disclose this information once she had moved his gyroscopic torture wheel outside. Upon arriving outside the Sanctum Celestial, Narsk reneged on his earlier agreement by demanding that she take him in exchange for him revealing the information; adding that his life was in danger because he had made an enemy in the form of Daiman."}, {"tag": "p", "text": "However, Kerra refused to cooperate since she did not work with the Sith nor with their collaborators. After taunting Narsk about his slim chances of survival down the chute, Kerra pushed the captive Bothan and his torture wheel down a long stone trough leading downwards from Daiman's palace. However, Narsk survived this fall and emerged in a junkyard. Narsk also managed to reach a spaceport where he found offworld transport on a freighter heading to a neutral planet in the Grumani sector, which was a regular destination for visitors from the Odionate. After two standard days, Narsk found his way back to the Odionate and in the presence of Lord Odion himself. While Odion was enraged at the loss of the information on the Convergence stored in his datapad, the Sith Lord spared the Bothan's life since he had succeeded in fulfilling part of the mission by destroying the Black Fang facility. Narsk had also alerted his master to the Jedi Knight Kerra's presence, which interested Odion since he desired revenge against the Jedi woman for seriously wounding him during the Chelloan incident."}, {"tag": "h3", "text": "In Odion's services"}, {"tag": "h4", "text": "Showdown on Gazzari"}, {"tag": "p", "text": "In return for his services, Odion allowed Narsk to participate in his battle preparations for the assault on Gazzari on the Sith Lord's flagship Sword of Ieldis. While reflecting on his dangerous mission to Darkknell en route to Gazzari, the Bothan spy realized that Daiman had spared his life to arrange for a battle with his estranged older brother Odion. Both Narsk and Daiman had realized that Odion's nihilistic beliefs meant that he savored a battle more than anything else in life. Narsk also realized that Daiman had allowed his escape to occur in order to report news of the deal over Bactra's arxeum back to Odion. Thus, Daiman hoped to lure Odion into a trap on Gazzari by using the unwitting Bothan spy as a means of accomplishing his goal of beating his estranged sibling once and for all. While Narsk suspected it was a trap, Odion was not worried since he knew that traps were a trademark tactic of his younger brother. Due to his nihilistic philosophy, Odion was willing to sacrifice the lives of his men to fulfill his goal of ending all life in the galaxy."}, {"tag": "p", "text": "Upon arriving in the Gazzari system, Odion ordered his Givin navigator, Jelcho, to search for Daiman's forces. Although they saw no trace of Daiman's fleet in the system, they did spot about a dozen of Bactra's ships near Gazzari's sun, where they could observe the events on the planet from a safe distance. Bactra had already arrived on the planet with the arxeum, which landed in the crater along with four transports filled with hundreds of students, impoverished younglings who had been recruited from the Daimanate. Although Odion knew that Bactra had just delivered the arxeum, he ordered his fleet not to fire on the Quermian's forces since he intended to attack his estranged younger brother Daiman, whom he regarded as his main rival. He also intended to track down his perennial Jedi foe: Kerra, whom he regarded as a dangerous threat to his nihilistic ambitions. After sighting Bactra's fleet, Odion contacted the Quermian, and Bactra informed him that the deal with Daiman had taken place, and that the Bactranites were no longer concerned with the fate of the arxeum. Bactra's fleet then remained in the Gazzari system, observing the battle between the Daimanites and the Odionites."}, {"tag": "p", "text": "For this engagement, Odion had deployed a quarter of his own home fleet including elements of his elite Thunder Guards. During the early stages of the battle, Odion's home fleet formed an orbital perimeter around the planet and awaited the arrival of his most important weapon, a massive siege tower called the Death Spiral. Once the Death Spiral exited hyperspace behind Odion's fleet, the Sith Lord ordered his Thunder Guard units to their transports. Narsk was present on the bridge of the Sword of Ieldis where Odion had outlined his battle plan. Prior to the ground assault, Odion ordered both Narsk and Jelcho to accompany on his personal transport. While the two Odionites served the same Sith master, the Bothan Narsk detested the Givin whose entire species he regarded as physically unsightly due to the large numbers of holes in their skulls. Within the Odionate, Lord Odion had a policy of assigning individuals jobs based on their species' skills specifications; with Bothans being utilized as spies, Verpines as engineers, and Givin as navigators. However, unknown to both Narsk and Odion, Daiman's forces had already landed on Gazzari where they had positioned themselves on the ridges of a massive crater on Gazzari where they were hidden under the metallic ash."}, {"tag": "p", "text": "During the subsequent Battle of Gazzari, Odion's forces including the Death Spiral landed inside a crater. In the subseuquent fighting, Odion's forces engaged Daiman and his mercenaries, destroying all four transports and significantly damaging the arxeum. The mercenaries bombarded the Death Spiral with cannon fire, but were unable to destroy the tower, which deployed several speeder bikes, airspeeders, and walkers from its base. Unable to withstand the firepower of the Death Spiral, Daiman's mercenaries were forced to retreat and the Death Spiral inflicted heavy casualties on Daiman's mercenaries. In the midst of the fighting, Narsk's Jedi adversary Kerra resurfaced. The Jedi woman had managed to infiltrate Gazzari by stowing aboard Daiman's flagship Era Daimanos. After fighting several Thunder Guards and stealing their speeder bikes, Holt shepherded the students off the battlefield to the cliffs of the crater."}, {"tag": "h4", "text": "Enter the Matriarch"}, {"tag": "p", "text": "During the initial stage of the battle, Narsk remained aboard Odion's transport under surveillance from the navigator Jelcho. By then, the tide of the battle had began to turn in Daiman's favor. A fleet of Daimanate warships had emerged from hyperspace, trapping Odion's fleet within the Gazzari system. This confirmed Narsk's suspicions that the engagement with Bactra on Gazzari was a ploy to lure Odion into a trap. At that moment, Narsk received a signal from his true master, family matriarch Vilia Calimondra. The Sith Lord wished for her two grandsons Odion and Daiman to end their sibling feud and unite against Bactra, who was still observing the battle from space, and she ordered Narsk to deliver her message to them. However, the Bothan's comlink was not working due to his proximity to the Death Spiral's energy shield. Convincing Jelcho to leave him and join the battle against Daiman, Narsk made his way south of the Death Spiral, where he hoped the reception would be clearer. However, he waited to deliver the message, as both Odion and Daiman were on the battlefield, approaching each other and preparing for a duel. With both Sith Lords engrossed in the battle, the Bothan found it unlikely either of them would receive his message."}, {"tag": "p", "text": "Meanwhile, Jelcho entered the fray on a speeder bike only to be intercepted by the Jedi Kerra Holt, who had been evacuating the students aboard the transports. She used the Force to telekinetically slam the bike to the ground, knocking the Givin unconscious. Kerra then used a bandolier to secure Jelcho to the bike before jamming its accelerator and sending it into the Death Spiral's speeder bays. This created an explosion which destroyed the siege tower. While wading through the battlefield, Narsk witnessed this explosion and survived it by hiding inside a derelict airspeeder. He also discovered Kerra's presence on Gazzari but did not pursue her since he was already preoccupied with Calimondra's new maverick orders. Narsk was baffled by these new orders since they defied the protocols of conventional military doctrine even when measured by the unorthodox standards of Sith warfare."}, {"tag": "p", "text": "With the destruction of the Death Spiral, Narsk was able to deliver Calimondra's message via comlink to Daiman and Odion since it had eliminated the physical barrier that had blocked the signals. These orders were then transmitted to their orbiting fleets which quickly ended their hostilities. They then immediately joined forces and turned on Bactra's fleet with their combined firepower destroying half of his warships within under a minute. The remnants of Bactra's fleet jumped into hyperspace and fled to Jutrand, the capital of the Bactranate. However, the Daimanite and Odionite forces pursued them, and, within a few days, Bactra's empire had fallen to Daiman, Odion, and the Sith Lords Lioko and Malakite."}, {"tag": "p", "text": "Meanwhile, Kerra encountered the mercenary Jarrow Rusher, whose forces had sustained heavy casualties during the fighting, and managed to convince him to evacuate over a thousand student refugees on his modified troopship Diligence. They fled to Byllura, a planet in the Sith state known as the Dyarchy, where they hoped they could find safety for themselves and the refugees, while making much needed repairs to the damaged vessel. However, Holt and Rusher found that the planet's entire population were slaves to the Sith twins Quillan and Dromika, and as a battle broke out, they fled, kidnapping Quillan. Since Quillan was linked to a mental telepathic network which enforced a mental grip on the population, his incapacitation caused the collapse of the Dyarchy into total anarchy. The planet was then captured by Sith Lord Arkadia Calimondra, Vilia Calimondra's granddaughter and the older sister of Quillan and Dromika. Unknown to Kerra, the stolen Marsk IV stealth suit was connected to a secret communications network which enabled Vilia to monitor all her movements."}, {"tag": "p", "text": "Following the fighting on Gazzari, Narsk left the Odionite forces on Gazzari and fled to an oasis resort outpost near the planet Jutrand to observe the collapse of the Bactranate and to received quality medical treatment for his earlier injuries. He then contacted Vilia via hologram to give a report of the recent developments in Gazzari and the collapse of the Bactranate. Pleased with Narsk's work, Vilia arranged for a bequest to divide Bactra's former holdings and corporate assets up among her grandchildren. Vilia also ordered the Bothan to keep an eye on the Jedi Kerra Holt's whereabouts; adding that she knew the location of the Jedi woman. Finally, Vilia ordered Narsk to prepare for travel since she knew someone who needed the services of a specialist. This someone turned out to be Sith Lord Arkadia Calimondra, her granddaughter and the ruler of the Sith state known as the Arkadianate."}, {"tag": "h3", "text": "In the Arkadianate"}, {"tag": "h4", "text": "Undercover in the Dyarchy"}, {"tag": "p", "text": "After his brief holiday, Narsk made contact with Arkadia who dispatched a special stealth starfighter to transport him to the Arkadianate, where she was making preparations to invade the Dyarchy. The Dyarchy was a small Sith princedom on the planet Byllura that was ruled by the adolescent Sith twins Quillan and Dromika, the two youngest children of the late Lord Chagras. Prior to his death in 1042 BBY, he had brought them to Byllura to be looked after by his Regent Saaj Calician, an ambitious Krevaaki Sith adept. Calician ruled on behalf of the twins while exploiting their Force powers for his own ambitions. The Dyarchy's Sith rulers resided at the Loft, a large hilltop palace opposite the capital city Hestobyll."}, {"tag": "p", "text": "The twins possessed a powerful Force connection which allowed them to control others through Force persuasion. By 1032 BBY, the twins under the influence of their regent had created a planet-wide mental telepathic system which imposed a Force-induced state of mental thralldom on Byllura's population; turning them into mindless slaves. To support his vision of the galaxy operating as a highly-centralized organism under one Sith Lord, Calician had constructed a fleet of battleships known as the Dyarchy Fleet. Calician intended to launch an invasion of the rearward systems of the Daimanate, as the first step in a large invasion campaign."}, {"tag": "p", "text": "Prior to the invasion, Narsk infiltrated Byllura in a specially modified stealth starfighter and attached a transmitter device onto the Loft's video surveillance system. This allowed Arkadia and her military commanders to spy on the Dyarchy's rulers who resided in a penthouse at the top of the Loft, a massive seaside palace on top of a rock overlooking Hestobyll's harbor. Narsk then retreated to a cave in higher ground which he would use to observe developments on Byllura. Since Kerra had acquired Narsk's stolen stealth suit on Darkknell, Vilia was able to use its electronic systems to spy on the Jedi woman and learnt that the Diligence was heading to Byllura. She subsequently informed her granddaughter Arkadia about the Jedi woman's presence."}, {"tag": "p", "text": "From his safe position in the mountains above Hestobyll, Narsk Ka'hane was able to monitor developments after the arrival of the Diligence. He also intercepted communications signals from the Diligence and subsequently confirmed that Kerra was indeed present on Byllura. Narsk also observed Kerra's wild pursuit through the streets of Hestobyll which ended at the Loft. After ascertaining that Kerra was within the Dyarchy's sanctum, the Bothan spy contacted his employer Arkadia and told her to be ready to strike Byllura. Narsk also observed the movements of the Dyarchy Fleet into Byllura's upper atmosphere. At one point, Narsk contacted Kerra via comlink and demanded that the Jedi return his stolen stealth suit. Having confirmed Kerra's presence, Narsk left Byllura on his stealth fighter and headed to space where he was picked up by Arkadia's flagship New Crucible."}, {"tag": "p", "text": "When Rusher's modified troopship Diligence arrived in Byllura, Calician mistakenly thought that it was the right time to strike against Daiman, because the Daimanite would not have permitted a ship to leave their domain if they had had sufficient military forces in the vicinity of their border. He ordered his red-clad Unifiers to capture the intruders but Kerra and Rusher fought back and fiercely resisted \"integration.\" Their actions set the stage for the Battle of Byllura which culminated in the capture of Quillan and fatally undermined the Dyarchy, creating a power vacuum which aided Arkadia's invasion plans. Using Narsk's intelligence, Arkadia's fleet entered the Bylluran system and quickly immobilized the Dyarchy's battleships. The Arkadianate did not destroy the enemy's battleships since they had wanted to salvage their parts. Arkadia also extended an apparent hand of friendship towards Kerra and Rusher by promising to give shelter to the Diligence in her domain."}, {"tag": "p", "text": "Following the invasion, Narsk visited Hestobyll which had been occupied by Arkadianate forces. The Arkadianate advance guard installed itself in The Loft, the former Dyarchy's seat of power. Having being freed from the mental thralldom of the Dyarchy's twin rulers, the Bylluran population did not resist the Arkadianate occupiers. Narsk accepted Arkadianate propaganda that the \"newly=liberated\" Byllurans would become \"contributing members\" of the Arkadianate. Narsk also witnessed Arkadianate forces liberating the Dyarchy's enslave Celegians, whose telepathic abilities had been employed by the Dyarchy to create the organic network that enthralled Byllura's population. During his visit, he also learnt that the former regent Calician had been executed and had met his end quietly."}, {"tag": "h4", "text": "The Ice Queen's Lair"}, {"tag": "p", "text": "Shortly after the execution, Narsk received a transmission from Arkadia and rejoined the Sith Lord at her capital Calimondretta, a city on the icy planet of Syned, making a brief report of the ongoing occupation of Byllura . There, he had a reunion with his nominal Jedi adversary Kerra, while meeting Rusher's Brigade mercenary leader Jarrow Rusher for the first time. He demanded that Kerra return his prized Mark VI stealth suit. Kerra had already given the suit to her teenaged Sullustan friend Tan Tengo. Kerra agreed to return the suit but mentioned that it was located in Tan's room aboard the Diligence. To complicate matters, Tien had gone on an official tour of Calimondretta, the icy capital city of the Arkadianate. By portraying her regime as an \"enlightened\" one in comparison to its Sith neighbors, Arkadia attempted to win over the hearts and minds of Rusher and Kerra. She also offered to provide a safe refuge for Rusher to drop his student refugees."}, {"tag": "p", "text": "Arkadia's warm approach towards her guests concealed an ulterior motive. She intended to recruit the services of Kerra as an assassin with her intended target being Vilia Calimondra, her grandmother and the family matriarch. Arkadia blamed her grandmother for the suspicious death of her father Chagras and for willfully abetting the internecine family feud between her grandchildren. Arkadia's propaganda efforts succeeded in temporarily winning over the Brigadier Rusher, who wanted to accept Arkadia's offer to host the student refugees. In contrast, Kerra distrusted the Sith Lord since the two Force-using orders had been bitter opponents for millennia. The Jedi woman also rightfully suspected that Arkadia wanted to exploit them in some way."}, {"tag": "p", "text": "Her suspicions were confirmed when Arkadia summoned her to the family bequest at her private museum, where she explained the complex family dynamics of the Calimondra family. During the meeting, Vilia distributed the corporate assets of the defeated Bactranate among her grandchildren and formally recognized Arkadia's annexation of the Dyarchy. Arkadia also confirmed that she had the twins Quillan and Dromika in her custody though they were kept separate from each other. At the end of the conference, Vilia agreed to look after Quillan's welfare and arranged for the hyperspace coordinates to her planet to be sent across a secure channel. Finally, Arkadia attempted to recruit Kerra as an assassin but the Jedi unequivocally rejected her job offer, asserting that she did not work for the Sith. In response, Arkadia had Kerra arrested and sent to the Impound where she would be interrogated and then executed."}, {"tag": "h4", "text": "Vilia's Counter-plot"}, {"tag": "p", "text": "While the Bequest was taking place, Narsk and Rusher waited outside the museum. An hour prior to the meeting, Narsk had received information about the Bequest from Vilia via his implant. The seven long pulses signified that today would be a special day. Since the Bothan had not been invited to participate in the proceedings, he could only ponder on why his current employer had invited a Jedi into a top-secret function. While the meeting was taking place, Narsk harried Rusher and attempted to convince him to return his stealth suit. However, Rusher was uncooperative and tried to put off returning the suit until Arkadia's meeting with Kerra had concluded. Narsk suggested communicating with the Diligence by comlink but Rusher refused, commenting that he did not want to annoy the Sith Lord by requesting side trips. He added that this errand could wait since the refugees were going to be transported to Calimondretta in the evening by an icecrawler. Rusher offered to send the stealth suit back to Narsk with Tengo but Narsk argued that it would be too late."}, {"tag": "p", "text": "Following the Bequest, Arkadia emerged from the museum with Kerra as a captive. She then demanded that Rusher bring the student refugees to Calimondretta immediately. She ordered the Brigadier to report to the main atrium where he would be picked up by the icecrawler. She reiterated her promise that Rusher and his mercenaries could depart into hyperspace, giving him a set of coordinates that purportedly led out of the Arkadianate. However, Arkadia secretly intended to kill the mercenaries by sending them on a one-way trip to the Nakrikal Singularity, a black hole. With Kerra unwilling to carry out Arkadia's errand, the Sith Lord instead recruited the Bothan, asking him if he was ready for more fieldwork. Narsk accepted Arkadia's offer and then followed Quillan who was being pushed in a hoverchair by the Human aide known as Enbo. When Rusher inquired about Kerra, Arkadia said that she planned to kill the Jedi before she could go on a rampage through the Arkadianate. In return for employing his services, Narsk got Arkadia to order Rusher to return his stolen stealth suit. Rusher had no choice but to comply with Arkadia's command."}, {"tag": "p", "text": "Through unknown means, Vilia discovered her granddaughter's plot and sent a transmission to Narsk's implant, ordering the Bothan spy to turn against his \"current\" employer Arkadia by launching her own \"counter-plot\". Cognizant of his new orders, Narsk approached Brigadier Rusher, who was uncomfortable with abandoning Kerra to the tender mercies of the Sith Lord. However, the Brigadier was unwilling to balance the lives of a thousand student refugees with that of one person. Still, Rusher tried to assure himself by dismissing his anxieties as not being part of his job. Narsk convinced the Brigadier that following Arkadia's orders would pose a danger to his crew by citing the developments that occurred during the Bequest. The Bothan added that they could use explosives to damage the tractor beam emitters at Calimondretta, allowing the Diligence to escape the Arkadianate. For this escape attempt to succeed however, it would require the full support of Rusher and his mercenaries."}, {"tag": "p", "text": "Rusher agreed to cooperate with the Bothan spy's plans and arranged for one his mercenaries Beadle Lubboon to transport Narsk's stealth suit and Kerra's lightsaber to Calimondretta. For his plan to succeed, Narsk also needed the support of Kerra to provide a second diversion for Arkadia's forces. Narsk modified the settings on Rusher's comlinks, allowing him to relay the instructions to Lubboon while evading detection from Arkadia's sensors. In return for Rusher's cooperation, Narsk paid him by giving him half of the coordinates that led to a safe hyperspace lane which ended at a jump-point in neutral space leading to the Galactic Republic. Narsk also presumably explained to Rusher that the earlier coordinates which Arkadia had presented earlier was actually a one-way death trip ending in a black hole. Finally, he promised to give the second half of the coordinates to Kerra on the condition that she helped create a distraction that would allow both parties to escape the Arkadinate."}, {"tag": "p", "text": "Unaware of Vilia's secret counter-plot, Arkadia had a modified shuttle at Embarkation Station 7 prepared for a single hyperspace jump to her grandmother's top secret destination. She explained to Narsk that his primary mission was to assassinate Vilia. Since the Bothan lacked the Force abilities and lightsaber combat skills of a Force-wielder, Narsk's weapon would consist of a remote-controlled nerve toxin pods. These nerve toxins had been harvested from Synedian alga, a flora indigenous to the planet Syned. Upon arriving on Vilia's world, he would slip out of the vessel unseen, shadowing Quillan. Once he located both Quillan and Vilia, he would activate the nerve toxins hidden in the chair; killing both targets and plunging her empire into anarchy. Arkadia hoped to benefit from this chaos by annexing other territories, thus furthering her larger ambitions of galactic dominance. In the event that the shuttle was captured by a third party, Narsk would claim that he was working for the Odionate in order to avoid attracting attention to Arkadia."}, {"tag": "p", "text": "For the mission, Narsk would be hidden within a secret compartment within one of the starship's engines. During the middle of the meeting, the Duros mercenary Beadle Lubboon arrived in an environment suit, carrying Narsk's stealth suit within his pouch. Rusher had sent Lubboon to deliver both the stealth suit and Kerra's lightsaber, knowing that the cumbersome Duros would not attract Arkadia's suspicion. The Duros mercenary had managed to smuggle the lightsaber past Arkadianate security by hiding it within the left arm of his spacesuit. Lubboon claimed that his left arm had been injured during a fall and was given permission by Arkadia to leave for the infirmary for medical treatment. Arkadia's experiences with Lubboon's clumsy antics gave her a poor impression of Rusher's mercenaries, leading her to reject their services earlier. She revealed the Narsk that she had planned to kill them by leading them into a rogue hyperspace lane to prevent any information about the Arkadianate from leaking to her enemies."}, {"tag": "p", "text": "After acquiring his stealth suit back and concluding his meeting with Arkadia, Beadle left for the infirmary as well by feigning an allergic reaction to the algae. There, Narsk obtained Kerra's lightsaber from Lubboon and infiltrated the Impound using his stealth suit. After destroying several Interrogator droids, the Bothan freed Kerra from her prison. He explained that he wanted to help the young Jedi woman because he was working for someone opposed to Arkadia's plan and that he also needed someone to create a diversion. Since the planned assassination of Vilia would destabilize the Grumani sector's political order, she had assembled several military parties for strategic attacks on the Arkadianate's neighbors. As part of her expansionist campaign, Arkadia also planned to deploy the nerve toxin known as Chagras's Blood as a bioweapon. She had intended to use the inmates at the Impound including Kerra as test subjects."}, {"tag": "p", "text": "After confirming that Rusher was collaborating in their escape attempt from the Arkadianate, he gave Kerra the second half of the hyperspace coordinates leading to the safe jump point. When Kerra asked who he actually was and how he had obtained such information, Narsk reitereated that while he was working for the Sith Lord Vilia, he himself was never a Sith. Kerra and Narsk were unable to free most of the other prisoners at the Impound since they had already been exposed to Chagras's Blood and succumbed to the effects of the bioweapon within minutes. When Kerra asked why Narsk had spared her life despite their earlier animosity, Narsk replied that he did so because he had no orders to kill her before departing on a turbolift."}, {"tag": "h4", "text": "The Great Escape"}, {"tag": "p", "text": "After freeing Kerra, Narsk returned back to Embarkation Station 7. While he was unaware about the full extent of Arkadia's plans for Vilia, the Bothan spy knew he would need a diversion for Vilia's counter-plot to succeed. Narsk also recalled that Arkadia had attached a timer to the gas canister assembly under the hover chair destined to be used during the assassination attempt. Narsk quickly realized that Arkadia had planted a fail-safe so that the nerve toxin would still be released even if Narsk failed or abandoned his assignment. When Arkadia asked Narsk what had kept him away so long, the Bothan claimed that he had to run his stealth suit through some diagnostics on the pretext that the Jedi woman had not taken care of it properly. Arkadia used the Force to levitate the catatonic Quillan onto his new velvet hover chair, which contained the nerve toxin gas canister. She then bid farewell to her younger brother, telling him that he never had a chance in life but that he would instead avenge their father through his death."}, {"tag": "p", "text": "Since Quillan dwelled entirely in his mind, he was not cognizant of any of the developments occurring around him. Prior to sending Narsk away on his mission, Arkadia instructed the Bothan to contact her via the encrypted channel programmed into his datapad after his mission had succeeded. At that moment the emergency sirens in the hangar activated. Arkadia and Narsk quickly learnt that Kerra had escaped the Impound. Arkadia was furious and commented that somebody had helped the Jedi woman to escape from her intended \"morgue\". With the shuttle ready for departure, Arkadia departed to attend to this situation but ordered one of the Wookiee Citizen Guards present to ensure that the Bothan closed his hidden chamber securely so that he would not die from asphyxiation in space. By then, the shuttle had been prepared for its hyperspace trip. In an attempt to sabotage Arkadia's plans, Narsk tried to appear surprised that they were departing so early. Arkadia replied that his mission was of such importance that she would not tolerate any delays. Narsk complied by entering the hidden hatch in the shuttle's engine but anxiously pondered about when Rusher and Kerra would provide their promised diversionary attacks."}, {"tag": "p", "text": "Meanwhile, Rusher and his crew kept to their side of the bargain with Narsk and hijacked the icecrawler \"Crawler One\", using it to transport two artillery cannons. They deployed the icecrawler as a trojan horse and used it to infiltrate Calimondretta. Once inside the fortress city, Rusher and his mercenaries launched their diversionary attack, causing significant interior damage to Patriot Hall. Arkadia's Citizen Guards also caught up with the Jedi escapee Kerra but were no match for the lightsaber-wielding Force-user. In response, an enraged Arkadia ordered her troops to deploy thermal detonators into the public square Reflection Prospect in a desperate attempt to kill the Jedi woman. However, Kerra survived the assault but many civilians and guards were killed or wounded during the conflagration. Further damage to Arkadia's assets were caused when the Diligence detached both its massive cargo assembly pods into Syned's two tractor beam emitters and Arkadia's military fleet, which had been assembled for a blitzkrieg against Arkadia's neighbors in the event that Vilia was assassinated."}, {"tag": "p", "text": "While Arkadia was preoccupied with the intruders on two separate fronts, Narsk sprung his plan into action. Meanwhile, the Bothan Narsk overpowered the Wookiee Citizen Guard by using his stealth suit to distract her, before knocking her unconscious. Quillan remained on the new burgundy hoverchair and was surrounded by three technicians. With the technicians distracted by the damaged caused to the chamber by the conflagration, Narsk took advantage of that opportunity to switch Quillan back into his original hoverchair, leaving the dangerous burgundy one behind in the hangar bay. While the technicians were distracted by Rusher's ultimatum being channeled across the intercom, Narsk got one a Human mechanic to help him push Quillan and the hoverchair into the shuttle's passenger compartment. Narsk claimed that there were saboteurs approaching the hangar bay and that they needed to complete the mission urgently."}, {"tag": "p", "text": "After attending to Quillan, Narsk entered his hidden engine compartment and activated the vessel's droid pilot by donning his gas mask. By then the ground crew had realized their mistake and attempted to stop the shuttle from leaving by contacting the droid pilot and raising a magnetic field. In response, Narsk quickly activated the nerve toxin assembly system. The burgundy hoverchair below immediately unleashed its deadly nerve toxin, killing the ground crew and covering Narsk's escape. The Bothan's jubilation was short-lived since his ears were permanently damaged by the thunderous roar of the accelerating engines. However, he had succeeded in sabotaging Arkadia's conspiracy to assassinate her grandmother and thus plunge the Calimondra dynasty into a crisis from which she could benefit."}, {"tag": "p", "text": "Meanwhile, Kerra engaged in a lightsaber duel with Arkadia at her museum. Before Arkadia could inflict a death blow on the Jedi Knight however, Rusher ordered his gunners to fire a precision shot at the museum, which opened a hole in its roof and allowed Kerra to escape to the surface. The Brigadier had known that his erstwhile ally was still in Calimondretta and found out that she was at Arkadia's museum due to a tag planted on the latter's lightsaber. On Syned's frigid surface, Kerra was rescued by Rusher who personally brought her back aboard the Diligence's medical bay. After evacuating five hundred defecting Arkadianate citizens who were unhappy with life under Arkadia, the Diligence escaped into hyperspace. Meanwhile, Arkadia survived the artillery attack but much of her capital and military assets were damaged or destroyed. The Mark VI stealth suit was also damaged by the engines' sonic bombardment which burnt out the receptors and electrical systems, permanently spoiling the suit beyond repair. Narsk also lost his hearing as a result."}, {"tag": "h3", "text": "In the Lap of Luxury"}, {"tag": "p", "text": "After seven hours of traveling through hyperspace, Narsk reached Vilia's secret retreat planet, which boasted large beautiful gardens. There, Vilia took Quillan into her custody. Meanwhile, Narsk received medical treatment and had prosthetic implants inserted into his ears. Narsk thought that his new implants would make him a better spy. Following his recovery, Narsk had a personal audience with Vilia Calimondra herself while she was tending to one of her private garden. Meanwhile, Quillan sat on a sedan chair under a portable shade, still immersed within his expansive mindscape. According to Vilia, her youngest grandson had the ability to see even distant objects like unknown galaxies. Narsk then realized that Quillan had been the center of the events that had occurred since Gazzari. While Narsk had been on the battlefield to ensure that Odion and Daiman complied with her orders to turn on Bactra, Vilia had grown concerned about Arkadia's ambitions, which her seers had sensed through the Force."}, {"tag": "p", "text": "Narsk also reported that two of Vilia's other agents had spirited Dromika away from Byllura. While both twins were now in Vilia's custody, she had made arrangements to keep them apart from each other and any opportunists who would want to exploit their powers. After contacting Arkadia, Narsk learned from her that his spur of the moment plan had succeeded. By claiming that he had been in the hidden compartment throughout the entire duration of the fighting, Narsk was able to escape her suspicions. Narsk also alleged that he arrived on Vilia's planet with the wrong hover chair. Arkadia concluded that her aides had loaded the wrong chair aboard the shuttle and were killed when it was accidentally released during the fighting. Enraged by the failure of her plans, Arkadia curtly cut her transmission. Due to the Siege of Calimondretta, Arkadia was preoccupied with rebuilding her war-damaged capital. With the loss of substantial military assets, Arkadia was also forced to recall forces from Byllura and to abandon her expansionist ambitions."}, {"tag": "p", "text": "When Narsk asked Vilia if she had any role in the death of Chagras, the Sith matriarch tried to deny her involvement in the death of Arkadia's father Chagras by presenting an alternative theory that Arkadia had the motive and means for murdering her father. Vilia portrayed Arkadia as ambitious younger daughter who feared that her father's legacy would go to younger, and more favored siblings. She also cited Arkadia's expertise in nerve toxins, the weapon that had brought the death of Chagras, as circumstantial evidence. Vilia then surmised that anyone could construct a case against Arkadia in the same way manner that they could build one against her. For the Calimondra family, shared illusions mattered as much as bloodlines in explaining the complex and fraught relationship between its various members. Narsk also expressed his concerns that he had freed the Jedi Knight Kerra Holt and speculated that she would not leave Sith Space and thus pose a continual threat to the Sith."}, {"tag": "p", "text": "He feared that the Galactic Republic and Jedi Order could exploit Kerra's knowledge of the Calimondra family and the Charge Matrica in their war effort against the Grumani Sith. However, Vilia dismissed his concerns by arguing that the lack of a mass media in Sith Space inhibited the flow of this information to the general population. She added that the Republic's authorities were ineffective against the Sith even when they had good intelligence about their Sith opponents. Vilia finally surmised that Kerra remained the sole Jedi throughout the entire Grumani sector. When Narsk reiterated that Kerra could still pose a danger to her dynasty, Vilia described Kerra as an opportunity to give her grandchildren some \"learning experience\" with dealing with the Jedi in preparation for the day that the Sith would invade Republic territory and face the Jedi Order again. Vilia also justified her policy of sowing discord within her family as a defining basis of Sith identity. Finally, she remarked that Narsk could send her greetings to Arkadia if the opportunity arose that the two crossed paths again."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Narsk Ka'hane was an opportunistic individual who was more concerned with personal profit than ideological leanings. While Narsk acknowledged that he did work for various Sith employers, he steadfastly believed that he himself was not a Sith. However, this meant that he became tarred by association in the eyes of some enemies of the Sith like the Jedi Knight Kerra Holt. Ka'hane was also a rational and perceptive individual who was able to analyze situations. He rightfully saw that the Battle of Gazzari was a trap that had been orchestrated by Lord Daiman to ensnare his estranged older brother Odion. Despite his rational objections, his employer Odion was too irrational and nihilistic to consider the Bothan spy's arguments."}, {"tag": "p", "text": "Throughout his career, Narsk had no permanent friends or enemies. Instead, his interaction with other characters depended on whether they shared the same interests and goals. Initially, Kerra was an enemy of Ka'hane since her crusade to sabotage the Sith war effort clashed with his work to obtain classified military information for Lord Odion. However, Kerra later became an ally after they encountered a common enemy in the form of the Sith Lord Arkadia Calimondra. Arkadia's plot to overthrow the Calimondra family matriarch Vilia was opposed by both Narsk and Kerra for different reasons. Narsk helped break Kerra out of her prison in exchange for the Jedi helping to keep Arkadia's forces at bay so that he could escape back to Vilia with her grandson Quillan. While the two were still officially enemies, Narsk did not kill Kerra because Vilia had not ordered him to do so."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a spy, Narsk Ka'hane was skilled at the art of infiltration. While gathering intelligence on the Daimanate's Convergence Tactical Assault Vehicle, Narsk infiltrated Darkknell disguised as a machine operator from Nilash. For his intelligence operations, Narsk often donned an advanced Cyricept Mark VI stealth suit which allowed him to travel virtually undetected. Narsk also carried with him a needler pistol, which was ideal for spy missions as it did not make the loud noise of a blaster. Narsk was able to switch the setting on his needler to fire acid-filled darts or pulse-wave darts. Narsk used this weapon during his initial encounter with Kerra Holt without success. Narsk was also competent at close quarters combat and he used these skills to incapacitate a female Wookiee Citizen Guard during his escape from the Arkadianate. Narsk lost his hearing after exposure to Arkadia's ship's sonic engines; he accquired audal implants after returning Quillan to his grandmother, Vilia Calimondra, and thought they would make him a more effective spy. For all his skills and training as a spy, Narsk was still no match for Force-sensitive individuals like the Jedi Knight Kerra Holt or the Sith warlord Daiman."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Narsk Ka'hane first appeared as a supporting viewpoint character in John Jackson Miller's novel Knight Errant, which was first released on January 25, 2011. While this was Miller's first published novel, he also developed the script for the Star Wars: Knight Errant comic series, which is closely tied to the novel. Narsk later made a cameo appearance in Knight Errant: Aflame 5, the fifth issue of the Aflame story arc which was first released on February 16, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}