{"url": "Narston", "categories": ["Category:Canon articles", "Category:204th Imperial Fighter Wing members", "Category:Engineers", "Category:Females", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Narston"}, {"tag": "p", "text": "Narston was a female engineer who operated for Colonel Shakara Nuress of the Galactic Empire's 204th Imperial Fighter Wing at the planet Pandem Nai, working with the orbital tibanna mining crews. Around a month after the Battle of Endor 4 ABY, Narston gave a progress report to Nuress. When the colonel asked of any disloyalty from the civilian extractor crews, which the engineer denied, Nuress ordered that a third of the military be moved to combat readiness."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around a month after the Battle of Endor in 4 ABY, Narston served as an engineer aboard Orbital One, a tibanna gas mining station located in the orbit of the planet Pandem Nai. She had the duty of communicating with orbital gas mining crews for Colonel Shakara Nuress, whose forces, the 204th Imperial Fighter Wing, had occupied Pandem Nai to use as a base of operations."}, {"tag": "p", "text": "One day, Narston approached Nuress with a set of progress reports for the gas product production. As the engineer listed updates, Nuress interrupted her to make sure that all of the report was on the datapad she carried. The colonel then took the datapad and waved Narston off. Moments later, Nuress called the engineer back, asking of the morale of the civilian extractor crews. Narston, confirmed that there was no signs of disloyalty, and so the colonel, finishing her read of Narston's datapad, ordered that a third of the military personnel be taken off supervisory duty and onto combat readiness as a temporary measure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A female individual, Narston swiftly responded when Nuress called her name."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Narston first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}