{"url": "Nashal", "categories": ["Category:Legends articles", "Category:Cities on Talus"], "nodes": [{"tag": "h1", "text": "Nashal"}, {"tag": "p", "text": "Nashal was one of three major cities on Corellia's Twin World of Talus."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nashal was an incredibly diverse city located along the banks of the Mephyt River, in the northeastern reaches of Talus. Originally founded by Selonian architects, the settlement served in its early days as a neutral ground for meetings between Talus' three native species. As the Drall, Selonian, and Humans learned to cooperate and communicate more effectively, Nashal became a focal point for cultural exchange. After the construction of Nashal's starport, the city's reputation as a diplomatic safe haven grew stronger. The Republic often held peace summits between rival systems in Nashal, and the influx of visitors from around the galaxy only increased the city's diversity. Nashal's emphasis on high culture was not all-inclusive. The city did have its share of slums, industrial areas, and military zones."}, {"tag": "p", "text": "After the Empire abolished the Imperial Senate, Nashal's prominence faded. However, the inhabitants retained a great appreciation for high culture and still believed strongly in peace between all sentient species. In the years to come, Nashal's focus shifted from diplomacy to food and drink. In fact, Nashal was known for producing some of the most successful chefs in the Corellian system."}, {"tag": "p", "text": "Nashal was the starting point of the Nashal River Race."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Nashal had a small Imperial presence, like other Corellian cities. Circa 1 ABY, the Rebel Alliance managed to conquer the city. Large numbers of Rebel troops then moved in to hold the city."}, {"tag": "p", "text": "Around the same time, several Selonians of the Neetha Den on Talus were captured by pirates and kept as hostages in order to exploit the rest of the den. The situation generated anti-human sentiments among the Selonian population of Talus and hostile anti-human demonstrations erupted in Nashal. Despite no act of violence against Humans was reported, the local police force and Cluster World Relations temporally issued a travel warning for Nashal."}, {"tag": "h2", "text": "Residents"}, {"tag": "p", "text": "The following individuals were residents or visitors of the city in the time after the Battle of Yavin: Igbi Freemo, Oecax, Durgur Pyne, Green Laser, Jusani Zhord, Sigrix Slix, Slooni Jong, Officer Pex, CorSec Agent Taarna, and Amyva Va'new."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nashal appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. In the game, Nashal is one of only two permanent, non-player built cities on Talus. However, there is a third game-owned settlement which exists in the form of an Imperial Outpost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}