{"url": "Nasi_Moreno", "categories": ["Category:Canon articles", "Category:Females", "Category:Individuals of unspecified species", "Category:Riot Squadron personnel"], "nodes": [{"tag": "h1", "text": "Nasi Moreno"}, {"tag": "p", "text": "Nasi Moreno was a female pilot in Riot Squadron, flying an A-wing for the Rebel Alliance and eventually the New Republic. Moreno fought the Galactic Empire at the Battle of Endor, and assisted her squadron in its mission to accompany the frigate Hellion's Dare for reconnaissance. The Imperial pilots of the 204th Imperial Fighter Wing attacked the Hellion's Dare over the planet Jiruus, intending to obliterate the trace of a report sent to the frigate by one of its scouts. When the Hellion's Dare and its squadrons attempted to escape into hyperspace, Moreno's fighter was surrounded by TIEs, and she was killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebel service"}, {"tag": "h4", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, Nasi Moreno served the Rebel Alliance as a pilot in Riot Squadron, flying an RZ-1 A-wing interceptor as Riot Eight under Riot Leader Rununja. The squadron fought in the Battle of Endor in 4 ABY, where the Galactic Empire saw defeat, and the Rebel Alliance eventually transformed into the New Republic."}, {"tag": "p", "text": "Moreno and Riot Squadron continued to serve the new government aboard the EF76 Nebulon-B escort frigate Hellion's Dare. The frigate's mission was primarily reconnaissance, investigating communications breakdowns in case of Imperial holdouts taking control of star systems. The squadron saw various battles against scattered Imperial forces, though most of the systems they investigated had simply lost communications due to a loss of their hyperwave relays."}, {"tag": "h4", "text": "Under attack"}, {"tag": "p", "text": "While the Hellion's Dare was stationed above the planet Jiruus, waiting for scout reports to return, the pilots of both Riot and Hound Squadrons celebrated on the planet's surface. During their celebrations, Moreno stayed near her fellow pilots, including Wyl Lark and Sata Neek. When Hound Squadron pilot Chass na Chadic heckled Lark, claiming he was a coward for wishing to return to his homeworld, Moreno shouted back at her."}, {"tag": "p", "text": "During the night, the pilots were awoken to the Hellion's Dare falling under attack from the TIE fighters of the Empire's 204th Imperial Fighter Wing, who had traced one of the scout's transmissions and wished to eliminate the recipient. Riot Squadron launched to defend the frigate, and Moreno attempted to devise a plan to attack the enemy fighters. However, the TIE pilots had expected such a plan, avoiding Riot Squadron's attacks."}, {"tag": "p", "text": "The Hellion's Dare and its starfighter complement prepared to jump to hyperspace. Moments before the jump could be made, TIE fighters converged on Moreno's position, surrounding her and cutting off her escape. The Hellion's Dare and its squadrons jumped to hyperspace, and Moreno was left behind in the Jiruus system, killed by the Imperial pilots of the 204th."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "When the squadrons exited hyperspace, followed by the Hellion's Dare, the pilots of Riot Squadron checked in, discovering that Moreno had not managed to follow them. Neek recalled witnessing the TIEs move in on Moreno before they jumped to hyperspace, and the other pilots declared Moreno as having been killed in action. Aboard the Hellion's Dare, a number of pilots and crew held a funeral to mourn Moreno, during which Chadic insisted that the pilot could have survived."}, {"tag": "p", "text": "Moreno would not be the only loss of Riot Squadron, however; the pilots of the 204th Imperial Fighter Wing pursued the Hellion's Dare into the nearby Oridol Cluster, and continued to single out a sole pilot before the frigate could jump to hyperspace, salvaging the jump coordinates from the fighters' wreckage. The New Republic pilots eventually worked out the 204th's strategy, but had no way to counter it. When resting between skirmishes aboard the Hellion's Dare, the surviving pilots continued to remember Moreno and the other casualties. Eventually, the Hellion's Dare itself was lost, with Wyl Lark and Chass na Chadic being the only survivors."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "While defending the Hellion's Dare over Jiruus, Moreno spoke tersely, describing a plan in practiced shorthand. However, she was quick to become angry when the 204th's pilots proved to be effective, cursing at the situation they were in. Moreno shouted at Chass na Chadic when the pilot heckled her squadron mate Wyl Lark. According to Rununja, the commander of Riot Squadron, Moreno understood the anguish of uncertainty, and would have wanted her fellow pilots to declare that she had been killed in action rather than worry over the possibilities of what had happened to her."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Nasi Moreno piloted an RZ-1 A-wing interceptor during her service to Riot Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nasi Moreno first appeared in Alphabet Squadron, a novel written by Alexander Freed and published in 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}