{"url": "Natala_Vanden", "categories": ["Category:Legends articles", "Category:Females", "Category:Planetary leaders", "Category:Vorzydiaks"], "nodes": [{"tag": "h1", "text": "Natala Vanden"}, {"tag": "p", "text": "Natala Vanden was a female Vorzydiak who served as President of the \"Gambler's World\" of Vorzyd V in 1 ABY. With her planet buckling under heavy gambling taxes levied by the Empire, Vanden began secret dealings with the Rebel Alliance, becoming their high-level contact within the planet's government. Vanden went so far as to clandestinely meet with Rebel leader Luke Skywalker, although it was interrupted by a sudden stormtrooper attack."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Vorzydiak, Natala Vanden was the President of her homeworld of Vorzyd V during the era of the Galactic Civil War. Under the rule of Emperor Palpatine, Vorzyd V had become a crucial world to the Galactic Empire, as the Empire heavily taxed the planet's gambling revenues and used them to finance its operations. By 1 ABY, this had driven Vanden to consider defecting to the Rebel Alliance, and she set up a secret line of communication with the leader of the Rebel cell in the capital city of Efavan, a Squalris businessman named Sanglui who had vowed to protect her identity with his life. Eventually, the opportunity to disrupt the Empire's operations attracted prominent Rebel leaders Luke Skywalker and Leia Organa to the \"Gambler's World,\" and Vanden requested a clandestine meeting with one of the visitors."}, {"tag": "p", "text": "Skywalker was chosen to meet with Vanden, although her identity was still kept secret, and the only information given to the young man was a series of very detailed instructions about how to reach the meeting place. This was for a reason: Skywalker was being followed by stormtroopers working directly for the shadowy Director of Imperial Intelligence known only as Blackhole, and the route Vanden told Skywalker to take contained numerous roadblocks, agents and tricks meant to ensure Skywalker lost his tail. Skywalker finally came out of a grav tube to come face to face with the contact, Vanden, whom he immediately recognized as the planet's President. Without much time to talk, Vanden quickly outlined her plan to redirect the money coming out of Vorzyd V's casinos away from the Empire and back to the planet's people, which would involve another secret meeting deep beneath Efavan where Vanden would directly hand Skywalker millions of credits."}, {"tag": "p", "text": "However, Vanden and Skywalker's meeting was cut off there, as the room in which they were speaking was suddenly attacked by stormtroopers who had figured out their location. While her bodyguards moved to protect the President, Vanden immediately responded by triggering a robotic arm that pushed Skywalker down another grav tube to his escape."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As President of Vorzyd V, Vanden chafed under Imperial rule, despising the tyranny of the Emperor and looking to ensure that the planet's gambling profits would be used to benefit the people. Vanden respected and admired Luke Skywalker, having been previously familiar with his deeds fighting for the Rebels, and felt honored to meet him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Natala Vanden first appeared in Gambler's World, a comic strip story arc written and illustrated by Russ Manning and released in 1979, although she originally went unnamed. Over 30 years later, her name was finally given in the third part of The Imperial Warlords: Despoilers of an Empire, a series of StarWars.com blog posts written by Abel G. Peña and Daniel Wallace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}