{"url": "Nathanjo_Nirrelz", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Diplomats", "Category:Gotals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nathanjo Nirrelz"}, {"tag": "p", "text": "Nathanjo Nirrelz was a male Gotal who worked for the government of Antar 4. In 22 BBY, he was sent as an emissary to the neighboring planet of Atzerri to secure bacta for his homeworld. However, Nirrelz was kidnapped and held hostage in a commuter hopper by the Roshu Sune, a militant terrorist group that intended to use him as leverage in a bid to convince Antar 4 to secede from the Galactic Republic. The Republic sent a Jedi task force to Atzerri in response, which negotiated with the Roshu Sune for a week before the terrorists began to open fire on their hostages. The Jedi stormed the hopper and rescued several of the captives, including an unharmed Nirrelz."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nathanjo Nirrelz was a male Gotal from Antar 4 who worked for the planet's government. In 22 BBY, a number of Gotals fled Antar 4 for neighboring Atzerri following a battle on their homeworld sparked by the Roshu Sune, a militant splinter branch of the Gotal Assembly for Separation. Shortly afterward, Nirrelz was sent to Atzerri on a diplomatic mission to acquire shipments of bacta from local suppliers. After he boarded a commuter hopper in the Atzerri spaceport of Skreeka, five Gotal members of the Roshu Sune hijacked the vehicle and redirected it to a base of theirs in an outlying swamp. The guerrillas then transmitted Articles of Secession to Antar 4's government, hoping to use Nirrelz and twenty-four other passengers as leverage in a bid to force their homeworld to secede from the Galactic Republic."}, {"tag": "p", "text": "Antar 4's government was without a security force that could effectively respond to the situation, which prompted the Republic's peacekeeping Jedi Order to dispatch a task force led by Jedi Knight Sarrissa Jeng to Atzerri to secure the hostages' release. The Roshu Sune held their captives aboard the commuter hopper for a week, during which time Jeng and her task force attempted to negotiate the release of the hostages, particularly Nirrelz, who was the Roshu Sune's intended prisoner. After a week, some of the terrorists began to panic and open fire on their captives. The Jedi stormed the commuter hopper, and the ensuing confrontation saw twelve hostages, two Jedi, and all of the terrorists lose their lives. Nirrelz was freed and unharmed, despite the detonation of a thermite bomb inside the hopper. His capture and rescue were both covered by HoloNet News."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nathanjo Nirrelz was mentioned in two articles on the HoloNet News website in 2002, which respectively detailed his capture and rescue. He has since been mentioned in 2008's The Complete Star Wars Encyclopedia and in Sarrissa Jeng's entry in the StarWars.com Databank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}