{"url": "Nautolan", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Amphibian sentient species", "Category:Mid Rim species", "Category:Nautolans"], "nodes": [{"tag": "h1", "text": "Nautolan"}, {"tag": "p", "text": "The Nautolans were a humanoid species from the planet Glee Anselm. They were amphibious, and adapted to survive in harsh environments. Nautolan society was largely peaceful, but they were at odds with the Anselmi, a related species also native to their home planet."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Nautolans were amphibious, capable of breathing both air and water. They were known to be capable of surviving in extreme environments. Their skin could be green, blue, gray, purple, orange, or yellow. One of their most notable features were their large, dark eyes, which were a product of evolution; through these eyes, they could spot details in lightless oceans."}, {"tag": "p", "text": "Another notable detail were their long tendrils, which grew from their heads. These tendrils were chemical-sensing, and most notably used to detect pheromones. Nautolans could translate pheromones emitted by other beings into an understanding of a being's emotional state."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Nautolans were known as a peaceful race, and disliked unnecessary violence. However, when forced to fight, they were skilled warriors. They had great respect for what they called the “ocean spirit,” which they believed existed to maintain the balance of nature on Glee Anselm. Nautolan society was prosperous, and they were generous in sharing their resources with others. The species was most comfortable underwater, preferring to be immersed in liquid."}, {"tag": "p", "text": "The Nautolan language, Nautila, involved the use of pheromones to communicate. These pheromones could be used to convey complex ideas, including full sentences and map coordinates."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nautolans lived underwater on their home planet of Glee Anselm. The first members of their species lived simply in caves, but over thousands of years, their society spread to encompass large areas of the ocean floor. At first, the Nautolans coexisted peacefully with their neighbors, the Anselmi, but after some time the Anselmi grew jealous of the Nautolans and began to threaten them and encroach upon their territory. In response to this, the Queen of the Nautolans warned the Anselmi that their actions would anger the spirit of the ocean. The Anselmi recognized that continuing to threaten the Nautolans could lead to war, and so they moved out of Glee Anselm's ocean and onto a large landmass."}, {"tag": "p", "text": "The Nautolans continued to send ambassadors to the Anselmi, warning them against upsetting the balance of nature, but their representatives were consistently sent away. Eventually, the Anselmi's desire to expand led them to build massive dams to hold back the ocean itself. According to Nautolan legend, this angered the ocean spirit so much that it brought down a storm to destroy the Anselmi empire and submerge it beneath the water. The Nautolans mourned that the Anselmi had not listened to their warnings, and continued to live peacefully, keeping in mind the importance of the natural balance."}, {"tag": "p", "text": "During and after the era of the Galactic Republic, Nautolans could be found in many places in the galaxy. By this time, the land-dwelling Anselmi were very hostile towards the Nautolans, referring to them as “gill heads” and swearing that one day they would dominate them."}, {"tag": "h2", "text": "Nautolans in the galaxy"}, {"tag": "p", "text": "During the time of the Galactic Republic, a number of Nautolans were members of the Jedi Order, including the Jedi Master Kit Fisto, the Padawan Knox, and the youngling Zatt. The Trident-class assault ship Nautolan's Revenge shared its name with the species."}, {"tag": "p", "text": "Nakano Lash was a prominent Nautolan bounty hunter, working alongside the likes of Boba Fett and Bossk. Fong Do was a male Nautolan bounty hunter who was close friends with Castas. A Nautolan fought alongside Cassian Jeron Andor in the Rebel Alliance, and a Nautolan named Daz Crano piloted a T-70 X-wing starfighter for the Resistance during their war against the First Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}