{"url": "Nautolan/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Amphibian sentient species", "Category:Cephalopoids", "Category:Mid Rim species", "Category:Nautolans"], "nodes": [{"tag": "h1", "text": "Nautolan"}, {"tag": "p", "text": "The Nautolans, sometimes referred to as the Nautiloids, were an amphibious humanoid species from the planet Glee Anselm. Although they established settlements across their aquatic homeworld, most Nautolan civilization was found in the Sabilon region. The most well-known Nautolan was Jedi Master Kit Fisto, a hero of the Clone Wars and at one point a member of the Jedi Council."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Nautolans possessed physiology common to amphibious species, including low light vision and excellent swimming skills. Their bony endoskeleton and dense cartilage made them tough and resistant to glancing blows. An egg-laying species, Nautolans emerged from their egg as a tadpole that developed arms, legs, and head-tails during their second year of life. Roughly the same size as a Human infant during this time, their limbs were weak and unable to support their weight, forcing youthful Nautolans to remain in aquatic environments for much of their childhood. They stood an average of 1.8 meters, had smooth green, blue, purple, or brown skin, and large black or dark maroon eyes with lids that were seldom used. They were capable of breathing underwater; however, unlike other water-based species, Nautolans did not experience difficulties out of water."}, {"tag": "p", "text": "Nautolans possessed exceptional olfactory and pheromone-sensing skills, enhanced by head-tresses. These tendrils were used to detect the emotional state of another being, but were most effective underwater. Within Nautolan culture, the ability to sense pheromone changes was an essential part of the communication process. All Nautolans had fourteen sensory tentacles and multiple hearts, which were capable of beating separately. Like their sense of smell, Nautolan language was also maximized for use underwater and not fully pronounceable in a gaseous atmosphere. Because of the loss in linguistic detail, most Nautolans chose to speak Anselmian or Galactic Basic when traveling off-world. In addition, Nautolans used other communicative cues when submerged, such as reading the swirls in other Nautolans' large eyes."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The society developed by the Nautolans on Glee Anselm was centralized around local families and governments. The centralized government of Glee Anselm was comprised of representatives from the Council of Elders that governed each settlement. Elders were elected on merit, and could be made up of youthful politicians as well as the most aged members of the society. A culture that promoted life-long mates, Nautolan families were characterized by their loyalty between spouses and the equality of the sexes in the household. While arranged marriages were common in their early history, the practice had become uncommon during the Galactic Civil War. No cultural affinity for the Force ever developed on Glee Anselm, though members of the Nautolan species recognized its importance and respected those among them that were Forceful."}, {"tag": "p", "text": "While few Nautolans left Glee Anselm, their music was occasionally found among savvy music collectors. Nautolan music was composed of sustained notes held in irregular patterns with occasional pauses. These pauses were considered the most important part of the music to the Nautolans, causing non-Nautolan listeners to misunderstand their artistic intent."}, {"tag": "h2", "text": "Nautolans in the galaxy"}, {"tag": "p", "text": "In the days of the Old Republic, Dossa was a female Nautolan criminal and the ultimate cause of Haazen's fall to the dark side of the Force. She joined Exar Kun as a Sith servant and fought in the Great Sith War. She led Haazen and his mentor, Barrison Draay, into a trap that resulted in Draay's death and Haazen's extreme disfigurement. Dossa was killed by Haazen in a vengeful rage for her part in his injuries."}, {"tag": "p", "text": "The Gynt family was a famous Jedi dynasty of Nautolans prior to the Great Galactic War, with the most renowned of the family being Eison Gynt, the last of the line."}, {"tag": "p", "text": "One of the most famous Nautolans to be seen off their homeworld was Kit Fisto. He was a Jedi Master during the final years of the Galactic Republic and a General in the Clone Wars. He, along with three other Masters, attempted to arrest Supreme Chancellor Palpatine when he was revealed to be a Sith Lord. Fisto was the third of the four Masters to be killed by the Chancellor."}, {"tag": "p", "text": "After the Battle of Yavin, the Rak'qua, a group of Nautolan warriors led by Overlord Rrynt'vor, took control of the asteroid base Station Gamma in the Bright Jewel system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A nautiloid is a type of shelled cephalopod."}, {"tag": "p", "text": "In the Star Wars: The Clone Wars CGI television series, Kit Fisto is shown blinking his eyes, both with expression and as a reflex. This is likely a production error, as Fisto's species was originally thought to have had lidless eyes. However, it can be explained that in the episodes in which he does this as a reflex, his eyes were exposed to atmospheric conditions that were more irritating than usual for his species - such as the fog on Vassek, the world where Grievous' lair was located."}, {"tag": "p", "text": "On page 18 of The Old Republic: Fatal Alliance, \"Nautolan\" is misspelled as \"Nawtolan\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}