{"url": "Navigator", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Space transport occupations", "Category:Navigators", "Category:Military specializations", "Category:The Force"], "nodes": [{"tag": "h1", "text": "Navigator"}, {"tag": "p", "text": "A navigator was a member of a starship's crew responsible for the vessel's navigation. As a child, Luke Skywalker was told by his uncle, Owen Lars, that his father was a navigator on a spice freighter, though in reality Anakin Skywalker was a Jedi Knight who fought in the Clone Wars. (However, Anakin had owned such a vessel.)"}, {"tag": "h2", "text": "Navigation using the Force"}, {"tag": "p", "text": "The Unknown Regions, known to their inhabitants as the Chaos, were a very dangerous place to navigate due to supernovae, black holes, gravity wells, and stranger phenomena. These hazards made navigation computers unreliable within the Chaos. Due to such hazards, the species of the Unknown Regions employed Force-sensitive navigators, individuals endowed with the Force power of precognition, to navigate."}, {"tag": "p", "text": "Chiss Force-sensitive children served as navigators known as Ozyly-esehembo, Cheunh for \"sky-walkers\". Most ozyly-esehembo were girls, and invariably their powers of precognition faded by adulthood. The Chiss referred to the power of precognition as \"Third Sight\", and the much rarer power of telepathy as \"Second Sight\". Though they were considered civilians, ozyly-esehembo served the Chiss Expansionary Defense Fleet in the sky-walker corps, along with their caregivers. Ozyly-esehembo were among the Chiss Ascendancy's most treasured assets and best-kept secrets, with generally only command staff of Fleet vessels and high-ranking Aristocra being aware of their existence."}, {"tag": "p", "text": "Other species of the Chaos also utilized Force-sensitive navigators to guide their travels through hyperspace. This practice was common enough that those navigators formed the Navigators' Guild, whose members could be hired to navigate for various factions and organizations in the Unknown Regions.  These navigators referred to the Force as the \"Great Presence\". Sub-groups of the Guild included Vector One, the Pathfinders, and Void Guides. Because the Chiss Ascendancy kept the existence of their sky-walkers as a tightly held secret, particularly from other societies of the Chaos, and because ozyly-esehembo were rare and of limited number, the Ascendancy often hired navigators of other species from the Navigators' Guild to navigate their journeys in the Unknown Regions."}, {"tag": "p", "text": "During the Imperial Era, Galactic Emperor Sheev Palpatine felt a disturbance in the Force at the fringes of the Unknown Regions. Palpatine sent his enforcer  Darth Vader and Grand Admiral Thrawn to investigate the source of the disturbance. Thrawn and Vader discovered Grysk forces kidnapping ozyly-esehmbo to navigate, and preparing to invade Imperial space. Their investigation led to the Imperial–Grysk conflict, including the rescue of several young ozyly-esehembo from the captivity of the Grysk Hegemony. During the mission, Darth Vader learned to navigate using the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}