{"url": "Navik", "categories": ["Category:Legends articles", "Category:Chattza Clan", "Category:Grand Protectors of the Rodians", "Category:Males", "Category:New Republic Senators", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Navik"}, {"tag": "p", "text": "Navik, also known as Navik the Red, was a Rodian warlord who served as the Grand Protector of Rodia during the Galactic Civil War. He gained his nickname from the red birthmark on his face. His given name, \"Navik,\" was Rodese for \"dark\" and was considered to be a prophetic name."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the reign of Emperor Palpatine, Navik's tribe, the Chattza, used Rodia's traditional wargames to attack other tribes. He attacked the Tetsu Clan, wiping out many of their members, including Greedo the Elder, and forcing the survivors, including Greedo's son and namesake, to flee the planet to worlds such as Nar Shaddaa. Not content with exiling them, he tracked down many survivors throughout the galaxy and killed them. When Navik became the Grand Protector of Rodia, he moved the capital from Equator City to Iskaayuma, the Chattza settlement. He also built ties to Prince Xizor and Black Sun. During his time as Grand Protector, the Chattza clan's rivals, the An'yettu clan, were prevented from leaving their island home by Navik. He remained in his position throughout the Galactic Civil War."}, {"tag": "p", "text": "After the Battle of Endor, Rodia joined the Alliance of Free Planets, though Navik decided not to join the New Republic (possibly fearing a war crimes tribunal). Rodia eventually joined, and Navik appointed himself Senator of Savareen sector to the New Republic Senate. He was later appointed to Borsk Fey'lya's Advisory Council, and voted for defending Bothawui over Corellia, due to Rodia's proximity to Bothawui. During a meeting concerning the Yuuzhan Vong invasion, he was outraged at the loss of the Mid Rim worlds of Kalarba, Druckenwell and Falleen to the enemy, citing that the New Republic favored the Core Worlds and Chief of State Borsk Fey'lya's homeworld of Bothawui. However, Navik showed his own opinions when he blatantly told Jedi Master Luke Skywalker that Tatooine, which was looking at potential invasion, was not his concern."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The New Jedi Order: Balance Point, the Rodian senator's name is 'Narik.' This is presumably a misspelling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}