{"url": "Navy_Order_of_Battle", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Imperial Military", "Category:Imperial Navy"], "nodes": [{"tag": "h1", "text": "Navy Order of Battle"}, {"tag": "p", "text": "The Navy Order of Battle referred to the organization, strength and command structure of the formations of the Imperial Navy of the Galactic Empire. The Order of Battle was under the purview of the Navy's Flight Branch."}, {"tag": "p", "text": "The Order of Battle reflected ideal combat formations and unit strengths, not operational realities. Especially at the higher levels, many Navy formations like the Systems Force and the Sector Group were understrength throughout the Galactic Civil War."}, {"tag": "p", "text": "In the aftermath of the Battle of Endor and Emperor Palpatine's death, the Navy Order of Battle broke down completely: the Imperial Navy split into smaller and smaller operational units as ambitious Moffs and Admirals seized control of parts of the fleet and set themselves up as warlords."}, {"tag": "h2", "text": "Order of Battle"}, {"tag": "h3", "text": "Command"}, {"tag": "p", "text": "An individual command, a single starship, was the building block of the Imperial Starfleet. Achieving command of a starship, no matter its size, was point of pride in an officer's career. The most iconic commands of the Imperial Navy were the Imperial-class Star Destroyers, of which nearly 25,000 were built. Despite this, they were not the most common warship in the Navy: that was the Sienar Fleet Systems IPV-1 System Patrol Craft, a heavily-armed corvette."}, {"tag": "p", "text": "Officers commonly turned down impressive staff promotions in the hopes of receiving a ship command, although serving as a staff officer on a prominent starship, such as a squadron flagship, was often considered a fast track for promotion. Commanding officers of ships, regardless of their line rank, always received the positional title of Captain."}, {"tag": "h3", "text": "Line of battle"}, {"tag": "p", "text": "The most basic combat formation in the Imperial Navy was the line of battle, or simply a line, and the smallest organizational unit used for space combat. The Imperial Starfleet shaped four to twenty starships into lines, depending on the type of line. The line was the most amorphous level of organization in the Starfleet. The Imperial Starfleet Order of Battle outlined seven types of lines: attack, heavy attack, reconnaissance, pursuit, skirmish, troop and torpedo."}, {"tag": "p", "text": "Attack and heavy attack lines aggressively engaged enemy starships in combat. Attack lines were composed of three heavy cruisers, or six to eight light cruisers, while heavy attack lines were composed of four to eight medium or heavy cruisers, possibly including a Victory-class Star Destroyer. If an Imperial-class Star Destroyer was present to provide direct firepower, attack lines would harry the opponent's flanks."}, {"tag": "p", "text": "Reconnaissance lines of two to four light cruisers equipped with surveillance gear gathered intelligence of the disposition of enemy forces, and did not engage in direct combat."}, {"tag": "p", "text": "Pursuit lines of four to ten fast light cruisers or frigates chased and trapped retreating enemies."}, {"tag": "p", "text": "Skirmish lines of four to twenty corvettes or similar small vessels harassed capital starships and engaged enemy pickets, frigates and starfighters, providing direct support for TIE Fighters. Skirmish lines of IPV-1 Patrol Craft were deployed everywhere the Empire wished to maintain a military presence."}, {"tag": "p", "text": "A troop line consisted of two Evakmar-Kuat Drive Yards Corps Transport vessels, two escort vessels, and frequently two Strike-class medium cruisers. Its function was the deployment of Imperial Army units."}, {"tag": "p", "text": "A torpedo line consisted of up to two Torpedo Spheres, used to penetrate planetary shields."}, {"tag": "p", "text": "In addition to the seven types of lines, the Imperial Navy considered an Imperial-class Star Destroyer a line in itself. While an Imperial-class Star Destroyer may have been able to act as an attack line and its complement of starfighters as a skirmish line, the decision to give commanders the option to field a ship equivalent to a heavy cruiser as a line unto itself was more political than tactical. After a naval staff study suggested a Star Destroyer was the field equivalent of the smallest of naval squadrons, the Admiralty decided that, as there were more lines than squadrons, designating the Star Destroyer as a line unit would get them more Star Destroyers. The Admiralty's thinking prevailed."}, {"tag": "p", "text": "Lines of battle were commanded by Senior Captains, who received the positional title of Captain of the Line."}, {"tag": "h3", "text": "Squadron"}, {"tag": "p", "text": "A squadron was the smallest independent operating unit in the Imperial Navy. Composed of several lines, a squadron ranged from 14 to 60 ships, depending upon the composition of the lines in the squadron. A squadron was the largest concentration of ships normally assigned to a single system. The Galactic Republic had designated units of identical configuration as fleets, which had been the total naval presence in a sector. Thus, the subordination and vast growth in numbers of squadrons was a useful measure of the growth of the Imperial Military after the establishment of Emperor Palpatine's New Order."}, {"tag": "p", "text": "Similar to lines, the Imperial Navy's Order of Battle designated four types of squadrons: light, heavy, battle, and bombard."}, {"tag": "p", "text": "Light squadrons patrolled areas known to be safe with a skirmish line and a reconnaissance line, and optionally two attack lines."}, {"tag": "p", "text": "Heavy squadrons engaged planetary systems that possessed known enemy presences with two heavy attack lines. In situations where pinpointing the enemy's position was required, heavy squadrons may be reinforced with an attack line and a reconnaissance line. During aggressive operations against the enemy, or those where the enemy was known to be defending a fixed asset the heavy squadron may consist of three heavy attack lines and a skirmish line. It was common to assign Victory-class Star Destroyers to the latter type of heavy squadron."}, {"tag": "p", "text": "Battle squadrons contained an Imperial-class Star Destroyer, supported by at least three lines - two attack lines and one pursuit line - for an average of 18 ships. In practice, Star Destroyers were normally accompanied by just two or three escorts, if any: the Imperial-class was designed to operate without support, and its hyperdrive was too fast for any escorts except for the speediest light cruisers. The battle squadron was used for offensive operations against a known enemy, and the mere arrival of an Imperial-class Star Destroyer was often enough to put down a planetary revolt or scare off an armed space-threat."}, {"tag": "p", "text": "Bombard squadrons subjugated worlds in open rebellion that had developed planetary defenses including multilayered planetary shields and large planetary guns with a skirmish line, a pursuit line, and up to four Torpedo Spheres. In practice, however, such squadrons usually only contained one Torpedo Sphere."}, {"tag": "p", "text": "The squadron's flag officer was officially of admiral rank, though he usually received the positional title of Commander."}, {"tag": "h4", "text": "Training Squadrons"}, {"tag": "p", "text": "Like other navies in the past, the Imperial Navy utilized various training squadrons, which were commanded by cadets who had passed through initial pilot training. Bantha Squad and the training squadron on Victorious were a few of these training squadrons."}, {"tag": "h4", "text": "Notable squadrons"}, {"tag": "p", "text": "The Imperial Navy had several squadrons at its disposal. The 123rd Nightstalker Group, under the command of Blackhole, was comprised wholly of TIE/LN starfighters and participated in various combat operations during the Galactic Civil War. In addition, the 128th TIE Interceptor Squadron was an elite TIE/IN interceptor squadron, formerly led by Kasan Moor until her defection to the Rebel Alliance. Other TIE/IN interceptor squadrons included the 133rd Imperial Fighter Group under Xandel Carivus and the 181st Imperial Fighter Wing, later renamed the 181st Imperial Fighter Group led by Soontir Fel, which became elite under his command. The 181st Imperial Fighter Wing had several subsections, including the 2/181st and Alpha Squadron. The 37th Imperial Fighter Wing was also involved in the Battle of Saloch, where it was composed of at least 6 squadrons, including the 6/37th. Zsinj once had the 181st Imperial Fighter Group impersonated. The Black Eight Squadron was an elite TIE/LN and TIE/sa bomber squadron, of which its most notable member was Juno Eclipse, one of the leaders of the Rebel Alliance. It eventually was reorganized by 1 ABY. Avenger Squadron was another notable squadron, being composed almost entirely of TIE Avengers and was assigned to the Task Force Vengeance. Storm Squadron likewise was composed entirely of TIE Advanced X1s."}, {"tag": "p", "text": "Black Squadron was a TIE fighter squadron personally commanded by Darth Vader, although most of the squadron was wiped out during the Battle of Yavin. It was well known enough that several Imperial Starfighter Squadrons derived their names from it, a notable example being Onyx Squadron."}, {"tag": "p", "text": "Although technically a fleet, Death Squadron was one of the most notable squadrons, being under the direct command of Vader. It was composed of several warships, including the Executor, the first in the Executor-line of Star Dreadnoughts, which acted as its flagship. It also was composed of several other squadrons under its wing, including the 128th TIE Interceptor Squadron, the TIE/LN starfighter Obsidian Squadron, and the TIE/sa bomber Scimitar Squadron."}, {"tag": "p", "text": "Although not actually part of the Imperial Navy, the 501st Legion sometimes acted as a starfighter squadron for the Imperial Navy. In addition, Black Wing Squadron was also developed based on the Rebel Alliance/New Republic starfighter squadron Rogue Squadron, with the intention of having them fight it."}, {"tag": "p", "text": "Because of the importance of the Death Star II's construction as well as the Battle of Endor, several squadrons had been reassigned to defend the battlestation, including Death Squadron, Scythe Squadron (which had originally been assigned to the Anoat system), Onyx Squadron (which had utilized TIE Defenders for the occasion) and the 181st Imperial Fighter Wing."}, {"tag": "p", "text": "There were also some who were assigned to defend the Emperor, such as the Emperor's Sword and Emperor's Shield."}, {"tag": "p", "text": "During the early years of the Galactic Empire, the 77th Air Wing was utilized during the Western Reaches Operation, which had been composed of a squadron called Sword Squadron, made up of 3 flights, Dagger Flight, Blade Flight, and Scimitar Flight. Another squadron was the 12th Squadron."}, {"tag": "p", "text": "Other squadrons included the 276th Imperial TIE Bomber Group, 323rd Imperial TIE Bomber Group, Alpha Squadron, Bantha Squad, Beta Squadron, Broadaxe Squadron, Cloak Force, Crimson Squadron, Delta Squadron, Dark Side Squadron, Dark Squadron, Durkii Squadron, Eagle Squadron, Ebon Squadron, Elite Squadron, Eta Squadron, Gamma Squadron, the Garqi Eagles, GoldWing Squadron, Hammer Squadron, Interloper Squadron, Iota Squadron, Mu Squadron, Nu Squadron, Raven Squadron, Reaver Squadron, Red Squadron, Red Star Squadron, Requiem Squadron, Saber Squadron, Scimitar assault wing, Shadow Squadron, the TIE Defender squadron of the same name, Shadow wing, Shrike Squadron on Mandalore, Shrike Squadron on Saffalore, Sigma Squadron, SilverWing Squadron, Solaest Fleet Long Range Patrol Wing, Spear Squadron, Specter Squadron, Stranger Squadron, Sunspot Squadron, Talon Squadron, Tempest Squadron, Theta Squadron, the TIE/sa bomber squadron of the same name, Twilight Squadron, Veerpal Squadron, the 302nd Flight Wing, and Zeta Squadron."}, {"tag": "p", "text": "Some squadrons, such as Black Epsilon, were deployed for covert operations that were either too small or too sensitive for the Navy itself to get involved."}, {"tag": "p", "text": "Several squadrons were also created for the Imperial Navy's successors in the Fel Empire and Krayt's Sith Empire, such as the 1st Imperial Center Core Defense Squadron, and Red Squadron."}, {"tag": "h3", "text": "Systems force"}, {"tag": "p", "text": "A systems force combined several squadrons, typically totalling ninety ships, and was responsible for Imperial Starfleet actions across multiple star systems. In practice, however, despite their nominal strength, most systems forces contained only a single squadron. Perhaps because of this, rather than outline specific formations of system forces, the Imperial Starfleet Order of Battle lent flexibility to Commodores to pool the whole of their naval resources and shape them as necessary missions required. However, in general, the systems force had at least six possible pooling situations."}, {"tag": "p", "text": "Force superiority pooled at least three battle squadrons and a light squadron. With a minimum of three Imperial-class Star Destroyers and nearly 90 other starships, force superiority's mission was to achieve space superiority in a given system, defined as; \"the complete absence of hostile craft within the orbital space of controlled worlds, and no chronic enemy ship activity within the entire system.\" Should an enemy be too powerful for force superiority to successfully destroy, the Commodore had the option of swapping out the light squadron for a fourth battle squadron, thus gaining enough force to ensure complete domination of a target area."}, {"tag": "p", "text": "Force escort protected crucial commercial shipments, economically essential space installations or facilities, and hunted down harassing pirates. With at least two heavy squadrons and two light squadrons, force escort was the most flexible of the force pools. Commodores used force escort to run a variety of missions, knowing well that their large starship count and organizational flexibility would allow for their completion. Where force superiority was given the maxim \"always send enough\", force escort bore the maxim \"never send too much\". In practice, this meant that force escorts were the Empire's first line of defense, protecting civilian freighters, attacking corsairs' hideouts, and serving as guardships at remote outposts. The Empire's early force escorts relied heavily on CR90 corvettes and frigates captured from the Trade Defense Force in the aftermath of the Clone Wars, but soon came to included cheap new designs from Kuat Drive Yards, including the Ton-Falk-class escort carrier and the EF76 Nebulon-B escort frigate."}, {"tag": "p", "text": "Transport forces were charged with deploying various troops from other branches of the Imperial Military, including Army troopers and even Stormtroopers, as well as acting as command centers for any ongoing surface operation. As such, they are comprised of at least two troop squadrons, a heavy squadron, and a light squadron."}, {"tag": "p", "text": "System bombard was charged with carrying out planetary bombardment missions. It was composed of three bombard squadrons and one light squadron."}, {"tag": "p", "text": "Force technical services was charged with transporting mechanical specialists quickly and safely wherever they are needed most. They are composed of eight transports as well as two armed escort frigates."}, {"tag": "p", "text": "Force support was tasked with resupplying various Imperial depots, including planet-side depots, across the galaxy, and as such, contained over a hundred container vessels. They generally lacked escort vessels of their own, but were assigned some when going through combat zones."}, {"tag": "p", "text": "Systems forces were commanded by Admirals, who were given the positional titles of Systems Admiral or Commodore. In practice, however, since most systems forces contained just one combat squadron, the Systems Admiral and the Squadron Commander were the same officer."}, {"tag": "h3", "text": "Fleet"}, {"tag": "p", "text": "Where all previous units were generally bound to specific system or set of systems, the Imperial Navy designated a fleet as a \"sector resource\", allowing it to operate on a sector-wide scale. A fleet was the smallest unit transferred between sectors. Comprising multiple systems forces, fleets typically totalled up to four hundred ships. With such a large number of units, there were thousands of potential types of fleet alignments. Common fleet deployment types included superiority fleets, assault fleets, and bombard fleets. Other examples of formations that a fleet might have taken included a deepdock fleet, support fleet, or ordnance fleet."}, {"tag": "p", "text": "Superiority fleets maintained space superiority in sectors with \"four or fewer worlds confirmed hostile to the New Order, and no more than 16 additional worlds with confirmed significant hostile elements\". With six Imperial-class Star Destroyers and almost 400 other starships, a superiority fleet was presumed to be a sufficient force for relatively calm sectors."}, {"tag": "p", "text": "Assault fleets transported huge numbers of Imperial Army and Navy troops to coordinate ground operations, while maintaining space superiority around the targeted systems. With two transport forces and two force escorts, an assault fleet engaged in massive planetary and system-wide ground campaigns."}, {"tag": "p", "text": "Bombard fleets contained an average of 416 ships, allocated between two system bombards and two force escorts. Bombard fleets were assigned to high-threat, low-value sectors where the Empire had determined the probability of repressing the Rebellion in the sector to be less than even. System bombards were used to annihilate opposition without concern for local infrastructure, when the Empire would rather completely destroy a world than see it fall into Rebel hands."}, {"tag": "p", "text": "Deepdock fleets had a total of 280 support vessels and one escort force, and are primarily utilized to support two space-based shipyards. The deepdock complexes in question have over a hundred repair bays with hyperdrive engines to ensure that they were easily relocated."}, {"tag": "p", "text": "Support fleets were considered the most important non-combat formations in the Navy, charged with securing the logistics of the entire Empire. Support fleets had over 500 small vessels, most of them container ships, with the supply burden falling in equal part on Corellian Engineering Corporation CR90 corvettes and massive FSCV transports. These fleets equip Imperial military forces with weapons, ammunition, equipment, supplies, and consumables."}, {"tag": "p", "text": "Fleets were commanded by admirals given the positional title of Fleet Admiral. Where Sector Groups were not big enough to justify splitting them into separate fleets, this usually made the Fleet Admiral the senior professional officer in the sector."}, {"tag": "h4", "text": "Notable fleets"}, {"tag": "p", "text": "Fleets within the Imperial Navy include the 15th Deep Core Reserve Fleet; the 27th Denarian Fleet; Admiral Kohrin's second fleet; Banjeer's fleet; the Black Fleet; the Byss Defense Fleet; the Centrality Navy; the Chandrila Defense Fleet; the Charis Fleet; the Coruscant Defense Fleet; Crimson Command; Death Squadron; Digit Squadron; Imperial Replenishment Fleet DK-209; the First Naval Fleet; the Gandle Ott system defense force; the Grand Imperial Navy; the Ground Pounders; the Hammer Group; the Imperial Fourth Attack Squadron; the Imperial Outer Rim Territories Patrol Fleet; the Inner fleet; Lumiya's fleet; the Maw fleet; the Outer Rim Imperial Fleet; Qeimet fleet; the Secret armada; the Shadow Hand Fleet; the Solaest Fleet; the Swift Wing; Task Force Vengeance; Task Force Whirlwind; the Third Ado Superiority Fleet; Thrawn's fleet; the Torize planetary defense force; the Vengeance Battle Group; and the Western Reaches Superiority Force. In addition, there was also one Unidentified Imperial fleet and one task force."}, {"tag": "h3", "text": "Sector group"}, {"tag": "p", "text": "A Sector Group was the sum total of Naval strength which the Empire expected to commit to a normal sector. A sector group could be expected to contain at least 2,400 ships in multiple fleets, 24 of which were Star Destroyers (Imperial-class Star Destroyers were the norm, but some groups contained older model Star Destroyers), and another 1,600 combat starships."}, {"tag": "p", "text": "The Sector Group level of command came about somewhat by accident: the Moffs of the Empire's sectors, installed under the Sector Governance Decree in the final days of the Republic, complained that the Imperial Navy's force requirements in quelling Separatist holdouts routinely robbed their sectors of resources without sufficient consideration for local security needs. Under the Sector Governance Decree, the Moffs held the power of the old Governor-Generals to raise forces and began raising their own local militias. Alarmed by the prospect of local military forces not loyal to Imperial Center, the Admiralty stepped in and created Sector Groups, local forces directly controlled by the Moffs but carefully scrutinised by Coruscant."}, {"tag": "p", "text": "The Sector Groups were largely drawn from the Planetary Security Forces, nationalized after the Declaration of a New Order, with its combat forces split between force superiority and force escort, and separate fleet commands for troop transport, bombardment, deepdock and support fleets. In practice, Sector Groups were rarely at their full establishment strength, sometimes lacking enough discrete forces to justify dividing the group into separate superiority and escort fleets."}, {"tag": "p", "text": "The commander of a Sector Group received the title of High Admiral, but this was often a ceremonial post granted to the Moff who governed the sector. In sectors that were involved in constant and severe naval actions, however, the High Admiral was a separate position from the Moff."}, {"tag": "p", "text": "The sector groups included Azure Shield, assigned alongside the 1st Sector Army, Azure Hammer Command, to the Azure sector of the Imperial Center Oversector; the Baxel sector fleet, assigned to the Baxel sector; the Brak Sector Fleet, assigned to the Brak sector; the Braxant Sector Fleet, a fleet composed of 13 Imperial-class Star Destroyers assigned to the Braxant sector that included the Obliterator, Ironhand, Relentless, and the Tyrannic; the Candoras Sector Fleet, composed of four Dreadnought-class heavy cruisers and other smaller ships assigned to the Candoras sector; the Coruscant Sector Fleet, assigned to Coruscant due to it being a sector in itself; the Elrood Sector Fleet, assigned to the Elrood sector composed of the Imperial-class Star Destroyers Stalker and Thunderflare, the Bayonet-class light cruiser Rintonne's Flame, and smaller vessels, including 12 system patrol craft, custom vessels, Skipray Blastboats, and various TIE fighters; the Kathol Sector Imperial Fleet, assigned to the Kathol sector; the Kuati Sector Forces, assigned to the defense of Kuat; the Oplovis Sector Fleet, assigned to the Oplovis sector; the Tapani Defense Force, assigned to the Tapani sector; the Tierfon Sector Fleet, assigned to the Tierfon sector; and the Trax Sector Group, assigned to the Trax sector."}, {"tag": "h3", "text": "Regional, oversector and strategic command"}, {"tag": "p", "text": "Although the Sector Group was the highest strength in the standard Order of Battle, there were also higher unofficial levels known as regional groups and Oversector groups, formed by assembled by merging sector groups together. Regional, oversector and strategic military commands came in a variety of mixed and homogeneous forces. These formations, however, are not officially part of the standard Order of Battle."}, {"tag": "p", "text": "Black Sword Command was a regional command that defended the Core regions from threats emanating from the galactic rim. It had three Super Star Destroyers as part of its fleet assets. Azure Hammer Command, based out of Anaxes, defended Sector Zero and consisted of 57 capital ships, led by the Super Star Destroyer Whelm. Likewise, Crimson Dagger Command, also based out of Anaxes, defended the Quelii Oversector, and was instrumental in the Ciutric Offensive during the Reconquest of the Rim in the early stages of the Imperial Period. Cerulean Spear Command, likewise, was charged with the defense of the Maldrood Oversector, and was instrumental in the Sy Myrthian Insurrection during that same time period. Additionally, a full ten percent of the entire Imperial Navy was kept in reserve in the Core Worlds, so as to be able to quickly respond to threats throughout the galaxy. In the Outer Rim Territories, a fleet with at least 19 Imperial-class Star Destroyers and three Immobilizer 418 cruisers, the latter supplied by Imperial Drydock IV, was also kept."}, {"tag": "p", "text": "Roving fleets aimed at specific tasks were fielded at several points in Imperial history. Notable units included Death Squadron and Scourge Squadron, which hunted for Rebel bases in the Outer Rim. There was also the Vengeance Battle Group, used by the Dark Jedi Jerec to search for the Valley of the Jedi, and the secret armada assembled by Admiral Mils Giel, for the purpose of transporting a vital biological device from the Outer Rim to Imperial Center."}, {"tag": "p", "text": "At least one Star Destroyer task force was used to punish Imperial sectors that threatened to undermine Imperial rule, as when the Moff of the Trans-Nebular sector established himself as the de facto warlord and was engaged by a fleet of Star Destroyers. This force was large enough to leave behind vessels that would form the core of a new sector fleet, before moving on to other trouble spots. There was also a fleet stationed near Byss, that was formed since the start of the Galactic Empire. The Emperor himself also possessed a personal fleet that he has command over, utilizing it in situations important enough to require him to participate in person."}, {"tag": "h2", "text": "Starfighter Corps organization"}, {"tag": "p", "text": "The TIE Fighters of the Imperial Navy's Starfighter Corps were organized as follows:"}, {"tag": "p", "text": "The typical formation of an Imperial-class Star Destroyer's wing was four TIE Fighter squadrons (one squadron was often equipped to be a reconnaissance squadron with TIE/rc starfighters), one squadron of TIE Bombers (lower priority ships had to make do with older TIE/gt fighter-bombers), and one squadron of TIE Boarding Craft. Often one or two flights in a fighter squadron were TIE/FC fire control craft. Sometimes one of the fighter squadrons was used for training purposes. By the Battle of Endor, one squadron had been swapped out in favor of a squadron of TIE Interceptors. During typical operations, two TIE squadrons provided screening for their Star Destroyer and any escort vessels, two conducted forward recon, and two were held in reserve."}, {"tag": "p", "text": "TIE Fighters assigned to ground operations were Navy vessels, but their pilots reported to an Imperial Army garrison commander, organized into ground support wings. The Navy's insistence on retaining control of all starfighters meant that ground support wings were smaller than those assigned to Star Destroyers, and consisted of forty TIEs in ten flights of four fighters each. Three flights were TIE Bombers, six were sorted into two squadrons of TIE Fighters, and a single flight of TIE/FC fire control craft."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}