{"url": "Nayama", "categories": ["Category:Legends articles", "Category:Fallen Jedi", "Category:Females", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Members of the Sith Brotherhood", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Nayama"}, {"tag": "p", "text": "Nayama was a female Human Force-sensitive who began training with the Jedi Order before quickly succumbing to the dark side of the Force and joining Exar Kun's Sith Empire. Before her fall, Nayama was the wife of Padawan Jolee Bindo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human from Ukatis, Nayama was a member of the Ukatis Enforcers serving the tyrannical Ukatisian monarch. During her service to the monarch, Padawan Jolee Bindo of the Jedi Order traveled to Ukatis on a mercy mission smuggling supplies to the Ukatis citizenry through a blockade set up by the Ukatis government. Opposed to Galactic Republic involvement, Nayama was ordered to track Bindo's ship and shoot it down; a mission she succeeded in completing. Bindo was captured and she managed to foil three of his escape attempts while in captivity, though eventually he won her over and they fell in love. Helping him escape offworld, the two were married; although marriage was frowned upon by many Jedi of the time and was deemed unacceptable for a member of the Order. Immediately, Bindo noticed that Nayama was strong in the Force, which is why she was able to shoot him down. Deciding to train her as a Jedi, Bindo's status as a Padawan and Nayama's age caused the Jedi High Council to deny his request. Ignoring the High Council's wishes, Bindo began secretly training her in the ways of the Jedi."}, {"tag": "p", "text": "The joy of Jolee's marriage to Nayama was not to last as the words of fellow Padawan Exar Kun inspired her to join in his dream of heralding in a Golden Age of the Sith. Urging her husband to abandon what she called \"the decrepit trappings of the Jedi\" and join her in Kun's war of conquest, Bindo pleaded with her to reconsider and think about what she would become and what she would be throwing away. In her frustration and failure to convince her husband and mentor to join the Sith, she drew her lightsaber and attempted to strike him down. The battle between husband and wife was long and difficult but eventually Bindo gained the upper hand and defeated her; it was at this moment he realized his wife had fallen to the dark side. At his mercy, Bindo refused to kill the woman he loved and he let her go. She followed many other fallen Jedi of that time, including Oss Wilum, Crado, and Ulic Qel-Droma in their attempt to create a new golden age in a conflict which quickly came to be known as the Great Sith War."}, {"tag": "p", "text": "The mistake of sparing the woman would come to haunt Bindo for years to come, as he allowed her to join Exar Kun, going on to kill many Jedi during the war until she herself was slain in the final battle on Yavin 4. The High Council decided to put Bindo on trial for his actions by training Nayama against their wishes and for him allowing her to escape his grasp. Though he was absolved of all responsibility, with the High Council citing mitigating circumstances and that he deserved compassion and he learned wisdom the hard way for all his actions during the war, the High Council decided to raise him to full Jedi status."}, {"tag": "p", "text": "The decision would come to haunt Bindo because he believed he deserved to be punished and that the Jedi forgave him; however, he could never forgive himself. According to him, that was when the Jedi left him, and that was where they failed him. Filled with sadness for the loss of his wife, he decided to leave the Jedi and head for the uncivilized parts of the galaxy. It was on his way that his ship was damaged in an asteroid field and he ended up in the Shadowlands of Kashyyyk, where he decided to exile himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nayama is first mentioned in the computer and video game Star Wars: Knights of the Old Republic, developed by BioWare. She is never actually seen; all the details of her life are related to the player, as Revan, through optional conversational dialogue with Jolee Bindo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}