{"url": "Naz_Felyood", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Naz Felyood"}, {"tag": "p", "text": "Naz Felyood was the Corellian captain of the pirate ship Jynni's Virtue up until its destruction in 1 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Five years prior to the events that ultimately changed his life, Felyood, accompanied by his first mate, Babbnod Luroon, found himself engaged in a sabacc game on Nar Shaddaa with a hooded old woman. Before winning the game and promptly disappearing, the woman informed Felyood that he would one day visit the world of Korriban, a place where \"evil lives\" and discover a most valuable treasure."}, {"tag": "p", "text": "This event lay almost forgotten within Felyood's mind, until a botched escape from an Imperial patrol landed him on the Sith tomb world. Eventually he set out on an expedition into a nearby valley, which, through a misstep, landed him in the tomb of the ancient Sith King Dathka Graush."}, {"tag": "p", "text": "In the tomb, Felyood discovered Graush's sarcophagus and an assortment of artifacts: a Sith sword, a Sith holocron, an amulet, and the Force-strong Heart of Graush. Upon Felyood's discovery of these things, he was possessed by the long dead Sith Lord, allowing his undead army to reawaken."}, {"tag": "p", "text": "During an assault on the still downed Jynni's Virtue, Felyood ended up losing the Heart. Suffering greatly at the loss of his friends, he wrote a letter confessing his feelings for First Mate Luroon. He also included a warning that ordered anyone who found the letter to leave Korriban while they still had the chance."}, {"tag": "p", "text": "The rest of Felyood's days were spent wandering the Korriban wastes, looking for the lost Heart. The residue of Gaush's spirit left within him prevented him aging any further, dooming him to search forever. He aptly presented himself, to any poor souls unfortunate enough to land on Korriban, as the sole survivor of a shipwreck, and solicited their help in finding the lost Heart."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As Felyood was created for an RPG adventure, his ultimate fate is presumably left up to the players involved. As such, there is unlikely to be an official canon resolution to his tale."}, {"tag": "h2", "text": "Sources"}]}