{"url": "Ne%27eda_Frip", "categories": ["Category:Canon articles", "Category:Businesspeople", "Category:Crime lords", "Category:Females", "Category:Individuals of unidentified species", "Category:Ne'eda's Stalwarts"], "nodes": [{"tag": "h1", "text": "Ne'eda Frip"}, {"tag": "p", "text": "Ne'eda Frip was the female crime lord leader of Ne'eda's Stalwarts and the owner of Neral's moon. As undisputed ruler of the moon, Ne'eda operated from a penthouse at the top of Ne'eda's Tower, the largest gaming palace on the moon, which many high-end clients visited to play hologames and sabacc. As an aquatic creature, she resided in a large water-filled tank and, unable to speak Galactic Basic Standard, communicated with her business associates through the translation assistance of her protocol droid."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ne'eda frequently did business with the human smuggler Lando Calrissian, but their relationship soured when Calrissian fled a gambling debt of two thousand credits he incurred after a poor round of sabacc. To square the debt between them, Calrissian agreed to either smuggle thirty barrels of purple glandis flower juice onto the planet Hynestia or pay the credits he owed. Failure meant his life was forfeit to Ne'eda. Calrissian did fail, his smuggling venture discovered by the Hynestian Queen Forsythia Jin and the purple glandis flower juice confiscated. When Calrissian returned to Neral's moon to pay the credits he owed and offer Ne'eda valuable gherlian furs he acquired on Hynestia to appease her after his loss of the juice, Ne'eda rejected his offers. She was not interested in the gherlian furs, and he did not have enough credits to account for interest."}, {"tag": "p", "text": "In retribution for Calrissian's failure, Ne'eda nearly consumed the smuggler in her massive, unhingeable jaw, but delayed when he promised her another offering, the priceless treasure of the Hynestian royal family. Intrigued, Ne'eda agreed to give Calrissian a final chance and sent a Wookiee Stalwart to accompany the smuggler to the Millennium Falcon in order to appraise the treasure he spoke of. Her henchman never reached the ship, as Calrissian fled when the Quarren bounty hunter Jeskian Veldar, whom he also owed money, arrived on the scene. Ne'eda's Wookiee Stalwart and Veldar argued over who could collect what was owed them, enabling him to slip away. Not willing allow Calrissian to escape, Ne'eda sent a fleet of five ships manned by her Stalwarts to recapture him. Altough they had the advantage in numbers, Calrissian outflew them, destroying four of the Ne'eda's ships with the aid of his partner, the pilot droid L3-37. Rather than be destroyed, the last of the Stalwart pilots disengaged and returned to Neral's moon to break the news to Ne'eda."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ne'eda was one of a species of large aquatic creatures. She had bright purple skin, with gills on her neck and fan-shaped fins on the side of her head. She was capable of swallowing a human, thanks to her unhingeable jaw lined with seven rows of razor-sharp teeth. Ne'eda also had hands with long sharp claws and suction cups on their palms and a powerful tail lined with spikes."}, {"tag": "p", "text": "A capable businesswoman, Ne'eda took her work very seriously and was unafraid of hurting and even killing those who wronged her or were indebted to her. A capable and dangerous ruler, her claim over Neral's moon was unchallenged."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ne'eda Frip first appeared in the 2018 middle-grade novel Lando's Luck, written by Justina Ireland and illustrated by Annie Wu, part of the Flight of the Falcon series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}