{"url": "Neb_Munb", "categories": ["Category:Legends articles", "Category:Males", "Category:Mercenaries", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Neb Munb"}, {"tag": "p", "text": "Neb Munb was a Sullustan male who lived on Tatooine during the Cold War between the Galactic Republic and the reconstituted Sith Empire. A professional mercenary, he was hired by a client to protect them from a group of assassins, and Neb enlisted the help of a Republic-allied individual to complete the job."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Sullustan, Neb Munb lived in the city of Anchorhead on Tatooine during the Cold War between the Galactic Republic and the Sith Empire. He worked as a professional mercenary, and he was hired as protection for a client who represented a corporation selling vaporators at a discount."}, {"tag": "p", "text": "The client's company had been selling vaporators a low price, which angered the planet's crime lords. The criminals had hired a professional killer to take out the client, who sent teams of killers anytime the client used a holoterminal. Upon realizing how the killer was tracking them, Neb hid the client in the Anchorhead cantina, until a Republic-allied individual came across them."}, {"tag": "p", "text": "When they learned about Neb's predicament, Neb asked an individual to use the client's ident card a few times. This will draw out the ambushers, allowing the individual to track them back to their hideout and eliminate the pro. They agreed, and tracked the killer back to a warehouse on the outskirts of Anchorhead. Thanks to the individual's efforts, the client was able to return to his job safely and continue selling good quality vaporators to the settlers for a low price."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Neb Munb was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears in the Anchorhead cantina, where he gives Republic players the mission \"The Hunted\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}