{"url": "Nebulon_Ranger", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Crescent-X9", "Category:Galactic Republic starships", "Category:Jedi starships"], "nodes": [{"tag": "h1", "text": "Nebulon Ranger"}, {"tag": "p", "text": "The Nebulon Ranger was a modified Crescent-X9 starship that belonged to Jedi Knight Cay Qel-Droma. Originally an ordinary space transport, the Ranger was modified extensively by Qel-Droma, who transformed it into what he considered a very trustworthy vessel. In 4000 BBY, Qel-Droma, his brother Ulic, and the Twi'lek Tott Doneeta were sent to the world of Onderon by Jedi Master Arca Jeth to bring peace to the long-lasting Beast Wars planetary conflict. After traveling across the galaxy to the Inner Rim world, the three Jedi were enlisted to retrieve Onderonian Queen Amanoa's kidnapped daughter. In the search for the missing Princess over the planet's forests, the Nebulon Ranger was shot down by a seeker-torpedo fired by the Beast Riders, a group of exiled dissidents fighting Onderon's monarchy. The damage was reparable, however, and after discovering that Princess Galia had staged the kidnapping with the Beast Riders to escape the monarchy's use of the dark side, the Jedi joined the Beast Riders' side. The Ranger was repaired and flown back toward the capital city of Iziz with the intention of negotiating for peace. Although Amanoa rejected their overtures, she and her army were ultimately defeated in the final battle of the Beast Wars, during which the Nebulon Ranger saw minimal action."}, {"tag": "p", "text": "The Nebulon Ranger experienced continued service over the next several years, including an errand to bring Vultan Jedi Oss Wilum to Onderon in 3998 BBY. The following year, the Ranger was involved in a mission to the planet Empress Teta. Ulic Qel-Droma had gone undercover in the Krath, a dark-side sect that had taken control of the Empress Teta system. However, after worries that Qel-Droma was in too deep, the Ranger transported Cay Qel-Droma, Tott Doneeta, and fellow Jedi Nomi Sunrider to Empress Teta, where Sunrider descended in an escape pod, hoping that she could find a way to contact Ulic on the planet below. However, when she was forced to escape from a Krath prison, Cay and Doneeta swooped in on the Ranger, blasting attacking Krath soldiers and rescuing Sunrider. Despite their best efforts, Ulic ultimately refused to join them, and by 3996 BBY, had become a full-fledged Sith under the tutelage of Dark Lord of the Sith Exar Kun. Together they waged war against the Galactic Republic and the Jedi Order, and after the Battle of Kemplex IX caused a supernova in the Cron Cluster; the shock wave from the nova headed directly toward the Jedi academy world of Ossus. During the scramble to salvage as much Jedi knowledge as possible before the shock wave hit, Ulic Qel-Droma and Exar Kun descended upon Ossus in order to steal Jedi artifacts for their own purposes. Their arrival was noticed by Cay, who went up in the Nebulon Ranger in order to meet his brother. However, things escalated, and the Nebulon Ranger ended up getting shot down after a dogfight between the two brothers. Several hours later, the shock wave destroyed the remains of the Ranger."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Crescent-X9 starship manufactured by Krasten Shipyards, the Nebulon Ranger was relatively small and had a length of just twenty-five meters. It was well-armed, however, boasting four laser cannons, two concussion missile launchers, two proton torpedo launchers and a pulse-wave cannon, all of which were controlled from a gunnery station in the cockpit. Each concussion missile launcher could hold up to eight missiles each, while the proton torpedo launchers could hold up to six. The Nebulon Ranger featured eight deflector shield generators that provided full hull protection. However, they were a great power drain, and therefore the deflector shields were raised only in combat. Thus, the Nebulon Ranger was highly vulnerable to a surprise attack. The Nebulon Ranger could hold up to twenty metric tons of cargo, and in addition could hold enough consumables to last the crew two months. The ship required two crewmembers and could accommodate four passengers. The Ranger was a multi-sectioned ship, with the two main series of engine arrays located on a right-angle frame, allowing the ship an easy way to separate the engines and granting better maneuverability without the need for maneuvering jets."}, {"tag": "p", "text": "The ship featured retractable wings that were typically extended during subspace flight but retracted during landing. The heavily armored main wing contained the fuel tanks, which fed into the ship's six AlderaanMotors power generators and engines. It also held the Ranger's airlock and a sensor array pylon. Each wingtip featured a retractable, rotating laser cannon, and a more powerful cannon was located at the base of the second engine array. The cockpit was in between the ship's forward mandibles, and opened into the living and cargo sections in the center. The main boarding ramp and emergency escape hatch were located behind the cockpit, and three escape pods were mounted below the pulse cannon. The Ranger had a cargo bay that was sectioned into several compartments, and contained life support, gravity, and atmosphere controls. Smaller vehicles could be kept in the bay, and the ship featured a drop bay between the engines to deploy them as quickly as possible. To this end, short-range airspeeders were often kept in the cargo bay. The Nebulon Ranger was modified extensively by its owner, Jedi Knight Cay Qel-Droma. Qel-Droma fitted the Ranger with a better hyperdrive, and upgraded the power couplings for faster sublight speed."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Beast Wars of Onderon"}, {"tag": "p", "text": "Originally an ordinary space transport, the Nebulon Ranger eventually fell into the hands of Jedi Knight Cay Qel-Droma. Qel-Droma spent a great deal of his spare time tinkering with the ship and making many modifications, including the addition of a new hyperdrive and upgrades to the power couplings for better sublight speed. At the time, Qel-Droma, along with his brother Ulic and their Twi'lek friend Tott Doneeta, was an apprentice to Jedi Master Arca Jeth. In 4000 BBY, the three were training on the planet of Arkania when Jeth gave them a mission: to travel to Onderon, a war-torn world that was embroiled in a long-running conflict between the aristocracy of the walled city of Iziz and exiled criminals known as the Beast Riders, and bring peace. The group departed at once in the Nebulon Ranger, traveling across the galaxy to Onderon. The Ranger crossed the orbit of the moon Dxun and circumnavigated the planet, finally coming to within viewing distance of Iziz. However, on the final approach to Iziz the Ranger was attacked by a group of Beast Riders on their flying drexl mounts, and although Doneeta prepared to fire on the exiles, Ulic Qel-Droma refused to allow him to retaliate. Instead, they flew the ship right through the Beast Rider swarm toward Iziz without firing a shot, and finally landed at the Iziz Royal Palace after receiving covering fire from several Iziz defense towers on the city walls."}, {"tag": "p", "text": "The three Jedi went to meet with Amanoa, Queen of Onderon, and her daughter Princess Galia, but during their meeting the same group of Beast Riders that attacked the Nebulon Ranger on its approach to Iziz broke into the palace and kidnapped the Princess. Vowing to retrieve her, the Jedi followed the fleeing Beast Riders in the Nebulon Ranger. However, the Beast Riders fired a seeker-torpedo at the ship, which hit the Ranger before Tott Doneeta could activate the deflector shields. The torpedo caused major damage to the Ranger, which went into a downward spiral, and with the lateral fins not responding and the systems computer down, the ship crash-landed in Onderon's forests. However, the Jedi used the deflector shields to cushion the impact with the planet's surface, and although the lateral fins were damaged and the sublight transponder was gone, the damage was reparable. Going in search of the Beast Riders, they ended up discovering that Queen Amanoa and King Ommin of Onderon were dark-side cultists that worshiped dead former Dark Lord of the Sith Freedon Nadd. The Jedi worked alongside the Beast Riders to formulate a plan to end the Beast Wars—Galia and Beast-Lord Oron Kira, whom she had run away to marry, would join the Jedi on the Nebulon Ranger and fly to Iziz to try to convince Queen Amanoa to peacefully end the war. If that failed, Oron Kira's father Modon would lead a great Beast Rider army against Iziz."}, {"tag": "p", "text": "Cay Qel-Droma was able to repair the Nebulon Ranger in less than a day, and the Ranger soon took flight for Iziz, with Galia and Oron Kira on board and followed by a Beast Rider escort. However, the Beast Riders piqued the attention of the Iziz defense guns, which immediately fired upon the ship and its escort. Cay Qel-Droma frantically contacted the Iziz Royal Palace, telling them that they had Princess Galia in tow, which prompted the guns to hold their fire and allow the Nebulon Ranger to land. Queen Amanoa rejected their peaceful overtures, and the Beast Riders subsequently attacked Iziz. The exile army won the battle, assisted by the sudden arrival of a battle meditation–wielding Arca Jeth. Queen Amanoa died at the conclusion of the battle, her dark-side power having fled her; Oron Kira and Galia soon consecrated their marriage under the laws of the Galactic Republic, ascending to the positions of King and Queen of Onderon respectively."}, {"tag": "h3", "text": "Encounter with the Krath"}, {"tag": "p", "text": "In 3998 BBY, the Nebulon Ranger was involved in another conflict. The Freedon Nadd Uprising, where Naddist cult members went into open rebellion, threw Iziz into turmoil. Hoping to reduce the dark-side presence still in the city, King Oron Kira and Queen Galia led a grand funeral procession through Iziz's streets, after which the sarcophagi of both Freedon Nadd and Amanoa would be moved to a new tomb on the Dxun moon. The Nebulon Ranger was used to bring in other Jedi to quell the Naddist uprising, specifically the Vultan Oss Wilum, who was flown in from the Outer Rim by Tott Doneeta. The Ranger landed during the funeral procession, and was left empty when Doneeta and Wilum left to meet the other Jedi present, including Master Jeth and the Qel-Droma brothers."}, {"tag": "p", "text": "Although the Freedon Nadd Uprising was soon put down, by the next year the Jedi faced a new threat, and the Nebulon Ranger was put into action yet again. A Sith cult known as the Krath rose to power in the Empress Teta system, and after an attack on a Jedi conclave which left Master Arca Jeth dead, Ulic Qel-Droma volunteered to go to Empress Teta and infiltrate the Krath, hoping to destroy it from inside. However, Qel-Droma's friends and fellow Jedi, still in possession of the Nebulon Ranger, began to grow worried about his well-being, and decided to rescue him. Cay Qel-Droma, Tott Doneeta, and fellow Jedi Nomi Sunrider, who was romantically involved with Ulic, subsequently journeyed to Empress Teta in the Nebulon Ranger. They launched Sunrider onto the planet below in an escape pod, hoping that she could find a way to contact the wayward Qel-Droma. After the ejection of the escape pod, Qel-Droma and Doneeta hid the Ranger in the shadow of the Tetan Moon, waiting for a signal from Sunrider. Sunrider was soon captured by the Krath, but escaped; grabbing a comlink from a fallen guard, she told Doneeta and Qel-Droma to come and rescue Ulic. The Nebulon Ranger came in from the Tetan Moon at top speed, killing several Krath soldiers with its laser cannons and finally landing in the streets of the Tetan capital city, Cinnagar, near Sunrider's location. Although they were able to come in contact with Ulic, he refused to join them, and even attacked them with the Force; pursued by dozens of Krath soldiers and ships, they were forced to abandon Ulic and flee to hyperspace in the Nebulon Ranger. They subsequently returned to the Jedi world of Ossus in the ship to determine their next step."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "The Nebulon Ranger was called into action again in 3996 BBY during the Great Sith War, where Ulic Qel-Droma, now a Sith apprentice, and his Sith Master Exar Kun led an army against the Galactic Republic and the Jedi Order. That year, a supernova caused by the destruction of the Cron Cluster of stars during the Battle of Kemplex IX created a shock wave that headed directly for Ossus. Knowing that the shock wave would kill all life on the planet and destroy Ossus' famed Great Jedi Library, the Jedi present, including Cay Qel-Droma, Tott Doneeta, and Nomi Sunrider, tried to save as much Jedi knowledge and artifacts as they could in what little time they had. The Nebulon Ranger was one of many ships participating in this evacuation. However, Exar Kun and Ulic Qel-Droma descended on Ossus soon after, with the intent of stealing artifacts for themselves. Their arrival was witnessed by Ulic's brother Cay, who could sense Ulic's presence in his ship. Cay sprinted for the Nebulon Ranger and took to the skies, but Ulic was not receptive to his brother's greetings and tried to evade Cay's pursuit. However, Cay followed, targeting laser strikes against his brother's engines. Ulic proved the better pilot on that day, however, slipping behind the Ranger and hitting it with several precise blasts. Severely damaged and at risk for explosion, the Nebulon Ranger crashed onto the planet's surface, but Cay was able to get out alive."}, {"tag": "p", "text": "Although Cay Qel-Droma's deft piloting preserved his life, the Nebulon Ranger was almost totally destroyed. His brother Ulic soon came upon the scene, and the two brothers ended up dueling with their lightsabers. However, Ulic proved too much for Cay, and Cay was slain near the remains of the Ranger. Several hours later, the shock wave from the Cron Supernova reached Ossus, destroying what was left of the Nebulon Ranger."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Nebulon Ranger belonged to Cay Qel-Droma, who heavily modified the ship, transforming it from an ordinary space transport to a trusty vessel fit for a Jedi. Qel-Droma treated the ship as his most prized possession, spending much of his free time modifying it. As such, he held an intimate knowledge of the ship's inner workings and could make major repairs in very little time, as demonstrated after the Ranger was hit by a seeker-torpedo on Onderon. His brother Ulic flew the ship often as well, including during their mission to Onderon. The Qel-Droma brothers were not the only ones to utilize the Nebulon Ranger, however, as Tott Doneeta flew the ship by himself at least once. Cay Qel-Droma was the last to ever operate the Nebulon Ranger above Ossus in 3996 BBY, shortly before its destruction by the Cron Supernova's shock wave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nebulon Ranger first appeared in Ulic Qel-Droma and the Beast Wars of Onderon, the first story arc of the Star Wars: Tales of the Jedi comic-book series, written by Tom Veitch and released in 1993. The Ranger appeared in the Freedon Nadd Uprising, Dark Lords of the Sith, and The Sith War story arcs. The ship was also featured in the Tales of the Jedi audio adaptation and the Dark Lords of the Sith audio drama. The Ranger was drawn by three separate artists: Christian Gossett—who originally designed the ship—Tony Akins, and Dario Carrasco, Jr. Further information on the Nebulon Ranger's history and technical layout was given in The Essential Guide to Vehicles and Vessels, the Tales of the Jedi Companion, and the Power of the Jedi Sourcebook. In 2008, the Nebulon Ranger was given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}