{"url": "Nebulon-Q_Swoop_Racer", "categories": ["Category:Legends articles", "Category:Mobquet Swoops and Speeders products", "Category:Swoops"], "nodes": [{"tag": "h1", "text": "Nebulon-Q Swoop Racer"}, {"tag": "p", "text": "The Nebulon-Q Swoop Racer, also known as the Nebulon-Q racing swoop, was a model swoop in the same Mobquet-manufactured line as the Nebulon-R Racer and the Nebulon-S Racer."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Nebulon-Q Swoop Racer was a single seat swoop bike manufactured by Mobquet Swoops and Speeders. Measuring three Imperial standard meters long, the swoop could reach speeds of 600 kilometers per hour, with its ion engines and had a flight ceiling of 350 kilometers. The Nebulon-Q had a cargo capacity of two kilograms and was sold without weapons. They sold for 5,500 credits new, and 1,050 credits used, and they were available for sale throughout the galaxy although their sale was licensed. It was larger than the Nebulon-R Racer."}, {"tag": "p", "text": "The craft was powered by Mobquet's AE318 swoop engine delivering thrust through two overcharged turbofans and featured a precise avionics suite."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Nebulon-Q Swoop Racer had a reputation for being a \"muscle swoop\", favored by pirates swoop gangs and delinquents throughout the Outer Rim Territories. It was additionally marketed toward professional swoop racing teams. Built for speed, the Nebulon-Q contained minimum safety features including a safety strap that was rarely used and steering control surfaces. It was succeeded by the Flare-S swoop."}, {"tag": "p", "text": "The Dark Star Hellions utilized Nebulon-Q Swoop Racers, as did The Skulls, a swoop gang based in the Hook Nebula, used modified Nebulon-Q swoops that could achieve speeds of 750 kmh, had a flight ceiling of 50 meters, and were armed with a light blaster cannon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}