{"url": "Neddoo", "categories": ["Category:Legends articles", "Category:Ewoks", "Category:Males"], "nodes": [{"tag": "h1", "text": "Neddoo"}, {"tag": "p", "text": "Neddoo was an Ewok male who lived on the Forest Moon of Endor. In 3 ABY, he was attempting to repair his hut, but the Ewok Teebo, who was being affected by a loonee bird, threw a bundle of reeds at it, destroying the whole thing. Neddoo was angered by this move and went to Chief Chirpa to complain."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Neddoo was an Ewok male member of an Ewok tribe in Bright Tree Village on the Forest Moon of Endor. In 3 ABY, when Neddoo needed to once again repair his hut, the young Ewok Teebo, who was under the influence of a loonee bird, approached him, asking what he was doing. Neddoo explained that he was strengthening his home's support rods, and he asked Teebo to help him by passing him a bundle of reeds. Instead of doing so usefully, Teebo used a wagon to launch the bundle at a startled Neddoo, which caused the Ewok to crash into his house, destroying it."}, {"tag": "p", "text": "Teebo laughed at Neddoo, who was shocked that the Ewok scout would do such a thing. It was then that Neddoo caught the effect of the loonee bird, and he too began laughing at his plight, with Teebo encouraging such mirth. However, once Teebo left, the effect wore off, and Neddoo questioned aloud what he was luaghing at. He later showed up at the hut of Chief Chirpa along with several other victims of Teebo's pranks in order to complain. By that time, Neddoo's arm was in a sling, and he explained to Chirpa that Teebo had destroyed his hut. Shortly after, the Ewok medicine man Logray told everyone that Teebo was had been behaving strangely due to the loonee bird."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Teebo considered Neddoo to be the \"biggest sourpuss\" in Bright Tree Village. Neddoo was very angry at Teebo after his hut was destroyed, and he questioned why he had pulled such a prank. After Teebo's laughter was done affecting him as well, Neddoo was surprised at himself for laughing at such an incident. He then felt the need to complain about what Teebo had done to Chief Chirpa. Neddoo's fur was gray and blue, and he had black eyes. He also sported a white beard."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Neddoo wore green clothing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Neddoo appeared in the seventh issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published on February 4, 1986."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}