{"url": "Neebo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Females", "Category:Individuals of unspecified species", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Neebo"}, {"tag": "p", "text": "Neebo was a female Jedi Master who served the Jedi Order during the last decades of the Galactic Republic. Neebo went missing on a mission to the moons of Sanjin, and her lightsaber was later found by Jedi Master Kit Fisto in 22 BBY, in the castle of the Separatist General Grievous, a Jedi killer."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Neebo was a Force-sensitive female who lived during the last decades of the Galactic Republic. She joined the Jedi Order and eventually reached the rank of Jedi Master. Sometime before fellow Jedi Master Kit Fisto's mission to the third moon of Vassek in the year 22 BBY, Neebo went on a mission to protect refugees on the moons of the Colonies planet Sanjin. Neebo went missing in the conflict, and Fisto later found her lightsaber in the trophy room of the Confederate cyborg General Grievous—who often collected the weapons of Jedi he had killed—during his infiltration of the General's castle on the third moon of Vassek. Fisto examined Neebo's weapon and then went on to duel Grievous."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Neebo was a Force-sensitive Jedi Master. In combat, she wielded a lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Neebo was first mentioned in The Complete Star Wars Encyclopedia, released on December 9, 2008. She was later referenced in the corresponding episode guide for \"Lair of Grievous,\" part of the first season of the Star Wars: The Clone Wars television series, which aired on December 12, 2008. Although the storyline suggests that the Jedi Master was killed by Grievous, this has not been confirmed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}