{"url": "Needle_(maneuver)", "categories": ["Category:Canon articles", "Category:Starfighter tactics"], "nodes": [{"tag": "h1", "text": "Needle  (maneuver)"}, {"tag": "p", "text": "The Needle, named by New Republic pilots, was a combat maneuver used by Imperial TIE fighter pilots during the Galactic Civil War, in which a flight of TIEs would pin and demolish an enemy starfighter after it had nowhere to go."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The manuever was a favorite of Imperial TIE fighter pilot, Garl Lykan, of the 204th Imperial Fighter Wing, in which he used it in combat against New Republic starfighter pilots."}, {"tag": "h3", "text": "Oridol Cluster"}, {"tag": "p", "text": "Some weeks after the Battle of Endor in 4 ABY, Lykan used the maneuver to kill one B-wing pilot from Hound Squadron, named Rawn, during the 204th Imperial Fighter Wing's attack on the New Republic frigate Hellion's Dare in the Oridol Cluster. Rawn was pinned and demolished by a flight of TIEs. Following Rawn's death, the pilots of Riot and Hound Squadron named the maneuver the Needle, recognizing it as a favorite of that particular Imperial pilot, who they nicknamed \"Snapper.\" Lykan later attempted a variant of the Needle, but was disrupted by an A-wing pilot from Riot Squadron, named Sata Neek."}, {"tag": "h3", "text": "Cerberon system"}, {"tag": "p", "text": "Around 5 ABY, Lykan again used the Needle, to kill a New Republic pilot, named Ubellikos, after a small New Republic strike force attacked the 204th Imperial Fighter Wing's temporary base at the Core Nine mining megafacility on the planet Troithe. Ubellikos was pinned to the ground and left with nowhere to go, before being killed."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following Garl Lyken's death during a battle in the Ghonoath system, the 204th Imperial Fighter Wing continued to utilize the Needle. During Lyken's funeral, Darita sketched out maneuvers on the floor for several of the newer recruits. Yrica Quell realized she was describing what the New Republic's Alphabet Squadron had come to know as Snapper's Needle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Needle was first mentioned the 2019 novel Alphabet Squadron by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}