{"url": "Assault_on_the_Death_Star", "categories": ["Category:Legends articles", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Assault on the Death Star"}, {"tag": "p", "text": "The Assault on the Death Star was a mission carried out by Alliance Special Forces operatives Kyle Katarn, Corwin Shelvay, Shira Brie, and Erling Tredway aboard the Second Death Star. Shelvay devised the operation in order to thwart the Galactic Empire's plans to destroy the Rebel supply base on D'rinba IV using the battlestation's superlaser."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Sometime after a failed mission by the Alliance to Restore the Republic to destroy the Galactic Empire's Second Death Star, Galactic Emperor Palpatine ordered that the space station be relocated to the Outer Rim's Endor system, near the forest moon of Endor, so that it could be completed in secrecy."}, {"tag": "p", "text": "En route from the Mid Rim, however, Sith Lord Darth Vader was informed that probe droids revealed the existence of a large Alliance to Restore the Republic supply base on the planet D'rinba IV, and notified Emperor Palpatine of the Death Star's temporary diversion to the D'rinba system, within the Mid Rim's Sombure sector. Vader, driven by a hatred for the Rebellion, took two Star Destroyers as escorts, his personal flagship Executor and the Colossus. The Sith Lord intended to have D'rinba IV close enough to be within the battlestation's superlaser range, so that both the Rebel base and the planet could be completely destroyed."}, {"tag": "p", "text": "The Rebel Alliance, however, managed to intercept the Empire's plans, and assembled some of their best troops: a small team of Force-sensitives and Alliance Special Forces members, with the objective of disabling the Death Star superlaser before it got too close to the planet. Commander and Jedi Knight Corwin Shelvay set up the operation and was joined by fellow operatives Shira Brie, Erling Tredway and Kyle Katarn."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Aboard a stolen Imperial freighter, the operatives infiltrated the space station through the Shuttle Bay, located on the Outer Level. Shortly thereafter, Darth Vader arrived at the Death Star from the Executor, aboard a Lambda-class T-4a shuttle. Vader then ordered the admiral in charge of the battlestation to prepare for D'rinba IV's destruction, and soon felt the presence of the Rebel infiltrators. The Sith Lord quickly alerted security, and stationed stormtroopers began to search for the operatives."}, {"tag": "p", "text": "Despite Vader's awareness of the Rebels, Brie, Tredway, Katarn and Shelvay soon managed to access the Death Star's Inner Level, and planted six explosives in five control rooms and the station's reactor core. Meanwhile, Star Destroyer Colossus reported that the Rebellion was preparing an evacuation from D'rinba IV. The team was able to disable the Death Star's superlaser before it got too close to the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Assault on the Death Star was introduced in Star Wars: The Interactive Video Board Game, scripted by Christian Marnham and released in 1996. It was later referenced by part one of The Dark Forces Saga, a series of online adventure scenarios for the Wizards of the Coast RPG line published on their website. Written by Abel G. Peña, it canonized four of the playable characters as Kyle Katarn, (from Star Wars: Dark Forces), Shira Brie (from Marvel Comics Star Wars series), Corwin Shelvay (from West End Games' Star Wars RPG material) and Erling Tredway (also from West End Games' Star Wars RPG material)."}, {"tag": "p", "text": "The Interactive Video Board Game's opening crawl and its instruction manual both reveal that the Rebel Alliance's goal in the mission was to disable the Death Star, while The Dark Forces Saga specifically states that the Rebel objective was only to disable the battlestation's superlaser. This article favors the newer source material."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}