{"url": "Assault_on_the_Flesh_Raider_command_base", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles with conjectural titles", "Category:Battles of the Flesh Raider uprising"], "nodes": [{"tag": "h1", "text": "Assault on the Flesh Raider command base"}, {"tag": "p", "text": "During the conflict with the planet Tython's native Flesh Raiders in 3643 BBY, Jedi Master Orgus Din led a strike force of Jedi Knights and Masters in an attack against a Flesh Raider command base in the Tythos Ridge mountains."}, {"tag": "h2", "text": "The assault"}, {"tag": "p", "text": "In 3643 BBY, the native Flesh Raiders of the planet Tython came into conflict with the Jedi Order and the Twi'lek Pilgrims of Kalikori village. When the Jedi learned the location of a Flesh Raider command base in the nearby Tythos Ridge from the village's scouts, Jedi Master Orgus Din gathered several Jedi Knights and Masters to attack the base while he sent his newest apprentice to deactivate the shield generator protecting it."}, {"tag": "p", "text": "The Padawan was successful in the mission, allowing the strike team to attack and destroy the command base, but the apprentice was also forced to defend Kalikori from enemy saboteurs while the main assault was underway. During their attack, the Order discovered the locations of many smaller camps across the planet, and the Jedi Council was forced to send all available Jedi to eliminate them in a series of simultaneous strikes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The assault appears in the 2011 massively multiplayer online role-playing video game Star Wars: The Old Republic, occurring concurrently with the events of the Jedi Knight mission \"The Face of the Enemy.\" The assault's success leads directly into the following mission, where the player is tasked with the destruction of a camp in the Forsaken Den."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}