{"url": "Neeku_Vozo", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Colossus resistance members", "Category:Kadas'sa'Nikto", "Category:Males", "Category:Mechanics", "Category:Members of Team Fireball"], "nodes": [{"tag": "h1", "text": "Neeku Vozo"}, {"tag": "p", "text": "Neeku Vozo was a Kadas'sa'Nikto male mechanic who served as a member of Team Fireball on the Colossus. Neeku befriended the undercover Resistance spy Kazuda Xiono during his mission on the Colossus to investigate First Order influence. During the hunt for the Colossus, Neeku served as the station's chief engineer."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Neeku Vozo hailed from the planet Kintan and came from a long line of bantha herders, although he was a sort of prodigy amongst his tribe. While growing up, Neeku heard many heroic tales about pirates who robbed the rich to and gave to the poor, leading him to have innocent ideas about those criminals. Vozo's parents did not understand why he wished to become a mechanic, but they sold their most prized bantha calves so that he could be a great engineer. At some point, Vozo had a pet named Lucky, who reminded him of his home. Lucky eventually died, and Vozo would subsequently eat it."}, {"tag": "p", "text": "During the New Republic era, Neeku Vozo had found work as a mechanic at the former New Republic starfighter pilot Jarek Yeager's repair shop on the Colossus, a supertanker fuel depot on the Outer Rim ocean world of Castilon. He worked alongside the female human Tamara Ryvora and the astromech droid R1-J5 \"Bucket.\""}, {"tag": "h3", "text": "Enter Kazuda Xiono"}, {"tag": "p", "text": "In 34 ABY, Neeku overheard two visitors: the Resistance pilot Poe Dameron and the former New Republic starfighter pilot–turned Resistance spy Kazuda Xiono. Neeku was familiar with Dameron and greeted him, telling him that it was a long time since they had met. Misunderstanding Xiono's remark about his childhood dream of becoming the best starfighter pilot in the galaxy, Neeku proclaimed to a crowd at Aunt Z's Tavern that Kaz was the \"best starfighter pilot in the galaxy.\""}, {"tag": "p", "text": "After Kaz got caught in a brawl sparked by Grevel's rigged holo-darts game, Kaz tried to correct his remark about being the best starfighter pilot in the galaxy. Taking things literally, Neeku took offense and thought that Kaz had been deceiving him. To make amends with Neeku, Kaz reluctantly agreed to prove he was the best starfighter pilot galaxy by racing with the elite Ace Squadron pilot Torra Doza, the daughter of Captain Imanuel Doza, who ran the Colossus."}, {"tag": "p", "text": "Neeku later accompanied Kaz to Yeager's repair shop in order to borrow Tam Ryvora's racer Fireball. Due to the ramshackle state of the Fireball, Yeager sent Neeku and Kaz to obtain spareparts from Flix and Orka's Office of Acquisitions. When Kaz asked Neeku for helped in procuring these parts, Neeku told him that the pilot had to pay for his own parts. When Neeku pleaded on Kaz's behalf, Orka agreed to give him secondhand parts in return for obtaining a gorg for lunch."}, {"tag": "p", "text": "The following day, Kaz took part in the race. Due to the ramshackle state of the Fireball, the ship sunk into the sea after the engines exploded. After Kaz was rescued from the sea, Neeku expressed relief that Kaz had survived without a scratch and remarked that he was an exceptional pilot. Yeager, who was a friend of Poe and was aware that Kaz was a Resistance spy, agreed to employ Kaz as a mechanic so that he could maintain a cover on the Colossus. Kaz was also accompanied by Poe's BB-series astromech droid BB-8, who was tasked with minding the young spy."}, {"tag": "h3", "text": "Kaz's friend"}, {"tag": "p", "text": "While Yeager tolerated Kaz's presence and Tam and Bucket resented the newcomer, Neeku remained on friendly terms with Kaz. Neeku took an interest in Kaz's lucky trophy. In return, Neeku told Kaz the tragic story of his former pet Lucky. Due to Kaz's lack of prior mechanical expertise, Yeager tasked Neeku with supervising Kaz's repairs on the Neimoidian visitor Hallion Nark's starship."}, {"tag": "p", "text": "Unknown to Neeku and the others, Nark was a spy in the service of the pirate Kragan Gorr and his Warbird gang. When the Warbirds attacked the Colossus under the cover of a triple dark storm, Neeku and the rest of Team Fireball took shelter. Kaz used Yeager's machines to jam the pirates' communications, forcing them to retreat."}, {"tag": "p", "text": "When Kaz struggled to repair an engine, Neeku remained supportive and counselled him that an engine was not sentient. After the racer and troublemaker Jace Rucklin and his associates befriended Kaz, Neeku warned Kaz to be careful with the youths, describing them as \"lazy, always laughing, pulling pranks on others, and not focusing on their work.\""}, {"tag": "p", "text": "Neeku's warnings was proven right when Jace took advantage of a visit to Yeager's office to steal a bottle of volatile hyperfuel. After the bottle was discovered missing, Neeku warned Kaz that hyperfuel was highly unstable and caused terminal blowouts. Realizing that Rucklin had stolen the hyperfuel, Kaz managed to stop Rucklin but destroyed racer in the process."}, {"tag": "h3", "text": "Visiting Doza Tower"}, {"tag": "p", "text": "After testing comlinks during a blackout, Neeku and his colleagues Kaz and Tam went to Aunt Z's Tavern for a meal of Cirilian Sour Pastes. After enduring a second black out, the trio encountered the Ace leader Hype Fazon, who had a celebrity status at the Colossus. While Neeku and Kaz were friendly towards Hype, Tam was hostile towards the Ace leader since she was bitter that her former friend Hype had abandoned her during her racing days."}, {"tag": "p", "text": "Shortly later, a First Order delegation led by Major Elrik Vonreg visited the Colossus, intending to negotiate the supply of fuel with Captain Imanuel Doza. Knowing of Kaz's interest in the First Order, Neeku tried to make conversation with the First Order stormtroopers but they brushed him aside. As a precaution, Kaz confiscated the other half of the comlink."}, {"tag": "p", "text": "Seeking to win hearts and minds, Hype invited Neeku and his friends to the High Tower, an offer which Neeku and Kaz accepted. Tam reluctantly came along. While Neeku and Tam socialized with Hype, Kaz took the opportunity to spy on Captain Doza's meeting with Major Vonreg. Kaz was later forced to flee when stormtroopers spotted him."}, {"tag": "p", "text": "While having drinks with Tam at Aunt Z's Tavern, Neeku, Tam, and the other patrons saw navigating over the ledge to flee the stormtroopers. Neeku joined the other patrons in cheering for Kaz while Tam was worried for the young mechanic. Kaz managed to escape into a blast door. After returning to Yeager's repairs, Kaz handed Neeku back his comlink. Neeku was happy to be reunited with his comlink but Kaz warned him not to use it when they were in the same room."}, {"tag": "h3", "text": "Orphans of Tehar"}, {"tag": "p", "text": "Neeku helped Tam and Kaz to install an acceleration compensator. After Kaz accidentally damaged the compensator, Neeku took pity on Kaz and paid for his glass of water at Aunt Z's Tavern. When Kaz heard about a bounty on two missing children and decided to collect the bounty in order to purchase a new compensator, Neeku told Kaz that he was not a bounty hunter. However, Kaz convinced Neeku that he could purchase a new compensator for Tam and help the children; making it a win-win situation."}, {"tag": "p", "text": "Neeku along with Kaz and BB-8 soon encountered the children Kel and Eila in the Colossus marketplace. Kaz tried to tell the children he was here to help them but they distrusted him and ran away. Neeku then told Kaz he had friends who could help them find the children. Neeku led Kaz and BB-8 to the engineering deck, which was the domain of the Chelidae or \"Shell folk.\" The Chelidae agreed to help."}, {"tag": "p", "text": "Shortly later, Neeku along with Kaz and BB-8 were summoned by the security droid 4D-M1N for a meeting with Captain Doza at Doza Tower. Doza queried about Kaz's interest in the children before dismissing them. Later, Neeku and Kaz received word from the Chelidae leader that his people had found Kel and Eila. Meeting the children, Neeku, Kaz, and BB-8 learnt that the children were the survivors of a First Order massacre on Tehar perpetrated by Kylo Ren and that the First Order was hunting them down to eliminate all survivors of the massacre."}, {"tag": "p", "text": "Since Eila was hurt in the leg, Neeku accompanied Kel and Kaz to the marketplace to find a herb. However, First Order forces led by Commander Pyre arrived to hunt down the children, having been tipped off by Captain Doza. After escaping back to the engineering deck, Kaz came up with a plan which involved tricking the First Order into thinking that Kel and Eila had jumped to deaths below. Kaz's plan worked and the children were able to find refuge with the Chelidae. As a bonus, Kaz managed to placate Tam by obtaining an acceleration compensator from the Chelidae."}, {"tag": "h3", "text": "Kaz's salvage run"}, {"tag": "p", "text": "Neeku was asleep when Kaz departed with Yeager on an early morning \"salvage run.\" Unknown to Neeku this salvage run turned out to be a starfighter training exercise with Kaz's mentor Dameron. While flying, the two Resistance pilots investigated a distress transmission in sector six of the Castilon system. They rescued a crew member named Synara San, who turned out to be a member of Kragan Gorr's Warbird gang."}, {"tag": "p", "text": "Later, Neeku was working in Yeager's repair station went BB-8 embarked on a wild chase searching for Kaz, who had been working on a targeting computer all that time."}, {"tag": "h3", "text": "The second pirate raid"}, {"tag": "p", "text": "Neeku and his fellow Team Fireball mechanics received a contract from Captain Doza to repair the station's air defense system's tracking computer. While working on the computer, Vozo discovered that they needed a new CoMar Tri-Tracker chip, an extremely rare military component. Since Neeku had a reputation as a \"chatterbox,\" Yeager ordered him to work in the garage and to delay his lunch break."}, {"tag": "p", "text": "After Kaz and Tam returned with a tracker chip provided by Synara San, Yeager allowed Vozo to take a break but issued orders to keep their operation secret. Vozo took it literally and muffled his mouth. Neeku muffling his mouth annoyed Kaz and Tam, who had trouble understanding his words. Later, Synara San visited to give Xiono some connector couplings. In truth, she wanted to confirm that the platform's air defense system was down."}, {"tag": "p", "text": "After Tam returned from her lunchbreak, Kaz asked Neeku about the chances of a pirate raid happening. Before Neeku could answer, Kragan Gorr and his pirates attacked the Colossus. During the attack, Neeku and Bucket hid inside the supply closet. Following the attack, Neeku recounted his and Bucket's ordeal to an exhausted Yeager, who had just returned from installing the tracking computer into the air defense system."}, {"tag": "h3", "text": "The Platform Classic"}, {"tag": "p", "text": "Neeku and his fellow crew were working on the Fireball racer when Tam informed about the upcoming Platform Classic race. When Kaz remarked that he heard a rumor that would make the Platform Classic the \"greatest race\" in the galaxy, Neeku thought that Kaz was joking. Shortly later, Neeku accompanied Yeager and the rest of Team Fireball to a meeting with Captain Doza, who wanted Yeager to compete in the Platform Classic against galactic racing champion Marcus Speedstar, Yeager's estranged younger brother."}, {"tag": "p", "text": "While Neeku and the other members of Team Fireball were delighted by the presence of Marcus Speedstar at the Platform Classic, Yeager was still hostile towards Marcus for causing the deaths of his wife and daughter. After returning to the workshop, Neeku asked Yeager why his brother had a different surname. Yeager was annoyed that Neeku thought that Speedstar was a proper surname."}, {"tag": "p", "text": "When Speedstar visited Yeager's garage in an attempt to mend relations with his older brother, Neeku introduced Yeager's Esral'sa'Nikto Oplock and astromech droid R4-D12 to his teammates. When Oplock howled, Yeager reassured Kaz and Tam that this was a traditional Esral'sa'Nikto greeting."}, {"tag": "p", "text": "Later, Neeku accompanied Yeager and the rest of the team to Aunt Z's Tavern where Yeager attempted to force Speedstar to pull of the race. Speedstar refused because he wanted to pay back his debts to the Guavian Death Gang to secure the release of his friend Oplock. Yeager's ploy backfired when Aunt Z and her patrons began betting on the two brothers."}, {"tag": "p", "text": "While Yeager was preparing his racer for the race, Neeku asked Yeager why he had stopped speaking to his younger brother. Without disclosing the details of their fallout, Yeager told Neeku that Speedstar had not been there when he needed him."}, {"tag": "p", "text": "Neeku and the rest of Team Fireball watched the Platform Classic on a holoscreen. During the descent phase, Neeku remarked that he could not bear to look. During the race, Yeager and Speedstar reconciled after Yeager realized that Speedstar truly cared for his friend Oplock. Yeager then pulled out near the finish line, allowing Speedstar to win the race and claim the prize money to pay Oplock's ransom. Neeku and the rest of Team Fireball were present when Yeager and Speedstar parted company on amicable terms."}, {"tag": "h3", "text": "Casual adventures"}, {"tag": "p", "text": "Neeku and his fellow Team Fireball members and Torra Doza later had a game of holo-darts at Aunt Z's Tavern. Xiono missed all three shots in his round. Bucket managed to hit the bull's eye twice but the third dart struck Xiono in the backside."}, {"tag": "p", "text": "As reward for his hard work, Yeager treated Neeku for lunch and allowed him to buy anything that he wanted. Neeku decided to buy a gorg from Bolza Grool's stall in the Colossus marketplace. However, the gorg escaped and led Neeku on a wild chase through the market. Following the chase, Neeku changes his mind and decided to have bantha milk instead. Yeager remarked to BB-8 that Neeku could have gotten a droid instead."}, {"tag": "p", "text": "Neeku was present with Ryvora when Xiono took a test flight in the Fireball. Xiono managed to circle the Fireball with Torra Doza's Blue Ace. However, the ship's throttle broke, causing Xiono to descend rapidly into Yeager's hangar. Xiono managed to regain control of the ship and land it safely. However, the Fireball's landing gear and canopy soon fell apart."}, {"tag": "h3", "text": "Neeku's new pet"}, {"tag": "p", "text": "Neeku and Xiono later visited Synara San at the Colossus loading docks seeking parts for the Fireball. Synara retrieved the wreckage of a Z-95 Headhunter from the the sea. They encountered a baby rokkna inside the Z-95 Headhunter's engine. Neeku quickly took a liking to the creature, thinking that it reminded him of a pet that he had as a hatchling back at home. To the consternation of Kaz and Synara, Neeku adopted the creature as his pet Bibo and hugged him."}, {"tag": "p", "text": "Neeku's new pet created tensions with his employer Yeager and colleagues Ryvora and Kaz. Despite Yeager's \"no pets\" policy, Yeager relented after Neeku promised to share his bunk and rations with Bibo. In spite of Neeku's efforts to keep Bibo contained, Bibo wrecked havoc around Yeager's garage, annoying Yeager and terrorizing the astromech droid Bucket. Having had enough of Bibo's disruptive behavior, Yeager ordered Yeager to get rid of Bibo."}, {"tag": "p", "text": "Unwilling to cast out his new pet, Neeku responded that he would also leave, provoking a gasp from Tam. When a shocked Yeager asks what he said, Neeku responded that he had asked nothing from him in all his years of service but that if he rejected Bibo he would resign. Bibo then ran away and Neeku chased after him. In response, Tam spoke up for Neeku's affection for Bibo and criticized Yeager for his perceived leniency towards Xiono."}, {"tag": "p", "text": "A distraught Neeku searched the Colossus marketplace for Bibo but found no sign of him. Tam consoled him and reassured Vozo that they would find Bibo. After hearing news about a disturbance in the engineering deck from Yeager, Neeku and Tam ventured down there where they met the Chelidae and the two human orphans Kel and Eila, who had found Bibo. Neeku introduced Tam to Kel and Eila, telling her that they were the \"shell folk\"'s helpers. Eila then sensed through the Force that something was coming for Bibo."}, {"tag": "p", "text": "Shortly later, a large rokkna attacked the Colossus. Due to Kaz and Synara's warning, Captain Doza managed to seal the station. Ace Squadron and Kaz in the Fireball attempted to drive away the giant sea creature but were unable to penetrate its hull. As the rokkna tightened its grip around the station, Tam and the other inhabitants of the Colossus urged Neeku to give up Bibo. After the rokkna peered through the viewport, Neeku realized that he had to give up Bibo in order to appease the sea creature."}, {"tag": "p", "text": "Taking a leap of faith, Neeku brought Bibo to the rokkna on an outlying platform. To the amazement of Neeku and Tam, the rokkna embraced Bibo. As a result, Neeku and the others realized that the rokkna was Bibo's mother. Tam comforted a distraught Neeku. Later, Kaz tried to cheer up Neeku by bringing a gorg as a pet. However, Neeku mistook the gorg for food and ate it instead."}, {"tag": "h3", "text": "Kaz's mechanical savvy"}, {"tag": "p", "text": "After Kaz had installed a new GX engine, repulsorlifts, and injectors, Neeku, Tam, and Yeager complimented Kaz for his improved mechanical skills. Kaz informed his colleagues that he obtained the parts from Flix and Orka in return for looking after their shop, the Office of Acquisitions. Kaz subsequently foiled a First Order plot to steal a phase connector."}, {"tag": "p", "text": "Neeku and Kaz were fixing a speeder bike when BB-8 annoyed Bucket, resulting in a spat between the droids. Later that night, the First Order hired the Warbird pirate gang to kidnap Captain Doza's daughter Torra Doza. They then turned on the pirates and rescued her, convincing Captain Doza to accept First Order \"protection.\""}, {"tag": "h3", "text": "The First Order occupation"}, {"tag": "p", "text": "After the First Order occupied the Colossus, Neeku noticed the arrival of TIE/fo space superiority fighters. Neeku was later present at Yeager's garage when stormtroopers visited it, seeking information about the whereabouts of Kaz's friend Synara San. Kaz managed to evade suspicions by pointing out that he had helped alert Captain Doza to the kidnapping of Torra. Later, Kaz enlisted Neeku's help in guiding him and Synara to the lower levels of the Colossus so that Synara could escape the First Order in an escape pod and rejoin the Warbirds."}, {"tag": "h3", "text": "The missing stormtrooper"}, {"tag": "p", "text": "During the First Order occupation, Neeku took part in a discussion with Kaz, Tam, and Yeager about the First Order and its forerunner, the \"Old Empire.\" Neeku shared Tam's view that the First Order provided security. Yeager countered that the First Order was little better than the Empire and took away freedom under the guise of providing security. Tamara, whose grandfather had worked as a factory worker under the Empire, disagreed that the Empire was evil. When she stormed out, Neeku followed her."}, {"tag": "p", "text": "When the refugees Kel and Eila came to Yeager's garage seeking Kaz's help, Neeku and Tam accompanied Kaz and discovered that the two children had knocked out a First Order stormtrooper known as CS-515. In order to ascertain that CS-515 had not reported the children, Kaz stole the stormtrooper's armor and infiltrated the First Order base, taking the opportunity to steal a data rod with intelligence on First Order fleet movements."}, {"tag": "p", "text": "While in the care of Neeku and company, CS-515 awoke and asked where he was. Neeku pretended to befriend the stormtrooper and told him that he was disoriented because he had been knocked unconscious. Gaining the stormtrooper's trust, Neeku knocked him unconscious with an electro-shock prod. After Kaz returned, they managed to put CS-515 back in his armor and hide. However, CS-515 was reprogrammed due to his \"erratic behavior,\" while Kaz was impersonating him."}, {"tag": "h3", "text": "The approaching storm"}, {"tag": "p", "text": "Neeku was servicing a racer with Tam, Bucket and Yeager when Xiono returned from a Mission to the Dassal system. When Neeku and Tam asked where he had been and the whereabouts of the Fireball, Xiono claimed that he had taken the fighter for a spin. When Neeku asked about BB-8, Xiono claimed that he had taken the droid to Takodana for repairs and that CB-23 was on loan. Neeku remarked that he missed BB-8."}, {"tag": "p", "text": "Later, Neeku suggested that Kaz and Tam compete in an upcoming race with the Aces the following week. Neeku was also present at Aunt Z's Tavern when the First Order attempted to set up a recruitment poster. Aunt Z objected to their presence. Later, the First Order cancelled all races on the Colossus as a security measure."}, {"tag": "p", "text": "Neeku and his fellow Team Fireball members later frequented Aunt Z's Tavern. While Neeku welcomed the security provided by the First Order, he expressed concerned at the restrictions created by the First Order garrison and communications blackout. Following the disappearance of the racer Hype Fazon, Aunt Z accused the First Order of having a role in his disappearance and hurled a propaganda poster at a stormtrooper patrol."}, {"tag": "p", "text": "Following the disappearance of Aunt Z, Neeku informed Kaz that Yeager was having a private meeting in his office. Kaz barged into the meeting and found Yeager chatting with Commander Doza, who was concerned that the First Order was holding people at the West Docks. When Neeku inquired about the meeting, Yeager claimed that they were organizing a social gathering to cheer people up."}, {"tag": "h3", "text": "Forming the resistance"}, {"tag": "p", "text": "Neeku and the rest of Team Fireball with the exception of Kaz were present when the garage was raided by Commander Pyre and his stormtroopers. Pyre had discovered that the Fireball had breached Sector Epsilon 51-3 and charged Team Fireball with conspiring against the First Order. Before Pyre could detain them, Bucket fired foam at the stormtroopers, allowing Neeku and most of Team Fireball to escape. However, Tamara surrendered, believing the situation to be the result of a misunderstanding."}, {"tag": "p", "text": "Neeku, who was not yet involved with the Resistance, was shocked to learn that Kaz was involved with the Resistance. Despite his shock, he stayed loyal to Yeager and Kaz. Reaching the engineering deck, Neeku, Yeager, Kaz, and CB-23 reunited with Bucket, Kel, Eila, and the Chelidae. Working in coordination with Captain Doza, they submerged the Colossus so that Yeager and Kaz could reach the top of Doza Tower and disable the transmitter, allowing Kaz to contact the Resistance. However, Yeager was captured and General Leia Organa was unable to send reinforcements to Castilon. In response, Kaz formed the Colossus resistance and recruited Neeku, CB-23, Kel, Eila, and the Chelidae as members."}, {"tag": "h3", "text": "Retaking the Colossus"}, {"tag": "p", "text": "Following the formation of the Colossus resistance, Neeku was privy to Kaz's plan to rescue Yeager and Captain Doza from First Order custody and escape to Hosnian Prime to bring back reinforcements. Struggling to come to terms with Kaz's double identity as a spy, Neeku initially did not believe that Kaz was the son of a senator."}, {"tag": "p", "text": "Before proceeding with their rescue mission, the Colossus resistance captured the hyperdrive chamber. Neeku along with Kel, Eila, and the Chelidae remained inside the chamber while Kaz and CB-23 tried to swim to Doza Tower. However, they were pursued by First Order SCUBA troopers, who trapped them below the engineering deck. At Kaz's plea, Neeku managed to depressurize the chamber, sucking out the SCUBA troopers."}, {"tag": "p", "text": "Kaz and CB-23 continued their mission by navigating through the corridors, making contact with Buggles and Torra Doza. Following the Hosnian Cataclysm, Kaz and Torra managed to free Yeager and Captain Doza. Working with Kaz and Torra, Neeku along with Kel and Eila flooded the corridors, flushing out many stormtroopers. While Kaz and the others tried to reason with Tamara Ryvora who had been won over by First Order Security Bureau Agent Tierny, Neeku and his team prepared the Colossus's launch, firing up its engines and preparing the hyperdrive."}, {"tag": "p", "text": "The Colossus ascended into space amidst a dogfight between Kaz, Yeager, Ace Squadron, the Warbird gang and Major Elrik Vonreg's squadron. After reaching space, the Colossus and its starfighters fled into hyperspace, escaping Commander Pyre's Star Destroyer. While Neeku had plotted a journey to the Ileenium system, he did not have enough time to put in all the coordinates."}, {"tag": "h3", "text": "Running from the First Order"}, {"tag": "h4", "text": "The rescued spy"}, {"tag": "p", "text": "Neeku was among those who greeted Kazuda Xiono, Jarek Yeager, Synara San, and Norath Kev upon their return from the skirmish on Varkana. Neeku commented that he found it delightful to see Xiono in stormtrooper armor once again, to which Xiono responded that the armor acted as more of a disguise than anything else."}, {"tag": "h4", "text": "The pirates' mutiny"}, {"tag": "p", "text": "At some point after liberating the Colossus from the First Order and escaping Castilon, Vozo was tasked by Kragan Gorr and the Warbird gang with repairing and reprogramming an old group of B2-series super battle droids. Vozo acted as if he was happy to help, having been lied to by the pirates, who told Vozo the droids were a gift and new security force for Captain Doza. However, in a stark contrast with his usual mentality, Vozo had in fact realized Gorr's deception, finding the sheer number of super battle droids concerning. Vozo reprogrammed the droids to initially carry out the assault, while he meanwhile reprogrammed lone B1-series battle droid, B1, to act as the super battle droids' commander in the final attempt to prevent the mutiny. Vozo was captured alongside Kazuda and Synara, and soon escaped with assistance from B1. It was at this time that Vozo activated the failsafe, allowing B1 to gain control of the super battle droids, banishing the Warbird gang from the Colossus."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Neeku Vozo was a male Kadas'sa'Nikto with black eyes and green skin. He interpreted everything very literally. Neeku easily befriended people but his tendency to interpret things literally would often cause confusion and trouble. While Neeku was initially upset that Kaz was \"not the best starfighter pilot in the galaxy,\" he forgave him after Kaz took part in a race with Torra Doza. Though Kaz lost and even crashed his ship, Neeku regarded Kaz as an exceptional pilot since he escaped uninjured."}, {"tag": "p", "text": "Neeku's tendency to take things literally led him to muffle his speech when Yeager ordered him to maintain the secrecy of their tracking computer project. On another occasion, Neeku thought that Marcus Speedstar's surname was a real name, not realizing that it was a nickname. Neeku held Speedstar in high regard due to reputation as a galactic racing champion. Neeku also regarded gorgs as food rather than pets."}, {"tag": "p", "text": "Having not lived under the Empire, Neeku did not understand the oppression and exploitative nature of the Empire. He also initially shared Tamara's view that the First Order brought security to the Colossus. As the First Order's occupation became more restrictive and oppressive, Neeku came to question the increased First Order military presence and the communications blackout. Despite his initial appreciation of the First Order, Neeku's loyalty to his friend Kaz and employer Yeager led him to join Kaz's informal resistance cell."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Jarek Yeager"}, {"tag": "p", "text": "Neeku Vozo was a devoted employee of Jarek Yeager who was willing to work hard without asking for much. When Yeager objected to his new pet Bibo, Neeku took offense and threatened to resign if Yeager refused to accept Bibo."}, {"tag": "h3", "text": "Kazuda Xiono"}, {"tag": "p", "text": "While the rest of Team Fireball initially resented or barely tolerated Kaz's presence, Neeku went out of his way to befriend Kaz despite the latter's lack of mechanical skills. Neeku also recognized that the seemingly charismatic racer Jace Rucklin and his associates were idle and unscrupulous troublemakers. His warning was proven right when Rucklin took advantage of his friendship with Kaz to steal a bottle of volatile hyperfuel."}, {"tag": "p", "text": "Neeku was friendly and approachable. He often sought to help others but in the process annoyed them or made the situation worse. On one occasion, he tried to chat with First Order stormtroopers in order to solicit information on Kaz's behalf. Neeku was also a kind-hearted individual and once treated the cash-strapped Kaz for a glass of water. As a discreet observer, Neeku told Kaz that he would not make a good bounty hunter due to the ethical implications of the job. Neeku also praised Kaz as his mechanical skills improved."}, {"tag": "p", "text": "Neeku was surprised to learn that Kaz was a spy and initially did not believe that he was the son of a senator. However, he remained loyal to Kaz and supported Kaz's plan to free Yeager and Captain Doza and later to expel the First Order from the Colossus."}, {"tag": "h3", "text": "Tamara Ryvora"}, {"tag": "p", "text": "Neeku was a close friend of Tamara Ryvora. The two came up with a coded language that they used to gossip about Kazuda Xiono. When Neeku was upset about Yeager kicking out Bibo, Tamara spoke up for him and helped him to find the creature. When Bibo's mother attacked, she convinced him to return Bibo to his mother in order to save the Colossus from destruction."}, {"tag": "h3", "text": "Bibo"}, {"tag": "p", "text": "Neeku showed great affection for the baby rokkna known as Bibo, adopting him as his pet. Neeku's love for his pet blinded him to Bibo's disruptive behavior. Neeku was greatly hurt when Yeager took offense at the mess that Bibo had cause and ordered Neeku to get rid of his pet. Neeku was so distraught that he threatened to resign. Only Tam understood Neeku's affection for Bibo and she helped him to find his pet. After Bibo's mother laid siege to the Colossus, Neeku took a leap of faith and reluctantly returned the creature to its mother."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Neeku Vozo was a skilled mechanic who was familiar with repairing starships and the dangers of hyperfuel. Neeku was familiar with comlinks but annoyed Kaz by using it in the same room. Besides speaking Galactic Basic Standard, Neeku could also speak several languages including the Chelidae language and the Nikto language Cracek."}, {"tag": "p", "text": "As a resident of the Colossus, Neeku was familiar with the station's layout. He used this knowledge to help Synara San escape the First Order and find an escape pod that allowed her to reunite with her fellow pirates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Neeku Vozo is a character created and developed for the Star Wars Resistance animated series. He is voiced by Josh Brener, who voiced Erskin Semaj in Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}