{"url": "Assault_on_the_Gray_Syndicate", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Lothal", "Category:Events during the Early rebellion against the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Assault on the Gray Syndicate"}, {"tag": "p", "text": "The Galactic Empire carried out an assault on the headquarters of the Gray Syndicate, located in the building once known Ake's Tavern in the northern market district of Lothal's Capital City. The assault was a complete success, with everyone within the building apparently killed, save Merei Spanjaf, who was believed to be an innocent hostage."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Merei Spanjaf, a teenage human girl living on Lothal, was forced to employ the services of the Gray Syndicate when she needed help gaining access to a snooper. She was able to get what she needed, but was left in debt to the crime syndicate's boss, Yahenna Laxo. Laxo later chose to call in Spanjaf's debt, sending her on a number of errands that utilized her particular talents. During these errands and her conversations with Laxo, Spanjaf came to learn the ins-and-outs of the organization and realized that Laxo was largely loyal to credits rather than individuals. As she witnessed him selling people that he had been hiding from the Galactic Empire to bounty hunters, she came to realize that she herself was safe only so long as Laxo didn't find it more profitable to give her up to Imperial authorities, knowing what he did about her involvement in illicit activities."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The assault on Ake's Tavern by Imperial forces was essentially a complete rout. Provided with the exact location of the building via Merei Spanjaf's tracking device, they were able to catch the Syndicate completely off-guard with an efficient strike carried out by a squad of stormtroopers. For the members of the Syndicate, there was barely enough time for one to yell out a warning before the building's windows exploded and stormtroopers rappelled down from cables launched from a gunship stationed above. As stormtroopers that had already entered downstairs carried out their assault, the stormtroopers above fired upon Yahenna Laxo, though in the confusion, it was unclear to Spanjaf whether Laxo had panicked and reached for a blaster or one of the stormtroopers had panicked. With Laxo dead, the assault was at a swift end, as the forces downstairs had already \"cleaned the whole nest out.\""}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the Empire's assault, Merei Spanjaf was left staring into Yahenna Laxo's lifeless eyes. She was safe, as the stormtrooper commander in charge of the mission believed her to be only an innocent hostage who had been forced to send a message to her mother claiming that she would be killed by the Gray Syndicate if her mother didn't call off her investigation into recent suspicious activities. Furthermore, Spanjaf was now entirely in the clear when it came to being implicated in said investigation, as she had erased all evidence leading to her. Several other members of the Syndicate were killed in the assault and any not present at the headquarters at the time were likely in danger. Additionally, a number of individuals being sheltered by Laxo in exchange for credits were left in the position of having to make new arrangements to stay safe from Imperial attention. The assault, however, had a positive effect for at least one of these individuals. Immediately prior to the assault, Holshef, an elderly human male wanted for his poetic and artistic expressions by the Empire, had been sold to a bounty hunter by Laxo. It was Spanjaf's task, however, to inform the bounty hunter of Holshef's location. With Laxo dead and Spanjaf free of the group's influence, Holshef had a chance to escape. Spanjaf would later personally work to ensure that he did."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}