{"url": "Neera_Opatajji-Hirken", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Neera Opatajji-Hirken"}, {"tag": "p", "text": "Neera Opatajji-Hirken was a Human female who was married to Corporate Sector Authority Viceprex of Corporate Security Mirkovig Hirken. A member of a noble family on Opatajji, Opatajji-Hirken had a privileged upbringing before marrying Hirken, a fast riser in the Corporate Sector hierarchy. However, their marriage was a loveless one, which deteriorated further when they moved to the desolate asteroid Mytus VII, where Hirken was overseeing the construction and operation of the Stars' End prison. After the catastrophic failure of the prison facility during a jailbreak of Stars' End's inmates, Opatajji-Hirken killed her husband after he attempted to escape without her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The fourth daughter of the Duke of the planet Opatajji, Neera Opatajji enjoyed an extremely privileged upbringing of high society functions in her family's mansion. But despite her house's opulent wealth and lavish lifestyle, Opatajji was frequently bored and lonely, and dreamed of finding her way out of the family home. She got her wish when she married Mirkovig Hirken, a fast-rising executive in the Corporate Sector Authority. But while the now-Neera Opatajji-Hirken delighted in her husband's fast rise up the Authority's chain of command, eventually becoming Viceprex of Corporate Security, it didn't make her any happier—much less so when she and her husband moved to the desolate asteroid Mytus VII, where Hirken had accepted a position overseeing a new experimental prison project known as Stars' End."}, {"tag": "p", "text": "There, the pleasures she had become accustomed to—the elaborate parties, the affairs with Hirken's subordinates—became completely inaccessible as the couple moved into living quarters within the prison complex itself. However, in 2 BBY, she seemingly got a reprieve when a troupe of entertainers, \"Madam Atuarre's Roving Performers,\" arrived to give a performance on Stars' End. Opatajji-Hirken was thrilled by the promise of a respite from her constant boredom, but in truth, the visitors weren't performers at all: they were in fact a group of friends and loved ones of Stars' End prisoners, who had come to stage a jailbreak. While Hirken, in part at Neera's urging, allowed the performance to go on, he was really more interested in seeing his Mark X Executioner gladiator droid do battle against one of the visitors' droids, Bollux."}, {"tag": "p", "text": "Although Neera delighted in the acrobatics of the Trianii Atuarre and her cub Pakka, her impatient husband cut the performance short to go straight to the fighting. From there, matters quickly got out of hand: the diminutive Bollux surprisingly defeated Hirken's droid, which led to a confrontation between Hirken and the group's leader, Corellian smuggler Han Solo. At Hirken's urging, Solo and Hirken's bodyguard Uul-Rha-Shan engaged in a gunfight, which ended with a massive power plant explosion that blasted Stars' End clear off the surface of Mytus VII. In the panic following the blast, Neera attempted to escape the doomed station with her husband. However, Hirken left her behind in order to separately attempt to negotiate a deal with Solo. Furious and betrayed, Neera tracked her husband down through the smoke-filled corridors of Stars' End, and put a hole in his back with a blaster pistol before she was killed by the station crashing back into Mytus VII's surface."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Remarkable even in her upper-crust society for her shallowness and superficiality, Neera Opatajji-Hirken cared only for her wealth and the trappings that came with it. She was spoiled and willful from her youngest days and grew up hating her sisters, seeing them only as competition for the young bachelors that visited their mansion. But while she got the successful match she hoped for when she married Mirkovig Hirken, she remained just as lonely and bored as she did in her previous life, and attempted to fill the void with lavish spending and extramarital affairs. She also found little affection for her husband: while she enjoyed his career successes, she detested his fondness for gladiator droids and highly resented him moving them to Stars' End. Eventually, she began to blame Hirken for everything wrong with her life—when she finally killed him, she felt no remorse. Short and extremely fat, Opatajji-Hirken usually covered her body in expensive jewelry and robes, and took great pride in her fashion sense."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Neera Opatajji-Hirken first appeared in Han Solo at Stars' End, a novel written by Brian Daley and released in 1979. She was later pictured by Mike Vilardi in 1993's Han Solo and the Corporate Sector Sourcebook, having been omitted from the Han Solo at Stars' End comic adaptation—in that version of the story, Mirkovig Hirken is killed by his bodyguard, Uul-Rha-Shan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}