{"url": "Neeva-Beelo", "categories": ["Category:Legends articles", "Category:Organization starships", "Category:Smuggler starships", "Category:YT-1210 light freighters"], "nodes": [{"tag": "h1", "text": "Neeva-Beelo"}, {"tag": "p", "text": "The Neeva-Beelo was a YT-1210 light freighter owned by the Rodian Teeloo. It was given to him in 32 BBY by an uncle to annoy Teeloo's cousins, who intended to inherit it. At that point, it was already several decades old with numerous mechanical problems when he got it. The main hyperdrives burned out after one jump, and the back-ups were not much better. The rigged wiring made it difficult to work on the ship's electrical systems. It had already been modified, removing a 25% of cargo capacity to increase the number of passengers from four to six and the consumables from two months for four people, to one point five months for six people."}, {"tag": "p", "text": "After Teeloo crashed into a snubfighter from the Blood Raptors while coming into Genarius, the ship developed more problems. The power core was jarred, the sublight engines were knocked out of alignment, and the sensors and forward maneuvering thrusters were damaged. The servo-motors in the vehicle's one gun turret were damaged so that it could only turn in a 180-degree arc."}, {"tag": "p", "text": "Despite all this, the ship looked a lot worse than it actually ran. It appeared to be held together by spacer's tape. The interior of the ship looked as bad as the outside."}, {"tag": "p", "text": "When Teeloo landed in Tolea Biqua, the Blood Raptors requised his cargo as a punishment for having crashed with one of his ships. They also forced him to race against their pilot, Gael Kinner, through the tunnels of Eskaron. The Raptors said that, if Teeloo lost the race, they would seize the Neeva-Beelo but, if Teeloo won the race, they would return his cargo. Of course they had no intention to."}, {"tag": "p", "text": "A volunteer crew that helped Teeloo in his race against the Blood Raptors fixed some of the ship's problems and they helped Teeloo through Eskaron's dangers such as The Spiral, Skinning the Mynock and the Cavern of Teeth, piloting against Kinner. During the race, Kinner was forced to shoot the pilot of a different race, Arraxx. As Arraxx was being sponsored by crimelord Nirama, this act gained Kinner and the Raptors the wrath of Nirama, who executed them after the race."}, {"tag": "p", "text": "Nirama also offered Teeloo an employment piloting for him. Nirama repaired the ship using his technicians once Teeloo had agreed to work for him. Teeloo then began using the Neeva-Beelo as his ship when working for Nirama."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}