{"url": "Neihero", "categories": ["Category:Canon articles", "Category:Individuals of unspecified gender", "Category:Meteor Squadron personnel", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Neihero"}, {"tag": "p", "text": "Neihero was a Rodian starfighter pilot who flew for the New Republic's Meteor Squadron under the callsign Meteor Four during the Galactic Civil War. The Rodian had a passing flirtation with another pilot named Wyl Lark over a month. Around 5 ABY, Neihero was scrambled with the rest of Meteor Squadron, to defend the planet Catadra from forces of the Galactic Empire's 204th Imperial Fighter Wing. While en route, the Rodian spoke another New Republic pilot about the threat of one of the 204th's vessels but was silenced by \"Meteor Leader\". When the pilots engaged the 204th's TIE fighters, Neihero and most of Meteor Squadron were killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, the Rodian Neihero served as a pilot in the New Republic's Meteor Squadron, an X-wing starfighter squadron part of General Hera Syndulla's battle group, under the callsign Meteor Four. Over the course of a month, the Rodian engaged in a number of hallway flirtations with Lieutenant Wyl Lark of the New Republic Intelligence's Alphabet Squadron. During a campaign in the Cerberon system around 5 ABY, where Meteor Squadron fought at the planet Troithe, members of the squadron were eventually deployed to protect the planet Catadra from the Quasar Fire-class cruiser-carrier Aerie of the Galactic Empire's 204th Imperial Fighter Wing."}, {"tag": "p", "text": "En route to Catadra, following an exchange between \"Meteor Leader\" and Wyl Lark, the Alphabet Squadron pilot Nath Tensent questioned whether the cruiser-carrier was just a distraction while the 204th's other vessel, the Imperial II-class Star Destroyer Edict, attacked Troithe. Neihero expressed doubt that the Edict was able to match Troithe's planetary defenses, leading Meteor Leader to advise the pilots to not socialize on the comm channel they were on. The New Republic fighters then reached Catadra, although Lark and Tensent chose to return to Troithe, and they engaged the Aerie's squadron of nine TIE fighter drones and three manned TIEs."}, {"tag": "p", "text": "In the following battle, the outnumbered Imperial squadron lost all but two TIE pilots, one of which was immobilized. In the process, the Meteor pilots were nearly completely wiped out, Neihero being among the dead. Some months later, Lark led a starfighter wing against the 204th during a large fleet battle at the planet Jakku. As both fighter wings slaughtered one another in a dogfight, exchanging words over a single comm channel, pilots from either side called out the names of those they had lost to the other side, one pilot calling out Neihero's name."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Rodian, Neihero engaged in flirtatious exchanges with Wyl Lark for around a month. After Nath Tensent speculated that the Edict might posed an issue for Troithe, the Rodian doubted the other pilot's sentiment and the Edict's capabilities."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": "Neihero first appeared by voice in the 2020 novel Shadow Fall, the second instalment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}