{"url": "Assault_on_the_New_Jedi_Temple", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Battles of the Jedi Temple", "Category:Liberation of Coruscant", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Assault on the New Jedi Temple"}, {"tag": "p", "text": "The assault on the New Jedi Temple was a military operation performed by the New Jedi Order and Galactic Alliance marines in the year 44 ABY. The Jedi Order, led by Grand Master Luke Skywalker, and a group of Alliance marines loyal to Admiral Nek Bwua'tu infiltrated the Jedi Temple on Coruscant and attempted to eliminate the Lost Tribe of Sith who had retreated into the Temple in response to the Order's elimination of almost a thousand Sith on Coruscant."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In response to the Jedi's recent assassination of over a thousand disguised members of the Lost Tribe, the Sith at the order of Abeloth pulled all of their forces back into the Temple following the advice of captive Wynn Dorvan, who was attempting to minimize the collateral damage of the coming battle and to give the Jedi an advantage."}, {"tag": "h2", "text": "The assault"}, {"tag": "p", "text": "The first stage of the assault was a coordinated infiltration of the Temple through secret passages by groups of Jedi. Their primary objectives were to seize control of the computer systems and deactivate the shield generators, which would enable Admiral Nek Bwua'tu's Void Jumpers to storm the Temple and drive out the Sith with the help of the Jedi."}, {"tag": "p", "text": "During the next week the Jedi strike team struggled to reach their destination and accomplish their goal.\nFinally after days of eluding Sith ambushes Grand Master Luke Skywalker, Jedi Master Corran Horn and Jedi Knight Jaina Solo were able to destroy a shield generator. All three of them were worn out and drawing on the Force for support; Jaina was in fact experiencing Force euphoria. As the most severely wounded, Solo volunteered to act as a human shield for the others in their retreat. Luke Skywalker recognized this sense of selfless sacrifice as Jedi Master material and promoted her then and there. They succeeded in escaping the Temple and immediately received medical care."}, {"tag": "h3", "text": "Skirmish in the loading bay"}, {"tag": "p", "text": "During the assault, Captain Han Solo, his wife, Leia Organa Solo, their granddaughter, Allana Solo, and the Jedi Knight Bazel Warv attempted to warn a group of Barabel Knights who had nested in the Temple of a vision Allana had of their nest coming under attack. However, they were intercepted by a group of Sith under High Lord Sashal, who had been chasing down Vestara Khai. They attacked the Solos and the Millennium Falcon, as Khai had just revealed that a prophesied Jedi queen for whom the Sith had been searching was actually Allana Solo. The Sith were defeated, but Warv was killed and the Solos successfully warned the Barabels of Allana's vision."}, {"tag": "h3", "text": "The hunt for Abeloth"}, {"tag": "p", "text": "The initial attempts to lower the Temple's defenses to allow for the marines to enter the Temple failed, but the Jedi finally succeeded in taking out the Temple's shield generators."}, {"tag": "p", "text": "Jedi Masters Corran Horn and Jaina Solo were pulled from their bacta tanks early, for a meeting of the Jedi High Council (New Jedi Order). Though it should be noted that Grand MasterLuke Skywalker extracted himself early."}, {"tag": "p", "text": "It was during this time Abeloth took Ben Skywalker and Vestara Khai back to her planet so they could recreate The Ones. Grand Master Luke Skywalker and his niece Jedi Master Jaina Solo went after them."}, {"tag": "p", "text": "On their way to Abeloth's planet, Ship Sith Meditation Sphere ambushed them, so Luke went back buckled up and went Beyond shadows where he fought along side Darth Krayt, to destroy Abeloth Force body while Ben and Vestara killed the body of Lady Korelei."}, {"tag": "p", "text": "Jedi Master Saba Sebatyne, accompanied by Jedi Knight Tahiri Veila and a squad of the elite marines unit known as the Void Jumpers, landed in the Temple loading bay and continued into the Temple, while the Solos and the Barabel hatchlings they had rescued were evacuated aboard the former Imperial Head of State Jagged Fel's shuttle the Parting Gift. At this point, the Jedi had learned from Wynn Dorvan that Abeloth had transferred part of her consciousness from her avatar Rokari Kem to the Temple's computer core, using the technique she learned when the entity absorbed the former Jedi Knight Callista Ming. Jedi Master Saba Sebatyne killed her last avatar within the Jedi Temple."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Battle of Coruscant would last for several weeks after the assault ended, as the remaining Sith who had fled the Temple were hunted down. Three months after the assault and the death of Abeloth, Grand Master Skywalker would awake from the healing trance he had been in since the duel with Abeloth. Where he learned that Abeloth had created lava flows killing billions, possibly trillions. At his decision, the Jedi Order would once again leave Coruscant, as many were blaming the Jedi for the recent destruction, and it would lessen the possibility of another attack on the capital. They would retreat to the planet Shedu Maad in the Hapes Consortium, site of a Jedi base since the Second Galactic Civil War."}, {"tag": "p", "text": "Jagged Fel and Jedi Master Jaina Solo would also marry not long after aboard on the Dragon Queen II, the flagship of Queen Mother Tenel Ka Djo. Tenel Ka and the Solos also decided that Allana Solo was ready to be revealed as the Chume'da, and she attended the ceremony under her true name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}