{"url": "Neimoidia", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Articles needing illustration", "Category:Neimoidia locations", "Category:Neimoidia system planets", "Category:Neimoidian planets"], "nodes": [{"tag": "h1", "text": "Neimoidia"}, {"tag": "p", "text": "Neimoidia, also known as Pure Neimoidia, was a planet centrally located in the galaxy's Colonies region, and was situated along the Trellen Trade Route. It was the homeworld of the Neimoidian species, and was near a string of wealthy \"Purse Worlds\" settled by Neimoidians, including Cato Neimoidia."}, {"tag": "p", "text": "Twenty-five millennia before the Battle of Yavin, the planet was discovered by Duros explorers from the planet Duro during their travels throughout the galaxy. After its colonization, Neimoidia became allied with but separate from the Duros homeworld, and later joined the Galactic Republic in 22,000 BBY as an independent world. Sometime later, the Neimoidians, determined to expand their influence, established a string of planets known as \"Purse Worlds\" on Cato Neimoidia, Deko Neimoidia and Koru Neimoidia, and Neimoidia was eventually overshadowed by the three as they grew in wealth. As a result, much of Neimoidia's population left for either of the three Purse Worlds, but some, including the Trade Monarch, the ruler of Neimoidia and the Purse Worlds, remained on the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Neimoidia, otherwise known as Pure Neimoidia, was a terrestrial planet located in the star system of the same name in the galaxy's Colonies region, at grid square N-10 on the Standard Galactic Grid along the Trellen Trade Route, which connected the planet to Kattada, Balmorra, and Commenor. 10,830 kilometers in diameter, Neimoidia orbited the system's star of Nen for twenty-nine standard hours and 221 local days, and was orbited by at least one moon."}, {"tag": "p", "text": "The planet was the homeworld of the sentient Neimoidian species, and maintained a population of 400 million life forms under a heavy gravity atmosphere and a dull, foggy and humid climate. On the surface, Neimoidia's primary terrain consisted of hot jungles, filled with fungus trees, manax tree orchards and harvester beetles, deserts, open fields, and rainforests. The planet was also in close proximity to a string of wealthy planets known as \"Purse Worlds,\" including the planet Cato Neimoidia, Deko Neimoidia and Koru Neimoidia."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Colonization of Neimoidia"}, {"tag": "p", "text": "At least twenty-five millennia before the Battle of Yavin, Duros explorers left their homeworld of Duro in the Core to spread their influence across the galaxy, during an era when exploration was at its peak. During their travels, the Duros discovered the planet Neimoidia and colonized it, taking the planet as their own. Following its colonization, Neimoidia began to establish itself as an allied but separate entity to the Duros homeworld, and by 22,000 BBY, the planet joined the Galactic Republic as an independent world in its own right."}, {"tag": "p", "text": "While the Duros focused their energy on exploration and astrogation, those that lived on Neimoidia set their sights on the acquisition of profits in a galaxy rich in assets, further expanding their influence. The eventual establishment of trading guilds brought Neimoidia new levels of control over the vast expansion of civilization throughout the entire galaxy, a process in which Neimoidia was determined to be at the forefront of."}, {"tag": "p", "text": "Ten thousand years after the colonization of Neimoidia, the physical differences between the Duros and the Neimoidians became clear to see. As a result, the planet's climates and heavy gravity atmosphere had wrought the subtle changes over the Neimoidians throughout several millennia, to the point where the two had evolved into distinctly separate species."}, {"tag": "h3", "text": "Establishment of Purse Worlds"}, {"tag": "p", "text": "Determined to expand beyond Neimoidia's borders to form an empire, the native Neimoidians began to establish a string of worlds known as \"Purse Worlds,\" striking out to locate, colonize and generate profits from Cato Neimoidia, Deko Neimoidia and Koru Neimoidia. Eventually overshadowed by its Purse Worlds, Neimoidia began to refer to itself as \"Pure Neimoidia.\" While the Purse Worlds flourished and fed wealth back to the Trade Monarch, the ruler of Neimoidia, the planet began seeing operations of grub hatcheries and farms created in order to develop agricultural trade bases in Neimoidia's hot jungles."}, {"tag": "p", "text": "Similar profit-centred strategies were implemented on the other Purse Worlds, which led to their succession over Neimoidia itself. However, despite Neimoidia's decrease in importance and worth, freighters continued to lift off every hour from the capital city of Koto-Si's docking bays."}, {"tag": "p", "text": "While members of Neimoidian society often found passage off of Neimoidia in favor of one of the three other Purse Worlds, those that remained were often worker drones. Apart from the ruling government and the house of the Trade Monarchy, very few remained  on the planet out of choice."}, {"tag": "h3", "text": "Trade Federation & the Clone Wars"}, {"tag": "p", "text": "Afterwards, eager to prove their ingenuity on another world and to show their strength through wealth, the colonists from Neimoidia began the construction of bridge cities on the planet Cato Neimoidia. Neimoidia later became one of the founders of the Trade Federation in 350 BBY, and following the end of the Invasion of Naboo in 32 BBY, the Federation opted to retreat from Neimoidia altogether, in favor of the other Purse Worlds. By the end of the Clone Wars between the Republic and the Confederacy of Independent Systems, Neimoidia was blitzed by the Republic and its grub hatcheries were laid to waste, leaving the continuation of the Neimoidians' operations at risk."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "Neimoidians & Duros"}, {"tag": "p", "text": "Neimoidia was the homeworld of the Neimoidian species, who had evolved into a distinctly different species from the Duros colonists after ten thousand years as a result of the influence of Neimoidia's climates and gravity. Around 25,000 BBY, the planet was colonized by several Duros settlers from the planet Duro in the Core, who focused on the skills of astrogation and space exploration, while the Neimoidians focused on acquiring wealth and expanding their influence across the galaxy. Viceroy Nute Gunray, Settlement Officer Rune Haako, and Senator Lott Dod of the Trade Federation, as well as General Lok Durd and Captain Mar Tuuk of the Confederacy of Independent Systems, were Neimoidians from Neimoidia."}, {"tag": "h3", "text": "Native fauna"}, {"tag": "p", "text": "Giant, monstrous beetles known as harvester beetles were native to Neimoidia, and were later settled on the other Purse Worlds. They were tamed by the Neimoidians, and assisted in the production of a fungus that brought great wealth to the Neimoidians. Neimoidia was also home to the parasitic Neimoidian tick larva, Mistfly, neekoflights and Pylat bird."}, {"tag": "h3", "text": "Government"}, {"tag": "p", "text": "Neimoidia, like the three other Purse Worlds, was ruled by a planetary government led by a Trade Monarch. The Trade Monarchy, along with the government, ruled the Purse Worlds from Neimoidia."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The capital city of Neimoidia was Koto-Si, which contained several docking bays for large freighters to land and take off every hour. The planet also contained Communal Hives and Fungus Farms in its jungles, from where fungus was grown with the help of harvester beetles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Neimoidia was first mentioned in the new Star Wars canon in several featurettes included in Star Wars: The Clone Wars The Complete Season One, a 2009 box set available on Blu-ray or DVD that included the entire first season of the canon animated series Star Wars: The Clone Wars. It was originally created for Star Wars: Episode I The Visual Dictionary, a 1999 Star Wars Legends reference book written by David West Reynolds."}, {"tag": "p", "text": "StarWars.com's Databank entry for Cato Neimoidia erroneously claimed that it was the homeworld of the Neimoidian species, with no mention of Neimoidia. It was later corrected to state that Cato Neimoidia was a Neimoidian colony, with any mention of a Neimoidian homeworld removed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}