{"url": "Neimoidian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Pages needing citation", "Category:Colonies species", "Category:Insectoid sentient species", "Category:Neimoidians", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Neimoidian"}, {"tag": "p", "text": "Neimoidians, also known as Neimoidian Duros, were a species of humanoids that were distant genetic relatives of Duros. They were native to the planet of Neimoidia and also lived on colony worlds in the same sector like Cato Neimoidia, Deko Neimoidia, and Koru Neimoidia. Neimoidians placed tremendous value on wealth and material possessions, and would go to great lengths to gain money and power, resulting in a stereotype of being greedy and cowardly; however, they were very easily intimidated, and hated combat."}, {"tag": "p", "text": "In the years prior to the Clone Wars, the Neimoidians became infamous for running the Trade Federation, a massive corporate entity. Famous Neimoidians included Nute Gunray and Rune Haako, high ranking members of the Trade Federation who later joined the Confederacy of Independent Systems, a separatist movement which waged war on the Galactic Republic. This proved to be their species' undoing: Neimoidia and its colonies were blockaded and invaded by the Republic in the war's final year, destroying many Neimoidian grub-hatcheries and catastrophically affected the long-term survival of the species. Thereafter, the Neimoidians faded from prominence in galactic affairs."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Since the Neimoidians were distant genetic relatives of the Duros, they retained many similarities to them, including basic form, noseless faces, and green-blue skin (though Neimoidians tended to be grayer, and in some cases like Mar Tuuk; even yellow). Their eyes also had pupils that split horizontally, and they were distinguished by small lumps on their foreheads and down-turned mouths. Their sense of smell came from glands under their eyes. These genetic differences were attributed to the distinct features of their homeworld, Neimoidia, including its gravity, which was heavier than Duro. Additionally, the planet's star was dimmer, and the planet itself was humid and widely shrouded by fog and mist."}, {"tag": "p", "text": "Neimoidian skin often took on a mottled look if the being was too self-indulgent or often prone to great stress, such as Nute Gunray. A Neimoidian's lung pods would expand and contract convulsively under great stress, leading to an old saying characterizing Neimoidians as the only sentient species with an entire organ devoted to worrying. Nauseated Neimoidians' skin turned pink. The Neimoidians had five fingers and two clawlike toes."}, {"tag": "p", "text": "Neimoidians were born in a larval state called a \"grub\" form. Although hive-mothers had cloacas, the grubs were born live and not from eggs."}, {"tag": "p", "text": "Many Duros took great offense at being compared to their Neimoidians cousins. In the TriPlanetary Press reference source known as the Encyclopedia Galactica, the entry for Neimoidian read, \"See: Duros\". The classic example of what not to say detailed an employer for a shipping company who was curious as to why a Neimoidian would be applying for a pilot's position when it was, in actuality, a Duros. The reason for the offense is obvious: Neimoidians tended to be cowardly, greedy, and fearful of death, while Duros were an adventurous, gregarious, and peaceful race."}, {"tag": "p", "text": "It is well-known that Neimoidians were notorious disease carriers. According to a joke made by Ebenn Q3 Baobab, onetime doctor for a Neimoidian fleet, \"the principal export of the Neimoidian home planet is Brainworm Rot Type C\". Baobab further explained in his Galactic Phrase Book & Travel Guide that both the Great Pandemic of Deersheba and the Intestinal Revenge of Bars Barka (which emaciated scores of Ubese colonists) originated with the Neimoidians. At several times in the past, Neimoidia had been quarantined and forbidden to travelers."}, {"tag": "p", "text": "Upon death, Neimoidian bodies would desiccate rapidly if not immediately buried or burned. The corpse's face would elongate, and the brain sac would shrivel into a series of tiny pods behind the head. It was this terrifying image of death, coupled with the Geonosian physique, that inspired the appearance of the Trade Federation's B1-Series battle droids."}, {"tag": "p", "text": "Whenever they laughed, their head remained the same, but their body shook ever so slightly."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Education and social life"}, {"tag": "p", "text": "Neimoidians spent their formative years as puny grubs in the communal hives of Neimoidia, until the age of seven standard years. They were knowingly neglected by being given limited amounts of food. In this way, the weaker individuals were weeded while the most acquisitive ones could hoard more food than they could eat by themselves. The Neimoidian education ensured the survival of the greediest. Because of that, the Neimoidians would retain ill memories of their homeworld and tried to avoid it as much as possible. In fact, Neimoidia's most able individuals typically left the planet at a young age, often joining the Trade Federation and its trading starships. Meanwhile, the weakest and least capable of the species were sequestered on Neimoidia and the purse-worlds, where they tended to vast insect hives, fungus farms, and beetle hatcheries. In large part because of their formative years and communal hives, the Neimoidians tended to place positions such as Trade Federation Viceroy as absolute and obey them without question, nor could they even make independent decisions. As such, if the Viceroy was killed, incapacitated, or otherwise indisposed during a conflict, the Neimoidians will be unable to continue fighting. This trait was notably exploited during the Battle of Naboo by Queen Padmé Amidala to ensure a quick and decisive end to the crisis. Similarly, the Neimoidians because of their upbringing requiring them to be materialistic, they also placed particular emphasis on one's status. This even extended to the number of blast doors aboard Neimoidian ships, with three blast doors indicating that the ones behind the blast doors were of high-level in Neimoidian society and thus superior."}, {"tag": "p", "text": "As adults, Neimoidians had a reputation of being skilled in matters of business and were well known for their leadership of the Trade Federation. Unfortunately, Neimoidians were stereotyped by other species as greedy, fearful of death, lazy, corrupt and even child neglecters. This was evident by the use of droids for almost everything. It was often said that one of the most difficult concepts for a Neimoidian to understand was loyalty."}, {"tag": "p", "text": "Members of other species often perceived the Neimoidians as villainous. In fact, the notions of morality and ethics that motivated other societies were completely absent from the Neimoidian culture. From infancy, they were reared to believe that anything they could appropriate was theirs by right, regardless of the means used."}, {"tag": "p", "text": "Their species was noted for being highly fearful to fight their own battles yet were deceitful to the point that they did not trust living soldiers. Such traits meant that they were often criticized for their cowardly nature and was one of the reasons why they made use of a mechanized army consisting of droids. In addition, the discussion of an individual's feelings was considered an anaethema amongst Neimoidians. Although they possessed the reputation of being cowardly and deceitful, the Neimoidians when push comes to shove showed surprising ferocity and tenacity when defending their purse worlds, which was best demonstrated with the Neimoidian Home Defense Legions within the Confederacy of Independent Systems."}, {"tag": "h3", "text": "Clothing"}, {"tag": "p", "text": "Because of their obsession with status, the Neimoidians placed great importance in clothing. Among their kind, elaborate clothes were specifically designed to assert an individual's personal wealth and rank and also to instil jealousy or envy in others. Not only did their robes, cloaks, hats and collars all have particular symbolic meanings, but so did their fabrics and colors. The Human Rella once joked that a Neimoidian would never spend some of their profits unless they could spend it on new robes. Ranks and garments were so closely associated that a Neimoidian disgraced by their peers would be stripped of their clothes immediately. They were particularly attached to their hats, and a popular opinion was that a Neimoidian would never be seen without it unless they were dead. That may not have been true for all historical eras, however, as bare-headed Neimoidians would frequently be spotted during the Galactic War. The numerous types of Neimoidian headgear ranged from simple caps that revealed the complete forehead to a wide variety of miters and crowns, some of which even comprised wig-like ornaments. In fact, the Neimoidian clothing etiquette was so complex that the Republic Xenosociological Database contained a whole subdirectory pertaining to that subject."}, {"tag": "h3", "text": "Language"}, {"tag": "p", "text": "The native language of the Neimoidians was called the Pak Pak. That term actually referred to both a verbal language and a nonverbal way of communication that consisted in complex hand gestures. To non-Neimoidians, the verbal Pak Pak sounded like a string of guttural croaks that had a certain musical quality. While most Neimoidians were able to speak Basic, they did it with a heavy accent."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 25,000 BBY, a Duros colony was established on Neimoidia under the leadership of Chla C'cHaan. Due to the distinct features of Neimoidia, including a gravity which was greater than Duro, the Duros colonists became a separate species from their genetic cousins, thus starting the Neimoidian species. During an expansionist period in the Old Republic era, the Neimoidians colonized several nearby worlds. The wealthiest and most resource-rich colony worlds were known as \"purse worlds\", that also served as administrative posts and ruled their own set of colonies. Notable purse worlds included Cato Neimoidia, Deko Neimoidia, and Koru Neimoidia ."}, {"tag": "p", "text": "In 350 BBY, the Neimoidians helped establish the Trade Federation, an association of business and trade groups which grew to dominate entire star systems. In 33 BBY, Darth Sidious had all the non-Neimoidian members of the Trade Federation Directorate murdered at the Eriadu Conference. As a result, the Neimoidians assumed complete control of the Federation."}, {"tag": "p", "text": "Despite centuries of running the Trade Federation, their control began to subside when the Galactic Republic began taxation of the trade routes that they had established. This act destroyed the Neimoidians along with their delicate financial control over the Trade Federation which began to crumble as a result. The institution of taxes on trade routes to the outlying regions left the Neimoidians furious. This resulted in the Trade Federation's Invasion of Naboo. However, the Trade Federation forces were defeated during the battle of Naboo. From this event, most of the stereotype regarding Neimoidians as greedy, conniving cowards was gained. Their humiliating defeat during the trade blockade of Naboo left the Neimoidian reputation entering into a downward spiral. After being bereft of position and power, they began considering every possibility in order to regain their status."}, {"tag": "p", "text": "During the Separatist Crisis, the Neimoidians aligned themselves with Count Dooku's growing Separatist movement. With the start of the Clone Wars at the Battle of Geonosis in 22 BBY, Neimoidians became a species commonly associated with the Confederacy and were usually either deported from or prevented from entering Coruscant. In addition, Neimoidian warriors and brutes were used in the Separatist armed forces as a part of Neimoidian Gunnery Battalion."}, {"tag": "p", "text": "In 19 BBY, the Republic retook Neimoidia and its purse worlds from the Confederacy before Viceroy Gunray and Settlement Officer Rune Haako were killed at Mustafar by Darth Vader. During the assault on Neimoidia, the planet was ravaged, and the destruction of many Neimoidian grub-hatcheries would affect the Neimoidian species."}, {"tag": "p", "text": "Under the Galactic Empire, the Trade Federation was disbanded after Acting Viceroy Sentepeth Findos signed a treaty on Neimoidia that gave Emperor Palpatine control of the Trade Federation's assets. Neimoidians then began adopting the culture of the baseline Duros to disassociate themselves with the Trade Federation's shameful legacy, something no doubt encouraged by the book Encyclical on Historical Greatness written by influential Neimoidian Chal Haan. The Duros, of course, vehemently denied this, as it was considered a great insult to be associated in any way with their genetic cousins. By the time of the rise of the New Republic, however, the Duros were friendlier towards the Neimoidians, and respected their business skills."}, {"tag": "p", "text": "Fewer Neimoidians also traveled far from their homeworlds, although their vehicles and weaponry—such as Sheathipede-class transport shuttles, Vulture droids, and Lucrehulk-class battleships and core ships—were often used by various corporate entities, particularly in the Corporate Sector."}, {"tag": "p", "text": "Neimoidians are known by most denizens of the galaxy as being notorious virus carriers, responsible for such diseases as the Great Pandemic of Deersheba and the Intestinal Revenge of Bars Barka, with many claiming that the chief export of Neimoidia was Brainworm Rot Type C. This history of reported disease cases grew so virulent that by 6 ABY, Neimoidia was officially quarantined and declared off limits to all travelers."}, {"tag": "p", "text": "During the Yuuzhan Vong War, some Neimoidians joined the New Republic and Galactic Federation of Free Alliances as pilots. Many others fell in with criminal organizations as well."}, {"tag": "p", "text": "One known Neimoidian was a member of One Sith during the Legacy era, tasked with guarding the Chambers of Persuasion in XoXaan's Temple on Korriban."}, {"tag": "h3", "text": "Neimoidians in the galaxy"}, {"tag": "p", "text": "Around five hundred years before the Battle of Naboo, Neimoidian traders sold a decommissioned Hoersch-Kessel LH-3010 capital freighter to Hugo Bartyn, who used it to build his own city in Lamaredd. Five centuries later, Bartyn's descendant Guther welcomed the visit of a Neimoidian dignitary and competed with him in a global race."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though the etymology of the Neimoidian name is unclear, their original designation \"S'hatnarian\" was explained by George Lucas in the cut segments of the 2007 interview by Seth MacFarlane, featured on the Region 2 Family Guy: It's a Trap! DVD. During the troubled filming of Star Wars: Episode IV A New Hope, Lucas frequented a bar not far from Industrial Light & Magic in the Presidio of San Francisco named \"Hombres\" (now \"La Terrasse\"). There he met, and would regularly meet William Shatner, who was living in San Francisco at the time doing stage work. The two became good friends and, as Lucas explained Star Wars, Shatner joked \"You'll have to name a character after me.\" George nodded and agreed, but never followed through. Upon restarting the Star Wars franchise with Episode I, he considered \"S'hatnarian\" as a title for the Neimoidians, only to drop the name later."}, {"tag": "p", "text": "Early Neimoidian designs portrayed them as a thin-faced species, intending for the B1-Series battle droids to mimic their appearance. When this design was dropped, they were given a new look based on that of the Duros. In the process, they went from computer-generated characters to actors wearing animatronic masks. The original design was eventually modified to become the Geonosians, thus preserving the idea that the battle droids resembled their makers. The intended association between the appearance of battle droids and the Neimoidians was not dropped, though, as reference material published around the time of The Phantom Menace stated that the droids were based on Neimoidian skeletons."}, {"tag": "p", "text": "Much as Imperial officers were given English accents, Silas Carson, who portrayed Nute Gunray in Star Wars: Episode I The Phantom Menace, was asked to imitate a Thai actor's reading of his lines when looping Nute Gunray's dialog for the movie. The use of Asian accents to depict the Neimoidians was cited by reviewers as part of a broader issue with racial stereotypes in that film."}, {"tag": "p", "text": "In the German version of the prequel trilogy, the Neimoidians were given French accents. In the French, Spanish, Czech and Italian versions, the Neimoidians were given Russian accents.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}