{"url": "Neimoidian_controller_(Saak%27ak)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Males", "Category:Neimoidians", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Neimoidian controller  (Saak'ak)"}, {"tag": "p", "text": "A male Neimoidian controller worked for the Trade Federation around 32 BBY. His job was to monitor the power generators in the hangar bay of the cargo freighter Saak'ak. During the Federation's blockade of the planet Naboo, he worked in a small computer room in the Saak'ak. However, Jedi Padawan Obi-Wan Kenobi, who had arrived on the Saak'ak to negotiate an end to the blockade was searching for a way to escape from the ship after surviving an assassination attempt perpetrated by Viceroy Nute Gunray. The Jedi found his way to the room the Neimoidian controller was working in, and questioned him about the means to pass through the security door in the Saak'ak's hangar. The concerned Neimoidian stated that it was not possible to open the door while the power generator was functioning, so Kenobi decided to destroy the generator. After the generator was destroyed, the Neimoidian asked Kenobi to leave, and the Jedi complied."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Controller of the power generators"}, {"tag": "p", "text": "A male Neimoidian worked for the Trade Federation as a controller of the power generators in the hangar bay of the Saak'ak, a Lucrehulk-class LH-3210 cargo freighter. When the Federation blockade of the planet Naboo was initiated in 32 BBY, the Saak'ak was the flagship of the many Lucrehulk-class freighters that surrounded the world. During the blockade, the Neimoidian monitored the power generators in a small room full of computers alongside an OOM command battle droid and three OOM security battle droids."}, {"tag": "p", "text": "The Neimoidian continued his work on the Saak'ak when the Trade Federation launched its invasion of Naboo. Only moments after the beginning of the invasion, however, the room was found by Jedi Padawan Obi-Wan Kenobi. The Jedi had arrived on the ship to negotiate a solution between the Federation and Naboo, but Trade Federation Viceroy Nute Gunray attempted to assassinate the young Jedi. Kenobi managed to escape from the assassination attempt, and tried to reach the hangar to escape from the ship. Sighting Kenobi, the panicked Neimoidian quickly shut the metal door to his room, sealing himself inside and leaving the battle droids to fight Kenobi. The Jedi simply destroyed the droids with his lightsaber, entered the room, and confronted the horrified controller, who begged for mercy."}, {"tag": "h3", "text": "Destruction of the power generator"}, {"tag": "p", "text": "The apprehensive Neimoidian controller quickly explained to Kenobi that he had not planned the invasion. Kenobi asked him how to get to the hangar, but the Neimoidian revealed that it was past a red security door which could not be opened while its power source was intact. Kenobi then questioned the controller about his work in the room, and the Neimoidian replied that he was monitoring the power generators of the hangar bay."}, {"tag": "p", "text": "Kenobi continued the interrogation, but when he asked how he could destroy the security door's power source, the nervous Neimoidian lied that the power generators were indestructible. Kenobi nevertheless decided to find a way to cut the door's power off by destroying the generator, which caused the appalled Neimoidian controller to yell at him and order him not to touch the machine."}, {"tag": "p", "text": "However, Kenobi found the power generator inside the room and destroyed it with his lightsaber, causing the security door to open. The Neimoidian controller asked the Jedi to leave, and Kenobi complied, leaving the room to rejoin his Jedi Master."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Working in a small computer room, the Neimoidian controller monitored the power generators of the Saak'ak's hangar bay. He was very frightened by Kenobi and tried to lock himself inside the control room when he first saw the Jedi. When this failed, the Neimoidian begged for his life, asking Kenobi not to hurt him. During Kenobi's questioning, the Neimoidian answered him quickly; however, when asked about the means to destroy the power generator, the concerned controller lied to Kenobi, telling him that the generators were indestructible. Seemingly terrified by Kenobi's plan to destroy the generator, the Neimoidian tried in vain to convince the Jedi not to touch it. After the generator was destroyed, the controller only wanted to be left alone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Neimoidian's only appearance to date is the video game adaption of Star Wars: Episode I The Phantom Menace, in which he was voiced by Jeff Coopwood, who also provided the voice of Captain Panaka in the game. While the Neimoidian lacks an official name, he is called a \"Neimoidian controller\" in the game's credits."}, {"tag": "p", "text": "In the game, the Neimoidian is encountered in the first level by Obi-Wan Kenobi, who is controlled by the player. Kenobi does not have to interact with the Neimoidian in any way and can even kill the unarmed being, which has no effect on the game. Due to this, and the fact the player has several dialogue options, whether the conversation between the Jedi and the Neimoidian is actually canonical—and, if it is, the exact form in which it transpires—is ambiguous. This article assumes 100% game completion with no \"dark side\" options. The game's strategy guide advises the player to talk to the technician. Regardless, the power generator must be destroyed by the player to continue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}