{"url": "Nekghoul", "categories": ["Category:Legends articles", "Category:Force-sensitive species", "Category:Mutants", "Category:Nekghouls", "Category:Rakghouls", "Category:Sithspawn"], "nodes": [{"tag": "h1", "text": "Nekghoul"}, {"tag": "p", "text": "Nekghouls were a more evolved and intelligent strain of rakghouls that had evolved in the ruins of Taris after driving the Outcasts to extinction by the time of the Cold War, three centuries following the planet's destruction in 3956 BBY, where for a while they were the planet's only inhabitants. They were larger and much smarter than rakghouls, which suggested that they may have qualified as their own separate species, and they also stood upright, compared to the standard hunched stance of rakghouls. Nekghouls were also unable to infect or transform their victims."}, {"tag": "p", "text": "What particularly set nekghouls apart from rakghouls was that they were sensitive to the Force, though they were untrained and their violent response to intruders made them lean more towards the dark side. They were capable of speech but had no known history or record of their origins but it's possible that it was because they were descended from the Outcasts. This led to some speculation on whether they were Jedi or Sith infected with the rakghoul plague or perhaps the result of mutation caused from radiation by Taris' shattered reactors."}, {"tag": "p", "text": "At some point of time, the Nekghouls obtained the holocron of a Jedi named Bay-Yon Siu. For an unknown period of time, the holocron attempted to teach the Nekghouls in the ways of the Force in hopes of helping them master themselves, which resulted in small success. Eventually, Jedi Knight Danah Jor attempted to destroy the holocron and the Nekghouls as he believed that the Nekghouls were too dangerous to be kept alive. A Republic aligned spacer was brought to the homes of the Nekghouls, encountering the holocron and the now imprisoned Danah Jor. The individual was then told of the state of the Nekghouls by the Holocron and the Jedi Knight Danah Jor, judging them according to their pleas and information given from both parties. After hearing from both sides of the debate, the individual allowed the holocron to continue teaching the Nekghouls in the ways of the Force by the holocron as the individual freed the Jedi Knight from his imprisonment."}, {"tag": "p", "text": "Darth Gravus's attempts at destroying the Galactic Republic's reconstruction of Taris led to the uncovering of efforts made by Jedi Master Sulan in attempting to turn nekghouls to the light side of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}