{"url": "Nella_Bold", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Mantellians", "Category:Moisture farmers"], "nodes": [{"tag": "h1", "text": "Nella Bold"}, {"tag": "p", "text": "Nella Bold was a young woman living on Ord Mantell, daughter of moisture farmer Orin Bold."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nella lived alone with her father on his moisture farm since her early youth, when her mother was murdered by Savrips. Running the farm was hard on her and her father, since the tyrannical land baron Taxer Sundown, who wanted to take over their enterprise, scared away both customers and their hired help. What time her work did not require, Nella spent modifying and improving her T-24 airspeeder, which her father had given her after finding it left behind by a miner in the province."}, {"tag": "p", "text": "In 37 BBY, Nella met the two Jedi Qui-Gon Jinn and Obi-Wan Kenobi, who were investigating a mysterious freighter from Vena shipping Mantellian Savrips. When they also decided to investigate Sundown, she decided to help them and fly them to the city at Ten Mile Plateau where his headquarters were located. On the way, they passed a band of Savrips. Nella, who naturally had wanted revenge on these creatures ever since her mother's murder, tried to strafe them with the airspeeder's inbuilt heavy blaster, but was forcibly restrained by the Jedi, causing her to resent them."}, {"tag": "p", "text": "When they arrived in the city, malicious eyes were already watching for them. Nella suddenly felt very ill. Moments later, she was mind-controlled by Sundown's mysterious powers and led the Jedi into a trap. In a back alley, Sundown revealed himself to the Jedi through a hologram. Immediately thereafter, they were attacked by more of Sundown's mind-controlled servitors, mercenaries armed with lightsabers. While the Jedi were thus occupied, Sundown's elite cadre abducted Nella and left."}, {"tag": "p", "text": "Nella was brought to Sundown's mountain retreat, far out in the desert, where she was held while the criminals deliberated. In the end, they decided to take her out into the desert and kill her. However, at this point Savrips led by Mawkran, the same Savrips she had tried to kill earlier, attacked the base and killed Sundown's goons. Nella expected to be killed or worse, but much to her surprise the Savrips spared her, capturing her but treating her better than the mercenaries had."}, {"tag": "p", "text": "Eventually, the Jedi Master Qui-Gon Jinn managed to track down the Savrips and free her. He also opened talks with the savrips, who proved much more civilized and intelligent than anyone had ever suspected. Mawkran, who was able to speak accented Basic, revealed that it was Sundown, not them, who was behind many of the murders that had plagued the countryside, including that of Nella's mother. For some reason, he seemed to want the Savrips hated, and by now they had been driven into near-extinction. His clan were the last, and now there where going to fight back - or die. Nella then agreed to help Qui-Gon and the Savrips to fight Sundown."}, {"tag": "p", "text": "The Savrips thus attacked his main headquarters at the Ten Mile Plateau. Sundown himself was killed by Obi-Wan Kenobi, and his mistress, the Baroness Omnino, by Master Jinn. However, a militia of moisture farmers, who had observed the battle, thought the Savrips had launched a general attack on Ord Mantell's Human community, with Nella as their hostage. Sneaking up on the victorious heroes, they shot Mawkran, who stood the closest to Nella, in the back, killing him. The misunderstanding was eventually resolved, but that did not bring him back."}, {"tag": "p", "text": "Nella, very touched by the Savrips' sacrifice, vowed to spend her life trying to undo the wrongs that had been committed against them. However, she was powerless to prevent their later decline."}, {"tag": "h2", "text": "Talents"}, {"tag": "p", "text": "Like her father Orin, Nella Bold was a skilled mechanic, able to jury-rig Mobquet and Subpro components to interlink with Incom machinery. She maintained her airspeeder with little apparent difficulty, entirely without any professional help. She was also a fairly skilled pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Ryder Windham has suggested Nella Bold may be the mother of Rebel pilot Dorovio Bold, whom was first named by Windham in Star Wars: The Complete Visual Dictionary, though this has not been made official."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}