{"url": "Nelvaan/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Ice planets", "Category:Low-gravity planets", "Category:Savareen sector planets", "Category:Terrestrial planets", "Category:Triellus Trade Route"], "nodes": [{"tag": "h1", "text": "Nelvaan"}, {"tag": "p", "text": "Nelvaan was a planet in the Koobi system in the Savareen sector of the Outer Rim Territories and was located at galactic coordinates Q-16. A frigid world, Nelvaan was home to the sentient Nelvaanian people. The Nelvaanians were considered primitive to many, as they lived in tribal villages, one of which was named Rokrul. Each village was led by a chieftain and their bond-mate along with a shaman who served as consultant on most matters. Religion was central in Nelvaanian culture, and the planet itself was referred to as the Great Mother. Therefore, when the Techno Union built a laboratory during the galactic Clone Wars that was powered by a siphon generator, a machine that absorbed geothermal energy, and the planet was plunged into an ice age, the locals became very concerned. The villagers sent all their male warriors to discover the cause of the Mother's plight, but none returned."}, {"tag": "p", "text": "In the year 19 BBY, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker arrived on the planet in search of General Grievous of the Separatist Droid Army. After defeating a vicious horax, the two were escorted to the Rokrul shaman Orvos. There, Orvos declared Skywalker to be the prophesied Holt Kazed, or \"Ghost Hand,\" and sent him off to heal the Great Mother. Skywalker followed Orvos' instructions and discovered the Techno Union laboratory and the Nelvaanian males. The Jedi freed the men and destroyed the base, later returning the men to their village."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nelvaan was an icy planet located at galactic coordinates Q-16 in the Koobi system in the Savareen sector of the Outer Rim Territories. Nelvaan had three moons and relatively low gravity at eighty-five percent. A day on Nelvaan took the standard twenty-four hours, and a year was made up of 349 of those days. The surface terrain consisted mostly of mountains, rivers, glaciers, and tree forests. The planet's low gravity also allowed for odd landscapes featuring precarious mesas that would have toppled centuries earlier under the strains of standard gravity. Nelvaan had a breathable atmosphere for Humans and Skakoans. The planet's low gravity also allowed for some really massive lifeforms such as the predatory horax. Other creatures native to Nelvaan included the siltcrawler, a common food for the horax, the bruise-leech crawler, and the white-furred bantha, along with other avian, primate, and rodent species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the days of the Old Republic, Nelvaan was still a primitive world. By the time of the Cold War between the reconstituted Sith Empire and the Republic, it was the only planet in the Koobi system that was not under control of the Sith Empire. During the Cold War, the Empire was of the opinion that Nelvaan was not worth conquering by force, and thus Imperial diplomats were sent to the world. The diplomats convinced the native Nelvaanians that the Empire had a legitimate right to their world, and the Empire considered using them as slaves. Bothan miners occasionally stopped by the planet to fill up their freighters' holds with water from the massive glaciers in order to sell in local space. The miners promised invigorating, life-bolstering minerals were contained in the water, though this had never been scientifically scrutinized."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Sometime prior to the year 19 BBY, Orvos, the shaman of the Nelvaanian village of Rokrul, prophesied a coming ice age. During the galaxy-spanning Clone Wars between then Galactic Republic and the rebelling Confederacy of Independent Systems, the Confederacy-aligned Techno Union constructed a laboratory in the planet's eighth sector, the Skakoan scientists and workers of which eventually made up three percent of the population. This base was powered by a siphon generator that fed off of thermal energy from the surrounding area. This plunged the planet into the ice age Orvos had predicted, but the climate change was so intense that the locals were still shocked. The Nelvaanians of Rokrul began to worry for their planet, which they referred to as the Great Mother, and started sending out warriors and scouts to see what was ailing her. None of them returned, leaving, aside from Orvos, only women and children left in the village. However, Orvos prophesied that two off-worlders would eventually come and save them from their plight."}, {"tag": "p", "text": "In the year 19 BBY, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker were sent to Nelvaan in search of the famous General Grievous, a leader in the Separatist Droid Army of the Confederacy. Upon arrival, the two Jedi and their clone troopers were attacked by a massive horax that killed all the clones before falling to the lightsaber blade of Skywalker. The two quickly realized they had interrupted the coming-of-age ritual of the son of Rokrul's Chieftain Tuzes-Adaz. Instead of having the Jedi killed on the spot, the chieftain brought them to the village to see Orvos, having remembered his prophesy regarding the two who would save them. After examining the Jedi, Orvos decided Skywalker was the prophesied Holt Kazed, or \"Ghost Hand.\" He then sent Skywalker off to find what was ailing the Great Mother."}, {"tag": "p", "text": "Skywalker followed instructions given to him by Orvos, leading him to the secret Techno Union facility. After seeing a vision of his future, he discovered the Nelvaanian males being mutated and experimented on by the Skakoan scientists. He rescued the warriors and destroyed the base, killing the Skakoan workers out of rage. He then went on to return the men back to their women and children, who at first were hesitant to embrace them due to the massive mutations the men had undergone. With the siphon generator no longer sucking up thermal energy, the planet began to return to its normal temperature."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Nelvaanians, canine-muzzled humanoids making up ninety-six percent of the sentient population, were the only sentient native species of Nelvaan, and they lived simple primitive lives in a society organized into tribes. Each tribe was led by a chieftain and their bond-mate, with a shaman serving as a consultant on almost all matters. Their culture was centered around their religion, and they referred to their planet as the Great Mother. Because of this, motherhood was considered sacred, and along with building and gathering food, mothers were tasked with the most important job in society: the raising of the children. The fittest males of the villages became warrior scouts responsible for defending the people from predators and hunting game for food. The Nelvaanians had little contact with the rest of the galaxy, and they maintained no centralized government and no allegiance during the Clone Wars."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Rokrul"}, {"tag": "p", "text": "Rokrul was a small Nelvaanian village located underneath a large mesa overhang. Its buildings, of which there were at least fifteen, were either made out of rocks or made from hollowing out stalagmites growing from the floor. There were at least eighty-five villagers from several different tribes, as the village was the result of a loose affiliation among those tribes for protection and assistance. The village women wore long brown, gray, and red gowns, while the men wore pants and loincloths with no top and children wore robe-like garments that were often brown."}, {"tag": "h3", "text": "Techno Union laboratory"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet gets its name from Nelvana, the animation company that made the animated segment in The Star Wars Holiday Special, and produced the Ewoks and Droids animated series. The Star Wars mythos also pays homage to the company's animation predecessors in the form of the planet's dog-like inhabitants, who resemble characters from Rock & Rule, the studio's first film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}