{"url": "Nem_Bees", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Impersonators", "Category:Jedi Purge victims", "Category:Males", "Category:Ortolans", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Nem Bees"}, {"tag": "p", "text": "Nem Bees was a male Ortolan Jedi Knight who served the Galactic Republic during the pan-galactic Clone Wars. When, late in the war, Bees's homeworld of Orto was threatened by the Confederacy of Independent Systems, the Jedi Council dispatched him to undermine the Separatists' efforts and secure Orto for the Republic. Disguised as the deceased Ortolan trader Ydde, Bees searched for a reported influential traitor who planned to sell the Ortolan people out to the Confederates."}, {"tag": "p", "text": "Despite his efforts, Orto was invaded successfully by the Confederacy a mere three days after Bees's arrival. Belo Tusus was revealed as the traitor, and despite the setback, Bees persisted in his mission. Sabotaging the machinations of Tusus's new Orto government, Bees paved the way for a successful Republic counter strike. During the campaign to eliminate the last pockets of Confederate resistance, Order 66 was initiated by Supreme Chancellor Palpatine, and as a result, Bees was slain by Commander CT-65/91-6210."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Investigation on Orto"}, {"tag": "p", "text": "As the Clone Wars entered its final phase in 19 BBY, the Galactic Republic began to lose holdings in the Sluis sector. The only stable planet in the general vicinity was Eriadu, and talk of secession began to brew at the Sluis end of the Rimma Trade Route. Realizing the importance of the planet Orto in the crisis, the Republic dispatched Jedi Knight Nem Bees to the planet, his homeworld. There, intelligence reports claimed that an official, highly placed in Orto's neutral government, was planning a coup. If it succeeded, it would place Orto in the official's hands, who would then surely align himself with the Confederacy of Independent Systems."}, {"tag": "p", "text": "At the urging of fellow Knight Ki-Adi-Mundi, Bees disguised himself as the trader Ydde, who had actually been murdered well over a decade prior. He stayed with Ydde's extended family as he operated in Orto's capital undercover, hunting for the traitor that would betray his planet and his people. Despite Bees's efforts, mere days after his arrival Financial Minister Belo Tusus staged his coup. Seizing control of the government while announcing his allegiance to the Confederacy, Tusus locked down all of Orto's spaceports. Shortly afterwards, the droid armies of the Confederacy arrived to occupy the planet. Realizing that his cover would be important if he were to swing events to his favor, Bees maintained his cover, which forced him to play the role of a frightened citizen as the battle droids swept through the city."}, {"tag": "h3", "text": "Sabotage"}, {"tag": "p", "text": "Despite his initial unwilling passiveness towards the unwanted Confederate occupation, Bees acted quickly. Just as Tusus began to install his new government, Bees effectively sabotaged it, militarily and logistically. He struck in several areas, preventing droid detachments from deploying, and severing shuttle guidance systems. Bees was fortunate to have a contact in Tusus's government: the traitor's own Twi'lek servant. Tusus, however, never discovered the leak, though he became increasingly paranoid and suspicious of his staff and the Neimoidian attachés in his council."}, {"tag": "p", "text": "Planning one final act of sabotage, Bees was able to gain access to a HoloNet transceiver, thanks to his Twi'lek ally. Contacting the Republic for the first time since the annexation of Orto, he arranged to have a strike force sent to Orto at a specific time. Working fast, Bees infiltrated the capital's palace, and disabled Orto's shield generator just as the Republic strike force emerged from hyperspace."}, {"tag": "h3", "text": "Demise at the Battle of Orto"}, {"tag": "p", "text": "Tusus, in a panic, abandoned his holdings and fled Orto. Bees rendezvoused with his allies as they landed. Led by Commander CT-65/91-6210, known also as \"Deviss,\" the clones met with Bees and progressed towards Orto's capital in the hopes of liberating it from the Confederacy. The Battle of Orto, however, was not resolved quickly, as the droid armies had firmly entrenched themselves. A week into the campaign, Supreme Chancellor Palpatine issued Order 66. Though he did not know it, Bees was now considered an enemy of the Republic, and his death was now the number one priority of his own troops. Acting on his orders, Commander Deviss personally gunned down Bees as the diminutive Jedi led an assault on the Confederate position."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During the trying times of the Clone Wars, Bees was thrust amongst his own people on his home planet, and had to live like a commoner in order to fulfill his duty to the Republic he served. When Belo Tusus betrayed Orto to the Confederacy, Bees was forced to act dispassionately, and sit idly by while troops marched into the planet's capital. That choice would later allow Bees to free his people in a more bloodless fashion."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Nem Bees was adept in the fields of subterfuge and infiltration, which he proved during the Orto situation in 19 BBY. He was able to inhabit the persona of Ydde, and successfully maintain his cover for the duration of his mission. Bees was able to identify and exploit the chinks in his adversary Belo Tusus's armor, and effectively undermine the former Financial Minister's new Orto government. Working in tandem with his mole in Tusus's government, Bees successfully damaged many auxiliary operations of the government, and aided his people in doing so. In a matter of mere hours, Bees was able to go from the role of saboteur to general, as he commanded his troops in the Battle of Orto. Despite his talents, he was unable to defend himself from the unexpected attack of his clone commander."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Nem Bees first appeared in the episode \"Chapter 22\" of the second season of Genndy Tartakovsky's television series, Star Wars: Clone Wars. At that point, the character was an unnamed Ortolan featured briefly in two shots of a montage sequence. In 2006, a name and a backstory was given to the character by Hyperspace member Kyle Jewhurst, under the screen name \"Lord Hydronium,\" through the \"What's The Story?\" feature on StarWars.com. The character was retroactively made a Jedi Knight by Jewhurst, who had noted that no members of the Ortolan species had been a Jedi previously in canon. Jewhurst also made reference to Bees's master being Shon Kon Ray, but the reference was cut during the editorial process."}, {"tag": "p", "text": "Which particular Ortolan Bees is in the wide shot displayed in the Databank entry is not clear; however, the small preview boxes featured on StarWars.com identify Bees as the Ortolan to the far left of the image. The image was later used in The Complete Star Wars Encyclopedia, in which Bees was given an entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}