{"url": "Nemen_Ull", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Nemen Ull"}, {"tag": "p", "text": "Nemen Ull was a male Jedi Master who served the Jedi Order during the Clone Wars. Shortly after the Battle of Mon Calamari around 22 BBY, Ull and his Rodian apprentice Wamtra were deployed to the planet Argul, where they held off legions of Confederate battle droids while the native Argullians evacuated from the world. During the battle, Ull entered an apartment complex to search for a missing child, and he died when the building was shelled by Confederate Armored Assault Tanks."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nemen Ull was a Force-sensitive male individual who served the Jedi Order during the waning years of the Galactic Republic. Ull eventually attained the rank of Jedi Master and trained the Rodian Jedi Wamtra as his apprentice. In 22 BBY, the galaxy was plunged into conflict following the outbreak of the Clone Wars between the Galactic Republic and the separatist Confederacy of Independent Systems. Around the first year of the conflict, shortly after the Battle of Mon Calamari, the planet Argul fell under attack from Confederate forces, and the Republic leader Supreme Chancellor Palpatine called for an evacuation of the world's cities."}, {"tag": "p", "text": "Ull and Wamtra journeyed to Argul to aid the withdrawal, and they were tasked with fending off the attacking Confederate army for long enough to allow the native Argullians to reach the planet's docking towers. For hours, the two Jedi held back legions of Separatist battle droids, and their actions created a window of opportunity for the Argullians to transfer their sick and wounded to the docking towers and flee the world, saving countless lives. However, after Ull entered an apartment complex to search for a missing child, the building was shelled by Confederate Armored Assault Tanks and was destroyed, resulting in the death of the Jedi Master. In the aftermath of Ull's demise, Wamtra struggled to cope with the loss of his mentor, becoming distraught and withdrawn; he wondered whether he should have gone into the apartment complex in Ull's place, and even considered resigning from the Jedi Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nemen Ull was willing to sacrifice his life while attempting to save a child during the fighting on Argul. He had a close relationship with his apprentice, and Wamtra was overwhelmed with grief as a result of the loss of his Master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nemen Ull was mentioned in Only the Force, a role-playing adventure that was written by J.D. Wiker and published in 2004."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}