{"url": "Nemo", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Jedi of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nemo"}, {"tag": "p", "text": "Nemo was a Human male who served as a Jedi during the Jedi Civil War. In 3956 BBY, served at the Jedi Enclave on the world of Dantooine, where he met the amnesiac Sith Lord Revan. He was assigned by the Enclave Council to investigate nearby Rakatan ruins, but fell victim to the ruins' security system."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nemo had served as a Jedi for many years during the Old Sith Wars. By the time of the Jedi Civil War against Darth Malak's Sith Empire, Nemo had become quite elderly. In 3956 BBY, Nemo was serving the Jedi Order at a hidden Jedi Enclave located on the pastoral Outer Rim planet of Dantooine."}, {"tag": "p", "text": "Following the destruction of Taris, the former Sith Lord Revan, who was suffering from amnesia, fled to Dantooine with Padawan Bastila Shan, Republic Soldier Carth Onasi, and the rest of his party. Upon arriving, Revan and Bastila shared a dream about ancient Rakatan ruins near the Enclave. The Enclave Council agreed to retrain Revan as a Jedi, and he completed his training within weeks, much to the surprise of Jedi Master Zhar Lestin. In order to proceed to the rank of Padawan, Revan first had to complete three trials. Revan quickly recited the Jedi code and constructed a lightsaber, the first two trials. The council gave Revan his third trial: to cleanse the nearby Ancient Grove of its dark taint. The council knew that the taint was, in fact, the fallen Cathar Padawan Juhani, but did not inform Revan of this. They subsequently allowed Revan access to the area outside of the Enclave."}, {"tag": "p", "text": "Nemo was approached by Revan, of whom Nemo knew the true identity. The two carried out a friendly conversation, and Revan asked about the trial he had been given. While initially surprised that the council has not informed Revan of the grove, he quickly realized that was part of the test, and knew not to say more. Instead, he gave Revan directions to the grove, and a vague warning about the taint."}, {"tag": "p", "text": "While Revan headed towards the Grove and confronted Juhani, Nemo was assigned to explore the ruins that Revan and Bastila has seen in their dream. Upon entering, he discovered the thirty thousand year old Rakatan droid that had resided there. In order to access the full expanse of the ruins, one must first solve puzzles and fight security systems to unlock the two seals on the inner door. Nemo failed these tests, and was struck down by the security systems."}, {"tag": "p", "text": "After defeating Juhani and returning her to the light, Revan returned to the Enclave, where he was made a full Jedi Padawan. As his first mission, he and Bastila were to explore the ruins, and discover what had happened to Nemo. Upon arriving, the two met the Overseer Droid, and discovered Nemo's body. Bastila was saddened by his death, but still wanted to uncover the secrets of the ruins. The two successfully solved both puzzles, and defeated the security droids. Inside the now open room, the discovered and ancient Star Map, one piece to the location of the Star Forge superweapon. Revan and Bastila would go on to discover four more Star Maps, and discover the location of the Star Forge."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nemo was male Human, who was quite elderly by the time of war against Darth Malak. As such, his fair skin was wrinkled, and his hair was white. He had undergone significant hair loss, and his eyes were a gray nearly as light as his hair."}, {"tag": "p", "text": "He was kind and welcoming to people, even those he was unfamiliar with. Nemo would often stop and get carried away in the beauty of nature, and encouraged others to do the same. He was willing to give advice to Revan, but when he heard that the council did not inform Revan of the grove, he understood that it was not his place to speak about it. Instead, he only gave the location and warned Revan to not quickly judge a situation of which he was ignorant. He understood that the dark could control a person just as much as the light, and told Revan of such. Nemo did not put undue importance on rank or heirarchy, but instead accepted his place in the world, whether it be high or low. After Revan commented on Nemo's unorthodox name, Nemo explained that he believed names were unimportant, alluding to his knowledge of Revan's true identity by saying: \"You of all people should remember that.\""}, {"tag": "p", "text": "He frequently associated with, and got to know, the residents of Dantooine, even sharing many rounds of the card game Pazaak with Aratech employee Karal Kaar during the early hours of the morning. Nemo hoped that by serving the Jedi, he could better serve the Galactic Republic and it's citizens. He could make logical discernments, and believed that the Kinraths in the nearby caves were drawn to the color and heat of the lightsaber crystals. Despite his prowess, Nemo was unable to solve the test within the Rakatan ruins."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Being a Jedi, Nemo wore the typical Jedi apparel of the time. He wore beige Jedi robes, a darker beige undertunic, and white pants, similar to many Jedi at the time. He also wore brown cloth pauldrons and gloves, gray boots and wrist guards, and a gray utility belt."}, {"tag": "p", "text": "During his assignment to the Rakatan ruins, he wore a blue robe with slight protective capabilities. This robe was retrieved by Revan and Bastila during their investigation of the tomb."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nemo appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic developed by BioWare. The direct interaction with Nemo is optional, and the player does not have to speak to him. None of the dialogue options change the player's alignment, nor do they begin or interact with any quests. Nemo's death is unavoidable, and both Bastila Shan and Vandar Tokare will speak of him and his death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}