{"url": "Nentan", "categories": ["Category:Legends articles", "Category:Glythe sector planets", "Category:Nentan locations", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Nentan"}, {"tag": "p", "text": "Nentan was a terrestrial planet located in the Nentan system of the Glythe sector. Nentan was a barren planet, and the main point of interest was the ancient ruins of a city built by an unknown alien species. During the Galactic Civil War, Nentan briefly hosted an Alliance base. The facility was evacuated after being discovered two months after going operational. Captain Bren Derlin's actions during the evacuation earned him a promotion to the rank of Major."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Nentan was located in the Nentan system, part of the Mid Rim's Glythe sector. The world was a barren, terrestrial wasteland. Nentan was located on the Celanon Spur, and was the endpoint for a hyperlane connecting Nentan to Valrar."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point in the planet's history, an alien species built a city on Nentan. By the time of the Galactic Civil War, the city was nothing more than ancient ruins and nothing was known about the original builders. During the Galactic Republic's expansion of the New Territories, the government tried to set up Nentan, alongside Cassander and Ketaris, as trading rivals to Ord Mantell. The efforts failed, and only served to push Ord Mantell to higher prominence."}, {"tag": "p", "text": "During the Galactic Civil War, the Empire actively suppressed Rebel activity on Nentan. Prior to the Battle of Yavin, Princess Leia Organa of Alderaan participated in a relief mission to the planet."}, {"tag": "p", "text": "Following the Battle of Yavin, the Alliance to Restore the Republic established a base on Nentan. It served as a major stopover point for civilians being transported on to Alliance safe worlds. General Carlist Rieekan commanded the base, with Captain Bren Derlin serving under him. Two months after the base went operational, it was discovered by Imperial forces. An evacuation was ordered, but the checkpoint base was full of civilians. Evacuation priority was to be given to the civilians, but there were not enough transports available to handle both the civilians and Alliance military personnel."}, {"tag": "p", "text": "Faced with the prospect of abandoning military forces on Nentan, Captain Derlin presented General Rieekan with a solution. While the civilians were evacuated, Captain Derlin led a squad of \"expendable\" personnel into the Nentan wastes, hiding among the rocky spires of the ancient ruins."}, {"tag": "p", "text": "Imperial forces assaulted the abandoned base with their full might, leaving their own transports under light guard. Captain Derlin led his men through the natural cover around the landing zone, and managed to capture an Imperial landing barge. The surprise move outwitted the Imperials as the transport left Nentan. Even the commanding officer of the orbiting Star Destroyer believed the transport to still be under their control, either moving prisoners or captured equipment. The transport jumped to hyperspace before a code clearance could be asked for. For his actions, Captain Derlin was promoted to the rank of Major."}, {"tag": "p", "text": "During the Yuuzhan Vong's invasion of the galaxy, Nentan was captured and occupied by the extragalactic aliens."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Nentan was an inhabited planet. During the Galactic Civil War, the population was actively oppressed by the Empire. Alliance commando Bron Burs hailed from Nentan, specifically the southern region."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Nentan's most notable location was the ancient ruins of a city built by an unknown alien species. Located in the Nentan wastes, it was comprised of towering rock spires."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}