{"url": "Nera_Dantels", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Starfighter Corps personnel", "Category:Females", "Category:Humans", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Nera Dantels"}, {"tag": "p", "text": "Nera Dantels was a Human female smuggler and captain of the freighter Starduster who joined the Alliance to Restore the Republic during the Galactic Civil War. In 0 BBY, the Alliance had a critical shortage of astromech droids, and Dantels arranged to rendezvous with members of Red Squadron on Commenor to deliver a dozen R2 and R5-series astromech droids to the Rebels. The group came under attack from Imperial TIE fighters as they attempted to leave the Commenor system, but Dantels managed to take the Starduster to hyperspace and followed Red Squadron to the Rebel base on Yavin 4. While there, Dantels helped Red Squadron pilot Biggs Darklighter to find a rare plant in the jungle, an extract from which was used to treat pilot Derek Klivian, who was suffering from an unknown infection. Dantels and Darklighter began a brief relationship, but Darklighter was killed in combat against the Empire's Death Star battlestation soon after."}, {"tag": "p", "text": "Seven months later, Dantels was part of a diplomatic team sent to Jabiim to negotiate an alliance with the Jabiimi Loyalists. When the Jabiimi realized that Rebel pilot Luke Skywalker was the son of Jedi General Anakin Skywalker, who had abandoned them during the Second Battle of Jabiim in the Clone Wars, Dantels and the other Rebels were taken into custody. Escaping during a subsequent Imperial attack on the Loyalist base, Dantels and Princess Leia Organa reached the Starduster and returned to rescue Skywalker. Unable to help the Loyalists as the Imperials began an orbital bombardment of the planet, Dantels and the other Rebels were forced to flee. Two months after the Jabiim mission, Dantels joined Dagger Squadron in a raid to rescue a Rebel team that had been stranded on the Imperial refueling and supply depot Bannistar Station."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebel smuggler"}, {"tag": "p", "text": "The early life of the Human female Nera Dantels was shrouded in mystery, but by the early Galactic Civil War she was an experienced smuggler and captain of the freighter Starduster, with contacts on most of the major galactic trade worlds and a reputation for being able to obtain almost anything. Around this time, the Alliance to Restore the Republic was in desperate need of weapons and ships for their fight against the Galactic Empire. Choosing to abandon her neutrality, Dantels decided to assist the Rebellion by helping to acquire the necessary supplies."}, {"tag": "p", "text": "Shortly before the Battle of Yavin in 0 BBY, the Alliance acquired a number of T-65 X-wing starfighters from an Incom Corporation assembly facility, but a critical shortage of the astromech droids used for hyperspace navigation and systems management left them unable to use the new starfighters. Aware of the Alliance's supply problems, the Galactic Empire placed strict controls on astromech droids in order to keep them out of Rebel hands. The Alliance contacted Dantels and recruited her to obtain and deliver a cargo of astromech droids. Dantels managed to acquire some droids and attempted to make a delivery to the Rebels, but she was almost caught when Imperial Intelligence broke the Rebel underground on Averam while she was on the planet. Although she managed to get her people to safety, her cargo was lost in the process."}, {"tag": "p", "text": "By calling in favors from some of her contacts and bribing others, Dantels managed to acquire a dozen more R2 and R5-series astromech droids, and once again attempted to smuggle them to the Alliance, arranging to meet with Rebel operatives on the Imperial stronghold world of Commenor. A Rebel team consisting of Red Squadron pilots Wedge Antilles, Biggs Darklighter, Cesi Eirriss, and Jek Porkins proceeded to Commenor, where they were told to play sabacc in a local cantina until Dantels made contact. Shortly after they arrived, Dantels initiated an override tap into the flux field of one of Antilles's cards, changing the image on the card to direct the Rebels to meet her at Hangar Bay 31, where she was waiting with the Starduster. After meeting with the Rebels, Dantels agreed to meet them in orbit and follow them back to their destination. Upon leaving the planet's atmosphere, however, Dantels detected TIE fighters approaching from a secret Imperial base on Commenor's moon, Folor."}, {"tag": "p", "text": "Antilles and Darklighter moved to intercept the oncoming TIEs in their X-wings, leaving Eirriss and Porkins to defend the Starduster. With help from Dantels, using the laser cannons aboard her vessel to destroy two Imperial fighters that made it past her escort, Red Squadron soon eliminated the first wave. However, Eirriss's fighter was damaged in the dogfight. Antilles instructed Eirriss to eject so that Dantels could pick her up in the Starduster, but Eirriss instead set a collision course for the oncoming second wave of Imperial fighters, telling the other Rebels to leave without her. Dantels and the others jumped to hyperspace moments after Eirriss's starfighter collided with the Imperials, and proceeded to the Rebel base on Yavin 4."}, {"tag": "h3", "text": "The Battle of Yavin"}, {"tag": "p", "text": "After personally delivering the astromech droids to General Jan Dodonna, the head of the Alliance's Starfighter Command, Dantels remained on Yavin 4 and agreed to go on a date with Darklighter, spending the evening walking the parapets of the ancient Massassi Temple that served as the Alliance base. Sensing that Darklighter was distracted, Dantels asked what was wrong, and he explained that his friend and fellow pilot Derek Klivian was dying from an unknown disease that was resistant to bacta therapy. A few days later, she offered to accompany Darklighter and Doctor Shae Polikex into the Yavin 4 jungle in search of a plant extract that had cured members of the original survey team who had fallen victim to a similar infection."}, {"tag": "p", "text": "As the three Rebels proceeded through the jungle, Darklighter was attacked by a swarm of viper wasps, but Dantels was able to repel the insects with a smoke grenade. Soon after, however, a large mamien attacked the group, taking Darklighter by surprise and knocking him to the ground. As it moved in for the kill, Dantels opened fire with her blaster pistol. The creature survived her attack, but as it turned its attention on her, Darklighter was able to reach his vibroblade and use it to kill the predator. Pressing on once more, the group eventually came across the plant they needed and were able to retrieve an extract. They were still in the jungle when Darklighter received a call on his comlink ordering him back to base—the Empire's Death Star battlestation had entered the Yavin system and was moving to destroy the Rebel base."}, {"tag": "p", "text": "After returning to base, Darklighter prepared to participate in a Rebel attack on the approaching battlestation. Dantels promised that, if anything happened to him, she would take care of Luke Skywalker, his old friend from Tatooine who had recently joined the Alliance. Before he left, she approached Darklighter in the base's hangar and told him to come back safely, kissing him and leaving without waiting for an answer. The Rebels suffered heavy losses in the Battle of Yavin, and Darklighter was among those killed before Skywalker succeeded in destroying the Death Star. Following the battle, Dantels visited a holographic memorial to Darklighter with Klivian, who had recovered from his infection after treatment with the plant extract."}, {"tag": "h3", "text": "Diplomacy on Jabiim"}, {"tag": "p", "text": "Dantels continued to work with the Alliance over the following months, putting her piloting skills at their disposal and earning the respect of her fellow pilots, including Vin Nothos, whom she saved when they were ambushed on a supply run through the Momansi Belt. Seven months after the Battle of Yavin, the Jabiimi Loyalist leader Nolan Gillmunn invited Alliance representatives to the war-torn planet Jabiim to request their assistance in his fight against Imperial occupation and the Jabiimi Nationalist party. Dantels was selected to join Princess Leia Organa of Alderaan, statistician Jorin Sol, and Rogue Squadron pilots Luke Skywalker, Wedge Antilles, and Darek Klivian in the diplomatic party. With Dantels carrying Organa and Sol aboard the Starduster, the Rebels arrived at Jabiim to find Gillmunn's Loyalists under attack by TIE bombers and Imperial stormtroopers. Despite eliminating the attacking Imperials, Dantels and the other Rebels were greeted with suspicion by the Jabiimi, who distrusted off-worlders since they had been abandoned by the forces of Galactic Republic General Anakin Skywalker during the Second Battle of Jabiim in the Clone Wars. However, Gillmunn welcomed the group, and, while Antilles and Klivian kept patrol in orbit, Dantels and the other Rebels went with Gillmunn to the Loyalist base."}, {"tag": "p", "text": "The negotiations did not last long, however; when the Jabiimi realized that Luke Skywalker was the son of the man who had betrayed them twenty years earlier, they attempted to attack the Rebel party. Although Gillmunn was able to prevent the situation turning to violence, Dantels, Organa, and Sol were taken into custody and separated from Skywalker. Locked up and placed under guard, Dantels and Organa discussed potential escape plans but initially decided to wait and see how the situation developed. Before long, the Loyalist base came under attack by Imperial and Jabiimi Nationalist forces. Deciding that they could wait no longer, the Rebels fled their cell, accompanied by their guard, Luscen. As they made their way out of the base, they were attacked by a pair of stormtroopers, who shot Luscen and ordered the others to surrender. Moving quickly, Dantels grabbed the fallen guard's blaster pistol and shot both stormtroopers dead. At that moment, the Rebels were approached by the Jabiimi Loyalist Tal Hesz, who told them that Skywalker was with Gillmunn and that they were to rendezvous in the outlying hills."}, {"tag": "p", "text": "Following Hesz to a pair of speeder bikes, the Rebels set off for the rendezvous point, with Dantels and Organa following on one bike, while Hesz and Sol took the lead on the other. Before long, Hesz stopped at the edge of a minefield running through a narrow canyon. As the Imperials approached from behind, Organa decided to press on, hoping that her speeder bike could outrun the exploding mines. Hesz, however, had sold out the Rebels and allowed both himself and Sol to be captured by the Imperials. With their speeder damaged by the mines, the two remaining Rebels were unable to help Sol and decided to press on to the Starduster. They arrived to find Organa's droids C-3PO and R2-D2 pinned down near the ship by an All Terrain Scout Transport and several stormtroopers. Using the droids as a distraction, Dantels and Organa sneaked aboard the Starduster, and Dantels used its laser cannons to eliminate the Imperials."}, {"tag": "p", "text": "After recovering the droids, the pair were joined by Antilles and Klivian, who had managed to break through an Imperial armada that had arrived in orbit. Organa hoped to save the Jabiimi, but Dantels and Antilles persuaded her that there was nothing they could do; their only hope was to escape and send reinforcements. As the Imperial forces began an orbital bombardment of the planet, Dantels and the other Rebels headed back to the Loyalist base in search of Skywalker and Gillmunn. After Antilles and Klivian cleared the area of Imperials, Dantels took the Starduster down to retrieve their allies. Gillmunn refused to leave but insisted that the Rebels could not save the planet and should flee. As Gillmunn led the surviving Loyalists to the relative safety of the planet's underground mines, Skywalker boarded the Starduster, and Dantels took the ship to the safety of hyperspace."}, {"tag": "h3", "text": "Rescue from Bannistar Station"}, {"tag": "p", "text": "Two months later, the Alliance Fleet came under attack by elements of the Imperial Navy commanded by the Dark Lord of the Sith Darth Vader and was forced to flee into hyperspace. The Providence-class carrier/destroyer Rebel One failed to rendezvous with the rest of the Fleet, and Dantels was among several officers on the bridge of Admiral Gial Ackbar's flagship, Home One, when a message was received from Alliance spymaster Tungo Li aboard Rebel One advising them that the ship had become stranded at Bannistar Station, a major Imperial refueling and supply hub in the Mid Rim. Li informed the Rebels that Rebel One's crew, including Organa and Skywalker, was planning to infiltrate and destroy the station and that they did not expect to survive."}, {"tag": "p", "text": "When Ackbar refused to risk elements of the Fleet to rescue them, insisting that they were unprepared to charge into enemy territory, Dantels and Lieutenant Netrem Pollard of Dagger Squadron resolved to come up with another option. The Rebels soon intercepted a transmission revealing that Organa and Skywalker had been captured, and, despite Ackbar's reservations, Pollard planned to take Dagger Squadron's B-wing starfighters to rescue them. Dantels volunteered to accompany them in the Starduster, but Pollard felt that the Starduster was not nimble enough and would jeopardize the mission. When Dantels insisted, however, he reluctantly agreed to let her fly one of Dagger Squadron's B-wings, joining Pollard, Vin Nothos, and Callen Troyt in place of the Verpine pilot Suskafoo."}, {"tag": "p", "text": "By the time Dagger Squadron arrived in the system, Lieutenant Deena Shan, having avoided capture with the other Rebels on Bannistar Station, had managed to destroy a large section of the station with a thermal detonator, providing a distraction that allowed her comrades to escape. Shan rendezvoused with Organa, Skywalker, and the other surviving Rebel operatives, Basso and Able, and the group attempted to flee in a stolen Lambda-class shuttle. Dagger Squadron intercepted the shuttle as it lifted from the station and took up escort positions as TIE fighters launched to stop the fleeing Rebels. While Nothos and Troyt cleared a path through the nearby Imperial capital ships, Dantels, acting as Pollard's wingmate, helped to protect the shuttle from the approaching TIEs. When they were clear, all five Rebel ships jumped to hyperspace and returned to Home One. Dantels remained a member of Dagger Squadron following their return, though she also continued to fly the Starduster."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By the time she joined the Rebellion, Nera Dantels was already an experienced smuggler who was known for her ability to acquire almost anything from her network of contacts throughout the galaxy. Her skills as a smuggler made her very useful to the fledgling Rebel Alliance, and she was willing to abandon her professional neutrality to join them. Passionate and headstrong, with her individuality proclaimed by the blue, curved tattoos around her eyes, Dantels refused to conform and was not willing to let either rules or people stand in her way. She did not want to wait around to be rescued when captured by the Jabiimi, and, when her friends were in danger on Bannistar Station, she refused to obey Admiral Ackbar's order not to attempt to rescue them. Although Dantels was accused of taking unnecessary risks, her experience and skill as a pilot earned her the respect of her peers, and, despite Netrem Pollard's initial concerns that her skills as a solo pilot would not translate to flying in a squadron, she successfully adapted to working as part of Dagger Squadron, becoming one of the first Rebel pilots to fly the B-wing starfighter in the process. Dantels was also skilled with a blaster pistol."}, {"tag": "p", "text": "Tall and slender, with dark hair, pale skin, and facial tattoos, Dantels had a striking appearance, which Biggs Darklighter described as exotic. Darklighter found himself attracted to Dantels when he first saw her on Commenor and, fearing that somebody else would beat him to it, wasted no time in asking her out. Dantels agreed to a date walking along the parapets of the Massassi Temple on Yavin 4 and soon found herself breaking her professional rules by falling in love with the young pilot. Dantels was concerned for Darklighter's safety after he was attacked by a mamien in the jungles of Yavin 4 and before he left to fight in the Battle of Yavin, visiting him in the hangar and bidding him to return to her. When Darklighter was killed in the battle, Dantels was stricken with grief and joined Darklighter's friend, Derek Klivian, in visiting his holographic memorial in the Rebel base to pay her respects. After Darklighter's death, Dantels was determined to see through her promise to him that she would take care of Luke Skywalker if anything happened to Darklighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nera Dantels was created by author Michael A. Stackpole for the Dark Horse Comics special X-Wing Rogue Squadron ½, published on February 1, 1997. The events of Rogue Squadron ½ were later retold from Biggs Darklighter's perspective in the third issue of the Star Wars: Empire comic series' Darklighter story arc, written by Paul Chadwick and released in 2003. Darklighter, Part 4 expanded on Dantels' time on Yavin 4 and her relationship with Darklighter. She later appeared again in Empire's In the Shadows of Their Fathers arc, written by Jeremy Barlow under the pseudonym \"Thomas Andrews\" and released in 2005. Her most recent appearance was in Star Wars: Rebellion's Small Victories story arc, written by Barlow and released in 2008. Dantels also received entries in The Official Star Wars Fact File 126, 2008's The Complete Star Wars Encyclopedia, and 2009's Rebellion Era Campaign Guide. A pilot card for Dantels was included in the Star Wars: X-Wing Miniatures Game's Rebel Aces Expansion Pack, first released in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}