{"url": "Nerf/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Creatures of Alderaan", "Category:Domesticated creatures", "Category:Food creatures", "Category:Grassland and plains creatures", "Category:Herbivorous creatures", "Category:Herd and pack creatures", "Category:Mammals", "Category:Nerf products", "Category:Nerf subspecies", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Nerf"}, {"tag": "p", "text": "Nerfs were a species of antlered, herbivorous mammal found all across the galaxy."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "Nerfs were large quadrupeds characterized by their four, curved horns and shaggy coats of fur. The common nerf stood about 1.3 meters at the shoulder. Their mass of hair tangled easily, creating a perfect web for insects and foreign objects to cling to. Thus, they carried around a pungent odor. Nerfs often chewed their cud, creating excessive spittle that further added to their disgusting image. The spit was sticky, black in color, and near-impossible to remove from clothing. Their saliva also had acidic qualities, and could cause burns if it landed on exposed skin."}, {"tag": "p", "text": "Male nerfs were generally larger and more aggressive than their female counterparts, with more pronounced horns. They were known to trample the young and batter the females. Because of this, males were kept separated from the rest of the herd."}, {"tag": "p", "text": "In the wild, nerfs were common prey for predators such as manka cats and taoparis. They were often hunted by sentient beings such as the Gungans. Nerfs had unusually keen night-vision, helping them to spot nocturnal predators with ease."}, {"tag": "h3", "text": "Domestication"}, {"tag": "p", "text": "Nerfs originated on Alderaan and were raised on farms and in animal nurseries on planets such as Alderaan and Kashyyyk. Because of the nerfs' importance in the galaxy, they were exported from Alderaan and bred to exist on other worlds, specifically in the Core and Inner Rim, thus the nerfs did not go extinct when Alderaan was destroyed in 0 BBY. Nerfs were not commonly found beyond the Mid Rim, since most ranchers chose to breed and raise the less-troublesome bantha. Some planets developed efficient nerf production and monitoring programs, such as the Fennesa Nerf Herding Council."}, {"tag": "p", "text": "Herders of the beasts—nerf herders—were well known for being as scruffy-looking and surly as their livestock. They would take the females and young out in the field to graze for weeks at a time, while the males ate harvested grasses back on the ranch. Although nerf herders were looked upon as lesser beings, their role in society was vital. Nerf-hide and fur was treated with chemicals and carded into sheets of wool for use in clothing, foot-wear, and furniture."}, {"tag": "p", "text": "Nerf meat was among the most profitable in the galaxy, and nerf steak restaurants were commonly found in the Core Worlds. The nerf meat industry was a very important sector of the economy of planets such as Olanet. Some companies were dedicated to processing nerf meat, such as Haugg Nerf Industries, Grand Horn Ranch Corporation, and Davengatt's Double-Zed Nerf Ranch."}, {"tag": "p", "text": "Nerf meat was prepared and served in a variety of ways such as:"}, {"tag": "h2", "text": "Subspecies"}, {"tag": "p", "text": "Because of the nerf's ability to easily adapt to harsh environments, several defined sub-species existed. Alderaan itself was home to two sub-species of nerf; the common plains nerf, and the leaner forest nerf. A number of nerf breeds were also found on the Tunroth Triumvirate worlds."}, {"tag": "h2", "text": "Nerfs in culture"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}