{"url": "Nergon-14/Legends", "categories": ["Category:Legends articles", "Category:Weapon stubs", "Category:Explosive substances", "Category:Minerals"], "nodes": [{"tag": "h1", "text": "Nergon-14"}, {"tag": "p", "text": "Nergon-14 was a volatile mineral that was used in the construction of Imperial proton torpedoes. It was also utilized in commercially available explosives and black market devices."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Nergon-14 was a powerful explosive substance, and was used in proton torpedo warheads, as well as a variety of demolition charges. The mineral was mined and was highly unstable in its raw form, to the point that significant physical or energy interaction with the raw mineral would detonate it. Refining the mineral added some stability, at a minor cost to explosive performance. While not as powerful as baradium, used in thermal detonators, Nergon-14 was more stable in it's refined form and therefore better suited to massive shipboard armament requirements. When inert, its color was blue, then changing to red and white before exploding."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The mineral was known to be mined extensively on Christophsis."}, {"tag": "p", "text": "Some years before the Galactic Civil War, a bounty hunter known as Kleb Zellock acquired quantities of Nergon-14 for the Empire on Tyne's Horky. Members of the Palpatine Counter-Insurgency Front used Nergon-14 explosives during their terrorist activities shortly after Coruscant fell to the New Republic."}, {"tag": "p", "text": "While training undercover at the Jedi Praxeum on Yavin 4, Corran Horn ordered twelve Nergon-14 charges from Colonel Tycho Celchu. Corran intended to destroy a temple of the long dead Sith Lord Exar Kun by placing the charges at key structural points. However, Kun's vengeful and still very powerful spirit melted the charges in defiance of Corran's attempts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}