{"url": "Assertor-class_Star_Dreadnought", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Assertor-class Star Dreadnoughts", "Category:Galactic Empire starship classes", "Category:Kuat Drive Yards products", "Category:Star Dreadnought classes"], "nodes": [{"tag": "h1", "text": "Assertor-class Star Dreadnought"}, {"tag": "p", "text": "The Assertor-class Star Dreadnought, also known as the Assertor-class Command Dreadnought and the Assertor-class dreadnought, was a class of Star Dreadnought manufactured by Kuat Drive Yards that served in the Galactic Empire. One of the largest vessels in the Imperial Navy in terms of size and power, it was characterized by its long and thin arrow-shaped hull. The dreadnought boasted a large array of armaments and utilities to fulfill its roles as a command ship, sector patrol vessel, and fleet operations craft."}, {"tag": "p", "text": "The Assertor-class dreadnought saw use in the Imperial Era during the time of the Rebel Alliance, with the lead ship of the class, the Assertor, and its sister ship, the Wrath, being introduced prior to the Battle of Yavin. During the Galactic Civil War, both ships and their battle groups conducted anti-Alliance operations along the border between the Mid Rim and the Outer Rim Territories."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "Manufactured by Kuat Drive Yards and priced at 1,100,000,000 credits, the Assertor-class Star Dreadnought, also known as the Assertor-class Command Dreadnought and the Assertor-class dreadnought, was a class of Star Dreadnought characterized by its long, thin arrow-shaped hull. The hull featured a broad ridge that ran along roughly three-quarters of the dorsal face of the ship, ending just forward of the tapering fan-tail, which overhung the primary ion engines."}, {"tag": "p", "text": "In terms of size and power, the Assertor-class was second only to the Executor-class Star Dreadnought, which measured at 19,000 meters and was armed with 5,000 turbolasers among other weapons. As such, it was the largest vessel in the family of Imperial Navy dreadnoughts that included the Bellator-class and Mandator-class. Naval Station Validusia was large enough to have the capability of docking an Assertor-class along with a dozen other capital ships."}, {"tag": "h3", "text": "Equipment and complement"}, {"tag": "p", "text": "To fulfill its roles, the Assertor-class Star Dreadnought was equipped with numerous sophisticated communications and long-range sensor suites. The Assertor-class featured command and control systems, allowing its commanders a near-unparalleled view of the battlefield. It was also equipped with a navigation computer, a class 2 primary hyperdrive with a class 12 acting as secondary, and enough consumables to last three years."}, {"tag": "p", "text": "In order to operate the vessel, the Assertor was manned by 125,000 officers, pilots, and enlisted crew, while also carrying 20,000 troops and support staff. It maintained a complement of 120 starfighters and numerous shuttles, landing barges, assault ships, gunboats, ground assault vehicles, and AT-series walkers."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "Overall, the Assertor was armed with twenty port and twenty starboard quad heavy turbolaser batteries, fifteen port and fifteen starboard quad battleship ion cannon batteries, and ten dorsal twin heavy turbolasers. Additionally, there were ten forward, ten port, and ten starboard quad light turbolaser batteries. Twenty ventral twin battleship ion cannon batteries were also placed, along with ten port and ten starboard dorsal medium ion cannons, and twenty heavy tractor beam projectors."}, {"tag": "p", "text": "There were also twenty forward, twenty port, and twenty starboard turret-mounted quad laser cannons, in company with thirty forward, thirty port, and thirty starboard concussion missile launchers. These weapon emplacements crowded the dorsal and ventral hull of the vessel, giving each Assertor-class vessel the firepower to nearly destroy an entire planet."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Assertor-class Star Dreadnought was tasked with fulfilling several roles, including fleet and sector patrol duties and fleet operations. The Assertor was additionally optimized as a sector command ship and served as a powerful mobile weapons platform. The dreadnoughts were typically the flagships of their own battle groups as they supported combat operations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Assertor was deployed by the naval forces of the Galactic Empire and saw service during the Imperial Era. The lead ship of the class, the Assertor, and its sister ship, the Wrath, were laid down at Kuat Drive Yards at some point prior to the Battle of Yavin in 0 BBY. During the Galactic Civil War, the Wrath was deployed with its own battle group, as was the Assertor. Both battle groups operated concurrently on the border between the Mid Rim and the Outer Rim Territories to provide support for anti–Rebel Alliance operations."}, {"tag": "p", "text": "Although the exact composition of the battle groups was not known, it was assumed that both vessels operated with dozens of other ships including smaller dreadnoughts, Imperial I-class and Imperial II-class Star Destroyers, numerous cruiser-sized vessels, and numerous support ships. The Assertor's own battle group at one point consisted of at least two Imperial II-class Star Destroyers and large scores of TIE/ln fighters, and was located near a light blue celestial body that was in proximity to a smaller, darker-colored terrestrial body."}, {"tag": "p", "text": "At one point during the Empire's reign, an agent of the Rebel Alliance was held captive aboard an Assertor, awaiting interrogation. In order to preserve Alliance secrets, the agent had to be eliminated or rescued."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Assertor-class Star Dreadnought was first mentioned in the new Star Wars canon in the thirty-fourth issue of the De Agostini magazine Star Wars: Build the Millennium Falcon, published in 2015. The Assertor was later pictured in the 2016 Star Wars Roleplaying sourcebook Lead by Example, which was published by Fantasy Flight Games for use with the Star Wars: Age of Rebellion roleplaying game system. The book's depiction of the ship was drawn by Steve Hamilton. The Assertor-class was originally a fan creation designed by Ansel Hsiao in 2010. Both Hsiao's design and the name Assertor-class Star Dreadnought were later introduced into the Star Wars Legends continuity in Jason Fry and Paul R. Urquhart's 2012 reference book, The Essential Guide to Warfare."}, {"tag": "p", "text": "Due to the heavy armament of the Assertor-class, Lead by Example suggests that player-characters should not be forced to directly fight an Assertor. Instead, the sourcebook provides an alternative way of using the vessel in roleplaying game adventures—as a backdrop or the location of an objective that the characters must attain. An example given in the book describes a game-master player using an Assertor's weapons systems to target the player-characters' starships on each turn of the game while a space battle is being fought across the dreadnought's surface. A game mechanism is also suggested that allows for missed shots by the Assertor's weapons to instead damage ships of the characters' enemies."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}