{"url": "Neti/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Botanical sentient species", "Category:Force-sensitive species", "Category:Mid Rim species", "Category:Neti", "Category:Shape-shifting species"], "nodes": [{"tag": "h1", "text": "Neti"}, {"tag": "p", "text": "The Neti were a species of shapeshifting sentient plants from the Inner Rim planet Myrkr, though they were first encountered on their colony Mid Rim world of Ryyk. Some called them Ryyk because of the planet's name. Notable Neti included the Jedi Masters Garnoo, Ood Bnar, T'ra Saa, and the Sith librarian Dail'Liss."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Neti were a species of shapeshifting sentient plants who generally stood between 2 to 5 meters tall, but skilled individual could morph its shape into a roughly humanoid solid treelike mass anywhere from 2 to 9.5 meters tall. They evolved from the trees on the forested planet of Myrkr."}, {"tag": "p", "text": "The Neti had tough gray skin similar to plant bark, multiple thin branching arms, and thick body trunks. Neti foliage tended to be brownish or black and grew on the upper parts of a Neti's body. As plants, Neti survived through photosynthesis, though they also needed some water to survive. Neti were extremely long-lived, with an average life span of several thousand years. Neti reproduction only occurred once every few centuries. Seeds often remained dormant for more than a thousand years before germinating."}, {"tag": "p", "text": "Neti were capable of changing their size and shape, apparently at will. The shapes and sizes a Neti could assume ranged from very humanoid to very treelike, even when asleep or knocked unconscious. When resting, they generally appeared as 5-meter-tall treelike objects. As a result of the Neti's infrequent procreation and long lives, their population always remained small and quite close to their homeworld."}, {"tag": "p", "text": "As plants, Neti had no need for food. They had a greatly reduced need for water as long as they had regular access to broad-spectrum light. Neti only had need of one-tenth the water of most other species, but if deprived of sunlight, they would starve, much as other races would when lacking food. Neti schooled in a special Force trance, presumably hibernation trance, could survive almost indefinitely in an area without natural sunlight and rain. All Neti were Force-sensitive and learned both the Neti and Basic from youth.[source?]"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Roughly four thousand years before the Battle of Yavin, the Neti left their home planet of Myrkr for reasons unknown.[source?] Afterward, Neti never were a common sight across the galaxy. When Ryyk was destroyed, only one Neti (Jedi Master Ood Bnar) was known to have been offworld. However, given the species' long life span and germination period, some Neti might have survived the destruction of their world, awaiting discovery in remote locations."}, {"tag": "p", "text": "It was known that a clan of Neti continued to live on Nerit, a temperate moon of the planet Ossus. By the era of the Second Galactic Civil War, the species was considered a myth."}, {"tag": "h2", "text": "Common Neti names"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}