{"url": "Neutralizer-class_bomber", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "Neutralizer-class bomber"}, {"tag": "p", "text": "The Neutralizer-class bomber was a starfighter developed by Sienar Fleet Systems during the time of the Sith–Imperial War using the designs of the Predator-class fighter. The bombers were used by the Sith-backed Fel Empire in its battles against the Galactic Alliance; however, they saw limited use following the end of the conflict. When forces loyal to deposed Emperor Roan Fel began to rebel against Dark Lord of the Sith Darth Krayt's regime, the Sith-led Empire began sending Neutralizer-class bombers to perform air strikes against locations believed to be hiding those sympathetic to the Emperor-in-exile."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Neutralizer-class fighter was a multi-purpose bomber, in use by Darth Krayt's Galactic Empire. Developed by Sienar Fleet Systems' engineers by adapting the designs of their Predator-class fighter, the Neutralizer was larger, bulkier, and less agile than the Predator. Featuring impressive shields for a fighter of its size, the ship was also nimble for a bomber and was capable of reaching speeds of 1,500 kilometers per hour in atmosphere. The bomber was also equipped with a Class 1.0 hyperdrive, and a navicomputer for interstellar travel."}, {"tag": "p", "text": "The Neutralizer had space for one pilot, and it was outfitted with two medium laser cannons and a proton torpedo launcher that could fire its complement of 10 proton torpedoes. The bomber was also able to hold a week's worth of consumables and supported up to 110 kilograms of cargo."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "A multi-purpose bomber, the Neutralizer filled a diverse range of roles. Its primary purpose was strafing enemy ground emplacements and breaking open defensible positions. The Neutralizer-class bomber was also used to perform air strikes against positions suspected of hosting enemy sympathizers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the conflict between the Sith-backed Fel Empire and the Galactic Alliance beginning in 127 ABY—known as the Sith–Imperial War—the Neutralizer-class bomber was developed by Sienar Fleet Systems' engineers by modifying the Predator-class starfighter. Compared to the Predator fighter, few Neutralizers were assembled, although the bomber saw use in the attack on the planet Ossus at the end of the war."}, {"tag": "p", "text": "As its main purpose was assaulting defensible positions and strafing ground emplacements, the Neutralizer saw limited use after the Sith–Imperial War. However, when the forces loyal to Emperor-in-exile Roan Fel, who had been overthrown by Darth Krayt, began to rise up against the Sith regime, Krayt's Empire started sending Neutralizer-class bombers to perform air strikes against positions suspected of harboring sympathizers to the deposed Emperor Fel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Neutralizer-class bomber was first mentioned in the 2009 Wizards of the Coast roleplaying game sourcebook the Legacy Era Campaign Guide."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}