{"url": "New_Aldera", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Cleanup", "Category:Capital cities", "Category:Culture of Alderaan", "Category:Galactic Empire cities", "Category:New Republic cities"], "nodes": [{"tag": "h1", "text": "New Aldera"}, {"tag": "p", "text": "New Aldera was the capital city of New Alderaan. It was made to look exactly like Aldera, so it was most likely located in the mountains of the planet, nestled near a lake (or, by some accounts, on an island at the center of a lake)."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "New Aldera was a city where thousands of former residents of Alderaan moved to after the Destruction of Alderaan by the first Death Star. It was governed by the Alderaanian Council, presumably headed by the Alderaan Alliance. It was established by the Alliance to Restore the Republic's Support Services, including Lieutenant Deeve."}, {"tag": "p", "text": "When the Alderaan Alliance moved to New Alderaan after Old Alderaan's destruction, New Aldera was built in a similar design and in a similar landscape."}, {"tag": "h2", "text": "The Battles of New Alderaan"}, {"tag": "p", "text": "New Aldera participated in the First and Second Battles of New Alderaan."}, {"tag": "p", "text": "The First Battle of New Alderaan was a battle during the Zsinj campaign of the Galactic Civil War. Taking place around 8 ABY, the forces of Warlord Zsinj decimated New Alderaan, requiring that planet's evacuation by the New Republic."}, {"tag": "p", "text": "The Second Battle of New Alderaan was a battle between the reborn Emperor Palpatine's forces and the New Republic. Prior to the battle, the Emperor had sent a contingent of Scarab Droids to murder Luke Skywalker in his sleep. The Emperor also sent his Executor Xecr Nist and his second in command Tedryn-Sha to kidnap the Solo twins."}, {"tag": "p", "text": "Unfortunately for them, Jem Ysanna and Leia Organa Solo confronted them and killed them while Vima-da Boda destroyed the Scarab Droids."}, {"tag": "p", "text": "In retaliation for the assault on his Citadel at Byss, the Emperor sent a force of AT-ATs to destroy the Rebel settlement at New Alderaan."}, {"tag": "p", "text": "The AT-ATs were the latest generation of the vehicle class and were equipped with the most powerful Imperial turbolasers and the new X-80 Power Cells. As a result, many buildings and gun emplacements were destroyed."}, {"tag": "p", "text": "Just as the village was about to be massacred, the Millennium Falcon, Starhook Ten, Bespin Bandit, Hyperspace Marauder and a squadron of X-wings came to the rescue. These new arrivals destroyed several of the AT-ATs."}, {"tag": "p", "text": "Starhook Ten landed and opened her cargo bay to the surviving refugees. However, the Rebels were forced to flee and New Aldera was lost to the Empire."}, {"tag": "h2", "text": "Reclamation"}, {"tag": "p", "text": "Presumably after Zsinj's death in 8 ABY the New Republic reclaimed the planet, as well as after Palpatine's final death in 11 ABY."}, {"tag": "p", "text": "At some point during the Galactic Civil War, Lieda Mothma recovered on New Alderaan from an unspecified injury or sickness. Jan Dodonna would retire to New Aldera, where he died of old age in 24 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}