{"url": "New_Ambition", "categories": ["Category:Legends articles", "Category:Hutt Cartel starships", "Category:TL-1200 transports"], "nodes": [{"tag": "h1", "text": "New Ambition"}, {"tag": "p", "text": "The New Ambition, originally known as the Shadowfire, was a Suwantek TL-1200 transport under the ownership of the Corellian explorer Derrend Montis. Montis desired that the vessel be both inconspicuous and well-armed, and to that end he went to great effort to modify the Shadowfire and enhance it's combat capabilities with military-grade shields, engines, sensors, and weapons. For a time, Montis used the ship as his personal transport when on exploration missions in deep space. However, he later sold it to a shipping company and when the company became bankrupt a few years later, the Shadowfire was passed between various owners. Eventually, the vessel was confiscated by the businessman Popara the Hutt, as a payment for a loan default."}, {"tag": "p", "text": "In 19 ABY, Popara's youngest child Mika became stranded on the planet Endregaad after the world was quarantined following a viral outbreak. Popara hired the Jedi archivist Mander Zuma and the spacers Reen Irana and Eddey Be'ray to take the freighter and deliver a shipment of medicinal spice to Endregaad, to allow them to search for Mika. As part of the arrangement, Popara agreed that the spacers could keep the freighter, and they named it the New Ambition. While en-route to Endregaad, the New Ambition was attacked by a Bomu Clan starship while traveling along the Indrexu Spiral. On arrival in the Endregaad system, the New Ambtion was forced to dock with the Corporate Sector Authority Invincible-class Dreadnaught Heavy Cruiser Resolute, which had been sent to enforce the quarantine. The CSA eventually let the New Ambition go, on the condition that it immediately departed from the system, but Zuma defied their orders and he and his associates landed the vessel on Endregaad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}