{"url": "New_Bakstre", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Braxant Run", "Category:Cassandran Worlds", "Category:Confederacy of Independent Systems planets", "Category:Empire-in-exile planets", "Category:Galactic Empire planets", "Category:Imperial Remnant planets", "Category:New Republic planets", "Category:Pentastar Alignment planets", "Category:Tendrannan sector planets"], "nodes": [{"tag": "h1", "text": "New Bakstre"}, {"tag": "p", "text": "New Bakstre was a planet located within the Tendrannan subsector of the Outer Rim's New Territories. Part of the loosely affiliated domain known as the Cassandran Worlds, New Bakstre was a planet dominated by industry situated on the important Braxant Run hyperlane that served much of the galaxy's northern quadrant. One of New Bakstre's major settlements, Havridam City, was partially destroyed in 22 BBY after activists from the Mechanical Liberation Front accidentally detonated a shipment of Vindicator XM-15 \"brilliant\" missiles. The planet was involved in the later stages of the Clone Wars when Jedi-led Galactic Republic forces engaged the military of the Confederacy of Independent Systems on the world's surface. Annexed by the Galactic Empire along with the entirety of the Cassandran Worlds roughly twenty years later, New Bakstre remained under Imperial control during the Galactic Civil War and the Second Galactic Civil War, with a brief intermediate spell, during which it was allied with the New Republic. New Bakstre possessed seven moons, a rapid rotation rate, and a sky that was colored purple."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "New Bakstre was a planet located in the system of the same name. Situated in the New Territories region of the Outer Rim, New Bakstre sat between the planets of Cassander and Isiring on the Braxant Run, the most important trade route in the galaxy's northern quadrant that ran from the planet of Bandomeer through several sectors to out past Xerton Nine. New Bakstre was originally part of the domain known as the Cassandran Worlds, a loose alliance of more than a hundred star systems. Shortly before the Battle of Yavin which took place in 0 BBY, the Galactic Empire took control of the Cassandran Worlds, splitting the region into three separate sectors known as the Cassandran sectors—Cassander, Tadrin, and Tendrannan. New Bakstre fell into the newly created Tendrannan subsector."}, {"tag": "p", "text": "Orbiting a single star, New Bakstre was in turn circled by seven moons. The planet had a rapid rate of rotation, and its sky was purple-tinted when viewed from the surface. The atmosphere was breathable to Humans, and the native flora included forests and twisted vegetation. One of its major population centers was Havridam City. By 25 ABY, New Bakstre was home to between 100 and 500 million inhabitants."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around a century prior to the fall of the Galactic Republic, an Esselian conglomerate headed by businessman Cassander Tadrin invested in a large exploration project, sending survey droids into unexplored areas of the galaxy. The undertaking was a success, discovering several planets in an uncharted section of the New Territories in the galaxy's northern quadrant. Bored and dissatisfied with the Core Worlds' culture of self-satisfaction, Tadrin sold his company holdings and took tens of thousands of his loyal employees and their families to settle his new discoveries. The worlds became a loosely united region of more than a hundred star systems called the Cassandran Worlds, governed from the planet of Cassander, then known formally as \"Cassander's Star.\" New Bakstre was one of the region's industrial powerhouses alongside Minashee."}, {"tag": "p", "text": "In 22 BBY, the Mechanical Liberation Front, a group of droid rights activists, attempted to free a shipment of Vindicator XM-15 \"brilliant\" missiles near Havridam City on New Bakstre. They believed that the Arakyd Industries–manufactured missiles' central processor was so advanced that the resulting weapon should be considered as a sentient being doomed to live an explosive existence. The Mechanical Liberation Front's efforts set off the missiles' explosive warheads, which caused the destruction of a twenty-five-kilometer area of Havridam City, and killed all fourteen activists conducting the raid."}, {"tag": "p", "text": "During the Clone Wars, fought between the Republic and the breakaway Confederacy of Independent Systems, New Bakstre was located within Separatist-controlled space. Toward the end of the war, during the Outer Rim Sieges, Republic forces—which included clone troopers, commandos, and warships—led by the Jedi General Traavis fought Separatist forces on New Bakstre and throughout the Cassandran Worlds, including on Monhudle and Biitu. The Republic claimed victory in the Clone Wars, and Supreme Chancellor Palpatine shortly thereafter reorganized it into the Galactic Empire, declaring himself Emperor."}, {"tag": "p", "text": "Shortly before the Battle of Yavin in 0 BBY, an Imperial task force arrived at Cassander and annexed the Cassandran Worlds, dividing the region into three distinct subsectors: the Cassander subsector, administered from Cassander itself; the Tadrin subsector, ruled from Minashee; and the Tendrannan subsector, governed from Isiring. New Bakstre was located within the bounds of the Tendrannan subsector. Along with a swath of the Outer Rim Territories, New Bakstre came under the authority of the Empire's Oversector Outer, ruled over by Grand Moff Wilhuff Tarkin and administered from the planet Eriadu in the Seswenna sector. Following Tarkin's death at the Battle of Yavin, command of Oversector Outer was passed to Grand Moff Ardus Kaine, who moved the administration center for the region to the planet Entralla in the Velcar sector."}, {"tag": "p", "text": "During the Galactic Civil War fought between the Empire and the Alliance to Restore the Republic, Imperial Customs cruisers patrolled New Bakstre. At some point, they forced down a freighter, the Dorion Discus, piloted by the smugglers Roark Garnet and Hawk Carrow, who were attempting to make an unscheduled delivery to the world. The starship crashed into a forest, and Imperial troops wounded and captured Carrow, taking him to the infirmary aboard the M-class Imperial Attack Transport Regina Cayli. Garnet subsequently infiltrated the ship and rescued his friend."}, {"tag": "p", "text": "Emperor Palpatine perished during the Alliance victory at the Battle of Endor in 4 ABY, triggering a widespread collapse of Imperial authority across the galaxy as ambitious moffs and military officials took the opportunity to form their own fiefdoms. Grand Moff Kaine reduced the size of Oversector Outer so that it only encompassed the northern quadrant centered around the New Territories, effectively protecting his homeworld of Sartinaynian. New Bakstre and the Cassandran Worlds remained within space that Kaine controlled from 4 ABY until 12 ABY. During that time, Oversector Outer was renamed and reorganized into the Pentastar Alignment, a warlord dominion. Kaine was killed during Operation Shadow Hand, the campaign that the resurrected Emperor Palpatine instigated in 10 ABY to topple the New Republic, the successor state to the Alliance. The Alignment foundered without Kaine, until Admiral Gilad Pellaeon took control of the region in 12 ABY and incorporated it into the heart of his restructured Empire. The Empire lightly defended the Cassandran Worlds, with only a pair of Victory-class Star Destroyers and a few flights of TIE Series starfighters in the region. New Bakstre remained under Imperial control until 17 ABY, when the Empire was forced to retreat into eight sectors under the pressure of a concentrated New Republic campaign."}, {"tag": "p", "text": "Following the Empire's retreat from the Cassandran Worlds, the region joined the New Republic. The association was short-lived, however, as the domain was sundered by the advance of the extra-galactic invaders known as the Yuuzhan Vong, who waged war on the galaxy from 25 ABY to 29 ABY. By the time of the Second Galactic Civil War, contested between the Galactic Federation of Free Alliances—the New Republic's successor—and the breakaway Corellian-led Confederation, New Bakstre was once again located in Imperial-held territory. By 137 ABY, New Bakstre was situated within the borders of Emperor Roan Fel's Empire-in-exile."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "One of New Bakstre's major urban settlements was Havridam City. In 22 BBY, a large section of the city was destroyed when activists from the Mechanical Liberation Front attempted to \"rescue\" a shipment of Vindicator XM-15 \"brilliant\" missiles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "New Bakstre was the principal setting of Regina Cayli, an adventure included in West End Games' Star Wars: The Roleplaying Game, published in 1987. The adventure was subsequently reprinted in 1994's Star Wars Adventure Journal 1. New Bakstre received an entry in 1998's Star Wars Encyclopedia. In 2002, the planet was referenced in HoloNet News Vol. 531 51, an online series of in-universe news reports leading up to the start of the Clone Wars."}, {"tag": "p", "text": "Geonosis and the Outer Rim Worlds, published by Wizards of the Coast in 2002, included a mention of New Bakstre and its links to the Cassandran Worlds in the sourcebook's entry for the planet Garqi. The eighty-seventh issue of Star Wars Insider, published in 2006, referenced New Bakstre in Jedi General Traavis' entry in the article Order 66: Destroy All Jedi. 2008's The Complete Star Wars Encyclopedia included an entry for New Bakstre, and it was also mentioned in the book's entries for the Cassandran Worlds and Havridam City. 2009's The Essential Atlas and its online companion made reference to New Bakstre and provided details on its astrographical location in the galaxy."}, {"tag": "p", "text": "Geonosis and the Outer Rim Worlds states that the Yuuzhan Vong \"ravaged\" the Cassandran Worlds during their war on the galaxy, which is also supported by several maps in The Essential Atlas, which depict many known Cassandran Worlds under Yuuzhan Vong control. However, New Bakstre is never specifically stated to have been attacked or captured by the invaders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}