{"url": "New_Cov/Legends", "categories": ["Category:Legends articles", "Category:Churba sector planets", "Category:Confederacy of Independent Systems planets", "Category:Corellian Run", "Category:Galactic Republic planets", "Category:Jungle planets", "Category:New Republic planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "New Cov"}, {"tag": "p", "text": "New Cov was the third planet in the Churba system of the Churba sector, located in the Mid Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "New Cov was the third planet from the single star of the Churba system, located within the Churba sector of the Mid Rim region of the galaxy at the junction of the Corellian Run and the Duros Space Run. It was home to some 90 million inhabitants and was covered almost entirely in vast jungles so treacherous that the population was forced to construct domed cities as refuge from the lethal fauna and flora. Ships enter the cities through the top vents, following the curved pipes down and inward to a bright landing area beneath a transparisteel dome. When safely culled, this flora was a lucrative source for a biomolecular harvesting industry, with products being marketed by the New Cov Biomolecule Company. These biomolecules were important manufacturing components that could not be synthesized."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Great Sith War, Krath came from Bothawui and attacked the planet but it was liberated by the Galactic Republic."}, {"tag": "p", "text": "At the time of the Galactic War, dozens of destroyed Imperial starships from a battle at the icefield got iced up in the exosphere of New Cov."}, {"tag": "p", "text": "Covies, as the residents were nicknamed, were routinely pillaged by raiders (rumored to be sponsored by either the Galactic Empire or the Corporate Sector Authority) for their biomolecular products as a form of taxation."}, {"tag": "p", "text": "During the Galactic Civil War, New Cov's capital, Illic, was the place of meeting between members of Garm Bel Iblis's movement and Bothan sympathizers of the Rebel Alliance. These Bothans, led by Borsk Fey'lya, were intercepted by an Imperial Victory I-class Star Destroyer. Despite a violent battle, Bothans still supported Garm Bel Iblis through New Cov until 9 ABY."}, {"tag": "p", "text": "During the Thrawn campaign, another Imperial Raid on New Cov revealed clearly the connections between Bothans and Bel Iblis. In fact, two New Republic officers were present this time: Han Solo and Lando Calrissian. Bel Iblis stopped to use New Cov after they convinced him to join the new Republic."}, {"tag": "p", "text": "The planet was conquered by the Yuuzhan Vong during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Churba Sector and, consequently, New Cov, in the Outer Rim Territories."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}