{"url": "New_Generation_Academy", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Academies"], "nodes": [{"tag": "h1", "text": "New Generation Academy"}, {"tag": "p", "text": "The New Generation Academy, also called the Osadia School, was a mysterious school on the forested world of Osadia which trained children of several planets in the ways of The Force, preparing them to become Mandalorian Knights. Jarael and Chantique were students in the school."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early History"}, {"tag": "p", "text": "The school was run by Master Antos Wyrick, who would later be known as Demagol, the Mad Mandalorian Scientist. Many children from different planets came to Osadia to train at the school. Jarael studied at the school alongside Wyrick's daughter Chantique, who bullied the other students due to her position as the Master's child. Apart from this, the school's activities were unknown and what they thought was also unknown."}, {"tag": "h3", "text": "The Crucible and the school's end"}, {"tag": "p", "text": "At some point, a massive slaving organization called the Crucible arrived on Osadia and started to have views on the school's students. Wyrick, in a plan to stop the Crucible from taking the students, offered his daughter to them. Chantique fostered a deep hatred for her father after this."}, {"tag": "p", "text": "However, the Crucible still planned to take the children and Captain Dace Golliard attacked the school and burnt it to the ground. Wyrick and the other adults tried to protect the children's escape, but most of them were captured."}, {"tag": "h3", "text": "Wyrick returns"}, {"tag": "p", "text": "Years later, Wyrick, under a new guise as the scientist Demagol, met up with Jarael on Flashpoint Stellar Research Station. Recognizing her, he decided to watch over her by assuming the identity of Rohlan Dyre, a Mandalorian that he put in a coma so that he wouldn't be recognized by the Republic authorities."}, {"tag": "p", "text": "He protected Jarael with all his ability and, after Zayne left due to Chantique's manipulation, he revealed his true identity and that he was planning to save the other students from the Crucible as he knew where they were held. However, Chantique revealed that she had murdered all of them and buried their remains in the schoolyard."}, {"tag": "h2", "text": "Appearances"}]}