{"url": "New_Jedi_Temple", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Coruscant government buildings", "Category:Jedi temples", "Category:New Jedi Order locations", "Category:New Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "New Jedi Temple"}, {"tag": "p", "text": "The new Jedi Temple was the headquarters of the New Jedi Order from the end of the Yuuzhan Vong War until it was captured by the One Sith in 130 ABY, and converted into the Temple of the Sith. It was reclaimed by the Jedi at the end of the Second Imperial Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rebirth of the Order"}, {"tag": "p", "text": "With the reestablishment of the Jedi Order by Luke Skywalker, he and his students set out to rediscover the teachings of their predecessors. Armed with the knowledge passed down by deceased Jedi Masters Yoda and Obi-Wan Kenobi, Skywalker began instructing his initiates on the far-flung Yavin 4 using the little knowledge he had learned. When Coruscant was finally liberated from the Galactic Empire by the New Republic, Skywalker and his students reclaimed the ruined Jedi Temple and began searching through the rubble for any artifacts they could find. When Tionne Solusar rediscovered the Jedi Archives, she began restoring and updating the lost database. While the Jedi remained vastly separate from the New Republic Senate in comparison to the days of the Old Republic, Skywalker commissioned the construction of the Jedi Headquarters on the roof of the Temple Ziggurat."}, {"tag": "p", "text": "As the Jedi were constantly developing their teachings and philosophies, the galaxy was besieged by the Yuuzhan Vong. As the extragalactic aliens invaded the capital, the Temple and Headquarters were lost, the structure suffering an incredible amount of damage. Forced to transport all the information they had found at the Temple to the many hidden bases used throughout the war, the Order survived the war, leading the newly formed Galactic Alliance to victory. Because of the Order's great leadership and the Jedi's sacrifices, Chief of State Cal Omas of the Alliance commissioned the Reconstruction Authority to rebuild the Temple. As the Yuuzhan Vong Shapers restored the planet, the Reconstruction Authority began not only in making the Jedi a home on Coruscant, but creating a symbol of Alliance-Jedi unity. In the restored Temple Precinct, the Processional Way terminated at the newly erected Fellowship Plaza, which in turn led to the Galactic Justice Center."}, {"tag": "p", "text": "While the Jedi were grateful for the new Temple, many within the Order wished to remain separate from the politics of the Senate. With the Jedi Academy on Ossus already fully occupied and in use, the Order had little use for the Coruscant Temple unless they were advising the Alliance. Many Jedi were already set up in their own private residences around the galaxy; unlike the strict rules of the Old Order, Jedi were allowed possessions and many were independently wealthy. However, as time progressed, the Order began to centralize once more. With the stirrings of civil war the Jedi High Council reconvened in the austere chambers of the Council Spire. Most Jedi Masters and Knights took up residences in the Temple; even Grand Master Skywalker and his wife Mara took up a formal apartment suite. By the time war broke out, the Jedi Temple served as the heart of the Order, while the Academy on Ossus remained open as a satellite training ground for younglings."}, {"tag": "h3", "text": "The threat of Darth Caedus"}, {"tag": "p", "text": "As the Council began dealing with the Corellian threat of secession, Jedi Knight Jacen Solo brought Dark Lady of the Sith Lumiya to the Temple. Lumiya had approached Solo and told him that he was destined to be a Sith; that through the dark side of the Force, he would be strong enough to defeat the Corellians and restore peace to the galaxy. Skeptical of her reasonings and motives, Solo decided to test her by walking her into the heart of her enemies' fortress; if she could make it through without exposing her hatred of Skywalker and the other Jedi, then he would trust her rationality. While she showed the awe one might expect a visitor to the Temple would display, she kept all other emotions completely checked, and exited the Temple with her new apprentice. At the same time, the Jedi began hunting for the Dark Jedi Alema Rar. At the behest of former-Captain Jagged Fel, the Jedi Council lent him an office within the Temple to stage his hunt for the rogue Twi'lek."}, {"tag": "p", "text": "Mid-war, the Grand Master's wife Mara was murdered on Kavan by her nephew Jacen Solo; a fact that would evade the Jedi for several months. Her body was returned to the Temple for cremation; a ceremony was to take place in the Morning Court with a crowd of Jedi, diplomats, and friends. As the funeral began a group of Galactic Alliance Guardsmen attempted to arrest Han and Leia Solo in a hall above the Court. The Solos managed to escape detainment by fleeing the Temple and not interrupting the funeral, but the commotion revealed the Temple's lack of safety against the Colonel Jacen Solo's reformed government. Soon after, the Ossus Academy was attacked by the GAG on Colonel Solo's command. Realizing the position they were in, the Council made a bold move at the Battle of Kuat by severing their ties to the Alliance and abandoning them mid-battle."}, {"tag": "p", "text": "Enraged by the embarrassing defeat at Kuat, Colonel Solo ordered the GAG to invade the Temple on Coruscant. Anticipating this, the Council programmed the Temple beacon to warn all Jedi away from Coruscant and to flee directly to an abandoned Imperial base on the Sanctuary Moon of Endor. At the Temple, Jedi began evacuating with the assistance of the loyal Temple Caretakers. Apprentice Seha Dorvald successfully drained the Archives of information and escaped with the data through the undercity, before delivering it to Endor. Eventually the Order would abandon the base at Endor for Shedu Maad in the Hapes Consortium. Establishing a secret academy there, the Jedi kept the base a secret, even after the war ended."}, {"tag": "h3", "text": "Conflict with the Galactic Alliance"}, {"tag": "p", "text": "With the defeat of Darth Caedus at the hands of his twin sister, Jedi Knight Jaina Solo, the Order began the process of reconciliation between the Alliance and the Imperial Remnant. With Solo dead and Cha Niathal resigning from the Chief of State Office, Admiral Natasi Daala was elected as Niathal's successor. With the galaxy back in a sense of peace, the Order returned to the Temple and began business as usual. However, in 43 ABY Daala began to use her position to wage war against the Order. She first ordered the arrest of Grand Master Skywalker, demanding that he be exiled from the Temple and all other academies for failure to prevent the outbreak of insanity that began plaguing active Jedi. She then decreed that the Temple be opened to Senate-elected supervisor and the press."}, {"tag": "p", "text": "Interim Grand Master Kenth Hamner accepted the order from the Chief's office, though stood firmly that the Temple's private areas would not be violated. Each supervisor would be assigned to a Jedi, but they could not follow them around the entire Temple. Therefore, all supervisors were based out of what was once a youngling lecture hall, and stayed in constant connection to their assigned Jedi via comlink. As the psychosis spread, the Temple infirmary became home to the wanted-Jedi. Jedi Jysella Horn went on a rampage in the Archives, while Yaqeel Saav'etu and Bazel Warv were detained at the southern speeder hangar below the Temple. When Daala ordered that all insane Jedi be frozen in carbonite, a group of Jedi known as Darkmeld, without consent of Hamner, kidnapped the patients and transported them to Shedu Maad. While Hamner eventually was able to get the supervisors removed and press barred from the Temple, there was a constant throng of media personnel surrounding the Temple waiting for another Jedi to fall victim to the Force insanity plaguing the Order."}, {"tag": "p", "text": "While tensions continued to rise between the Order and the Alliance, Jedi Sothais Saar fell under the same enigmatic madness the other Jedi were suffering. Fleeing the very public Senate Plaza, Saar was detained by Master Cilghal and brought to the Temple. Having refused to turn over Saar to the Alliance, Chief Daala ordered the Temple raided by Mandalorians. With attacks at the Main Entrance, hangar level, and food delivery hangars the Jedi were able to repel the attack, though the Temple was damaged. Stationing Galactic Alliance Security around the Temple, municipal water, power and waste pickup were all shut off, forcing the Temple to rely on generators to maintain operational. Following the attack Han and Leia Solo, acting as liaison between the government and the High Council consulted Hamner in a lower level conference room to discuss a deal to turn over Saar in an attempt to mend relations with the Chief."}, {"tag": "h3", "text": "Voluntary abandonment"}, {"tag": "p", "text": "With the return of exiled Grand Master Luke Skywalker, the Jedi High Council received him in the Council Chambers and listened in shock as he revealed his new direction for the Order. Realizing that the Jedi and the Galactic Alliance had become too entwined, Skywalker deemed it necessary for the Order to immediately withdraw its representative from the Alliance Triumvirate in addition to complete withdraw from Coruscant itself. While initially there was hesitation about leaving their Temple abandoned, Skywalker filled them in on additional sensitive information. The Lost Tribe of the Sith had indeed infiltrated Coruscant and in order to catch them, the Jedi would need to leave the planet and return only once the Sith had all assembled on the world. Then, and only then, would the Jedi be fit to eradicate the threat. In a public spectacle, Masters Skywalker, Sebatyne, and Jedi Solo marched down the Processional Way to a special stage erected at Fellowship Plaza where they stood with acting Chief of State Wynn Dorvan and Senator Haydnat Treen. Together, the Jedi and politicians said good bye to the era of Jedi presence on Coruscant and the Order left almost completely."}, {"tag": "p", "text": "Inside the Temple, the hidden Barabel Jedi removed the locks on the lower level sewage grates to create a \"backdoor\" should the Jedi wish to return. In the Temple proper, the Archives data had been copied, and the most valuable data taken with the roaming Order. All that remained was protected by a virus that would spread and delete data should intruders try to access information. Indeed, the Temple would be occupied by the Lost Tribe's Keshiri members, all part of the Coruscant infiltration team. Because their species could not be hidden amongst the public as their Human counterparts did, the Keshiri were forced to stay behind the scenes as the Humans infiltrated the government. Placed in command, the High Lord Ivaar Workan oversaw the Temple occupation and tasked his Sith to map the cavernous complex for the arrival of Grand Lord Darish Vol. Sending teams into the Temple sublevels, each team disappeared as they ran across the hidden Barabel Jedi."}, {"tag": "h3", "text": "Sith Takeover"}, {"tag": "p", "text": "Over the next century, the Jedi Order continued to evolve and to exist, launching the revolutionary Ossus Project and volunteering the home of one of their most prestigious academies to undergo terraforming by the reformed Yuuzhan Vong. Seeing great results on Ossus, the Jedi championed its use on other worlds, using it to gain some support for the Yuuzhan Vong as they help erase memories from the war they had raged a century before. However, the Jedi failed to sense the tampering of the One Sith, a secret organization forming on Korriban. With the project sabotaged, worlds helped by the Jedi and Yuuzhan Vong went insane with alien growth, their populations overcome by terrible disease and plague. Seeing a great secessionist movement in the making, the Imperial Remnant swooped into the core and ousted the Alliance government. As the Emperor called for the surrender of the Jedi, half fled the Temple on Coruscant in favor of the Ossus Academy. Legions of Sith invaded the Temple, killing or scattering those who still dwelt within. Soon after, the Massacre at Ossus saw the dissolution of the Order."}, {"tag": "p", "text": "With the surviving Jedi scattered or in hiding at the Hidden Temple, the Coruscant Temple fell under the control of Darth Krayt, who had successfully killed or scattered the leaders of the Alliance, Jedi Order, and Galactic Empire, taking up the mantle of Emperor of the Galaxy. After holding the Temple for seven years the transparisteel pyramids were removed and the Temple was completely redesigned, becoming the Temple of the Sith not only in name, but in design."}, {"tag": "p", "text": "It was subsequently abandoned by the Sith when they fled Coruscant at the end of the Second Imperial Civil War and reclaimed by the Jed and returned to it's original design."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A dramatic pyramid of tinted transparisteel in the Rebirth architecture style, the Jedi Temple was supposed to serve as a successor to the former Jedi Temple, the Jedi Headquarters building, and the Jedi Praxeum on Yavin 4. Built upon the reformed sacred spire as the old Temple, the complex was permeated with light side energies, creating a soothing and reflective atmosphere for the occupants. Erected in the Temple Precinct, the great edifice sat in the middle of the Temple Court, an area dotted with giant bronzium statues and monuments to the Jedi Order. Freely visible for several hundred kilometers, the Temple Apex stretched well over a kilometer into the sky, making it a prominent fixture on the Galactic City."}, {"tag": "p", "text": "When the Reconstruction Authority rebuilt the area surrounding the Temple, they connected the newly established Galactic Justice Center with the structure via the Fellowship Plaza. It was said from that if one passed through the Walking Garden, it was possible to see the tip of the Temple Apex. Also located near the Temple were Unity Green and Liberation Lake."}, {"tag": "h3", "text": "Pyramids"}, {"tag": "p", "text": "From the exterior of the Temple, a bystander would not find many similarities between the new Temple, and the past structure that had served the Order for several centuries. But looking at the history of the Temple, this was a common trend; as the Temple grew and expanded, additions completely changed the exterior appearance. Atop the Temple Ziggurat, a green pyramid was constructed to enclose the Jedi Council Spires, along with Tranquillity Spire, giving the structure a completely different shape. Additionally, four smaller pyramids were built at each corner of the building adding more space to the building."}, {"tag": "p", "text": "Under the new shell, however, the Temple had obvious and direct inspiration from the past. The five spires which had formed Coruscant's skyline of two decades past, were still in use. Rooftop gardens which serviced the refectories, balconies, and hangars had all been rebuilt to exact specifications. Light poured through the outer shell, bathing the entire surface of the Ziggurat in natural light, as well as pouring down through the clerestories to light the interior halls. Tranquillity spire once more held the ancient texts of the founding Jedi, reclaimed from Darth Sidious' vaults. The Hall of Knighthood was rebuilt and new memorial statues were suspended in the tower by repulsorlift pads. The reformed peak of the mountain was again surrounded by a meditation balcony with a lower balcony presenting a series of holo-depictions of the history of the Jedi. Because the mountain remained largely intact throughout Operation: Knightfall and the attack by Lord Nyax, the mountain still retained the original meditation chambers and cave chapels."}, {"tag": "p", "text": "New state-of-the-art high-gain communication transmitters were installed within the peak of each of the five pyramids of the new Temple, and were used to contact the Ossus Academy and for meetings of the reformed High Council. Also restored was the Operations Planning Center, which continued to serve as Jedi Command's headquarters. With the hangars also restored, the Jedi began to house their X-wings, E-wing, and the StealthX model used strictly by the Order. The ships would exit through hatches built in to the side of the complex's transparisteel shell."}, {"tag": "p", "text": "Within the new, four gleaming pyramids were contained hundreds of new rooms that were used for the housing and schooling of Jedi Knights. In one of the pyramids was the Morning Court, a large chamber on the first floor, that was used as a hub for foot traffic and large gatherings within the Temple. It was here that a pyre was erected for the funeral of Mara Jade Skywalker. The pyramid's peak retracted which allowed light to flow down through a wide opening in the structure, which emptied through the roof of the Morning Court."}, {"tag": "h3", "text": "Temple Ziggurat"}, {"tag": "p", "text": "Within the Temple, the Reconstruction Authority stayed very close to the blueprints obtained by Master Tionne Solusar from the old Jedi Archives. With the majority of rooms matched column for column, bust for bust, tile for tile, a Jedi from the Old Republic would have little problem navigating the miles of halls. Though many of the Order's initiates now begun their training at the Academy on Ossus, this area of the Temple remained in use by small classes, and for the continuous study by those Padawans whom had been selected by a master and transferred to Coruscant. The Jedi Archives was restored and updated by archivist and Chief Librarian Tionne Solusar, the Archives and library was filled with holobooks containing Jedi lore and personal journals from past Jedi in the field."}, {"tag": "p", "text": "After updating, the Archives was once more one of the most comprehensive libraries in the galaxy. Another prominent feature inside the Temple was the Room of a Thousand Fountains, the expansive greenhouse at the base of the quarter. First noticed by Grand Master Skywalker in an ancient document and again in a stolen recording of Operation: Knightfall housed in astromech R2-D2's memory banks, the Grand Master made sure that the meditative garden was reconstructed to its former glory. Although the Jedi worked with the galactic government, they did take their own prisoners on occasion. Therefore, the Temple was equipped with its own Detention Center. Housing to house, delinquent apprentices, Dark Jedi, and later, psychotic Knights, the area was designed to soothe and rehabilitate its occupants. Following the Second Galactic Civil War, Raynar Thul, a former Jedi who sustained brain-damage after his time with the Killiks was recovering within the containment cells as he was unwilling to reenter the Temple community."}, {"tag": "p", "text": "Also included was the Jedi Temple Great Hall, a large meeting and assembly place during the years following the Second Galactic Civil War. It was within these chambers that the Order bid farewell to the exiled Grand Master Skywalker. Interim Grand Master Kenth Hamner would hold daily reports here, updating the Order on the problems bestowed upon the Jedi by Chief of State Natasi Daala in 40 ABY. The meditative walkway, a cavernous hallway surrounding the base of the Temple starting from the main entrance was decorated with a newly created arcade of stained-glass windows and statues relating the events of Jedi history. It now extended around the four additional pyramids that were erected at each corner of the ziggurat. With the gleaming High Council Tower soaring on the southeast side of the edifice, the rooms above the main entry were largely used as conference rooms and meeting areas for visiting diplomats."}, {"tag": "p", "text": "While the Jedi were peaceful and meditative, they were also trained to defend themselves. Several lightsaber training chambers were scattered around the Temple; a sparring arena was also located in the bowels of the giant structure. Retaining dormitories for students and Jedi abroad, many located in the Knights' Billet, each individually built room could accommodate the different species of Jedi's needs. During the Swarm War, Grand Master called Knights Tahiri Veila, Tesar Sebatyne, and Lowbacca to the Billet so that he could exile them to Dagobah for meditation and recovery from their Joiner infliction. Senior Knights and Masters were given private rooms and office from which they could conduct affairs with distant governments and the Jedi Council."}, {"tag": "p", "text": "To avoid another incident like that of Operation: Knightfall, the Reconstruction Authority designed evacuation corridors and instructions in case of fire or invaders. Accessed through maintenance corridors or disguised wall pieces, heavy metal doors blocked the way to the hatch. A sign on each door read: \"EMERGENCY EVACUATION ACCESS. USE ONLY IN TIMES OF EMERGENCY. TEMPLE SECURITY WILL BE ALERTED.\" Once through the door, Jedi would emerge into a short permacrete hall that led to an identical door. Through this door was a telescoping platform that was suspended in a small space between the exterior wall of the city block that was the Temple Precinct. The platform could extend beyond the Precinct's outer wall into a traffic lane for immediate rescue."}, {"tag": "p", "text": "Several secret security traps existed amongst the Temple's walls. In the Main Entrance, two pillars were hollowed at the base to hold security droids which could be deployed by the Temple Security Forces. In addition, a security screen could be pulled over the main entry to trap an intruder in or out of the Temple. Only the Grand Master was ever made fully aware of how extensive the new security systems were. These included heavy hover assault droids hidden behind secret panels in the walls and columns as well as, anti-personnel shields around the entrances and exits. These shields could easily trap any intruder, including a Jedi. This security enhancement was tested against the insane Knight Jysella Horn in 43 ABY, though she was able to escape due to an enhanced form of precognition."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}