{"url": "New_Mandalorians", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Mandalorian organizations", "Category:New Mandalorians", "Category:Outer Rim Territories governments"], "nodes": [{"tag": "h1", "text": "New Mandalorians"}, {"tag": "p", "text": "The New Mandalorians was the pacifist government of the Mandalorians that controlled the Mandalore system in the Outer Rim. The New Mandalorians placed great importance on the virtues of pacifism, neutrality, and nonviolence rather than martial prowess and military strength as the Old Mandalorians did. They were led by a Duchess of Mandalore up until its dissolution following the coup in 19 BBY. Their pacifist ideals were eventually opposed by Death Watch, who sought to return the Mandalorian people to the proud martial ways of their ancestors. Although the New Mandalorians rejected the ways of old, their capital city of Sundari displayed murals detailing their exploits during their wars with the Jedi Order."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mandalorian Civil War"}, {"tag": "p", "text": "At some point before the Invasion of Naboo, a civil war erupted for control of the Outer Rim world of Mandalore and was fought between competing ideals within Mandalorian society. Such as the warrior clans and insurgents who wished to see a return to their warrior past and the New Mandalorians government, led by Satine Kryze of House Kryze."}, {"tag": "p", "text": "During the war, the Jedi Order sent Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, who spent a year on Mandalore to protect the Duchess as the insurgents attempted to kill the group using bounty hunters, forcing them to live on the run. At the end of the civil war, Kryze ruled Mandalore while the clans were exiled to Concordia."}, {"tag": "h3", "text": "Death Watch insurgency"}, {"tag": "p", "text": "Though the exiled clans were presumed to have died out on Concordia, the survivors had in fact regrouped and formed the Death Watch splinter group, who opposed the pacifistic Mandalorian government and desired to restore Mandalore's war-like culture. They were secretly led by Concordia's Governor, Pre Vizsla, and Duchess Satine's own sister, Bo-Katan Kryze."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}