{"url": "New_Mandalorians/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic-aligned governments", "Category:Mandalorian organizations", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "New Mandalorians"}, {"tag": "p", "text": "The New Mandalorians were members of a reformist Mandalorian political movement on Mandalore. The group was formed after a Galactic Republic attack on the Mandalore sector which rendered portions of the planet into inhospitable white-sand deserts. Differing from other groups on Mandalore in that they placed great importance on virtues of pacifism, neutrality, and nonviolence, rather than military strength, the New Mandalorians used their engineers' technical skill and their talent for construction to forge a new society in the barren wastes. There, segregated from the warrior clans of the rest of Mandalore's people, the New Mandalorians lived in grand bio-cube cities, taking the domed city of Sundari to be their capital. The New Mandalorians disregarded the ancient Mandalorian warrior codes, and forwent traditional Mandalorian armor, as they turned their backs on their warrior clan peers and diverged from the Resol'nare, the central tenets of Mandalorian culture. A number of Mandalorian hardliners in support of the traditional warrior culture subsequently deemed the New Mandalorians as the Faithless due to the perceived illegitimacy of their peaceful counterculture."}, {"tag": "p", "text": "During the Clone Wars, the New Mandalorians were led by Duchess Satine Kryze of Kalevala, and their government combated the rival Mandalorian movement known as the Death Watch, in an effort to keep Mandalore neutral, and out of the galactic war. Neutrality came at a cost, however, leading to severe food shortages, and a rise in New Mandalorian corruption as the Republic severed trade routes to Mandalore, leaving the desert-dwelling New Mandalorians scrambling to feed their people, cut off as they were from Mandalore's verdant farming communities. Late in the war, the New Mandalorian regime fell to the machinations of a Death Watch coup that saw Duchess Kryze deposed, and the radicals' rise to power behind the puppet Prime Minister Almec. These revanchists heralded the demise of the New Mandalorians and their ideals, and their political dominance on Mandalore came to an end following the ascendance of Spar to the position of Mand'alor, traditional leader of the Mandalorian people."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Society and government"}, {"tag": "p", "text": "The New Mandalorians were a reformist Mandalorian faction. Unlike the Mandalorians' traditional history as warriors, the New Mandalorians fashioned themselves as pacifists, espousing the virtues of peace, tolerance, and neutrality. They came to view these ideals as necessities to surviving in a hostile galaxy, and did away with the ancient warrior codes their forebearers had followed in the hope of being accepted by the galactic community. Instead of training in combat, the New Mandalorians cultivated their talents as inventors and pursued their passion for advanced technology. Non-violence was an expectation for all within their sect, but while violent bloodshed toward sentients was abhorrent to the New Mandalorians, non-lethal self-defense was acceptable in certain situations. The New Mandalorians looked down upon their warrior clan brethren for continuing their age-old ways as soldiers and mercenaries, believing that their traditions were discredited and that they were ultimately dead-enders."}, {"tag": "p", "text": "Following their foundation, the New Mandalorians established a society of their own, isolated from the traditional Mandalorian warrior clans on their cultural homeworld of Mandalore. They took to the portions of Mandalore that had been rendered into barren deserts of white sand by the Galactic Republic's devastating Mandalorian Excision, constructing massive bio-cube cities using their innovative technological skills. Hermetically sealed against the elements, these bio-cube cities allowed the New Mandalorians to live within Mandalore's inhospitable deserts, and the grand black-domed city of Sundari was taken as the New Mandalorians' capital. Many of the New Mandalorians' vehicles were purchased from the MandalMotors company, a driving force in Mandalore's economy that was headquartered in the planet's traditional capital city of Keldabe. MandalMotors-made Aka'jor-class shuttles, Buirk'alor-class airspeeders, and Balutar-class swoops could all be found employed throughout New Mandalorian society. Despite coming from a company owned and operated by the Mandalorian warrior clans, in keeping with their pacifist ideals, these New Mandalorian vessels were all unarmed. In the year 22 BBY, it was declared illegal for offworlders to carry weapons in New Mandalorian territories."}, {"tag": "p", "text": "Unlike the warrior clans, who were governed by a loose organization of the many chieftains of the clans subordinate to the reigning Mand'alor—the traditional leader of the Mandalorian people and culture—the New Mandalorian government was more centralized, comprised of a Ruling Council made up of a number of ministers, such as the Minister of Finance and the Minister of the Interior. The council was presided over by a Prime Minister and a Deputy Minister, and operated out of the Sundari Royal Palace. The New Mandalorians did not recognize the authority of the clan-chosen Mand'alor, instead appointing a Mand'alor of their own in opposition to the leader of the warrior clans. To the traditional warriors who resented the New Mandalorians, these leaders were known as \"Anti-Mandalores.\" Establishing a peaceful and stable state they deemed \"New Mandalore,\" the New Mandalorians were the first Mandalorian group to gain the acceptance of the Republic, culminating in Mandalore being granted representation in the Galactic Senate. The New Mandalorian government made all attempts to ensure the sect remained neutral and removed from any conflict that sought to involve them, though the Ruling Council's many ministers were prone to squabbling amongst themselves over decisions regarding the New Mandalorian people, and over time, corruption of the government's officials became a growing concern."}, {"tag": "h3", "text": "People and culture"}, {"tag": "p", "text": "The New Mandalorian populous was overwhelmingly composed of Humans, with fair-complected skin, and primarily blonde hair, though individuals with brown and red hair were known to exist within the New Mandalorian faction. This racial homogeneity stood in stark contrast to the traditional warrior clans, in which Humans of a variety of skin colors and aliens from a multitude of species all stood together as Mandalorians, regardless of outward appearances. Further separating them from the warrior clans, the New Mandalorian civilian population forwent traditional Mandalorian armor as part of their proscription of violence, a significant deviation from the Resol'nare, the six central tenets of the Mandalorian culture that traditionally defined what it meant to be Mandalorian. Instead, the average New Mandalorian citizen primarily dressed in more casual attire, such as pants, shirts, tunics, and dresses. Even without armor, a number of New Mandalorians continued to wear traditional Mandalorian kamas. New Mandalorian garments were often white in color, though shades of blue—a color that had long represented the concept of reliability in the Mandalorian culture—were also common in New Mandalorian fashion."}, {"tag": "p", "text": "Officers of the New Mandalorian police force were among the few who continued to wear armor in the course of their duties, utilizing uniform suits of grey-plated armor that shared a number of design elements in common with the style of armor worn by traditional Mandalorian soldiers of the time. The Mandalorian Royal Guard also wore suits of armor, specifically designed to evoke Mandalore's history of gallantry and discipline, while at the same time setting itself apart from the armor associated with Mandalore's warrior clans."}, {"tag": "p", "text": "After breaking from the Mandalorian warrior clans, the New Mandalorians retained the knowledge of how to work Mandalorian beskar iron, a nearly indestructible metal ore found only on Mandalore and its moon, Concordia. The Mandalorians historically developed techniques for manipulating the iron which they guarded closely from outsiders, and passed down from one generation to the next; the New Mandalorians used beskar in the construction of their capital, Sundari, and in the city's towering buildings."}, {"tag": "p", "text": "New Mandalorian culture was very clinical, and tightly regimented, with elements of their warrior heritage redirected toward other pursuits or kept firmly throttled by the domineering government. While they dwelt in the white-sand desert regions of Mandalore, the New Mandalorians still held an appreciation for natural greenery, though they insisted upon meticulously trimming and sculpting the vegetation into stark geometric shapes, everything from plaza-occupying trees to rooftop garden shrubs. New Mandalorian aesthetics often favored a cube shape, and such forms could be seen in numerous aspects of their daily lives, from the design of their bio-cube cities, to the trim of Sundari's trees, and even the cut of New Mandalorian foods. Such cube-cut food was served at the Sundari Royal Palace, and as part of the standardized meals served to New Mandalorian children at their schools, along with fresh drinking water. The New Mandalorians preferred centralized education for their children, as opposed to the warrior clans' individualistic education from their elders. The most promising New Mandalorian students were enrolled in the prestigious Royal Academy of Government, where they were taught and trained in the expectation that they would go on to be future leaders in the New Mandalorian government."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "In the year 1051 BBY, the Mandalorian soldier Aga Awaud became the new Mand'alor, taking the title of \"Mandalore the Uniter\" as he moved to consolidate the Mandalorians scattered throughout the galaxy in an effort to strengthen Mandalorian space following the ravages of the New Sith Wars. Under his reign, the Mandalore sector emerged a regional industrial power, offering protection to surrounding star systems and sectors that lacked Mandalore's stability. To the Galactic Republic, however—piecing itself back together after the war with the Sith—the Mandalorians were seen as a threat: taxing trade on the nearby Hydian Way hyperlane, binding their neighbors with defense and economic pacts, and refusing to comply with the Republic's restrictions on sector defense forces. Though a number of clan leaders warned against Mandalore's growing militancy, and argued that Mandalore should join the Republic as a powerful and influential sector, these would-be peacemakers were dismissed."}, {"tag": "p", "text": "Alarmed by the threat of the Mandalorians, the Republic and its Jedi protectors lead a task force into Mandalorian space in 738 BBY, in a brief but overwhelming pre-emptive strike that came to be known as the Mandalorian Excision. Key Mandalorian worlds such as Ordo, Fenel, Concord Dawn, and even Mandalore itself were bombarded by Republic forces to such a degree that portions of those worlds were transformed into barren desert. Mandalorian space was disarmed and occupied for decades, and a caretaker government was placed in power, comprised of those clan leaders who had sought peace. Over time, a new faction emerged from the caretaker government, calling themselves the \"New Mandalorians\": though they resented the Republic for its actions, the New Mandalorians saw no future in opposing the galactic government and chose instead to turn away from their warrior heritage, relinquishing their ancient warrior codes and traditional armor in exchange for a pacifistic creed espousing peace, neutrality, and tolerance. They chose to found a new society on Mandalore, isolated from the planet's warrior clans in the white-sand deserts left by the Mandalorian Excision, calling upon their talents as inventors and builders to forge grand bio-cube cities in the inhospitable wastes. The New Mandalorians took the domed city of Sundari as their capital, in opposition to the traditional Mandalorian capital city of Keldabe, and their dedication to peace and their love of advanced technology allowed for them to claim ascendancy over the scattered warrior clans on Mandalore for centuries. For the first time in the planet's history Mandalore was welcomed by the Republic, and offered representation in the Galactic Senate. The New Mandalorians held most positions of power recognized by the Republic, and looked down upon the Mandalorian clans that still continued their warrior ways. These practitioners of the traditional ways came to be known as the Aka'liit—the Mandalorian Faithful—and, in turn, deemed the New Mandalorians the Faithless, with many viewing their alternate society as illegitimate. As time passed, the New Mandalorians eventually established a presence on Mandalore's neighboring world, Kalevala."}, {"tag": "h3", "text": "Civil wars"}, {"tag": "p", "text": "Though many Mandalorian warriors were ambivalent toward the pacifist New Mandalorians, over the centuries, radical elements worked in secret to bring down their regime. In the year 60 BBY, a charismatic Mandalorian soldier by the name of Jaster Mereel ascended to the position of Mand'alor. In this role, he began to institute a cultural reform among the clans that were unaffiliated with the New Mandalorians, a reform that many had been calling for since the Ithullan genocide nearly a century and a half earlier. Eventually laying out a new guideline for Mandalorian behavior known as the Supercommando Codex, he asserted that the Mandalorians who still wished to fight would simply act as highly-paid soldiers, and should conduct themselves as honorable mercenaries. Mereel was opposed by the barbaric Tor Vizsla and his faction calling itself the Death Watch, a group that desired a return to brutal savagery, the instigation of another galactic war of conquest, and the downfall of the New Mandalorians, whom they despised for their pacifist ideals and turning their back on the Mandalorians' traditional culture. While Death Watch's goals were quite opposite to the New Mandalorians, the New Mandalorians could not support Mereel's faction of supercommandos—now calling themselves the \"True Mandalorians\"—for despite his reforms, any act of Mandalorian violence was fundamentally against what the New Mandalorians stood for."}, {"tag": "p", "text": "The Death Watch and their True Mandalorian foes became embroiled in a bitter conflict dubbed the Mandalorian Civil War; the New Mandalorian government, meanwhile, rejected both groups and continued to act independently from them. The war spanned more than a decade, during which Jaster Mereel fell and Jango Fett took his place as the new Mand'alor, up until the disastrous Battle of Galidraan in 44 BBY that saw the eradication of the True Mandalorians from which Fett emerged as the only survivor. Though he hunted and killed Tor Vizsla on Corellia, fragmenting and scattering the Death Watch, Fett grew distant from his role as Mand'alor and the rest of his people, scarred as he was by the loss of his comrades, and he eventually took up the solitary life of a bounty hunter."}, {"tag": "p", "text": "With the True Mandalorians out of their way, Death Watch finally moved against the New Mandalorians. During what became known as the Great Clan Wars, the fragmented Death Watch incited war against the New Mandalorian pacifists across Mandalore. The choice between standing with the New Mandalorians and supporting the Death Watch turned several clans against one another, and Mandalore suffered through a violent, second civil war that left fresh scars across the planet's surface and many dead. The tide of the war shifted with the entrance of Duchess Satine Kryze into the conflict: Kryze, the daughter of her clan's preeminent chieftain turned staunch New Mandalorian pacifist, wielded her words and charisma in lieu of weapons, winning over several of the warring clan leaders to her peaceful cause. Death Watch and their goals were ultimately thwarted, as a number of defeated but unrepentant Mandalorian warlords accepted exile to Mandalore's moon Concordia, where the New Mandalorian government assumed and expected that they would die out. Their strength renewed, the New Mandalorians appointed Satine Kryze as their new Mand'alor—though she ruled the New Mandalorian faction initially in opposition to Jango Fett, who possessed the title among the warrior clans until his death years later in the Battle of Geonosis. As the new leader of the New Mandalorians, Kryze set about rebuilding the damage incurred to Mandalore during the war."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Return of the Death Watch"}, {"tag": "p", "text": "Duchess Satine Kryze continued to lead the New Mandalorians as the galaxy-spanning Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems in 22 BBY. By that point in time, New Mandalorian territory had prospered greatly in the years following the end of the Great Clan Wars. Under Kryze's leadership, Mandalore was declared a neutral world at the Clone War's onset, with Kryze even elected to lead the Council of Neutral Systems, a collective of other worlds and star systems that wished to remain uninvolved in the conflict. But while the New Mandalorians had been making a steady recovery in the wake of the last bloody civil war, so too had Death Watch. As ever, the resurgent Death Watch despised the peace-loving government the New Mandalorians had established, viewing the administration as weak and Kryze as a disgrace to all Mandalorians for their pacifist views. They allied with Count Dooku, leader of the Confederacy of Independent Systems, to gain the means necessary to remove Kryze and the New Mandalorians from power."}, {"tag": "p", "text": "An attack on a Republic cruiser by a Death Watch commando, along with circulating rumors that the New Mandalorians weren't as peaceful as they wanted the galaxy to believe, drew the attention of the Jedi Council, who dispatched Jedi Master Obi-Wan Kenobi—an old friend and one-time lover of Satine Kryze—to Mandalore in order to investigate the current state of Mandalorian affairs. Kenobi arrived at the New Mandalorian capital of Sundari, where he was ferried from the city's docks to the Royal Palace in order to meet with Duchess Kryze. There, he was greeted by the New Mandalorians' Prime Minister Almec, who assured Kenobi that the New Mandalorians were committed to peaceful coexistence with the Republic, disavowing any connection to Mandalore's warriors. Kryze arrived shortly thereafter, and invited the Jedi Master to accompany her on a walk through Sundari to display how far things had progressed since the Great Clan Wars' end, all the while assuring Kenobi that the New Mandalorians remained firmly dedicated to peace. Despite this, Kenobi discovered the threat posed by the Death Watch when the Memorial Shrine was violently bombed as Kenobi and Kryze had been walking nearby in Peace Park. Spotting the bomber among the panicked and injured crowd of New Mandalorians at the scene, Kenobi attempted to detain the terrorist, but the bomber instead chose to commit suicide rather than allow himself to be taken into custody by Kenobi. As the bomber spoke in the Concordian language during his final moments of life, Kenobi decided to follow the potential clue back to Concordia, Mandalore's moon, with Kryze as his escort."}, {"tag": "p", "text": "Once on Concordia, Kenobi's investigation took him to an old beskar mine believed by the New Mandalorian government to be abandoned. There, he was captured and incapacitated by the Death Watch, who were secretly using the derelict mines to manufacture weapons and armor, only to later be rescued by Kryze. As Kryze and Kenobi made their escape from the mines, they were confronted by a contingent of Death Watch soldiers under the leadership of their most recent commander, Pre Vizsla, governor of Concordia and clan kinsmen of Death Watch's founder, Tor Vizsla. The younger Vizsla had previously been a public supporter of Kryze and the New Mandalorian regime, but had worked in secret for years to rebuild the Death Watch in the wake of the Great Clan Wars, establishing a hidden base in the Concordian mines from which Death Watch could move against the pacifists Vizsla viewed as a disgrace to the Mandalorian name."}, {"tag": "p", "text": "Pre Vizsla challenged Master Kenobi to single combat, engaging him with an ancient lightsaber of his own, the black-bladed Darksaber that had been passed down through his clan. Despite his own skill with the blade, Vizsla was unable to best the Jedi Master in combat on his own, ordering his Death Watch subordinates to finish Kenobi with jetpack-launched missiles. The chaos of the resulting explosion allowed Kenobi and Kryze the opportunity to flee Concordia and return to Sundari. Evidence of the significant threat Death Watch posed led to the Galactic Senate drafting a defense initiative that would send a garrison of the Republic's Grand Army to occupy Mandalore as a peacekeeping force. The New Mandalorian government was highly opposed to the idea, confident that they would be able to handle Death Watch on their own, and desiring Mandalore to maintain its neutral status instead of becoming a military target in the war due to a Republic presence. Intent on pleading her government's case against the proposed occupation before the Galactic Senate, Duchess Kryze traveled to Coruscant aboard her personal starship, the grand Coronet starliner, with the New Mandalorian senator Tal Merrik and a retinue of political sympathizers."}, {"tag": "p", "text": "During the voyage to Coruscant, Senator Merrik proved himself a traitor to the New Mandalorian cause and a Death Watch ally when he attempted to have Kryze killed aboard the Coronet, unleashing a band of assassin probes from the vessel's cargo hold. The assassin droids were foiled by Master Kenobi's continuing protection of Kryze, along with a small detachment of clone troopers under the command of Captain Rex, Commander Cody, and Kenobi's former Padawan, Anakin Skywalker. His initial plan ruined, Merrik took Kryze hostage at blasterpoint, and called in battle droid reinforcements from Death Watch's Confederacy allies to deal with the clones and Jedi. Though he attempted to flee the Coronet with the captive duchess, Merrik initiated a contingency plan wherein he could detonate the ship's engines with a hand-held detonator, killing everyone aboard including himself, if his escape could not be secured. Amid a standoff between Obi-Wan Kenobi and Merrik, it was Kenobi's former Padawan Skywalker who brought an end to the threat Merrick posed by killing the New Mandalorian senator and securing the detonator."}, {"tag": "p", "text": "Once safely on Coruscant, Duchess Kryze went before an assembly of the Republic senate, hoping to convince the gathered senators that an intrusion by the Republic into Mandalorian affairs would only make the situation worse, and a Republic occupation would incite the population of Mandalore to violent rebellion. However, Supreme Chancellor Palpatine presented recorded testimony from the New Mandalorians' Deputy Minister Jerec, in which the statesman indicated that it was their government's pride that brought Kryze before the Galactic Senate and that if they were to have any success in stopping the Death Watch, the New Mandalorians would need Republic assistance. Unknown to nearly all involved, the evidence had been doctored from Jerec's original statement; Kryze's existing relationship with the Deputy Minister made her question the validity of his apparent testimony, but when she demanded to speak with him, Chancellor Palpatine informed the Duchess that Jerec had been killed in a Death Watch bombing on Kalevala the day prior. On that solemn note, the senatorial session was adjourned and the vote on the resolution was scheduled for the following day. Duchess Kryze left the Senate Building, only to come under attack from a Death Watch assassin sent to Coruscant with orders to terminate her life by Pre Vizsla. Her airspeeder was destroyed and her pilot killed, but Kryze managed to escape the ordeal physically unharmed. As an unexpected result of the attack, the Senate decided that the Death Watch threat required more immediate action, and elected to move up the vote, passing a resolution that would see Republic troops departing for Mandalore the following morning."}, {"tag": "p", "text": "At the same time, Prime Minister Almec had dispatched a New Mandalorian scout to Concordia, who was able to ascertain that the Death Watch was indeed assembling an army in preparation for the Republic's arrival. A shrewd politician, Almec was able to correctly deduce the Death Watch's plan from the scout's report: instigating a conflict with the Republic, the Death Watch would gain the populace's support by appearing to be liberators against an oppressive off-world occupation the likes of which Mandalore had not endured since the end of the Mandalorian Excision. Even with this knowledge, however, there was little he could do on his own, and instead he put his faith in Kryze's ability to convince the Senate to see reason."}, {"tag": "p", "text": "On Coruscant, Kryze met with Davu Golec from the Republic Ministry of Intelligence. A supporter of Kryze and the New Mandalorian government, Golec had discovered that Jerec's presented testimony had been falsified, and turned over the original recording to Kryze before being gunned down by the Death Watch assassin still targeting the Duchess. A misunderstanding at the scene of the crime on the part of the Coruscant Security Force led to the belief that Kryze had been responsible for Golec's death, and she was forced to flee when CSF attempted to take her into custody. Kryze contacted Obi-Wan Kenobi for assistance while on the run, and together they passed along the true recording to Senator Padmé Amidala of Naboo so that she could present the findings to the senate. In light of the newfound evidence, the Senate ordered an emergency session, during which the earlier approval of the resolution was overturned and the Republic intervention force was decommissioned. Kryze was also cleared of all wrong-doing when it was discovered that Death Watch was responsible for Davu Golec's death. Although the Death Watch's plan had been foiled, Pre Vizsla contemplated attacking the New Mandalorians with his assembled army regardless, but was persuaded against such action by Count Dooku; Dooku reasoned that without the backing of the Mandalorian people, any attempt to claim power by force would be met with failure, just as they had for the previous incarnations of Death Watch during the last wars. Due to Kryze's victory in the Galactic Senate, Mandalore was allowed to uphold its neutral status and remain out of the Clone Wars. Defeated, Death Watch was later driven from the Mandalore system, becoming a nomadic band of Mandalorian outlaws wandering the galaxy."}, {"tag": "h4", "text": "Corruption and conspiracy"}, {"tag": "p", "text": "Despite the successes of Duchess Satine Kryze in allowing Mandalore to remain out of the galactic war, peace came at a price for the New Mandalorians. With their declaration that Mandalore would remain a neutral entity, much of the Republic's hierarchy viewed the New Mandalorians now on the outside of Republic concerns; Republic trade routes to Mandalore were largely shut down and re-prioritized elsewhere. Having isolated themselves from Mandalore's farming communities in the verdant parts of Mandalore left unscathed by the Mandalorian Excision, the New Mandalorians began to suffer from food shortages without Republic aid, leaving many of the faction's citizens starving. In an effort to remedy the situation, Prime Minister Almec took it upon himself to establish a black market trade network in secret, going against the wishes of Duchess Kryze in order to get the supplies the New Mandalorian people so desperately needed."}, {"tag": "p", "text": "The illegal intake of supplies to Sundari came at a dangerous cost: Moogan smugglers arrived in Sundari, bribing their way passed customs officials in order to unload shipments of Ardees Beverage tea. Looking to increase their total profits from the shipment, the Moogans diluted the tea with slabin from a warehouse at Sundari's docks, but instead of a harmless mixture, the slabin dosage was incorrectly calculated, contaminating the tea. The tea was distributed to a number of New Mandalorian schools, resulting in hundreds of children becoming violently ill, many of whom were taken to a recently opened hospital in Sundari. The hospital was set to be toured that day by Duchess Kryze and her offworld guest, Senator Padmé Amidala—visiting Sundari to discuss the reinstitution of Republic aid to the New Mandalorian people—and upon discovering the outbreak of poisoned youths, Kryze and Amidala set out to discover the source of the illness plaguing the New Mandalorians sect's schoolchildren. Upon visiting one school that had been affected, the two politicians discovered the Ardees bottled tea to be the source of the poison, and traced the shipment back to the Sundari warehouse out of which the Moogan smugglers were operating. Following a brief shootout between the smugglers and several members of the Mandalorian Royal Guard, the operation was dismantled and an antidote was provided to the hospitalized children, though many New Mandalorian children had already succumbed to the contaminated drinks and died as a result. Prime Minister Almec was confronted by Kryze at the conclusion of her investigation—though she did not yet know of his involvement—and in an effort to ease her concerns, he assured the Duchess that he intended to form a committee to look into the corruption lurking amongst the New Mandalorians' officials, but this did little to quell Kryze's misgivings. Instead, the Duchess requested a member of the Jedi Order come to Mandalore in order to help stop the black market trade network, and lecture against the perils of corruption at the Royal Academy of Government. Agreeing to the request, the Jedi Council dispatched Jedi Padawan Ahsoka Tano to Mandalore."}, {"tag": "p", "text": "Arriving in Sundari, Tano lectured for days at Sundari's Royal Academy, speaking on the subject of corruption among government leadership, and the duty of the common citizen to ensure lawful behavior among society's rulers. Taking the Jedi's words to heart, a group of New Mandalorian cadets aware of the city's food shortages—Amis, Lagos, Soniee, and Duchess Kryze's own nephew, Korkie—decided to investigate Sundari's warehouse district for any signs of misconduct. Infiltrating the facility, the four New Mandalorian youths discovered a government warehouse being used to store black market goods, and a secret meeting between a group of New Mandalorian officers, several Gotal smugglers, and an unknown being draped in a concealing cloak. They informed Duchess Kryze of the meeting they had witnessed, only to be met with a warning of caution. Instead, the cadets turn to Prime Minister Almec with their find, unaware that he was in fact the cloaked man from the warehouse. Fearing the repercussions of his discovery, Almec moved against the cadets and had them arrested by the New Mandalorian Secret Service, along with their Jedi ally Padawan Tano, and even the Duchess herself. He attempted to have the Duchess sign a confession of conspiracy, incriminating herself as the one responsible for the black market network, going so far as to use a shock collar as a means of persuading her. Kryze would not yield, and soon after, Tano and the cadets fought back, managing to overpower Almec and his guards until he could be fitted with a shock collar himself, forcing the Prime Minister to surrender. Almec and his conspirators were placed under arrest and subsequently imprisoned, having been found guilty on charges of corruption by Sundari's courts. Almec was replaced as Prime Minister of the New Mandalorians by Armatan, the former New Mandalorian Minister of the Interior, while the black market trade network was left in ruins."}, {"tag": "h4", "text": "The Death Watch coup"}, {"tag": "p", "text": "Two years since Death Watch had last attempted to remove the New Mandalorians from power, Sundari and other New Mandalorian holdings across Mandalore came under attack by a contingent of offworld crime lords known as the Shadow Collective. Comprised of elements of Black Sun, the spice-dealing Pyke Syndicate of Coruscant, and the Hutt Cartels, these gangsters were secretly in collusion with the Death Watch after Pre Vizsla forged an alliance with their leader, the rogue Sith Lord Darth Maul, to topple the New Mandalorians' pacifist regime. As part of a plan to exemplify the ineffectiveness of the New Mandalorian administration, the Collective's thugs rampaged throughout Sundari, overwhelming a police force that proved incapable of defending against the aggressors. The capital city's docks fell quickly into Collective control, while Pyke gangsters assaulted the Mandalore Banking Center, and Black Sun foot soldiers opened fire on Peace Park with reckless abandon, killing civilian and police officers alike. Panicked, dense crowds of New Mandalorians gathered at the Sundari Royal Palace to demand action from their leaders, only to be advised to remain calm and cautioned to keep to their peaceful principles by Duchess Satine Kryze. It was then that Death Watch made their presence known, as Pre Vizsla publicly pledged to do what Kryze could not: defend the New Mandalorians against the crime syndicates and keep Sundari safe."}, {"tag": "p", "text": "At the docks of Sundari, Death Watch troops subdued the Black Sun and Pyke forces holding the dock workers captive, freeing the grateful New Mandalorians and taking the criminals into custody. In Peace Park, Pre Vizsla's loyal lieutenant Bo-Katan and her handpicked unit known as the Nite Owls rescued a number of New Mandalorian children from Black Sun footsoldiers, binding the gangsters with fibercord, while Vizsla himself apprehended a team of Pyke thugs led by Darth Maul's Sith apprentice, Savage Opress, as they attempted to flee the pilfered Mandalore Banking Center. The Collective had played the role of villains to be vanquished by the Death Watch well, and as the Mandalorian warriors triumphed over the offworld gangsters, the New Mandalorian populous applauded their efforts and lauded the Death Watch as saviors. With the fervent support of the New Mandalorian people, Pre Vizsla marched on the Royal Palace with a cadre of Death Watch soldiers, deposing and imprisoning Duchess Kryze and her supporters, going so far as to kill those officials who refused to side with him. Vizsla declared himself the new Prime Minister, replacing Armatan, while claiming the title of Mand'alor of the New Mandalorians."}, {"tag": "p", "text": "His ambitions met, Vizsla turned on his Sith allies and had both Darth Maul and his apprentice, Savage Opress, jailed. However, the two Sith broke free of their confines shortly after, and came across the captive former Prime Minister Almec within the Sundari prison complex; deciding the deposed politician would make a suitable, more malleable replacement for Vizsla, Maul and Opress broke free of the prison with Almec in tow, storming the Royal Palace. There, Maul challenged Vizsla to a duel for leadership, and despite a furious show of skill and force from Vizsla, Maul emerged triumphant, beheading Vizsla and claiming the right to succeed him as leader of Death Watch. While Vizsla's lieutenant Bo-Katan and a squad of other Death Watch soldiers refused to kneel to a non-Mandalorian, fleeing the palace amidst a hail of blasterfire, many of Vizsla's former troops bowed to the victorious Sith Lord and accepted Maul as their new Secret Mandalore. By Maul's new authority, Almec was reinstituted as Prime Minister of the New Mandalorians, serving as a public face and puppet ruler behind which Maul could reign in secret, his presence unknown to the people of Mandalore beyond the ranks of Death Watch. With his position returned, Almec spoke before a gathering of the New Mandalorian people, detailing a story in which Duchess Kryze had been responsible for Vizsla's murder and that it had been Vizsla's last wish for Almec to return to office as Prime Minister in order to attend to the plights of the populous in his absence. Stating that it was in accordance with Vizsla's last wishes, Almec also assuring the New Mandalorians that Vizsla's goals of remilitarization would live on."}, {"tag": "p", "text": "Further conflict broke out when Bo-Katan and the Death Watch troops that had turned their backs on Darth Maul attempted to free Duchess Kryze from her confines and flee the city. Though they were successful in reaching Sundari's outer docks, Maul's loyal Mandalorian super commandos overtook and recaptured Kryze before she could do anything more than send a request for aid to Obi-Wan Kenobi at the Jedi Temple on Coruscant. Knowing the Republic would be unable to send official aid to deal with the Death Watch threat due to Mandalore's neutrality, Kenobi journeyed to the Outer Rim world alone and in disguise, sneaking into Sundari in order to free his former lover. This rescue attempt was as doomed to failure as the first, as Kenobi's starship was destroyed and he was apprehended along with Kryze by a vengeful Darth Maul. Taken back to the palace, Maul killed Kryze before Kenobi's eyes in recompense for the grievous injuries the Jedi Master had inflicted upon him more than a decade prior. Rather than kill Kenobi outright, Maul instead chose to have him thrown into prison to live with the grief of Kryze's death, but before Kenobi could ever reach his intended jail cell, he was rescued by Bo-Katan and her faction of Death Watch. Bo-Katan rushed the Jedi Master out of Sundari and off of Mandalore amid a heated battle between her Death Watch soldiers and their former comrades that were now loyal to Darth Maul. Concurrent to Kenobi's escape was the arrival of Darth Sidious, who had sensed the whereabouts of his one-time apprentice Darth Maul, and traveled to Mandalore in order to confront him over a breach of the Sith Order's Rule of Two. In Sundari's Royal Palace, the Dark Lord of the Sith faced off against Maul and Savage Opress, in a lightsaber duel that saw the death of the Opress and the subjugation of Maul at Sidious's hands, though Maul was spared in order to serve the Dark Lord's own future purposes."}, {"tag": "h3", "text": "Decline"}, {"tag": "p", "text": "Backed by the criminal forces of the Shadow Collective, the Death Watch's coup proved to be too much for the New Mandalorians. Their government fell in the face of Death Watch's rise, while the Mandalorian revanchists eventually put an end to the New Mandalorians as a faction."}, {"tag": "p", "text": "Mandalore's position in the Clone Wars changed with the arrival of Spar on Mandalore. The former Republic ARC trooper, previously known as Alpha-Ø2, deserted the Grand Army and fled from Kamino before the start of the Clone Wars. Traveling the galaxy as a mercenary, he came to Mandalore following the death of Jango Fett on Geonosis, and there he met a local constable and clan chieftain by the name of Fenn Shysa. Shysa, who saw Jango Fett as a symbol of strength for Mandalore, persuaded the clone to act as Fett's heir and take up the vacant role of Mand'alor. Spar did, becoming \"Mandalore the Resurrector,\" and forging a new army of supercommandos in the image of the fallen True Mandalorians which he dubbed the Mandalorian Protectors. Spar won out over the broken New Mandalorians, and overturned the New Mandalorians' position of neutrality, instead allying Mandalore with the Confederacy of Independent Systems in order to oppose a Republic he viewed as oppressive and the Jedi Order, whom he blamed for their part in destroying the True Mandalorians and their willingness to lead the Grand Army's clone soldiers. The New Mandalorians would never manage to reclaim their lost dominance, and under Spar, the warrior clans and Jaster Mereel's Supercommando Codex returned to the forefront of Mandalorian culture on Mandalore."}, {"tag": "h2", "text": "Notable New Mandalorians"}, {"tag": "h3", "text": "Satine Kryze"}, {"tag": "p", "text": "The daughter of the chieftain of Clan Kryze, Satine Kryze hailed from the planet Kalevala. During the Great Clan Wars, as the Death Watch attempted to overthrow the New Mandalorian regime in a bloody civil war, Kryze's father sent her away to Coruscant in order to gain an education in diplomacy and statecraft, and be free of the violence that would eventually claim the clan leader's life. When Kryze returned to the Mandalore system, she did so under the protection of Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi; for months, Kryze was under constant threat from the Death Watch and its allies, but as time went on, Kryze was able to use the skills she had learned and her own charisma to rally war-weary chieftains to the New Mandalorian cause and bring about peace. Following the end of the Great Clan Wars, Kryze was appointed Mand'alor by the New Mandalorian people, and as Mand'alor, she set about rebuilding the damage incurred to Mandalore during the Great Clan Wars, leading New Mandalorian society and its capital city Sundari to prosperity."}, {"tag": "p", "text": "Upon the outbreak of the Clone Wars, Kryze strove to ensure Mandalore would remain neutral in the conflict, though the peace she had made came under siege by the re-emergence of the Death Watch. Though Kryze was able to overcome their initial schemes and attempts on her life to solidify Mandalore's neutrality, as the Clone Wars went on, her rule was marred with severe food shortages, a rise in New Mandalorian corruption, and mass poisonings throughout New Mandalorian territory as a result of toxin-laced tea imported by Moogan smugglers. In 20 BBY, Death Watch allied with the Shadow Collective to bring down the New Mandalorians: public opinion swayed against Kryze as offworld gangsters mercilessly gunned down civilians and caused panic, only for the Death Watch to arrive and act as saviors of the people, defeating and arresting their secret allies in a show of apparent heroism. With the support of her people gone, Kryze was deposed and imprisoned, replaced as Mand'alor by Death Watch leader Pre Vizsla. Weeks later, when her old friend Obi-Wan Kenobi came to Mandalore in order to rescue Kryze from prison, she was murdered in front of the Jedi Master by the Sith Lord Darth Maul, who had been in collusion with Vizsla during his coup and sought to pain Kenobi with his one-time lover's death. Despite her achievements, Kryze's legitimacy as Mand'alor was not recognized by the Mandalorian warrior clans in the years that followed, and the New Mandalorian faction was eventually destroyed."}, {"tag": "h3", "text": "Almec"}, {"tag": "p", "text": "A Mandalore native, Almec grew up a member of the New Mandalorian faction. He despised the traditional Mandalorian warrior ways, and took great pride in the success the New Mandalorian government had in renouncing the violent reputation Mandalore had held in the past. He came to resent the opinion of offworlders who associated Mandalore only with the planet's warrior clans rather than the progressive New Mandalorian society, and was a strong believer in the sect's pacifist beliefs. Almec was named Prime Minister of the New Mandalorian people by the start of the Clone Wars, but despite his high-ranking office and talents as a diplomat, Almec was a humble man, who preferred simple clothes and considered himself a servant of the people."}, {"tag": "p", "text": "However, it was his dedication to the New Mandalorian people that would be his downfall: the black market trade network that Almec took it upon himself to establish during lean times in New Mandalorian society led to Moogan smugglers importing tainted tea that poisoned and killed New Mandalorian children. When his complicity in these deaths were discovered, Almec was imprisoned on charges of corruption. Two years later, Almec rode out a Death Watch coup against the New Mandalorians in the safety of his cell in a Sundari prison. But when he was approached by the rogue Sith Lord Darth Maul with the promise of power, Almec was freed of captivity and returned to his former position as Prime Minister. With Death Watch and Maul in power now, Almec renounced his former pacifism in the belief that war would again be the future of Mandalore, and agreed to loyally serve Darth Maul as a puppet ruler of the New Mandalorians."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Mandalorians first entered into Star Wars canon via a mention in The Essential Atlas, a 2009 reference guide authored by Jason Fry, before making their visual debut in the second season of the Star Wars: The Clone Wars television series, appearing in a trilogy of episodes comprised of \"The Mandalore Plot,\" \"Voyage of Temptation,\" and \"Duchess of Mandalore.\" Following their initial introduction, the New Mandalorians would continue to be a reoccurring presence in the television series, reappearing later in the second season's \"Senate Murders,\", and in the third season episodes \"Corruption,\" \"The Academy,\" and \"Pursuit of Peace.\" During The Clone Wars series' fourth season, several New Mandalorians appeared in minor roles in the episodes \"A Friend in Need\" and \"Deception.\" The release of the young reader novel The Clone Wars: Darth Maul: Shadow Conspiracy by Jason Fry, along with three of the television series fifth season episodes the novel adapted—\"Eminence,\" \"Shades of Reason,\" and \"The Lawless\"—saw the downfall of the New Mandalorians, brought on by a Death Watch coup with the aid of Darth Maul."}, {"tag": "p", "text": "The New Mandalorians were introduced to The Clone Wars television series in a way that differed significantly from the manner in which Mandalorians had been more commonly portrayed in the Star Wars Expanded Universe prior to that point in time: the New Mandalorians adhered to pacifistic neutrality and non-violence, in a culture otherwise established as one of clan-based soldiers and mercenaries. Although the choice to portray a group of Mandalorians in this way was a radical departure of what had come before, the New Mandalorians' commitment to peace was an essential aspect of their overarching narrative throughout the television series. Discrepancies between the portrayals of the two societies, one of pacifist desert-dwellers and one of soldierly ruralists, were reconciled through a variety of reference books including The Essential Atlas and Star Wars: The Clone Wars: New Battlefronts: The Visual Guide, while The Essential Guide to Warfare detailed additional aspects of the New Mandalorians' in-universe foundation and rise."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}