{"url": "New_Order", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Culture of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "New Order"}, {"tag": "p", "text": "The New Order was the official political ideology and atheistic state religion adopted by the First Galactic Empire, and was enforced by COMPNOR, with the Grand Architect of the New Order responsible for its political message."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Sheev Palpatine proclaimed himself Emperor in front of the whole Galactic Senate, he promised that his new regime would usher in a thousand years of peace by ending the corruption and ineptitude of the old political system of democracy."}, {"tag": "p", "text": "Early into the Empire, a series of sub-commissions began blueprinting what role the \"ideal\" Imperial citizen would serve in a political religion that would come to be known as the New Order. The Empire's officious tone was appealing to dissatisfied youths who felt powerless and victimized. To them, the Empire offered a chance at retribution and an intoxicating brand of power."}, {"tag": "h2", "text": "Ideology"}, {"tag": "p", "text": "The chief values of the regime were order, control, and the rule of law. Other values included civic pride, patriotism, and militarism, which some described as Fascism. Xenophobia and humanocentrism were key points of New Order policy, and were justified as a natural extension of the human right to rule."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The term \"New Order\" was used by the Nazi Party in reference to their future geopolitical and ideological goals. Other fascist movements of the early 20th century also used the term as a name for themselves or their ideology. Since clear similarities can be seen between the Empire in Star Wars and real life fascism, it is likely the term New Order was inspired by these movements.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}