{"url": "New_Order/Legends", "categories": ["Category:Legends articles", "Category:We're Doomed!", "Category:Articles needing additional sources", "Category:Culture of the Galactic Empire", "Category:Sith"], "nodes": [{"tag": "h1", "text": "New Order"}, {"tag": "p", "text": "The New Order, also called the New Imperial Order and the New Era of Power, was the name primarily given to the political program and the ideology of COMPNOR adopted by the Galactic Empire and its successor states, the Imperial Remnant and Empire of the Hand."}, {"tag": "h2", "text": "Terminology"}, {"tag": "p", "text": "The term New Order appeared to be based on the use of the term \"Old Order\" to represent the Galactic Republic. During the Mandalorian Wars, Mandalore the Ultimate and his Neo-Crusaders intended to conquer Republic space and establish a New Order. The term had also been used earlier by members of the Separatist Council to describe the Confederacy of Independent Systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The New Order has its origin in the Declaration of a New Order by which Palpatine established the Empire in 19 BBY. It endured, with and without Palpatine, in one form or another, for at least one hundred and fifty-seven years. That it lasted this long is no credit to Palpatine, for in the end it had never truly been intended to operate without him; it fell to others—to Gilad Pellaeon and, later, to the Fels—to try to find a new relevance for it, to give it a new lease on life as a \"New Order with a Personal Face.\" Under Darth Krayt, however, the New Order was returning back to the way it was, back to Sith tyranny and absolute rule under the Head of State."}, {"tag": "h2", "text": "Ideology"}, {"tag": "p", "text": "The New Order arose as a result of the failures of the Galactic Republic (in particular the usage of \"everyone is right\" democracies), which was decentralized and often found ineffectual in resolving disputes between its more powerful members. The Empire was championed as a strong unifying solution to this problem. It criticized the perceived decadence and weakness of the Republic and advocated an authoritarian and militaristic social and political culture. It promised to trade frailty for strength, chaos for order, and uncertainty for decisiveness. As such, they also made sure that there was no question whatsoever as to who was in charge, in order to ensure that there was no grandstanding careerism among senators. Leia Organa, however, claimed that this ultimately resulted in those doing the grandstanding careerism to be replaced with moffs and admirals."}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "The military was massively built up and reinforced. They were also taught to always be on the alert of danger to the Empire, either within or without, and to respond with a swift, merciless retribution."}, {"tag": "h3", "text": "Male Chauvinism"}, {"tag": "p", "text": "The New Order's ideology was a pervasively male chauvinist, possibly due to its military origins. The armed forces were almost entirely male—first because their earliest members were so and later because of deliberate exclusion. Likewise were most of the Emperor's advisors. However, there were notable exceptions such as Admiral Natasi Daala. Later though, during the days of the Imperial Remnant, women were just as important as they were in the New Republic. Male chauvinism would later rear its head again, especially as the Council of Moffs saw that Marasiah Fel was to become the next ruler of the Fel Empire."}, {"tag": "p", "text": "This argument, however, has been often countered with the fact that the Imperial military is made up of clones who came from male DNA, thus countering accusations of sexism and replacing it with the fact the Empire wanted members who had unquestioning loyalty like the clones had. Another argument made against the allegation of misogyny, made by the female stormtrooper Isila Drutch, was that the female physiology was such that women simply were more likely to wash out of stormtrooper training on Carida than males, especially when Stormtrooper training itself was notoriously brutal as it was. Drutch also implied that, at least in the case of the Stormtrooper Corps, it was only assumed there were no women in the branch due to the design of the stormtrooper armor being such that it would have been impossible to determine the stormtrooper's gender. In addition, Leia when recalling the events of the Liberation of Coruscant, more specifically the aftermath of their storming the Imperial Palace, implied that there were some staff at the palace that were female besides the Emperor's concubines."}, {"tag": "h3", "text": "Culture"}, {"tag": "p", "text": "The culture of New Order proponents was ascetic and minimalist, as it was believed that bare essentials were the core of efficiency, with the framework reduced to the essence. These aesthetics were encouraged throughout the galaxy by the Coalition for Progress, an arm of COMPNOR. During its short existence, the Empire was not particularly brutal in the suppression of artistic culture, as it was primarily interested in military and political dominance. However, pressures from the New Order left their mark on the art of the Imperial period. In addition, any artists that exhibited subversive tendencies were often required to undergo the necessary re-education, with Leia also remarking that any government, regardless of how many battles it won, that would not tolerate criticism was inherently feeble."}, {"tag": "p", "text": "Despite this, there existed a glaring dichotomy in Imperial culture. On one hand, there was certainly a change from the artistic vibrancy of the Galactic Republic. On the other, the privileged élites of the Core Worlds that formed the ruling class of the Empire often attended soirées, fêtes, and balls. These fortunate few enjoyed a charmed existence under the Empire where Human-produced operas and artwork presented a sort of intellectual renaissance, at the expense of non-Human or politically \"subversive\" art."}, {"tag": "p", "text": "It was believed that only the upper crust of galactic society was suited for the rigors of command, so a disproportionate amount of the Imperial command staff came from privileged backgrounds. This led to a sharp contrast between the officer corps and the rank-and-file soldiers."}, {"tag": "p", "text": "Another aspect of their culture was being Anti-Jedi and denouncing the use of the Force. Palpatine commissioned a loose organization of loyal Darksiders called the Dark Side Adepts, however, as a replacement for the now abolished Jedi Order and to make up for the lack of Sith Lords to do his bidding."}, {"tag": "p", "text": "All of this changed during the days of the Imperial Remnant, however, when Imperial officers were selected from the more experienced veterans rather than galactic blue-bloods. This shift in command meant more sensible, tactically-minded decisions on the battlefield.\nIn addition, Jedi were no longer hated as they once were. Though individual prejudices certainly existed, it was no longer law to despise Jedi or the Force. Eventually, this would lead to the formation of the Knights of the Empire."}, {"tag": "h3", "text": "Humanocentrism"}, {"tag": "p", "text": "The New Order was intrinsically tied to a Human-supremacist vision of society. Aliens were rarely accepted into formal Imperial organizations, droids even less frequently. They were also often the target of exclusionary policies, perhaps as a result of the stigma surrounding the alien-based Confederacy of Independent Systems and their droid army."}, {"tag": "p", "text": "Officially, New Order proponents justified the subordinate status of non-Humans by suggesting that Human supremacy was needed in order to protect and govern them, specifically claiming that non-Humans, in particular those within the Rim, were unpredictable and prone to violent outbursts, citing the history of the Republic Senate as evidence to this. This marginalization explained why non-Humans rarely held positions of power: they were not technically barred but ostensibly were simply unfit for such positions. Theoretically, Imperial law made no distinction between Imperial citizens (Human or others), but the practice of Human High Culture belied such legal niceties."}, {"tag": "p", "text": "In some cases, sentient aliens had been virtually exterminated by the Empire (infamously, the Empire occasionally used an ecological act permitting the eradication of dangerous species to justify military operations against sentient species). According to the Imperial Handbook, the orchestration of strategic extinctions was under extreme circumstances that was used in the interest of galactic security. This allowed aliens to be enslaved and put to work in mines and on the Death Star. Chewbacca worked under the Empire until Han Solo freed him from oppression. Another change was Humans were generally the only ones allowed in the military (notable exceptions included Grand Admiral Thrawn). Many planets were represented by Humans in the Imperial Senate prior to its deconstruction. Many species, including the Mon Calamari and the Bothans, joined the Alliance to Restore the Republic in response to their loss of rights and treatment. Despite this, however, Leia when recalling the events of the Liberation of Coruscant, more specifically the aftermath of their storming the Imperial Palace, implied that there were some staff at the palace that belonged to various alien species. After the fall of the Galactic Empire, the Remnant abandoned speciesism altogether, thus potentially drafting the Rights of Sentience into the Imperial Charter. Droid rights were most likely brought up from an absolute no to a controversial maybe. By the time of the Second Imperial Civil War, Humanocentrism was still present amongst the ranks of the Imperial Military, as exemplified by Admiral Dru Valan, despite the new laws."}, {"tag": "h3", "text": "Anti-Jedi"}, {"tag": "p", "text": "In large part due to Order 66 and Operation Knightfall, the Empire also promoted anti-Jedi sentiment, and to a certain degree anti-Force User sentiment, often citing how the Jedi managed to be killed easily by clone troopers despite them being Force users as an example of how they were allegedly using scams. However, they do allow for Force users among them, so long as they pledged to employ them in full cooperation with the Emperor's wishes, and that any who don't were exterminated."}, {"tag": "h2", "text": "Economic practice"}, {"tag": "p", "text": "Following the Clone Wars, the Empire started a process of stabilization and expansion of the economy. While the Imperial Period saw dramatic increases in state control and centralization of economic procedures, it had little effect on the galactic economy, as witnessed in the virtual non-existence of inflation. This was because the New Order tolerated corporate competition, and as such established the Corporate Sector Authority within the Corporate Sector where transparent mercantilism could occur without interference. At the same time, they also wish to ensure the companies allow their coffers to be used for the greater good, and as such, longstanding corporations such as TaggeCo, Kuat Drive Yards, and Santhe/Sienar Technologies, had been nationalized by the Empire to allow their engineers to contribute to the Empire's prosperity."}, {"tag": "h2", "text": "Governance"}, {"tag": "p", "text": "The governance of the New Order flowed top-down from the central authority. The Imperial Military was used to maintain order throughout the Empire."}, {"tag": "h3", "text": "Imperial Senate"}, {"tag": "p", "text": "The Imperial Senate acted as a transitional buffer between the Old Republic to the New Order, with it eventually being removed by 0 BBY."}, {"tag": "h3", "text": "Redistricting of Imperial territory"}, {"tag": "p", "text": "The Oversectors were redistricted to comprise of several smaller sectors, in order to ensure ease of various elements essential to the New Order, including direct command of the military forces, controlling information, and more efficient taxation of Imperial subjects, with Grand Moffs commanding each Oversector and Moffs administrating each smaller sector. Both the Moffs and Grand Moffs by consequence have direct political and military control over the territories."}, {"tag": "h3", "text": "Propaganda"}, {"tag": "p", "text": "In order to ensure the New Order was promulgated, COMPNOR was created to generate public support, as well as control over the culture and youth groups of the Empire, ensuring that the next generation would be indoctrinated with Imperial values. In addition, they also had direct control over the media HoloNets via Imperial HoloVision, eliminating their status as private entities, and had indirect control via political influence over unofficial entities such as TriNebulon News, Brentaal Trade News, and Core News Digest."}, {"tag": "h2", "text": "New Order supporters"}, {"tag": "p", "text": "At first, people of the Empire enthusiastically supported the vision outlined in the Declaration of a New Order, largely due to the violence that had plagued the galaxy for so long. Many Senators wholeheartedly supported the new government while a number of more cautious Senators chose to watch and wait to see how the new government would handle the affairs of state. Imperial citizens were encouraged to join COMPNOR. However, the New Order began to lose support as the Empire's authoritarian nature became increasingly public."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}