{"url": "New_Republic/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic governments", "Category:New Republic"], "nodes": [{"tag": "h1", "text": "New Republic"}, {"tag": "p", "text": "The New Republic, (4 ABY–28 ABY) was the name of the galactic government established by the Alliance to Restore the Republic to replace the Galactic Empire after the Battle of Endor. Like its predecessor, it was often simply referred to as the Republic; less often, it was referred to as the New Galactic Republic or the Second Galactic Republic."}, {"tag": "p", "text": "Formed in 4 ABY, after the dissolution of the former Alliance of Free Planets (which was formed directly after the Battle of Endor as an intermediate government), it was to become the supreme governmental authority of the galaxy. The \"New\" Republic was supposed to be a sort of continuation of the original Galactic Republic that had become known as the Old Republic at that time."}, {"tag": "p", "text": "The New Republic was founded on the same principle that the old Galactic Republic was thousands of generations before—to have a representative parliamentary body govern the galaxy in a fair and equal manner—and it was designed to eradicate the shortcomings that brought about the Galactic Republic's downfall. The New Republic was protected by the New Jedi Order, which was established by Luke Skywalker, just as the Old Republic was once protected by the Old Jedi Order."}, {"tag": "p", "text": "Because of the restoration of the Galactic Republic, the Empire sometimes referred to the New Republic as the Old Order while in decline, as opposed to their New Order."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "A New Galactic Republic"}, {"tag": "p", "text": "The death of Emperor Palpatine, in 4 ABY, at the Battle of Endor, signaled the end of the Empire. The news of the Death Star II's destruction, as well as Palpatine's demise, was broadcast by the Rebel Alliance throughout the galaxy, using their alternative HoloNet system called the New Republic HoloNet. On the capital world of Coruscant, civilians and Rebels reacted to the broadcast by starting an uprising, among other things shouting praise for the return of the Republic."}, {"tag": "p", "text": "A week after the Battle of Endor, at the end of the Bakura Incident, the Alliance to Restore the Republic, was reorganized into the Alliance of Free Planets."}, {"tag": "p", "text": "One month later, in the aftermath of the Nagai–Tof War, the Alliance to Restore the Republic was reorganized into the New Republic, with the official Declaration of a New Republic was issued by eight of the most important members of the Rebel Alliance, setting forth goals, values, and ideals of the new government. These eight individuals, Mon Mothma of Chandrila, Princess Leia Organa of Alderaan, Borsk Fey'lya of Kothlis, Admiral Ackbar of Dac, Sian Tevv of Sullust, Doman Beruss of Corellia, Kerrithrarr of Kashyyyk, and Verrinnefra B'thog Indriummsegh of Elom, became the first members of the New Republic provisional government, or the Provisional Council."}, {"tag": "p", "text": "The main goal of the Provisional Council, and so of the New Republic, was to capture Coruscant. This was more for symbolic rather than strategic purposes. Since the beginning of the Old Republic the seat of galactic government had been on Coruscant, and its capture would legitimize the authority of the New Republic in the eyes of the galaxy. Until the move could be made, the Provisional and Inner Councils met on other member worlds instead, such as Noquivzor. During this period, the Provisional Government continued to provide guidance for the new government and work out a new series of principles and laws."}, {"tag": "p", "text": "Initially, Mon Mothma chose to work against the Empire through diplomacy rather than combat, and the newly founded Republic dispatched envoys to thousands of worlds. Numerous systems joined the New Republic, while many others instead declared themselves independent. Mothma's Republic, which was intended as a voluntary union for the common good, respected such decisions. Toward that same end, Mothma devolved control of Planetary Security Forces that had been nationalized by the Empire to their own sectors via the Defense Declarations. Constituent sectors of the New Republic were obligated to contribute to the Republic's starfleet, but were allowed to retain command of their local forces. For some sectors, the Defense Declarations served as the deciding factor that motivated them to join the New Republic; furthermore, the Republic's defeat of the Tofs eased doubts that the former Rebels would be capable of defending the galaxy."}, {"tag": "h3", "text": "Onward to the Core"}, {"tag": "p", "text": "For the first few months following the victory at Endor, the New Republic government made few aggressive lunges into Imperial held space, instead choosing to concentrate on sending ambassadors to the numerous worlds that had overthrown their Imperial governors. As the ambassadors quickly strengthened the stability of the New Republic by increasing membership in the Outer Rim Territories, Admiral Ackbar prepared the military for the first in a series of campaigns aimed at liberating key portions of the galaxy from Imperial rule."}, {"tag": "p", "text": "After their conflict with the Nagai and the Tofs concluded, New Republic leaders met on Mon Calamari to plan their assault on the galaxy's inner systems, and in 4 ABY, Admiral Ackbar organized the New Republic's forces into four fleets. The First Fleet, commanded by Admiral Firmus Nantz, initially operated in the Western Reaches; the Second Fleet, commanded by Admiral Hiram Drayson, protected the New Republic leadership in Mon Calamari Space; the Third Fleet, commanded by Ackbar himself, was based in Bothan Space and operated in the Slice; and the Fourth Fleet, commanded by Admiral Voon Massa, was headquartered at Bothawui as a source of reinforcements for the First and Third fleets."}, {"tag": "p", "text": "For the next two years, the New Republic Defense Force liberated countless worlds in the Mid Rim and Inner Rim, expanding towards the Core Worlds and establishing key bases for future campaigns."}, {"tag": "p", "text": "By 6.5 ABY, 30% of the galaxy fully supported the New Republic, with an additional 20% supporting nominally and cautiously. As Ackbar and his fleets neared the Core, it became apparent that the main goal of the new government was in reach—the capture of Coruscant."}, {"tag": "h3", "text": "Legitimacy"}, {"tag": "p", "text": "Coruscant would be captured three years after the Battle of Endor. This was made possible by a commando team from Rogue Squadron. The team included pilots Wedge Antilles, Corran Horn, Gavin Darklighter, and others, as well as New Republic agents Iella Wessiri and Winter. Together, they were able to bring down Coruscant's planetary shields with lightning created using the planet's weather control systems. Once the shields were down, the team called the New Republic fleet under Admiral Ackbar to cripple the rest of the planet's defenses. This was, to a certain extent, a trap laid out by Imperial Intelligence head Ysanne Isard."}, {"tag": "p", "text": "The New Republic settled in to find the Imperials had left behind the Krytos virus—a deadly disease affecting many non-Human races and only curable by bacta. To deal with this threat, the Rogues resigned their commissions and waged the Bacta War against Isard. This brought Thyferra, the primary bacta-source in the galaxy, under New Republic control. The New Republic was thus able to pull through the Krytos crisis and continue to thrive. With the New Republic securely in control of Coruscant, many neutral worlds began to view the new government as a legitimate power, no longer as a weak band of rebels."}, {"tag": "h3", "text": "Rebels to respectable"}, {"tag": "p", "text": "Shortly after the capture of Coruscant and the relocation of the New Republic government, the New Republic Senate was established during Restoration Day. The speech of Princess Leia Organa, New Republic Minister of State, reflected the beliefs and principles of the First Senate:"}, {"tag": "p", "text": "Mon Mothma became the first Chief of State of the New Republic and also, under the new Charter, the President of the Senate and the Commander in Chief of the Armed Forces. During her administration, the New Republic government remained very similar to that of the provisional government. The Inner Council continued to be at its head, but the New Republic Senate assumed the duties of the Provisional Council."}, {"tag": "p", "text": "Fighting a dictatorial Empire proved much easier than forming a confederation of planets. As the Empire was slowly routed out of the Core, many New Republic councilors began to think that the war was near an end. Political ambitions and individual pursuits for power or prestige began to creep into the new government. While this problem was slowly growing more serious, the presence of the Empire as an enemy to rally against kept the Republic together. Despite more localized threats from Imperial warlords like Zsinj, by the end of 8 ABY nearly three-quarters of the known galaxy was aligned with the New Republic. Too many of the government's leaders thought the war was nearly over."}, {"tag": "h3", "text": "Imperial resurgence"}, {"tag": "p", "text": "One of the first major tests came in 9 ABY when Grand Admiral Thrawn assumed control of the remnants of the Empire and led a successful campaign against the New Republic. Political infighting hampered the New Republic's response to the crisis early on, as ambitious councilors like Borsk Fey'lya sought to gain power at the expense of others. Despite numerous defeats and setbacks, the New Republic rallied again, finally achieving victory during the Battle of Bilbringi. Thrawn was dead and his forces in retreat. Sensing that the defeat of the Empire was in their grasp, the New Republic launched a series of operations into the remaining sections of the galaxy still held by the Empire. The victory was short lived."}, {"tag": "p", "text": "A year after Thrawn's death, the resurrected Emperor Palpatine led a major Imperial offensive originating from the Deep Core. Faced with superior forces, including a number of superweapons, the New Republic was forced to fall back and operate in much the same way as the Rebel Alliance had. Ultimately the New Republic was saved by the death of the Emperor during a skirmish on Onderon, thanks to the efforts of Jedi Master Luke Skywalker."}, {"tag": "h3", "text": "Reorganization and reform"}, {"tag": "p", "text": "Upon the successful recapture of Coruscant in 11 ABY, the New Republic Senate began the first of a series of government restructuring programs. Specialized councils were established, each with greater power than ordinary Senate committees and given the responsibility for a specific aspect of government. These included the Council on the Common Defense, the Council on Security and Intelligence, the Justice Council, the Ministry Council, the Council on Science and Technology, and the Commerce Council."}, {"tag": "p", "text": "The Inner Council was replaced by the Ruling Council consisting of the chairpersons of each of the eight Senate councils. The Ruling Council had the authority to remove the Chief of State from office to prevent the head of government from becoming too powerful, as Palpatine had become as Supreme Chancellor."}, {"tag": "p", "text": "It was also at this time that Jedi Master Luke Skywalker convinced the Senate that the New Republic would only be further protected by the establishment of a new Jedi Order. The Senate thus endorsed Skywalker's establishment of the Jedi Praxeum on Yavin 4. The Praxeum was at first used to train the first Knights, and later became an academy where younger students would work their way up to an apprenticeship. During Admiral Daala's attempt to reform the Empire, Yavin 4 was considered a key point in the New Republic's downfall. It was thus targeted, but the Jedi managed to defend the Praxeum and drive the Empire away. Mon Mothma retired from public life and named Princess Leia Organa Solo as her successor. With the approval of the Senate, Organa Solo became the second Chief of State of the New Republic."}, {"tag": "p", "text": "Many important events with long lasting repercussions for the New Republic occurred during the presidency of Organa Solo. The most important of these was the opening of diplomatic talks with the Duskhan League, an alliance of Yevethan worlds in the Koornacht Cluster. This in turn led to what was commonly referred to as the Black Fleet Crisis, during which Organa Solo extended the powers of the Chief of State, amidst two petitions of recall from the Ruling Council and a petition of no confidence in the Senate, in order to protect the New Republic from the fanatical Yevetha and their ruthless campaign of genocide."}, {"tag": "p", "text": "It was also during this time that many former Imperial worlds petitioned for and received New Republic membership. However, the governments of many of these worlds retained their Imperial-era character and as a result their Senate delegations often advocated views associated with the late Empire. This ideological disjoint often resulted in deadlock within the Senate."}, {"tag": "p", "text": "Finally, after being criticized for New Republic involvement in the Koornacht Cluster, Almania (during which the Senate Hall was destroyed), and the Corellian system, and because of discord within the Senate, especially between the traditional and pro-Imperial senators, Chief of State Leia Organa Solo took an indefinite leave of absence, upon which the Calibop senator Ponc Gavrisom was chosen as the caretaker Chief of State."}, {"tag": "h3", "text": "Peace with the Empire"}, {"tag": "p", "text": "Despite the growing mistrust between certain elements within the New Republic, it remained united in its efforts to defeat the Empire. A campaign launched by Imperial Supreme Commander Gilad Pellaeon ended in disaster as New Republic forces under Ackbar defeated Pellaeon and reduced the Imperial Remnant to a mere eight sectors in the Outer Rim."}, {"tag": "p", "text": "Ponc Gavrisom's ascension to the office of Chief of State, the construction of a new Senate Grand Convocation Chamber, and a new round of major government restructuring marked the beginning of a new period for the New Republic. The power of government was shifted more to the local, planetary, system, sectoral, and regional levels to avoid the centralization of power that marked the Palpatine era. The New Republic Senate's role was thus reduced to little more than providing for the common defense and mediating inter-system disputes. While any legislation passed by it was still binding, the new limit of one bill per delegation per year prevented gridlock, since any proposed legislation would have to pass the scrutiny of both the committee in which it was introduced as well as the full Senate."}, {"tag": "p", "text": "Another development made during the restructuring was the creation of the New Republic Observers, an organization that functioned much like the Jedi Order during much of the Republic. The job of the Observers was to move about the New Republic and to report to the Senate what they saw or heard, especially with regard to improper government activities that local authorities preferred to keep out of sight."}, {"tag": "p", "text": "The major event of this period was the Caamas Document Crisis, which threatened to begin a civil war between pro-Bothan and anti-Bothan factions of the New Republic. The crisis, which began with the uncovering of the Caamas Document at Wayland, ended with the signing of a final peace treaty between the New Republic and the Imperial Remnant, finally ending the twenty-one year Galactic Civil War."}, {"tag": "h3", "text": "Changing of the guard"}, {"tag": "p", "text": "The end of the Galactic Civil War saw many worlds finally choosing an allegiance, with many joining the New Republic. Leia Organa Solo returned to the Senate shortly after the signing of the Bastion Accords at the urging of her friends. The New Republic and the Jedi would also defeat the neo-Imperial Second Imperium, the anti-Human Diversity Alliance and an attempt by the Black Sun crime syndicate to dominate the galaxy. In 23 ABY, Leia permanently resigned."}, {"tag": "p", "text": "In the subsequent election, Borsk Fey'lya was elected Chief of State with a three-fifths majority. Many other long-term members of the Senate resigned as well as military leaders like Ackbar and Hiram Drayson. Unfortunately, these senators, beings of high principle and former rebel leaders, were replaced by senators of lesser principle, and the infighting of the Old Republic was seen again."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "In the subsequent invasion by the Yuuzhan Vong, the Senate was paralyzed by incompetence and cowardice. The administration of Chief of State Fey'lya failed to take the invasion seriously until too late. The invaders made quick progress, conquering huge portions of the galaxy in their trek towards Coruscant. Distrust of the New Jedi Order further complicated things, while the New Republic Defense Force found itself constantly falling back towards the Core, wrecking morale. The Battle of Coruscant sounded the death knell of the New Republic, as members of the Senate hijacked elements of the Defense Fleet to escort themselves out of the system. Fey'lya sacrificed himself in the battle."}, {"tag": "h3", "text": "Rebirth into the Galactic Alliance"}, {"tag": "p", "text": "In 28 ABY, the Senate reconvened on Mon Calamari, and, after a long campaign, elected Cal Omas as Chief of State. That would be the final election of the New Republic. Following the decisive Battle of Ebaq, Omas reorganized the remnants of the New Republic into the Galactic Federation of Free Alliances. With a new constitution, increased checks and balances, and a new federal structure, the Galactic Alliance strove to correct many of the flaws of the previous government. Furthermore, it committed itself to working closely with the Jedi Order to ending the war. In 29 ABY, the Galactic Alliance and the Jedi Order defeated the Yuuzhan Vong during the Battle of Yuuzhan'tar and one year later, had officially taken authority of the galaxy and thus officially reforming the New Republic. The Galactic Alliance would rule the galaxy for the next century, before being absorbed by the reborn Galactic Empire following the Sith-Imperial War."}, {"tag": "h2", "text": "Government and politics"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Membership in the New Republic"}, {"tag": "p", "text": "The New Republic was a voluntary confederation organized on democratic principles under the New Republic Common Charter and in accord with the ideals and purposes embodied in the Declaration of a New Republic. Primary (voting) membership was available to any independent sovereign political entity representing one or more unified planetary populations, or to other recognized and definable territories, such as the surviving Alderaanians. Membership followed an application process (during which the candidate member reviewed the Charter and other governing statutes and agreed to abide by them) and an assessment process (during which the candidate member's annual support contribution was determined)."}, {"tag": "p", "text": "Affiliate (non-voting) membership was available to subordinate political units (for example, the individual members of a league of worlds) and to duly recognized representatives of sentient species not constituting a political unit."}, {"tag": "p", "text": "Observer (non-voting) membership was available to nonmember allies of the New Republic."}, {"tag": "p", "text": "The Declaration of a New Republic set forth the principles to which the New Republic was dedicated; the common Charter was the actual mechanism by which planets became members, and specified both the rights and duties of members, and the various institutions of government and their powers. The common Charter was a creation of the transitional Provisional Council."}, {"tag": "p", "text": "Worlds applying to join the New Republic submitted Articles of Membership, while worlds wishing to leave the New Republic did by submitting Articles of Withdrawal."}, {"tag": "h3", "text": "Legislative branch"}, {"tag": "p", "text": "The government of the New Republic was organized around a unicameral legislative body called the New Republic Senate, replacing the New Republic Provisional Council. Primary members were represented in the Senate by a senator. Each senator had a single vote, regardless of the population represented. Affiliate members were represented on Coruscant by a legate, who could speak in general sessions of the Senate, but could not vote on official Senate business (to avoid dual representation) or serve in the Senate's various working bodies."}, {"tag": "p", "text": "As a body with a large and potentially unlimited membership, the Senate-in-whole was an almost impossibly unwieldy structure for getting work done. Consequently, most of the real governance was performed by the Senate's councils, committees, and commissions. The daily business of the Senate proper was primarily speech-making and public debate. When the Senate met as a committee of the whole, it was sometimes referred to as the New Republic Assembly."}, {"tag": "p", "text": "Councils were appointed bodies with autonomous decision-making and appropriation authority over some segment of government operations outside the Senate proper (for example, the Defense Council, which oversaw the Navy). The most populous and powerful members of the New Republic were disproportionately represented on the Senate's councils."}, {"tag": "p", "text": "Committees were elected bodies with the authority to administer various aspects of Senate operations, including the general budget. They were semi-autonomous; in the event of a unanimous committee vote, the approval of the Senate-in-whole was not required (however, the Senate-in-whole could override a less-than-unanimous committee decision with a three-to-five majority)."}, {"tag": "p", "text": "Commissions were voluntary bodies with an advisory capacity only. They prepared reports on issues of concern for presentation to the President of the Senate, to the Minister of State, to the Supreme Commander, or to the general membership; scheduled and conducted hearings; and contracted for independent research."}, {"tag": "p", "text": "In 17 ABY, the New Republic lifted a ban on former Imperial officials holding elective office."}, {"tag": "h3", "text": "Executive branch"}, {"tag": "p", "text": "The New Republic was headed by the Chief of State. The Chief of State was elected by fifty percent and one vote majority of the Senators. The Chief of State was also the President of the Senate and Commander-in-Chief of the Fleet, although that title was sometimes used to refer to the highest-ranking member of the military."}, {"tag": "p", "text": "Tradition varied on the proper form of address for the President. Mon Mothma preferred \"Chief of State,\" but the address varied under Leia Organa Solo depending on context. In general, Senators, the Senate bureaucracy, and the Coruscanti media referred to the President, while the General Ministry, member worlds, and the population of the New Republic often referred to the Chief of State, depending on local languages and history."}, {"tag": "p", "text": "Part of the problem and confusion arose from the lingering association of the term President with the last holder of that office before the Empire—Palpatine. Most of the subsequent Presidents of the Imperial Senate were lapdogs of the Emperor. The term retained a certain stain; this contributed to Organa Solo's difficulties during crisis situations. The concerted effort by certain public relations aides to bring the term \"President\" into common use invoked old fears of Presidential tyranny."}, {"tag": "p", "text": "The President could be recalled by a majority vote of the Senate on presentation of a petition of no-confidence by a majority of the Ruling, or Inner, Council, or by a quarter of the primary members of the Senate. The election of a President could be blocked by the Ruling Council on a unanimous vote. In practice, the power of the Ruling Council to void an election and initiate the recall of a sitting president meant that any candidate proposed by or approved by the Ruling Council was likely to be elected by the Senate. The Ruling Council consisted of the chairmen of the Senate councils and the President of the Senate. The President could select any member of the Ruling Council to conduct the business of the Senate in her absence from that body."}, {"tag": "p", "text": "If the president became incapacitated, incommunicado, or died, the chairman of the Ministry Council selected an acting Chief of State from among the following: any former president, the current Minister of State, any former Minister of State."}, {"tag": "p", "text": "The day-to-day running of government was done by the General Ministry, the bureaucracy of the New Republic, led by a First Administrator. It was organized into several large permanent Ministries, smaller task-oriented service Agencies, and several semi-independent Institutes. The various Senate councils had oversight and financing authority over the corresponding Ministries."}, {"tag": "p", "text": "The Cabinet consisted of the heads of the various ministries and was headed by the Minister of State. This body was the link between the Chief of State and the Ministries."}, {"tag": "h3", "text": "Judicial branch"}, {"tag": "p", "text": "The Court of Justice was the judicial branch of the New Republic. The members of the Court of Justice were selected by the Senate Justice Council from a list of nominees presented by the President of the Senate. The First Justice was elected by the other members of the Court from among their number. Nominally independent, the power of the Court of Justice was limited by its narrowly defined jurisdiction: to review charges of violations of the Charter by members or by the other branches of the New Republic's government. The Court of Justice did not serve as the court of last appeal for ordinary civil and criminal cases; those were settled by local judicial authorities on member worlds."}, {"tag": "h2", "text": "Economy"}, {"tag": "p", "text": "The New Republic had a very complex and diverse economy like the Old Republic. It is possible that increases in state control and centralization of economic procedures during the Imperial Period were partially reversed under the New Republic."}, {"tag": "p", "text": "After the fracturing of the Empire at the Battle of Endor, many different currencies came into existence. Though the New Republic had reclaimed the credit, it was by no means the most accepted monetary unit in the galaxy. During this time exchange rates fluctuated wildly, and indeed it was hard at times to find anyone that would exchange one for another. The establishment of the New Republic presumably stabilized the galactic economy.[source?]"}, {"tag": "p", "text": "At that time, the credit was backed by the immense wealth of the planet Muunilinst. During the early years of the New Republic, Nova crystals mined on Krann were the base for much of the galactic government's hard currency until the mine ran dry."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The New Republic had a very diverse culture like the Old Republic. Restrictions placed on arts and culture during the Imperial era were removed by the New Republic and returned to the opulence and ornamentation of the Old Republic."}, {"tag": "p", "text": "The Humanocentrism policies of the Empire were ended under the New Republic. But, the views of Human High Culture would be kept alive in the New Republic for years after the Empire's defeat by fringe groups such as the Human League."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The Combined Defense Forces of the New Republic was the military arm of the New Republic. At its peak, it operated five full fleets, each consisting of hundreds of warships, transports, and support vessels, divided into battle groups and task forces, in addition to ground troop divisions and starfighter wings. The fleets were known collectively as the New Republic Defense Fleet, although many referred to it as the New Republic Navy."}, {"tag": "p", "text": "After the reorganization of the military into a single unified command, the former Minister of Defense was called the Supreme Commander, and the posts of Minister of the Army and Minister of the Navy were abolished."}, {"tag": "p", "text": "The Supreme Commander, appointed by the Defense Council with the approval of the President of the Senate, led the Defense Force. He reported to the Chief of State."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The New Republic's territory varied in size a great deal during the course of its history. By 6.5 ABY, 30% of the galaxy (some 300,000 worlds) fully supported the New Republic, with an additional 20% (200,000 worlds) supporting nominally and partially. In 8 ABY over 600,000 worlds were members, and by 9 ABY almost three-quarters of the Known Galaxy (at least 700,000 worlds), including all of the Core Worlds except the Corellian sector and a few Coruscant sector planets were New Republic members. Yet, subsequent wars against Thrawn and the reborn Emperor reduced the size of the Republic drastically. By 15 ABY, the New Republic only consisted of 11,000 planets and 4,000 sentient species scattered throughout the galaxy, with almost 600,000 worlds claimed by the Empire and a further 100,000 New Republic worlds proclaiming neutrality. After Palpatine's final death, it rose to at least 100,000 directly controlled worlds. In 16 ABY, worlds were applying for membership at a rate of ten per day. By 19 ABY, half of the galaxy (some 500,000 worlds) had once again become members of the New Republic, in light of the fact that the war against the Imperial Remnant was approaching the end; however, representation in the Senate was limited to between 50,000 and 200,000 worlds. When the Yuuzhan Vong came, the number dropped to under 80,000 worlds, with the Vong claiming almost 800,000 worlds."}, {"tag": "p", "text": "The Borderland Regions separated the territories of the New Republic and the Imperial Remnant during the latter part of the Galactic Civil War. Presumably, this was continued even after the Galactic Civil War."}, {"tag": "p", "text": "Coruscant was the capital world of the New Republic, as it was for the Galactic Empire and the Galactic Republic before it. Its membership included worlds from all regions of the galaxy, stretching mainly from the borders of the Core Worlds to the Outer Rim Territories."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Republic first appeared in Timothy Zahn's 1991 novel Heir to the Empire, the first installment of The Thrawn Trilogy. However, the idea of rebuilding the Galactic Republic mentioned as part of the backstory of the Star Wars original trilogy traces back from George Lucas' early comments about a potential sequel trilogy in 1980, after the release of Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}