{"url": "New_Republic_Army", "categories": ["Category:Legends articles", "Category:New Republic stubs", "Category:New Republic military units"], "nodes": [{"tag": "h1", "text": "New Republic Army"}, {"tag": "p", "text": "The New Republic Army was a segment of the New Republic Defense Force that served as the ground military of the New Republic. It was formed from the ground forces of the Alliance to Restore the Republic after the New Republic was established."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Formed from the Alliance Army, the Rebel SpecForces were re-purposed as commandos to seize bridgeheads during planetary assaults, while the bulk of the Army was to be used for occupation and peacekeeping duties."}, {"tag": "p", "text": "In 5 ABY, the Army won a protracted three-month battle on Milagro against the Imperial Army. In 6 ABY the army liberated Coruscant under the command of Han Solo, Luke Skywalker, General Rand Talor, and General Brenn Tantor."}, {"tag": "p", "text": "The New Republic Army suffered heavy losses fighting against the Dark Empire in Operation Shadow Hand. Following the post-12 ABY reorganization of the New Republic Defense Force, the Army was abolished and its defense responsibilities transferred to the Planetary Security Forces, while the New Republic Marines took over the planetary assault role under the command of the naval battle groups as part of a fully-integrated Defense Force."}, {"tag": "p", "text": "After the formation of the Galactic Alliance in 28 ABY, the Army was reformed as the Galactic Alliance Army."}, {"tag": "h2", "text": "Vehicles"}, {"tag": "p", "text": "Comprising of combat speeders, attack tanks, T1-B hovertanks, T3-B heavy attack tanks, Hover Transport TC9s, Mobile Proton Torpedo Launchers, Tracked Mobile Bases, Scanner Jammers, and T-47 airspeeders."}, {"tag": "h2", "text": "Troop variants"}, {"tag": "p", "text": "The common infantry was the New Republic trooper. Other variants included Missile Troopers, which specialized in missile launchers and demolition expertise. Scout Soldiers, used for protecting worlds and quelling riots. Sea Commandos, elite commandos trained in aquatic warfare. Mortar Troopers, specializing in providing cover fire, acting as support units."}, {"tag": "p", "text": "New Republic Marines, specializing in massive, planetary assaults. Used exclusively by New Republic Defense Fleet."}, {"tag": "p", "text": "New Republic Honor Guards, tasked with the protection of the Chief of State. Palace Guards, are to ensure security within the Imperial Palace."}, {"tag": "p", "text": "Mandalorian Protectors, ally forces often helping the New Republic. Assisted in the Battle of Mindor."}, {"tag": "h2", "text": "Weaponry"}, {"tag": "p", "text": "A280 blaster rifles, DH-17 blaster rifles, DH-17 blaster pistols, DL-44 heavy blaster pistols, AKraB vibrodaggers, mortars, missile launchers, blast cannons. Explosives included thermal detonators, 7-PrG proton grenades, C-16 fragmentation grenades."}, {"tag": "h2", "text": "Units"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}