{"url": "New_Republic_Defense_Force", "categories": ["Category:Canon articles", "Category:New Republic stubs", "Category:New Republic military units"], "nodes": [{"tag": "h1", "text": "New Republic Defense Force"}, {"tag": "p", "text": "The New Republic Defense Force, also  known as the New Republic military, was the peacekeeping organization responsible for protecting the New Republic, the galactic government formed by the Alliance to Restore the Republic following their victory against the Galactic Empire at the Battle of Endor. However, following the Galactic Civil War, training and funding was allocated primarily to the local planetary defense forces, and the New Republic Defense Force was kept reduced via the Military Disarmament Act."}, {"tag": "p", "text": "It was composed of the land-based New Republic army, the naval New Republic Defense Fleet, and the special operations New Republic Special Forces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The New Republic Defense Force saw substantial action against the remnants of the Galactic Empire during the last stages of the Galactic Civil War. New Republic military forces took part in the rebellion on Akiva, the liberation of Kashyyyk, and the Battle of Jakku. Despite the Imperial defeat on Jakku, elements of the military particularly the Starfleet were ordered to remain on high alert for Imperial activity."}, {"tag": "p", "text": "Chancellor Mon Mothma believed the government needed to demilitarize and make their military a peacekeeping force. The New Republic military was reduced by the Military Disarmament Act. While the military had sufficient resources to defend the galaxy about six years before the destruction of the Hosnian system, some Centrists like Senator Erudo Ro-Kiintor of Hevurion lobbied for the government to divert more funding into individual planetary defenses. In reality, this was a pretext for channeling government funding into Centrist worlds."}, {"tag": "p", "text": "The military of the Republic fell under the command of the New Republic Command, a body of individuals that led the Republic's armed forces. During the early conflict between the First Order and the Resistance, the military forces of the Republic were ordered to not fire on the First Order due to the Galactic Senate desperately wanting to avoid another galactic war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}