{"url": "New_Republic_Defense_Fleet", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:New Republic fleets"], "nodes": [{"tag": "h1", "text": "New Republic Defense Fleet"}, {"tag": "p", "text": "The New Republic Defense Fleet, also known as the New Republic Navy, New Republic Starfleet, or the New Republic fleet, was the naval branch of the New Republic's military forces formed from the Rebel Alliance Fleet in the aftermath of the Battle of Endor."}, {"tag": "p", "text": "It was first led by Fleet Admiral Gial Ackbar. Following the Battle of Endor, the Fleet augmented its size by capturing Imperial vessels, but it was reduced with the Military Disarmament Act after the signing of the Galactic Concordance."}, {"tag": "p", "text": "Thirty years after the Battle of Endor, it was still the largest military force in the galaxy, but nevertheless was a fraction of the size of the Republic Navy during the Clone Wars. A substantial portion of the Starfleet was stationed in the Hosnian system when the system was targeted and destroyed by the First Order's Starkiller Base superweapon. Hundreds of ships were destroyed during the attack."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The New Republic Starfleet was formed from the Rebel Alliance Fleet after the Rebel Alliance became the New Republic in the aftermath of the Battle of Endor. Its chief commanding officer was Fleet Admiral Gial Ackbar, a respected Mon Calamari who had commanded the rebel fleet at Endor. Starfleet pilot Wedge Antilles took part in an undercover mission above Akiva but was captured by Admiral Rae Sloane. The Starfleet later fought against the Galactic Empire's military during the Galactic Civil War and saw action in several battles including the Rebellion on Akiva and the Battle of Jakku. Throughout that conflict, the Fleet augmented its size by capturing Imperial vessels."}, {"tag": "p", "text": "In the months following the Battle of Endor, Admiral Ackbar received intelligence on Imperial fleet movements from an Imperial officer known as the Operator. This figure turned out to be Fleet Admiral Gallius Rax, one of the late Darth Sidious' proteges, who was seeking to eliminate his rivals in the Imperial military. The New Republic Starfleet also won several victories against the Empire on Arkanis and Kuat. In addition, the Starfleet destroyed five Super Star Destroyers and captured three others. These victories consolidated the New Republic's power and strength."}, {"tag": "p", "text": "Since the New Republic Navy was thinly spread across the galaxy, the New Republic was unable to commit any military forces to search for Han Solo, who had embarked on a campaign to liberate the Wookiee homeworld of Kashyyyk. In response, lieutenant Norra Wexley resigned her commissioned in the New Republic Starfleet after Admiral Ackbar ordered her and her team to resume the hunt for Imperial fugitives. After Han and Chewbacca's team succeeded in disabling the inhibitor chips controlling the Wookiees, Wedge's Phantom Squadron and Admiral Ackbar's Home One defeated the Imperial Star Destroyers orbiting Kashyyyk."}, {"tag": "p", "text": "After two voting rounds, the Galactic Senate dispatched the New Republic Fleet under Admiral Ackbar and Commodore Kyrsta Agate to assault the Imperial remnants that had retreated to the planet Jakku under the leadership of Gallius Rax, who had proclaimed himself Counselor to the Empire. Despite superior numbers, the New Republic fleet was unable to break through the Imperial fleet formation, which had formed a protective wall around the Super Star Destroyer Ravager. Commodore Agate managed to use her Starhawk-class battleship Concord's powerful tractor beam projector to drag the Ravager down to Jakku's surface. This turned the tide of both the space and ground battle in favor of the New Republic."}, {"tag": "p", "text": "Following the Battle of Jakku, the New Republic and the defeated Galactic Empire concluded hostilities by signing the Galactic Concordance, which imposed harsh reparations on the remnants of the Empire and limited their ability to wage war. Although surviving Imperial forces retreated behind treaty-drawn boundaries in the Core Worlds and Inner Rim, the New Republic Defense Force was ordered to maintain its combat readiness until at least a month after the surrender. Following a protracted \"Cold War,\" the \"Old Empire\" eventually withered away and the remaining Imperial hardliners eventually retreated to the Unknown Regions where they formed the First Order."}, {"tag": "h3", "text": "Peacetime"}, {"tag": "p", "text": "Believing that the remnants of the Empire no longer posed a threat, the Republic turned its attention to reshaping galactic politics. In the aftermath of the Galactic Concordance, the Galactic Senate under the leadership of Chancellor Mon Mothma formally adopted the Military Disarmament Act which reduced the Republic Starfleet to a large but limited military force. While the Republic Defense Fleet still remained the largest fleet in the galaxy at the onset of the cold war, it was a fraction of the Old Republic's Navy during the Clone Wars. Since the Disarmament Act limited the production of capital ships, the Republic Starfleet was forced to rely on Rebellion-era vessels like the MC80A Home One Type Heavy Star Cruiser Home One for a while. While the arms manufacturer Incom-FreiTek Corporation continued to develop new X-wing starfighter models like the T-85 X-wing for the New Republic Starfleet, military contracts were limited due to the disarmament policy and the growing corruption in the Galactic Senate."}, {"tag": "p", "text": "About two years after the Battle of Jakku, several former New Republic freighters fell into the hands of pirate elements including Captain Viz Moshara; who acquired the Mon Cal freighter Radium Destrobar. During the Magernon's Amnesty, New Republic fleet forces commanded by Captain Krull blockaded Substation Grimdock to prevent pirate ships from escaping with former Imperial \"terrorists\" and \"death squads.\" The blockade was complicated by Solo and Lando Calrissian's mission to locate the Phylanx Redux Transmitter. Krull briefly detained Solo and Lando's team but released them after Organa convinced him they were on a secret mission sanctioned by the Galactic Senate. As compensation, Krull provided them with the shuttle Chevalier."}, {"tag": "p", "text": "Nearly three decades later, New Republic starfighter pilots like Joph Seastriker and Greer Sonnel were relegated to escorting Senators like Leia Organa and Ransolm Casterfo on official missions and trips throughout the galaxy. Competitions like the Five Sabers were also popular viewing among many Republic starfighter pilots like Joph, Greer, and Temmin Wexley. By law, New Republic senators were forbidden from using Republic pilots and starships to undertake illegal work like smuggling and using false identities. While the New Republic maintained an adequate military and starfleet, some Centrist senators like Erudo Ro-Kiintor lobbied for more government funding to be diverted to shoring up the defenses of individual worlds. In reality, this facilitated the funneling of substantial government funding to Centrist worlds, a faction in the New Republic's Galactic Senate. Several New Republic military personnel including Wexley, Seastriker, Greer, and Caluan Ematt later joined the Resistance, a paramilitary organization founded by Leia to tackle threats to the Republic."}, {"tag": "h3", "text": "Cold war"}, {"tag": "p", "text": "Emboldened by the perceived weakness and \"decadence\" of the New Republic, the First Order began crossing the Borderland and made several incursions into Republic space, including the Suraz engagement. Despite the First Order's frequent violations of the Galactic Concordance by embarking on a rearmament program and violating Republic sovereignty, New Republic Command refused to allow the Fleet to take action against the First Order and limited starfighter units like Rapier Squadron to sector patrol work. In spite of evidence to the contrary, some Republic officers like Major Lonno Deso dismissed the First Order as a small but troublesome Imperial remnant that used propaganda and fear to exaggerate its strength and importance. Some Republic senators like Erudo Ro-Kiintor even secretly colluded with the First Order by derailing or blocking motions increasing funding for the Republic Navy."}, {"tag": "p", "text": "Frustrated by the Senate and Starfleet's unwillingness to take action against the First Order, General Organa and other like-minded supporters like Admiral Ackbar formed the Resistance, a splinter group from the Republic's military that was independent of the Republic chain of command. While the Republic tolerated the Resistance's activities, it was wary of risking war with the First Order. The Resistance was joined by Republic Navy personnel such as the starfighter pilot Poe Dameron and his colleagues from Rapier Squadron, who shared General Leia's sentiments about the First Order. However, other Republic officers like Major Deso regarded the Resistance as an irritant for exaggerating the threat posed by the First Order."}, {"tag": "p", "text": "When the First Order launched a preemptive strike against the Hosnian system in an effort to destroy the New Republic, a substantial portion of the Republic Starfleet was destroyed when Starkiller Base unleashed several blasts of phantom energy and destroyed Hosnian Prime and the other astronomical bodies in the system. The attack also destroyed the Galactic Senate and killed numerous people including Chancellor Lanever Villecham and Korr Sella, an envoy from the Resistance sent by General Leia to plead for the Republic to take action against the First Order."}, {"tag": "h3", "text": "Open war"}, {"tag": "p", "text": "Following the destruction of the Hosnian system, the surviving senators decided to dissolve the remaining New Republic task forces to protect their own homeworlds."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The New Republic Defense Fleet was headed by a Fleet Admiral and answered directly to New Republic Command. While one fleet of the Starfleet remained with the Galactic Senate which moved to different member worlds on a rotational basis, the majority of Starfleet was scattered across several bases throughout New Republic space including one on Mirrin Prime. Some known starfighter squadrons included Corona Squadron, Gold Squadron, and Rapier Squadron. In addition to the Starfleet, the New Republic's member worlds also had local defense forces, whose operations were guided by individual Republic senators."}, {"tag": "p", "text": "By 7 ABY, the Defense Fleet had a cyber-warfare department based at its headquarters in Chandrila. The Chief of the cyber-warfare department was slicer Conder Kyl, a veteran of the Galactic Civil War. Another known employee of the Defense Fleet's cyber-warfare department was the Ewok slicer Peekpa. In addition, the Fleet also utilized several KX-series security droids."}, {"tag": "h2", "text": "Starships of the New Republic Defense Fleet"}, {"tag": "p", "text": "The New Republic Defense Fleet contained numerous vessels within its inventory while the navy was active. These vessels ranged from capital ships to sub-capital ships."}, {"tag": "h3", "text": "Capital ships"}, {"tag": "p", "text": "The New Republic Defense Fleet utilized various types and models of capital ships while in active service. The New Republic came to possess at least three Super Star Destroyers. One of the first capital ships directly commissioned by the New Republic for manufacture was the Starhawk-class battleship, which included the Starhawk prototype, the Starhawk-class Battleship Mark I, and the Starhawk-class Battleship Mark II. As battleships, the Starhawks of the New Republic were more heavily armed and armored than Imperial Star Destroyers. Even though, they stole the Imperial II-class Star Destroyers the captured Imperial spacecraft to the Nadiri Dockyards for the Project Starhawk. By the Battle of Jakku, numerous Star Destroyers served within the New Republic Defense Fleet, and were slightly retrofitted."}, {"tag": "p", "text": "In addition to battleships, the New Republic Defense Fleet utilized a range of heavy cruisers, which included both of the MC80 Star Cruiser line's MC80A Home One Type Heavy Star Cruiser and the MC80 Liberty Type Heavy Star Cruiser. Another Mon Calamari heavy cruiser was the MC85 Star Cruiser, which saw use throughout Republic history. Other Mon Calamari Star Cruisers of the cruiser-class included the MC75 Star Cruiser, the MC95E Star Cruiser, and the New Republic Cruiser line. Additional cruisers in the New Republic's arsenal included vessels such as the Immobilizer 418 cruiser, and the Acclamator-class assault ship."}, {"tag": "h3", "text": "Sub-capital ships"}, {"tag": "p", "text": "The New Republic Defense Fleet used a variety of sub-capital ships, including carriers. Frigates such as the Alderaanian escort frigate, the assault frigate, the EF76 Nebulon-B escort frigate, and the Nebulon-C escort frigate were used. Additionally, light cruisers such as the Carrack-class light cruiser served within the Republic navy. Corvettes such as the CR90 corvette were widely used, and the New Republic also possessed a modified Raider II-class corvette."}, {"tag": "h3", "text": "Light craft"}, {"tag": "p", "text": "The New Republic used smaller light craft, including the MG-100 StarFortress SF-17 bomber. Transports such as the GR-75 medium transport were deployed, as well as freighters such as the YT-1300 light freighter and gunships such as the UT-60D U-wing starfighter/support craft. During the Galactic Civil War, the New Republic used Lambda-class T-4a shuttles, and two years after the Battle of Jakku, the Defense Fleet used shuttles manufactured by Trivault Corp."}, {"tag": "h3", "text": "Starfighters"}, {"tag": "p", "text": "As part of the New Republic Starfighter Corps, the New Republic Defense Fleet deployed a variety of starfighters. Such starfighters included interceptors such as the RZ-1 and RZ-2 A-wing starfighters starfighter-bombers such as the BTL-A4 Y-wing assault starfighter/bomber and BTA-NR2 Y-wing starfighter, and other starfighters such as the HH-87 Starhopper, the A/SF-01 B-wing starfighter, the Tri-Wing S-91x Pegasus Starfighter, as well as the T-65B, T-65C-A2, T-70 and T-85 variants of the X-wing starfighter."}, {"tag": "h3", "text": "Space stations"}, {"tag": "p", "text": "The New Republic Defense Fleet utilized Harrikos-Fifteen Research Station, Parozha VII, an Imperial dockyard Fondor Shipyards, Ankot Station, the Brooksdion, and the Nadiri Dockyards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Republic Defense Fleet first appeared in the canon novels Aftermath and Lost Stars by Chuck Wendig and Claudia Gray. The New Republic Defense Fleet originated in Star Wars Legends in the 1991 Star Wars Legends novel Heir to the Empire by Timothy Zahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}