{"url": "New_Republic_General_Ministry", "categories": ["Category:Legends articles", "Category:New Republic organizations"], "nodes": [{"tag": "h1", "text": "New Republic General Ministry"}, {"tag": "p", "text": "The General Ministry was the umbrella organization of the New Republic that included all ministries, agencies, institutes and services of the government that were not under the New Republic Defense Force and were not a council, committee, or commission of the New Republic Senate."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The New Republic General Ministry was led by the First Administrator who answered to the Chief of State and would be appointed by the Ministry Council with the approval of the Chief of State. The General Ministry Cabinet, led by the First Administrator, was formed by the heads of each of the various ministries. The Cabinet would report to the Chief of State and carry out their instructions."}, {"tag": "p", "text": "Serving as the umbrella bureaucratic organization of the New Republic, the General Ministry had under it all parts of the government that were not under the New Republic Defense Force or a council, committee, or commission of the New Republic Senate. After the Black Fleet Crisis these ministries included the Ministry of State, the Ministry of Finance, the Ministry of Commerce, the Ministry of Security, and the Ministry of Science."}, {"tag": "p", "text": "Separate from the various ministries were several agencies that supervised government concerns on navigation, communications, port operations, records, facilities, and transportation. In addition to this, the New Republic Intelligence Service was placed under the General Ministry. However, the Director of New Republic Intelligence answered directly to the Chief of State, not the First Administrator."}, {"tag": "p", "text": "The General Ministry, like its Old Republic predecessor, also managed the General Ministry Institutes. This served as an umbrella organization that managed the funding of several centers of learning and research by the New Republic government."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nanaod Engh was the First Administrator during the Black Fleet Crisis. A close ally of Chief of State Leia Organa Solo, she affectionately called him \"Nanny\", Engh tried to convince Chief Organa Solo to \"buff\" up her public image. She reluctantly agreed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}