{"url": "New_Republic_Intelligence_Service", "categories": ["Category:Legends articles", "Category:New Republic intelligence organizations"], "nodes": [{"tag": "h1", "text": "New Republic Intelligence Service"}, {"tag": "p", "text": "The New Republic Intelligence Service, or simply New Republic Intelligence (NRI) was the primary New Republic intelligence gathering agency, responsible for obtaining and analyzing information about foreign governments, corporations, organizations and individuals, and reporting such information to the various branches of the New Republic government."}, {"tag": "h2", "text": "Organization and role"}, {"tag": "p", "text": "The duty of the New Republic Intelligence Service was the detection, investigation and analysis of any potential threats to the security of the New Republic. As part of its duty, NRI was responsible for the assembling of data on a wide range of figures as well as knowledge of any particular skills or technology that were active at the time. Thus, they often collected holovids, sensor scans, personal histories, corporate records as well as any other information they could gather from captured databases. From this information, they determined the level of threat that was posed to the New Republic. In addition to this information gathering approach, the Intelligence Service also made use of reports from underground agents, researchers, documented events and service personnel to bolster its knowledge of the target. However, the reliability of the information was not always a certainty due to certain sources being incapable of being fully verified such as those from smugglers, mercenaries and independent traders."}, {"tag": "p", "text": "New Republic Intelligence Service was also fond of using false intelligence at times in order to feed misinformation to enemy spies as a form of counterintelligence against their operations. Furthermore, they made active use of starships to gather further data and relied in intelligence units such as Wraith Squadron. They also possessed a fleet of speedy as well as stealth based ships with operatives making use of Incom T-65BR X-wing reconnaissance starfighter as well as Republic Engineering Corporation's own Ferret-class reconnaissance vessel and Prowler-class reconnaissance vessel."}, {"tag": "p", "text": "Information that was gathered by Intelligence was later reported to a number of divisions within the New Republic. Due to the fact that it was part of the military, agents of NRI wore dark green uniforms when not in the field and had standard military ranks. It ran parallel with Fleet Intelligence with its members wearing the uniform of the New Republic Defense Force. NRI appeared to have been a military or paramilitary organization, providing its officers with military ranks and operating units such as Black Force Squadron. It also reported to the Council on Security and Intelligence."}, {"tag": "p", "text": "The head of the organization held the title of Director with another ranking position being that of Deputy Director of Operations for New Republic Intelligence. Further makeup of Intelligence ranged doctors, soldiers, field operatives, scientists, tacticians, theoreticians and even a small number of Noghri though the duties of this latter group were not entirely known. NRI Officers were largely recruited from the New Republic Defense Force and consisted of soldiers with desirable skills and were given thorough training in order to develop espionage skills after which they were placed into action. Only the more experienced operatives were given deep cover assignments with the best being gone for long periods of time. As such the majority of these officers simply gathered information and transmitted it to headquarters where it was later analyzed by experts. In addition, the agency maintained a network of safehouses that operated on as many as two hundred worlds. The distribution of the safehouses meant that some were located within the Core and others within the Rim. This allowed NRI to dispatch agents to any site and on any mission within a thirty six hour time frame."}, {"tag": "p", "text": "Jokes about Bothans and gornts were popular at NRI; Iella Wessiri estimated that she'd heard a thousand jokes on that variation after serving there for a few years."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was the successor to Alliance Intelligence and the Senate Planetary Intelligence Network. The agency was under the authority of the General Ministry. The headquarters for the intelligence service was based on Coruscant, in the area known as The Abyss. Intelligence Operations Command was possibly its head, and the Ongoing Investigation Division was a branch of it. Following the Battle of Endor and the establishment of the New Republic, the new government established its own intelligence division which was New Republic Intelligence. This newly created military division was at first headed by General Airen Cracken who was a former resistance fighter in the Rebel Alliance and had previously served as a general in that period. He was appointed as Supreme Commander for Intelligence once the organization was formed. New Republic Intelligence was one of the two major intelligence services of the New Republic, alongside the distinct but related New Republic Fleet Intelligence."}, {"tag": "p", "text": "Shortly after the formation of the New Republic, many worlds found themselves being raided by the raiders of the mysterious Imperial warlord known as Lord Shadowspawn. In order to help curb this threat, New Republic Intelligence leaked information about a passenger ship known as the Corellian Queen which attracted agents of Lord Shadowspawn. As the enemy TIE Defenders approached, the trap was sprung and the enemy fighters were decimated. However, some of the enemy ships were allowed to escape after a transponder was secretly attached to them during the battle. By fleeing back to the planet Mindor which allowed the Rapid Response Task Force to follow them back to their base and led to the Battle of Mindor. During Grand Admiral Thrawn's campaign against the New Republic, the intelligence division were unable to learn anything of his origins even after five years after the Battle of Endor. Furthermore, NRI was incapable of uncovering the identities of the ship Captain's in the Chiss's fleet."}, {"tag": "p", "text": "At some point after its creation, NRI's Ongoing Investigation Division was involved with studying the history as well as threat posed by the planet Carida. Following the actions of Kyle Katarn and the threat posed by Jerec, Luke Skywalker came to see the dangers of the ancient Sith Empire world of Dromund Kaas. In order to protect his fledgling New Jedi Order, Skywalker alongside New Republic Intelligence ensured that all known of that ancient Sith world disappeared and that it returned to its former status of being simply a myth which it had done across the millennia."}, {"tag": "p", "text": "NRI acted as a clearinghouse for intelligence reports from across the galaxy. Its threat analysis prompted and informed innumerable military operations. While the Defense Force maintained its own military intelligence unit in the form of Fleet Intelligence, NRI interacted on a regular basis with military units. In certain instances, NRI officers were placed in command of Defense Fleet task forces, as with the Teljkon Vagabond task force. However, NRI personnel were clad in a dark green uniform unlike the dress of personnel of the Defense Fleet. During the Black Fleet Crisis, the Intelligence Service was responsible for withholding the news of General Han Solo's capture by the Yevetha from the general populace."}, {"tag": "p", "text": "In 18 ABY before the onset of the First Corellian Insurrection, the intelligence service learned of a disturbance in the Corellian sector which made them suspicious of a possible threat emerging to the Republic within that region of space. A number of agents were at first sent to the sector but all mysteriously disappeared. To that end, intelligence agent Belindi Kalenda met with retired general Han Solo before he and his family went on a mission to Corellia in order to list their aid as an information gathering tool so that they could uncover the developing threat. In 25 ABY, the Book of Sith was discovered by Jedi Master Luke Skywalker. He agreed with Wedge Antilles and Iella Wessiri Antilles to hand over the text to NRI for review."}, {"tag": "p", "text": "During the turbulent period of the Yuuzhan Vong War, NRI was heavily involved in gathering intelligence on the extragalactic alien invaders known as the Yuuzhan Vong. In this time, the agency sought to aid the New Jedi Order but Anti-Jedi sentiment from the leaders of the New Republic meant that this was not feasible through official channels. As part of their duties, they investigated any activity by the Yuuzhan Vong and the collaborator group known as the Peace Brigade. New Republic Intelligence noted that in the initial stages of the war, that the Yuuzhan Vong possessed thousands of capital ships that traveled in flotillas of up to seventy five vessels. Amongst their ranks were warships that were the similar to Super Star Destroyers with firepower levels that were the equivalent of the heaviest turbolasers and ion cannons."}, {"tag": "p", "text": "Intelligence was also heavily involved in interrogating the seemingly defecting Priest caste Yuuzhan Vong known as Elan and her familiar, Vergere. A thorough examination was made of the two in order to determine if they were infiltrators pretending to be surrendering. However, they ultimately yielded and helped orchestrate a mission to take the two to meet the New Jedi Order. However, this proved to be a carefully designed plan that involved an extermination attempt on the members of the Jedi Council. The failure of New Republic Intelligence led to a great deal of controversy as well as blame held over the agency for them incapable of determining the nature of the two spies. After the Battle of Tynna, members of NRI were involved in a covert placement of examining what the extragalactic invaders were doing to the world of Tynna. As the conflict intensified and became a war of survival, New Republic Intelligence was involved with Chiss biotechnicians in the development of a deadly biotoxin called Alpha Red project."}, {"tag": "p", "text": "The New Republic Intelligence Service was eventually replaced by the Galactic Alliance Intelligence Service."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}