{"url": "New_Republic_Presidential_election,_23_ABY", "categories": ["Category:Legends articles", "Category:Changes of government", "Category:New Republic"], "nodes": [{"tag": "h1", "text": "New Republic Presidential election, 23 ABY"}, {"tag": "p", "text": "The New Republic Presidential election of 23 ABY saw Borsk Fey'lya succeed Leia Organa Solo as Chief of State of the New Republic, following Organa Solo's resignation. In an unusual vote for the highly fragmented New Republic Senate, Fey'lya (often considered one of the most polarizing senators) won a three-fifths supermajority in the first round of voting."}, {"tag": "p", "text": "The election was a decisive turning point in New Republic politics and in the state of the galaxy at large. Fey'lya had been trying to increase his personal power since his time with the New Republic Provisional Council, and had made both a number of allies and enemies along the way. One of those enemies was Admiral Ackbar, Supreme Commander of the New Republic Defense Force; Ackbar retired just after Fey'lya's election, and one of Fey'lya's first acts in office was to replace him with Sien Sovv. The retirements of Ackbar and Organa Solo, and the death of Mon Mothma the next year, finally removed from office the triumvirate that had led the New Republic and Rebel Alliance for nearly two and a half decades."}, {"tag": "p", "text": "The election also led to Hiram Drayson's resignation, and tempted Organa Solo to re-enter politics, although she was dissuaded by her brother, Luke Skywalker."}, {"tag": "p", "text": "Also shortly after his election, Fey'lya apparently eliminated the position of Minister of State and created the New Republic Advisory Council, staffing it with senators, many of whom were believed to have questionable beliefs or business practices, as well as anti-Jedi sentiments."}, {"tag": "p", "text": "It was largely the ineffectualness of the Fey'lya administration voted in by this election that caused such great devastation of the galaxy during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}