{"url": "New_Republic_Senate", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:New Republic Senate organizations"], "nodes": [{"tag": "h1", "text": "New Republic Senate"}, {"tag": "p", "text": "The New Republic Senate, also known as the Galactic Senate, Galactic Congress, and early on as the Provisional Senate, was the central legislative body of the New Republic. It was modeled on the Galactic Senate of the Old Republic, which became the Imperial Senate during the era of the Galactic Empire. In 0 BBY, Galactic Emperor Sheev Palpatine announced the Senate's dissolution and allowed regional governors to take direct control of their territories."}, {"tag": "p", "text": "In the aftermath of the Battle of Endor, the Rebel Alliance founded the New Republic and restored the Senate as its principal governing body. With the signing of the Galactic Concordance, the peace treaty that ended the Galactic Civil War, the Republic replaced the shattered Empire as the dominant government of the galaxy. At that point the Senate demilitarized the military and set out to bring peace and harmony to the galaxy. Mon Mothma, the first chancellor of the New Republic Senate, eliminated the emergency powers that had been given to Palpatine—the last Supreme Chancellor of the Old Republic—during the Clone Wars. She intended the Senate and the Republic to be forces for peace."}, {"tag": "p", "text": "Three decades after the war, the emergence of the First Order threatened to destroy that peace. General Leia Organa founded the Resistance to serve as a check against the First Order, but despite her efforts to convince the Senate to take action, the Senate did not believe that the First Order was a threat, so the Republic remained militarily unengaged. The First Order ultimately turned its superweapon, Starkiller Base, towards the Republic and destroyed the Senate's capital of Hosnian Prime, eliminating the Senate along with it."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins and foundations"}, {"tag": "p", "text": "The Galactic Senate first served as the legislative body of the Galactic Republic, where it became hampered by the bureaucracies and special interests that entangled the Galactic Republic in its final few years. The Senate ceded much of its power to the executive authority of Supreme Chancellor Palpatine during the Clone Wars, allowing him to oversee the war effort with special emergency powers. At the end of the war, the chancellor—secretly the Sith Lord Darth Sidious, who had manipulated the entire conflict between the Republic and the Confederacy of Independent Systems to amass central authority for himself—transformed the Republic into the Galactic Empire, and with it the Galactic Senate became the Imperial Senate."}, {"tag": "p", "text": "The Imperial Senate had even less power than its predecessor, with its power largely replaced by regional governments who controlled their own territories within the galaxy. The Emperor disbanded the Senate shortly before the Battle of Yavin, intending that the completed Death Star superweapon would create enough fear that it and the threat of the Imperial Military would keep recalcitrant worlds in line. After the Death Star was destroyed, the Empire set out to create a second Death Star in order to continue with this plan of ruling through fear. The Senate remained disbanded, however, eliminating the last traces of the Republic from the Imperial regime."}, {"tag": "p", "text": "The destruction of the second Death Star and the death of the Emperor during the Battle of Endor left the Empire in chaos. The Alliance to Restore the Republic, which was created to oppose the Empire and struck the critical blow against the regime during the Battle of Endor, formed the New Republic in the midst of this chaos. The New Republic restored the original Galactic Senate, which initially based itself in Hanna City on Chandrila. The world was chosen because it had long been seen as a planet whose inhabitants believed in justice and was widely seen as a step towards restoring justice to the galaxy."}, {"tag": "h3", "text": "Liberating the galaxy"}, {"tag": "p", "text": "Mon Mothma, the leader of the Rebel Alliance and a former senator from Chandrila, was elected as the chancellor of the Galactic Senate. The charter of the chancellor maintained the emergency powers that the old Senate gave to Palpatine at the onset of the Clone Wars, but Mothma intended to eliminate them, believing them to be a poison to democracy. She further believed that if the Republic was to convince the galaxy to join them, it could not be seen as doing so under threat. Mothma also hoped to demilitarize the Republic once the Galactic Civil War came to a close, and she proposed a bill that would cut the Republic's military force by ninety percent. The other ten percent would remain a peacekeeping force, while defense was left to local militias. This was only to take effect at the end of the war, however, as Mothma knew that the Empire would capitalize on any perception of weakness within the Republic."}, {"tag": "p", "text": "By 5 ABY, the New Republic had won a string of military victories against the Empire and captured several worlds including Arkanis and Kuat. Princess Leia attempted to lobby the Galactic Senate to send military forces to liberate the Wookiee homeworld of Kashyyyk from Imperial domination. With the Senate preoccupied with defeating the Empire and protecting Republic worlds, Leia's husband Han Solo and his Wookiee co-pilot Chewbacca undertook a campaign to liberate Kashyyyk. Against the wishes of Chancellor Mothma and the Senate, Leia solicited the Republic pilot Norra Wexley and her team's help in finding Han Solo, who had disappeared near Wild Space."}, {"tag": "p", "text": "Following the capture of Kuat Drive Yards, the Senate tentatively accepted an offer from the Imperial leader Grand Admiral Rae Sloane to discuss a peaceful resolution to the Galactic Civil War. Chancellor Mothma also agreed to raise the matter of Kashyyyk's liberation with Sloane and gave orders that no New Republic forces launch any official incursion into Kashyyyk. Leia disagreed and regarded the Wookiees' well-being as a non-negotiable matter. However, these talks were a ruse for an Imperial assassination attempt on the New Republic leadership using the liberated prisoners from Ashmead's Lock as unwilling drones. After Han and Chewbacca succeeded in sparking a mass Wookiee revolt on Kashyyyk, Leia along with Captain Wedge Antilles and Admiral Gial Ackbar defeated the Imperial fleet. Despite her role in liberating Kashyyyk, Leia's actions temporarily made her a pariah with the Senate."}, {"tag": "p", "text": "Following the Attack on Chandrila, the Galactic Senate began relocating its capital to the Mid Rim agrarian world of Nakadia, which had strict biosecurity laws. This transition coincided with Chancellor Mothma's political rivalry with the hawkish Orishen Senator Tolwar Wartol and the discovery of the Empire on Jakku in the Inner Rim. In an attempt to prolong the war, Wartol conspired with the Black Sun and Red Key crime syndicates to coerce five senators into opposing Mothma's bill to send military forces to Jakku. With the help of Han Solo, Sinjir Rath Velus, Temmin Wexley, Jom Barell, and Conder Kyl, Mothma convinced the senators to change their votes. As a result, the Senate dispatched troops to Jakku. New Republic forces won a major victory against the Empire. In retaliation, Wartol tried to assassinate Mon Mothma but ended up killing her adviser Auxi Kray Korbin instead. Soon afterward, the New Republic signed the Galactic Concordance with Grand Vizier Mas Amedda, formalizing the Empire's surrender and dissolution."}, {"tag": "p", "text": "Despite the ongoing fighting with the Empire, some of the Galactic Senate's first actions were to pass several laws which addressed the excesses and injustices of the Empire. While there was frequent bickering on the news holos about the merits of each proposal, some New Republic supporters like the former TIE fighter pilot Thane Kyrell thought this was preferable to the Old Empire, where people could not express their opinions without fear of Imperial reprisals. The Senate did not focus spending on the military but also diverted considerable amounts of government funding to the mass clean-ups of polluted worlds and reparations for alien species who had been enslaved by the Empire."}, {"tag": "h3", "text": "The pursuit of peace"}, {"tag": "p", "text": "During the Battle of Jakku, the final large-scale engagement of the Galactic Civil War, the Republic and the Empire signed the Galactic Concordance on Chandrila. The peace treaty brought an end to the war and required that the Empire remain within predetermined borders inside the Core Worlds and the Inner Rim. Some prominent members of the Senate believed that the war had truly ended and that the Empire would issue a final surrender to Republic forces. Despite the optimism of an impending peace, the Chancellor nonetheless warned that the Republic worlds should remain on high alert and that the New Republic Defense Fleet would be kept war-ready for the foreseeable future. Ultimately, the remaining Imperial forces retreated into the Unknown Regions and were not heard from for years. In the early days of the New Republic, Mothma hoped that the Senate would vote on how to structure the new government."}, {"tag": "p", "text": "The end of the war led the Senate to pass the Military Disarmament Act, achieving the goal set out by Chancellor Mothma when the Senate was reconstituted. Princess Leia Organa, one of the leading members of the Rebel Alliance during the war, argued strongly against military disarmament, believing that it was foolish for the Republic to trust that the Empire would no longer pose a threat. As a result of her warnings, Organa saw her reputation sullied when she was branded a warmonger and accused of being unable to let go of the Galactic Civil War."}, {"tag": "p", "text": "Though the Republic was initially based on Chandrila, the Republic chose to rotate its capital to different member worlds through a process of election. Instead of choosing Coruscant, the former seat of power of the Galactic Republic and the Galactic Empire, the rotation of the capital helped convince star systems that were reluctant to join the Republic that it would not repeat the mistakes of its predecessors, and that this Republic would not be a Core-centric government. One of the worlds that served as the New Republic's capital was Hosnian Prime, a planet in the Hosnian system, and the Senate itself was located in Republic City. It was there that the current Chancellor, Lanever Villecham, focused on improving trade relations with historically neutral systems in the Trans-Hydian Borderlands."}, {"tag": "h3", "text": "Deadlock"}, {"tag": "p", "text": "By 28 ABY, the Galactic Senate had become mired by deadlock and infighting. Since the retirement of Mon Mothma as Chancellor, consensus had broken down in the Senate. Two powerful factions had formed in the Senate: the Populists, who sought to preserve the status quo where individual worlds enjoyed substantial autonomy, and the Centrists, who advocated a stronger central government and military. The bickering between the two factions and the highly decentralized nature of decision-making made it hard for the New Republic to carry out key functions and mandates like enforcing financial regulations, patrolling the galactic shipping lanes, and preventing the resurgence of organized crime networks."}, {"tag": "p", "text": "The Galactic Senate's indecisiveness and bickering enabled the Nikto crime lord Rinnrivin Di's cartel to gain a foothold in the Gaulus sector, which housed the planet Ryloth. Rinnrivin's smuggling and gambling activities exacted a heavy toll on Ryloth's economy and was used to fund the expansion of the First Order's Navy. Ryloth's Emissary Yendor raised his planet's plight to the Galactic Senate but was met mainly by indifference. However, the Populist Senator Leia Organa and her Centrist colleague Ransolm Casterfo agreed to investigate the matter on behalf of the Senate."}, {"tag": "p", "text": "Over the course of their investigation, the two senators discovered that Rinnrivin's cartel was linked to a paramilitary faction called the Amaxine warriors, who supplied Rinnrivin with pilots and admired the Old Empire. Leia's investigation found that Rinnrivin's cartel had risen to power under suspicious circumstances, while Ransolm discovered that the Amaxine warriors were massing troops and starfighters on Daxam IV and Sibensko for war. Leia and Casterfo's investigation coincided with a successful Centrist motion to create a new powerful position called First Senator, which would command the Republic's economy and military. At the urging of several Populist senators including Tai-Lin Garr and Varish Vicly, Leia agreed to stand as the Populist nominee for First Senator."}, {"tag": "p", "text": "After obtaining the Supreme governorship of Birren with the help of Leia, the Centrist Senator Lady Carise Sindian discovered that Leia was the daughter of the hated Darth Vader. In secret, Lady Carise was a clandestine agent of the First Order with ties to the Amaxine warriors' leader Arliz Hadrassian. With Carise's approval, Hadrassian staged a distraction by bombed the Galactic Senate's conference building on Hosnian Prime. However, this only drew Leia and Casterfo's attention to the Amaxines. Due to Hadrassian's fanaticism, Lady Carise came to regard her as a liability to the First Order's plans."}, {"tag": "p", "text": "Seeking to plant a wedge between Leia and Casterfo, Lady Carise informed him about Leia's true parentage. Feeling betrayed by his friend, Casterfo upstaged a Senate hearing into Leia's nomination for First Senator by revealing that she was the daughter of Darth Vader. As a result, Leia lost the support of many senators excluding Tai-Lin and Varish, and was forced to withdraw her nomination for First Senator. Undaunted, Leia and her team C-3PO, Joph Seastriker, and Greer Sonnel traveled to Sibensko, where they uncovered evidence of the Amaxines' links to Rinnrivin's cartel. Following a confrontation with Rinnrivin and the Amaxine warriors, Leia managed to escape with the help of her husband, Han Solo. Shortly afterward, a damaged Amaxine B-wing starfighter crashed into the Amaxines' underwater weapons depot, triggering an explosion that destroyed their base and the underwater city."}, {"tag": "p", "text": "Later, Leia applied for a hearing at the Galactic Senate and gained a quorum due to a favorable vote from Casterfo, who wanted to make amends for betraying Leia. During her hearing, Leia gave a speech documenting the Amaxines' linkages to Rinnrivin Di's cartel. She also supplied evidence including banking records and footage from Sibensko. When several senators accused her of warmongering and lying, Casterfo sprung to her defense and shared visual logs of the Amaxine's military might and training from his trip to Daxam IV. Casterfo's actions won him the respect of Leia but earned him the ire of Lady Carise, who hatched a plot to eliminate the dissident Centrist senator. An opportune moment came ten days later during Tai-Lin Garr's campaign for First Senator. Lady Carise hired Hadrassian to assassinate Tai-Lin. Based on Leia and Casterfo's information, Hadrassian was then linked to the Amaxines, the Napkin Bombing, and Rinnrivin's cartel."}, {"tag": "p", "text": "Lady Carise then planted fabricated evidence linking Casterfo to Hadrassian. As a result, Casterfo was arrested for allegedly aiding Hadrassian's Amaxine warriors. He was then deported back to his homeworld of Riosa to face imprisonment, trial, and sentencing. Following Tai-Lin's death, the Galactic Senate (with the backing of Lady Carise and the Centrists) passed a motion suspending all future elections due to the political unrest. Lady Carise also planned to submit a motion seceding the Centrist worlds from the New Republic so that they could join the First Order. At that point, Leia determined that Lady Carise was behind the revelations of her parentage and Casterfo's framing. She then persuaded the Elder Houses to strip Lady Carise of all her royal titles, reducing her to a commoner. While most Senators believed that no more threats existed with the elimination of the Amaxines and Rinnrivin's cartel, Leia disagreed and believed that other forces were conspiring to overthrow the Republic. Frustrated with the Senate's infighting and complacency, Leia established a paramilitary outfit called the Resistance to protect the New Republic."}, {"tag": "h3", "text": "Building to destruction"}, {"tag": "p", "text": "In the decades after the Galactic Civil War, the First Order began to rise to power as a successor force to the Galactic Empire. The Senate did not believe that the First Order was a threat, including after investigating its activities. The Senate Intelligence Committee reviewed reports of the First Order's activities and found them to be inconclusive and overstated, ultimately concluding that the First Order was a shattered remnant of the old Empire that, despite their persistence, constituted a poorly equipped and poorly organized group of Imperial fundamentalists. Organa attempted to convince the Senate of the threat, but they refused to take any action against the First Order. As a result, Organa formed the Resistance to serve as a check against the activities of the First Order. The Senate did not officially support General Organa's military activities, but it did begrudgingly tolerate it. Nonetheless, the Senate, including the chancellor, continued to pursue peace and would not engage the First Order so long as they followed the dictates of the Galactic Concordance. However, the Resistance was supported and funded by sympathetic senators who shared Organa's views on the First Order."}, {"tag": "p", "text": "The First Order intended to turn its sights onto the Republic and the Senate, which leaders like General Armitage Hux saw as an illegitimate government that was unable to control the chaos in the galaxy. During the growing conflict between the First Order and the Resistance, the First Order used its superweapon, Starkiller Base, to destroy the Hosnian system. Those senators present on Hosnian Prime, including Chancellor Lanever Villecham, were killed when the planet was destroyed by the Starkiller's firepower."}, {"tag": "h2", "text": "Organization and powers"}, {"tag": "p", "text": "The Galactic Senate had member worlds from the across the galaxy. In the beginning, it was mostly worlds from inner systems, but a few Outer Rim worlds joined the Senate early in its existence. The representatives within the Senate were chosen by the will of the people, and early Senate debates about the proposals to correct the injustices of the Empire were greeted with positivity due to the ability to openly express opinions without fear of the Empire. The Senate oversaw the rehabilitation of worlds across the galaxy by directing resources towards cleaning up polluted worlds and providing reparations for species that had been enslaved by the Empire."}, {"tag": "p", "text": "The Senate also contained committees such as the Committee for Imperial Reallocation, which was charged with redistributing the resources of the Empire, and the Senate Intelligence Committee, which at one point investigated the activities of the First Order. Not all representatives were fully loyal to the Senate, however, with some having sympathies and even allegiances to the First Order."}, {"tag": "p", "text": "During the conflict between the First Order and the Resistance, members of the Senate included Chancellor Lanever Villecham of the Tarsunt system, Thadlé Berenko of Naboo, Zygli Bruss of Candovant, Thanlis Depallo of Commenor, Nahani Gillen of Uyter, Brasmon Kee of Abednedo, Gadde Neshurrion of Ubardia, Andrithal Robb-Voti of Taris, and Erudo Ro-Kiintor of Hevurion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The canon Galactic Senate of the New Republic first appeared in the 2015 novel Aftermath by Chuck Wendig. The New Republic Senate previously appeared in various Star Wars Legends stories, including The New Jedi Order book series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}