{"url": "New_Republic_Senate/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:New Republic Senate organizations"], "nodes": [{"tag": "h1", "text": "New Republic Senate"}, {"tag": "p", "text": "The New Republic Senate, also known as the New Republic Assembly or Galactic Assembly, was the legislative and executive branch of the New Republic. It was located on Coruscant. The government of the New Republic was organized around this unicameral legislative body. The New Republic Senate was the successor of the Provisional Council and the Imperial Senate."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rebellion and New Republic"}, {"tag": "h4", "text": "The Provisional Council"}, {"tag": "p", "text": "The ultimate goal of the Alliance was to end the Emperor's tyrannical rule and to restore freedom and justice to the galaxy. To achieve these ends, the Rebel Alliance used tactics from subversion to large-scale military actions, such as the Battle of Endor."}, {"tag": "p", "text": "The Battle of Endor and the death of the Emperor four years after the Battle of Yavin signaled the end of the Empire. One month later, the Declaration of a New Republic was issued by eight of the most important members of the Rebel Alliance setting forth the goals, values, and ideals of the new government. These eight, Chief of State Mon Mothma of Chandrila, Princess Leia Organa of Alderaan, Borsk Fey'lya of Kothlis, Admiral Gial Ackbar of Mon Calamari, Sian Tevv of Sullust, Doman Beruss of Corellia, Kerrithrarr of Kashyyyk, and Verrinnefra B'thog Indriummsegh of Elom, became the first Inner Council of the New Republic provisional government, the Provisional Council."}, {"tag": "p", "text": "The main goal of the New Republic during the time of the Provisional Council was to capture Coruscant. At the time, the Provisional Council, and therefore the New Republic, did not have an official designated seat of government or capital world. Instead, the Provisional and Inner Councils met on various member worlds, such as Noquivzor. To move the government to Coruscant would be more symbolic than strategic, and would establish the legitimacy of the New Republic, for the seat of galactic government had always been on Coruscant since the beginning of the Republic. Until then, the Provisional Government's goals would be to provide guidance for the new government and to work out a new series of principles and laws."}, {"tag": "h4", "text": "The Rebel Alliance Senate"}, {"tag": "p", "text": "One year after the Battle of Endor, the New Republic Provisional Council had been established on Yavin 4. The Senate met in the Palace of the Woolamander. In pursuit of the quest to establish a legitimate new galactic government, Mon Mothma organized the Senate Planetary Intelligence Network, also known as SPIN. After Trioculus attacked Yavin 4 in his search for the Lost City, Mon Mothma relocated SPIN to the Defense Research and Planetary Assistance Center on the mysterious and remote planet Dagobah. The Senate remained headquartered on Yavin 4 until the failed wedding of Han Solo and Princess Leia in the Great Temple's Audience Chamber."}, {"tag": "h4", "text": "The First Senate"}, {"tag": "p", "text": "Shortly after the capture of Coruscant and the relocation of the New Republic government seven years after the Battle of Yavin, the New Republic Senate was established during Restoration Day. The speech of Princess Leia Organa, New Republic Minister of State, reflected the beliefs and principles of the First Senate:"}, {"tag": "p", "text": "“Today we become a galactic family—a family of the great and the small, the young and the old, with honor to all and favor to none.\""}, {"tag": "p", "text": "Mon Mothma became the first Chief of State of the New Republic, and under the new Charter, also the President of the Senate and the Commander-in-Chief of the Armed Forces. During her administration, the New Republic government remained very similar to that of the provisional government, with the New Republic Senate Assembly assuming the duties of the Provisional Council and with the Inner Council at its head."}, {"tag": "p", "text": "The Senate was able to provide the protection and guidance necessary to end the threat posed by the Empire following the return of Grand Admiral Thrawn nine years after the Battle of Yavin. However, it was not able to defend against a major Imperial counteroffensive lead by a resurrected Emperor Palpatine that saw the recapture of Coruscant a year after Thrawn's death, and thus the New Republic found itself again on the run."}, {"tag": "h4", "text": "The Senate during the Black Fleet Crisis (The Second Senate)"}, {"tag": "p", "text": "Upon the successful recapture of Coruscant eleven years after the Battle of Yavin, the New Republic Senate began the first of a series of government restructuring programs. Specialized councils were established, each with greater power than ordinary Senate committees, with the responsibility of providing for a specific aspect of government. These included the Council on the Common Defense, the Council on Security and Intelligence, the Justice Council, the Ministry Council, the Council on Science and Technology, and the Commerce Council."}, {"tag": "p", "text": "The Inner Council was replaced by the Ruling Council made up of the chairpersons of the eight Senate councils, with the power to remove the Chief of State from office to protect against having the head of government become too powerful, as Palpatine did as Supreme Chancellor."}, {"tag": "p", "text": "During the Second Senate, Mon Mothma retired from public life and named Princess Leia Organa Solo her successor. With the approval of the Senate, Organa Solo became the second Chief of State of the New Republic."}, {"tag": "p", "text": "Many important events with long lasting repercussions occurred during the presidency of Organa Solo. The most important of these was the opening of diplomatic talks with the Duskhan League, an alliance of Yevethan worlds in the Koornacht Cluster. This in turn led to what is commonly referred to as the Black Fleet Crisis, during which Organa Solo extended the power of the Chief of State, amidst two petitions of recall from the Ruling Council and a petition of no confidence in the Senate, in order to protect the New Republic from the fanatical Yevethans and their ruthless campaign of genocide."}, {"tag": "p", "text": "Also, around this time, many former Imperial worlds petitioned for and were granted membership to the New Republic. However, many of these worlds retained their individual governments, and as a result, their delegations to the Senate often advocated views associated with the late Empire such as xenophobia, and generally caused deadlock within the Senate."}, {"tag": "p", "text": "Finally, after being criticized for New Republic involvement in the Koornacht Cluster, Almania (during which the Senate Hall was destroyed), and the Corellian system, and because of discord within the Senate, especially between the traditional and pro-Imperial senators, Chief of State Leia Organa Solo took an indefinite leave of absence, upon which the Calibop senator Ponc Gavrisom was chosen as the caretaker Chief of State."}, {"tag": "h3", "text": "The Third Senate"}, {"tag": "p", "text": "Ponc Gavrisom's ascension to the office of Chief of State, the construction of a new Senate Grand Convocation Chamber, and a new round of major government restructuring marked the beginning of the Third Senate. The power of government was shifted more to the local, planetary, system, sector, and regional levels to avoid the centralization of power that marked the Palpatine era. The New Republic Senate's role was thus reduced to little more than providing for the common defense and mediating inter-system disputes. While any legislation passed by it was still binding, the new limit of one bill per delegation per year prevented gridlock, since any proposed legislation would have to pass the scrutiny of both the committee in which it was introduced as well as the full Senate. A creation of these reforms was the sector assemblies, which governed sectors and controlled their representation in the Senate."}, {"tag": "p", "text": "Another development made during the restructuring was the creation of the New Republic Observers, an organization that functioned much like the Jedi Order during much of the Republic. The job of the Observers was to move about the New Republic and to report to the Senate what they saw or heard, especially with regard to improper government activities that local authorities preferred to keep out of sight."}, {"tag": "p", "text": "The major event of the Third Senate was the Caamas Document crisis, which threatened to begin a civil war between pro-Bothan and anti-Bothan factions of the New Republic. The crisis, which began with the uncovering of the Caamas Document at Wayland, ended with the signing of a final peace treaty between the New Republic and the Imperial Remnant, finally ending the twenty-one year Galactic Civil War."}, {"tag": "h3", "text": "The Fourth Senate"}, {"tag": "p", "text": "The end of the Galactic Civil War saw many worlds finally make a choice on which side to join, and many chose the New Republic. Leia returned to the Senate shortly after the signing of the Bastion Accords, but permanently resigned in 23 ABY."}, {"tag": "p", "text": "In the subsequent election, Borsk Fey'lya was elected Chief of State with a three-fifths majority. Many other long term members of the Senate resigned as well. Unfortunately, these senators, beings of high principle and former rebel leaders, were replaced by senators of lesser principle, and the infighting of the Old Republic was seen again. In the subsequent invasion by the Yuuzhan Vong, the Senate was paralyzed by incompetence and cowardice. In the Battle of Coruscant, most of the Senate hijacked elements of the Defense Fleet to escort them out of the system. Fey'lya, who was responsible for many (if not most) of the failures of the War, sacrificed himself in the battle. The Senate reconvened on Mon Calamari, and, after a long campaign, elected Cal Omas as Chief of State."}, {"tag": "h3", "text": "Conversion"}, {"tag": "p", "text": "In 28 ABY, as the New Republic converted into the Galactic Alliance, the New Republic Senate became the Galactic Alliance Senate."}, {"tag": "h2", "text": "Powers"}, {"tag": "p", "text": "The Senate was the legislative and executive power of the New Republic. It also had limited judicial authority, presumably for high-profile plaintiffs or cases too controversial for the Court of Justice. Such cases included trying Senators for treason, crimes against civilization and presumably corruption and treason of the Chief of State."}, {"tag": "p", "text": "Each senator was limited to introducing one bill per year, with a straight up-down vote required to get the bill out of committee and to the Senate as a whole."}, {"tag": "p", "text": "HoloNet channel 11 was reserved strictly for use by the New Republic Senate."}, {"tag": "h2", "text": "Composition"}, {"tag": "p", "text": "The Senate was headed by the Chief of State alongside the Chair of the Senate. It mainly consisted of representative assemblymen. Primary members were represented in the Senate by a governor-delegate, or Senator. Each Senator has a single vote, regardless of the population represented. Affiliate members were represented on Coruscant by a Legate, who could speak in general sessions of the Senate, but not vote on official Senate business (to avoid dual representation) or serve in the Senate's various working bodies. In 19 ABY, there were nearly 1000 senators, with each representing 50-200 worlds."}, {"tag": "p", "text": "As a body with a large and potentially unlimited membership, the Senate-in-whole was an almost impossibly unwieldy structure for getting work done. Consequently, most of the real governance was performed by the Senate's councils, committees, and commissions. The daily business of the Senate proper was primarily speech-making and public debate. When the Senate met as a committee of the whole, it was sometimes referred to as the New Republic Assembly. Councils were appointed bodies with autonomous decision-making and appropriation authority over some segment of government operations outside the Senate proper (for example, the Defense Council, which oversaw the New Republic Defense Force). The most populous and powerful members of the New Republic were disproportionately represented on the Senate's councils. Committees were elected bodies with the authority to administer various aspects of Senate operations, including the general budget. They were semi-autonomous; in the event of a unanimous committee vote, the approval of the Senate-in-whole was not required (however, the Senate-in-whole could override a less-than-unanimous committee decision with a three-to-five majority). Commissions were voluntary bodies with an advisory capacity only. They could prepare reports on issues of concern for presentation to the Chief of State, to the Minister of State, to the Supreme Commander, or to the general membership; schedule and conduct hearings; and contract for independent research."}, {"tag": "p", "text": "The senior members of the Senate were seated at the lower levels, with the newer and less powerful senators seated in the upper tiers. A Gamorrean acted as the sergeant-at-arms."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}