{"url": "New_Republic_Security_Bureau", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:New Republic intelligence organizations", "Category:New Republic law enforcement"], "nodes": [{"tag": "h1", "text": "New Republic Security Bureau"}, {"tag": "p", "text": "The New Republic Security Bureau (NRSB) was an intelligence and law enforcement agency of the New Republic that was founded less than a month before the Liberation Day attacks."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The New Republic Security Bureau was responsible for investigating security threats to the New Republic and managing bounty hunters who were used to hunt down Imperial war criminals. The Bureau maintained a building in Hanna City on the New Republic's capital Chandrila which contained boards that allocated bounty hunting jobs. The NRSB was also known to solicit the services of freelance investigative slicers such as Conder Kyl for analyzing the controller chips found in the brain stems of the mind-controlled Ashmead's Lock assassins."}, {"tag": "p", "text": "The New Republic Security Bureau consisted of NRSB officers and utilized orbital jumpers and a Hammerhead-class cruiser."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The New Republic Security Bureau was founded one month before the attack on Chandrila in 5 ABY. The nascent agency was caught off-guard and overwhelmed by these attacks; which saw liberated former Rebel Alliance prisoners from Ashmead's Lock prison attack and kill several New Republic government officials and military officers during the Liberation Day festivities in Hanna City. These prisoners were being controlled by the Imperial Fleet Admiral Gallius Rax, who used inorganic biochips to turn them into unwilling assassins."}, {"tag": "p", "text": "The NRSB managed to apprehend the Imperial agent Windom Traducier, who used his position as a New Republic Senate Guardsman to erect a transponder that transmitted Rax's signals to the Ashmead's Lock prisoners. The NRSB also found Traducier's secret second apartment which contained blasters which he had distributed to each of the mind-controlled assassins. During their investigation, they discovered that the Ashmead's Lock assassins had been outfitted with inorganic bio-chips inside their brain steams. The Bureau also identified Traducier as the man who murdered the former Imperial General Jylia Shale and helped the Imperial adviser Yupe Tashu escape."}, {"tag": "p", "text": "Due to the damage inflicted on the New Republic's image, the NRSB temporarily suspended the hiring of bounty hunters to capture Imperial fugitives. They also contracted Conder to analyze each of the bio-chips found inside the Ashmead Lock's prisoners' heads."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Republic Security Bureau first appeared in Chuck Wendig's 2016 novel Aftermath: Life Debt, the second installment in The Aftermath Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}