{"url": "New_Republic_soldier", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:New Republic trooper variants"], "nodes": [{"tag": "h1", "text": "New Republic soldier"}, {"tag": "p", "text": "New Republic soldiers, also known as New Republic troops, were the soldiers of the New Republic's military. Shortly after the Battle of Endor, Republic soldiers fought on the planet Uyter. Republic soldiers took part in the Battle of Jakku, a major battle which ended the Galactic Civil War in the New Republic's favor and led to the signing of the Galactic Concordance. By 9 ABY New Republic soldiers were responsible for overseeing prisoner transportation aboard New Republic Correctional Transports guarded by security droids. Twenty-four years after the Battle of Endor, they were used to guard the New Republic senatorial complex on Hosnian Prime."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "New Republic soldiers could be placed under infantry units such as the Thirty-first, 61st Mobile Infantry or Third Recon Group."}, {"tag": "h2", "text": "Uniforms"}, {"tag": "p", "text": "During the Galactic Civil War, New Republic soldiers wore simple vests and utility belts. They were armed with rifles and blasters. In the New Republic Era, a variation of it's troop attire consisted of a blue tunic with a New Republic roundel on the left shoulder, blue trousers, white shoes, a white belt and holster and a white helmet with a black tinted visor, the same type worn by the Alderaanian consular security. About twenty-four years after the Battle of Endor, New Republic soldiers stationed at the Galactic Senate on Hosnian Prime wore jackets and trousers that were not designed to inspire terror and awe. They also wore helmets that were tethered by a simple leather strap."}, {"tag": "h2", "text": "Specialized New Republic soldiers"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}