{"url": "New_Sith", "categories": ["Category:Legends articles", "Category:Sith states and governments"], "nodes": [{"tag": "h1", "text": "New Sith"}, {"tag": "p", "text": "The New Sith, also known as the New Sith Empire, Reorganized Sith Empire, or simply the Sith Empire, was a revived faction of the Sith Order that existed throughout the millennia-long Draggulch Period. The faction arose in 2000 BBY due to the machinations of Darth Ruin, a Jedi Master who initiated the Fourth Great Schism of the Jedi Order, becoming a Dark Lord of the Sith. Amassing a multitude of like-minded disciples, Ruin founded a new empire of the Sith, clashing with the Galactic Republic and the Jedi in the New Sith Wars. The reign of Darth Ruin ended prematurely due to the instigation of his backstabbing followers, setting a treacherous precedent that would plague his successors for many centuries. Nonetheless, the New Sith had emerged into a bloody age of galactic expansion, eventually giving rise to a new leader—the shadowy \"Dark Underlord\" and his marauding Black Knights. Even with the Dark Underlord's defeat by the Jedi, the Sith crusades persisted, further expanding their territory and power base."}, {"tag": "p", "text": "Over five hundred years after their resurgence, the New Sith achieved a crushing victory against Republic and Jedi forces on the planet Mizra, provoking mass Jedi defections and a continued streak of Sith domination. In the wake of this upturn, the tyrannical Darth Rivan rose to leadership, creating a unique brand of warriors—the Battlelords—in an attempt to curb the string of betrayals among the Sith. This venture met an abrupt end, however, after Rivan and his Battlelords were entrapped, and ultimately destroyed, by a Sith artifact called the Darkstaff. In the last centuries of the New Sith Wars, the reigning Dark Lord Belia Darzu created an army of mutated cyborgs—the Metanecrons—during the two-decade Sictis Wars. The end of this period saw yet another Sith victory, but not before Darzu's demise at the hands of the Mecrosa Order."}, {"tag": "p", "text": "By the advent of the century-long Republic Dark Age, the New Sith had all but completely eroded the strength of their ancient nemeses. Despite the Republic's imminent collapse, the Sith ranks devolved into a period of discord and treachery, plunging their empire into a civil war. Throughout the Republic Dark Age, a number of Sith warlords took control of their own independent dominions, continuing their violent conquests against the Republic, the Jedi and each other. The fragmented New Sith remnants endured a phase of perpetual turmoil for some time—although still collectively dominating the galaxy's Outer Rim—until the intervention of the renegade Jedi Skere Kaan in 1010 BBY. Declaring himself the new Dark Lord of the Sith, Kaan conquered the warring Sith enclaves, reorganizing them into a faction called the Brotherhood of Darkness."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Jedi schism"}, {"tag": "p", "text": "In the year 2000 BBY, the beginning of the Draggulch Period brought about the revival of the Sith Order, a cult of dark side practitioners who—over the past several millennia—sought the destruction of the Galactic Republic and the peacekeeping Jedi Order. For centuries up to this point, the Sith were commonly believed to have been vanquished, having been inactive since the reign of the reconstituted Sith Empire from the time of the Great Galactic War. The Sith would eventually return, however, due to the machinations of a Jedi Master known as Phanius. Reputed for his solipsistic mindset, Phanius pursued alternative teachings in conflict with the Jedi Order's prohibitions, leading him to uncover the ways of the Sith from within a rare Sith holocron."}, {"tag": "p", "text": "Seduced by the dark side of the Force, the intelligent and charismatic Phanius abandoned the ways of the Jedi, intent on reviving the Sith Order. To this end, the fallen Jedi Master sought out and infiltrated a number of surviving Sith clans, uniting them under his banner and assuming the identity of Darth Ruin. In the process, fifty additional Jedi chose to leave the Order and rally behind Ruin's new Sith crusade, resulting in the Fourth Great Schism. Declaring himself a Dark Lord of the Sith, Ruin drove his followers to wage war against the Jedi Order and the Galactic Republic, founding a new empire of the Sith and initiating a conflict known as the New Sith Wars."}, {"tag": "p", "text": "Throughout his reign over the New Sith, Darth Ruin garnered infamy as a particularly merciless and self-centered leader, known for sacrificing many of his underlings on a whim. This ultimately led to the Dark Lord's assassination at the hands of his own Sith disciples, who were unwilling to tolerate their leader's egocentric philosophy. Despite Ruin's death, his actions introduced a new age of expansion for the Sith, resulting in the reclamation of numerous Sith worlds—particularly Yavin 4 and Ziost—along with acts of sabotage against the Republic. The treachery that led to Ruin's fall, however, also provoked a string of further betrayals among his Sith successors, of which would persist for hundreds of years to come."}, {"tag": "h3", "text": "Black Knights"}, {"tag": "p", "text": "By 1750 BBY, another individual had seized the Dark Lord mantle as the leader of the New Sith—a shadowy dark side spirit known only as the \"Dark Underlord\". The origins of the Dark Underlord were shrouded in mystery; some speculated that he was summoned from the realm of Chaos itself, while others believed him to be a reincarnation of Xendor, a darksider who once lived during the First Great Schism thousands of years earlier. A bloodthirsty marauder, the Dark Underlord proved himself a force to be reckoned with among the Sith, allowing him to consolidate a Sith alliance—the Black Knights—in a destructive campaign against the Republic and the Jedi."}, {"tag": "p", "text": "Headquartered on the planet Malrev IV, the Black Knights were known for their violent exploits along the Zona Miki route of the Outer Rim Territories, terrorizing numerous space stations at the behest of the Dark Underlord. These exploits attracted the ire of Murrtaggh, a Jedi Master who hired a group of Mandalorian mercenaries in a plot to sabotage the Dark Underlord's forces. The Mandalorians staged a diversionary attack on Malrev IV, diverting the attention of a leading Sith commander and consequently leaving the Dark Underlord vulnerable to Murrtaggh's own assault. In the ensuing battle, the Dark Underlord met his demise at the hands of the Jedi Master. The Black Knights were not completely vanquished, however, and eventually managed to reform their ranks on several occasions—even centuries after the New Sith Wars—in the Dark Underlord's absence."}, {"tag": "h3", "text": "Conquest at Mizra"}, {"tag": "p", "text": "The death of the Dark Underlord ultimately did little to impede the momentum of the Sith war effort, which continued to grow over the following centuries. Despite a number of foiled incursions at Corphelion, Gap Nine and King's Galquek, the New Sith had enlisted allies among the Devaronians and Hiitians by the year 1500 BBY. Decades later, the Sith amassed an army against Republic and Jedi forces on the planet Mizra. Many Lords of the Sith participated in this battle, each mounting a personalized speeder bike named after a predatory species that epitomized their innermost nature. The tide of this engagement was turned by the actions of a lone Sith sniper who—after killing a Jedi coordinator and disrupting their battle meditation—triggered a full-scale slaughter of the Jedi forces, resulting in a crushing Sith victory. At the battle's end, hundreds of Jedi were captured by the Sith and promptly converted to the ways of the dark side. In the aftermath of their triumph at Mizra, the Sith were left without a clear line of succession, leaving no immediate heir to the Dark Lord mantle. Nonetheless, Mizra was a pivotal turning point in favor of the Sith, solidifying their power base and paving the way for a new leading Sith figure—the tyrannical Darth Rivan."}, {"tag": "h3", "text": "Tyranny of Rivan"}, {"tag": "p", "text": "At some point between 1417 BBY and 1250 BBY, the Dark Lord Darth Rivan led the New Sith from a personal fortress on the terraformed planet Almas. In an effort to overcome the perpetual betrayals among the ranks of the Sith, Rivan sought to build an army of darksiders led by a unique brand of Sith commanders known as the Battlelords. Through a series of complex rituals fueled by the power of Sith magic, the Dark Lord created a Force bond between the Battlelords and the soldiers under their command, preventing the subordinates from attacking or killing their masters."}, {"tag": "p", "text": "Initially, the use of Rivan's Battlelords brought a higher degree of cohesion to the armies of the Sith. This success proved short-lived, however, when the eventual betrayal of Rivan's Sith apprentice—Darsin—obstructed the fruition of the Dark Lord's Battlelord army. Additionally, the Jedi began specifically killing individual Battlelords, thereby releasing the bonded subordinates and allowing them to flee the battlefield. As a result, the Sith deemed the Battlelords unfit for their intended purpose, ultimately discontinuing their use."}, {"tag": "p", "text": "During his reign, Darth Rivan obsessively sought the destruction of a Sith artifact known as the Darkstaff, fearing its reputably malevolent power as a potential threat to his existence. In time, however, the Jedi Order staged an assault against Rivan's stronghold on Almas, precipitating a violent end to the Dark Lord's reign. By this point, Rivan had finally managed to acquire the Darkstaff, only to have its power turn against him amid the pivotal battle. To this end, the Darkstaff invoked a hyperspace wormhole, obliterating Rivan's entire contingent of Battlelords and teleporting the Dark Lord himself forward through time. At his final destination on Ruusan during the Light and Darkness War, Darth Rivan—now deprived of his ability to wield the Force—was killed by a Force-user of unremarkable power."}, {"tag": "h3", "text": "Sictis Wars"}, {"tag": "p", "text": "In 1250 BBY, the final quarter of the Draggulch Period saw the rise of Belia Darzu, a Dark Lord who led the New Sith during a two-decade period known as the Sictis Wars. Using a hidden stronghold on the Deep Core world of Tython, Darzu experimented with the power of mechu-deru, an obscure technique allowing the manipulation of mechanical structures through the Force. These experiments led to the creation of the nanogene spore, a virus capable of transforming living victims into hulking hybrids of metal and flesh called technobeasts. Through the power of the dark side, the technobeasts were bound to the will of Darzu herself, who promptly mobilized the creatures into an obedient army known as the Metanecrons. Over the course of the Sictis Wars, the technobeasts were unleashed upon the Galactic Republic and the Jedi, becoming recognized as the defining horror of this period."}, {"tag": "p", "text": "By 1230 BBY, an alliance once established between Lord Darzu and the Mecrosa Order—a secret society from the Tapani sector—had fallen apart. The Mecrosa sought revenge against the Dark Lord for an unwanted incursion in their territory. Additionally, Darzu—like many of her Sith predecessors—fell victim to treachery at the hands of her own Sith followers, culminating in the Dark Lord's assassination by the Mecrosa. In spite of Darzu's death and the resulting sabotage of her technobeast army, the New Sith were nonetheless deemed victorious by the end of the Sictis Wars. Additionally, Darzu's successors would continue utilizing the technobeasts for the remainder of the New Sith Wars, albeit in smaller numbers than before. The victory of the Sictis Wars came at a cost, however, and once again deprived the Sith of a clear line of succession for a new leader to seize the Dark Lord mantle."}, {"tag": "h3", "text": "Fragmentation"}, {"tag": "p", "text": "By 1100 BBY, the relentless Sith crusades had weakened the Republic's economic, military and political strength to the point of absolute collapse, beginning an era known as the Republic Dark Age. This new era, however, also brought about a phase of intense division between the power-hungry Lords of the Sith. Unwilling to unite under a single leader, the New Sith failed to capitalize on the Republic's decline. Instead, they turned against one another in a period of disagreement and backstabbing, leaving their ranks irreparably fragmented. The century-long Republic Dark Age saw the rise of many Sith warlords who—despite their lack of unity—continued waging their bloody conquests throughout entire star systems, with some maintaining control of their own independent territories. Even in their divided state, the Sith collectively dominated the galaxy's Outer Rim while pushing towards the Core Worlds."}, {"tag": "p", "text": "Discord persisted between the fragmented remnants of the New Sith until the year 1010 BBY. Around this time, Skere Kaan—a Jedi Master known for his radically disillusioned outlook on the Republic and the Jedi—had organized a group of like-minded peers called the \"Brotherhood\". Spearheading a campaign to conquer the remaining Sith enclaves on his own terms, Kaan went on to defeat the most powerful of the warring Sith Lords in a matter of months, all while working under the false pretense of rebuilding the Republic. In the process, the Jedi Master—having since declared himself a Dark Lord of the Sith—assumed leadership over the surviving Sith, uniting them to the principle of \"Rule by the Strong\". Amassing his twenty thousand-strong following, Kaan founded a new, unified Sith faction called the Brotherhood of Darkness, promptly declaring war against the Republic in the final decade of the New Sith Wars."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After the collapse of the New Sith, Kaan and his Brotherhood of Darkness sought to repress the unrelenting betrayals that had ultimately caused the downfall of their predecessors. To this end, Kaan allowed all members of the Brotherhood to bear the title of Dark Lord of the Sith, hoping to encourage a sense of equality throughout their ranks. Additionally, Kaan forbade his followers from assuming the coveted title of \"Darth\", believing that such a practice merely provoked strife among the Sith. Despite these preventative measures, the Brotherhood met their ultimate demise in the climactic Ruusan campaign, ending the thousand-year-long New Sith Wars in 1000 BBY. The Sith were not completely destroyed, however, as a surviving Brotherhood member—Darth Bane—went on to establish a new Order of the Sith Lords."}, {"tag": "p", "text": "In the aftermath of the Draggulch Period, succeeding generations of the Sith Order came to regard the New Sith Wars as the bloodiest, most wasteful conflict in galactic history. The ramifications of the Fourth Great Schism were documented in a Jedi guidebook titled The Jedi Path, citing the Sith revival as the near-end of galactic civilization. Nonetheless, the Republic avoided extinction and escaped the Dark Age perpetuated by the Sith, rebuilding its government after the Ruusan Reformation. In a collection of historical writings called the Book of Sith, Darth Bane lambasted the New Sith, asserting that their persistent infighting led them to waste an ideal opportunity to defeat the Republic. This—combined with Bane's fervent opposition to the Brotherhood's promotion of equality–led him to establish the \"Rule of Two\", a doctrine that was intended to curb the ambitions of the power-hungry Sith. Under this doctrine, Bane's successors enacted a centuries-long plan for galactic domination, eventually succeeding where the New Sith had failed by overthrowing the Republic and all but completely purging the Jedi Order."}, {"tag": "p", "text": "By the year 40 ABY, the New Sith and a number of their leading figureheads were discussed in a historical compendium about the Force, compiled by Jedi historian Tionne Solusar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Sith were first mentioned in the novelization of Star Wars: Episode I The Phantom Menace, authored by Terry Brooks and published in 1999. The novel erroneously establishes the New Sith (simply dubbed the \"Sith\" at the time) as the original foundation for the Sith Order as a whole. In the year 2000, this error was corrected in The Essential Chronology, a reference book—penned by Kevin J. Anderson and Daniel Wallace—which first identified the faction as the \"New Sith\". The Power of the Jedi Sourcebook misattributed the history of the New Sith under the name of the Brotherhood of Darkness, a separate organization that existed after the New Sith collapsed. While most commonly known as the \"New Sith\" in multiple sources, the faction was later referred to as the \"New Sith Empire\" in the sixth volume of Star Wars Comic UK, released in 2011. In the following year, the group was simply named the \"Sith Empire\" in Book of Sith: Secrets from the Dark Side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}