{"url": "Newar_Forrth", "categories": ["Category:Legends articles", "Category:Army of Light members", "Category:Jedi Lords", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Newar Forrth"}, {"tag": "p", "text": "Newar Forrth, or New'arforrth in his native tongue, was a male Twi'lek Jedi Master serving the Jedi Order and the Galactic Republic during the latter decades of the Republic Dark Age. The leader of the Nercathi clan, Forrth was a Jedi Lord on Ryloth, ruling his constituents in return for protecting the planet from the New Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Lord"}, {"tag": "p", "text": "A Force-sensitive male Twi'lek of the Nercathi clan, Newar Forrth was born on Ryloth during the Galactic Republic's Dark Age, a time of war and suffering caused by the actions of the Sith Empire. Trained in the ways of the Force by the Jedi Order, Forrth became a Jedi Master and later the Lord of his homeworld in exchange for protecting the Ryloth citizens from the Sith. Fashioning two lightsabers for his personal use, Forrth was a master of the two-bladed Jar'Kai style of lightsaber combat."}, {"tag": "p", "text": "In 1010 BBY, the Jedi High Council's failed protégé Jedi Master Skere Kaan broke away from the Order and created the Brotherhood of Darkness to destroy the Order and the Republic. Upon hearing Coruscant Jedi Temple's battlemaster Lord Hoth had rallied the banners of the Jedi Grand Council, Lord Forrth mustered those Jedi and commoners loyal to him and joined Hoth's Army of Light. Fighting for a decade against Kaan's Brotherhood, Forrth was charged with leading the Third Legion of Light on such campaigns as the triumphant battle at Malrev IV."}, {"tag": "p", "text": "In the last year of the fighting, Lord Hoth led Forrth and the other great lords on a final campaign on the fields of Ruusan. Fighting alongside Hoth, Lord Forrth was struck down during the long period of fighting, perishing on the muddy world with so many of his brethren."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following Lord Forrth's death, the battle of Ruusan was eventually won and the Sith forces vanquished a heavy cost. Following the Republic and the Jedi Order's enactment of the Ruusan Reformations, Jedi Knight Johun Othone was able to convince the Galactic Senate to grant him the funds necessary to construct the massive Valley of the Jedi as a memorial on Ruusan. Having recovered Forrth's body, the Jedi cremated the Twi'lek's remains and sent them to Ryloth, while three statues were erected in the Valley in memory of the fallen Lord. On Ryloth, members of his clan used the ashes of Forrth's corporeal form to fashion three crystal statues of their own."}, {"tag": "p", "text": "Over a millennium after his death, aspiring young Twi'lek Force-sensitive Boc Aseca found the crystal statues of Forrth on Ryloth. Using his psychometric abilities, Aseca gleaned memories of the battles at Ruusan from the statues, thus fueling his descent to the dark side of the Force. Years later, Aseca traveled to Ruusan and the Valley of the Jedi where he met Kyle Katarn in battle beneath the ancient statues of Forrth. After a fierce lightsaber duel Aseca was cut down in the shadow of the great Twi'lek Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The inspiration for Forrth's remains being shaped into three idols is from Idol Intentions in Star Wars Adventure Journal 12."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}