{"url": "Nexu", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Carnivorous creatures", "Category:Creatures of Cholganna", "Category:Creatures of Saleucami", "Category:Felines", "Category:Jungle and forest creatures", "Category:Nexu", "Category:Predatory creatures"], "nodes": [{"tag": "h1", "text": "Nexu"}, {"tag": "p", "text": "Nexu were predatory felines native to the planet Cholganna. They were also found on Zhanox and Saleucami."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Nexu were agile catlike animal predators with four red eyes and a defensive mane of sharp quills. The four eyes gave them excellent vision, with the second pair allowing them to track prey by its body heat using infrared vision. The nexu was 4.51 meters long and typically 0.94 meters tall. Nexu possessed sharp teeth and long claws, perfect for climbing trees. Their double tails were forked and whip-like. A nexu's light build allowed it to remain highly agile and difficult to hit, but also meant that it was easily hurt or even killed if struck with enough force; a single kick was enough to stun a nexu and cause significant pain."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The nexu's fierce reputation made them popular animals for gladiator matches, and Poggle the Lesser kept a nexu in the Petranaki Arena on Geonosis. The beast was used in the attempted execution of Senator Padmé Amidala prior to the outbreak of the Clone Wars. When a Geonosian guard attempted to direct the nexu with a blast from an electric pike, the creature became irritated and killed its provoker, tackling him off his mount and crushing his neck in its powerful jaws. It then found Senator Amidala, however, to be more difficult prey. Though it landed the first blow and slashed the senator across the back, injuring her, causing her to scream in pain, and ripping her outfit around her midriff and ripped off her sleeve, she returned the favor with a powerful kick which stunned the Nexu due to its weak skeletal structure; the predator was swiftly killed soon afterwards by a reek ridden by Anakin Skywalker, which rammed it head-on with its horn."}, {"tag": "p", "text": "Clone commando Tech of Clone Force 99 had a recording of a nexu among his collection of many such creature sounds."}, {"tag": "p", "text": "By the time of the war between the First Order and the Resistance, the Ithorian storekeeper Dok-Ondar had the head of a nexu mounted on a wall in his store, Dok-Ondar's Den of Antiquities, in Black Spire Outpost on the planet Batuu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The nexu that appeared in Star Wars: Episode II Attack of the Clones was nicknamed \"Bad Kitty\" by the ILM animation team."}, {"tag": "p", "text": "Robert Barnes designed the nexu; early concept sketches depicted a very lionlike creature. The nexu's final design came about when Barnes mixed feline traits with those of other species, such as reptiles and humans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}