{"url": "Ngaaluh", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Jeedai Heretics", "Category:Yuuzhan Vong priest caste"], "nodes": [{"tag": "h1", "text": "Ngaaluh"}, {"tag": "p", "text": "Ngaaluh was a female Yuuzhan Vong deception sect priestess, and loyally worshiped the goddess Yun-Harla for much of her life. During the Yuuzhan Vong War, however, Ngaaluh had her belief in the True Way eroded by an interrogation subject; the Fosh Jedi Vergere. The priestess harbored her new heresy for some time, reaching her own conclusions and coming to believe strongly in the Force and the role it could play in her species' journey."}, {"tag": "p", "text": "When she learned of the secret heretical cult operating in the bowels of conquered Coruscant, Ngaaluh traveled to meet Yu'shaa, the Prophet who led the movement, and using her respected position became his spy in the court of Supreme Overlord Shimrra Jamaane. Ngaaluh knew the Prophet to be Nom Anor, the disgraced executor, though unlike many she believed Anor to be serving the interests of his followers. In fact, Ngaaluh was used for Nom Anor's own gain; he had her frame, discredit and destroy his rivals among the Intendant caste. Unfortunately for the duplicitous priestess, Shimrra soon became suspicious of her luck in uprooting so many traitors, and had Ngaaluh investigated. When the Supreme Overlord confronted her at his court, Ngaaluh took poison and killed herself in service to the Jeedai heresy; after her death, however, the movement went on to help topple the Yuuzhan Vong Empire during the Battle of Yuuzhan'tar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The turn to heresy"}, {"tag": "p", "text": "Ngaaluh was known to be closely associated with Harrar, a fellow member of the deception sect, and was often seen in the court of Supreme Overlord Shimrra with the elder priest. In the latter months of 26 ABY, prior to the Battle of Yag'Dhul, Harrar dispatched Ngaaluh to his friend, Warmaster Tsavong Lah. Ngaaluh informed the warmaster that Vergere, a Fosh who had been the familiar of deception sect priestesses Falung and Elan, had returned to the Yuuzhan Vong. Vergere had disappeared following the failure of Elan's mission to assassinate the Jedi, and Ngaaluh oversaw the interrogation of the mysterious being in the haar vhinic, a device commonly used by the Yuuzhan Vong to extract the truth from captives. During the interrogation, however, the Fosh undermined her questioner's faith in the True Way and the Great Doctrine. Ngaaluh became convinced that the religion espoused by the priests was fraudulent, and that the Supreme Overlord and the priests could no longer be trusted as the conduit to the gods. She continued to debate such matters within herself, long after Vergere was sent back to Tsavong Lah. Ultimately, the priestess attempted to reconcile the existence of the Force with that of the True Way; she was left confused in most respects, knowing only that she was willing to lay down her life to serve the Force, which she believed to be a lingering exhalation of the great god Yun-Yuuzhan, and those who wielded it—the Jedi."}, {"tag": "p", "text": "Subsequently, Ngaaluh conspired with Vergere and the renegade Master Shaper Mezhan Kwaad, to plot the overthrow of the Yuuzhan Vong religion and caste system. In 27 ABY, she traveled to the moon Yavin 4 along with Vergere, and there, they oversaw the torture of Tahiri Veila, a captured Jedi whom Mezhan Kwaad sought to mold into a loyal servant of the Yuuzhan Vong."}, {"tag": "h3", "text": "Seeking Yu'shaa"}, {"tag": "p", "text": "As a disciple of Yun-Harla, Ngaaluh was well-versed in subterfuge and intelligence, and thus it was simple for her to locate the heretical movement thriving in the underlevels of re-shaped Coruscant. With a genuine display of piety, Ngaaluh was able to pass the screening the Shamed Ones conducted and mingle with the heretics. Yu'shaa, the Prophet of the movement, was delivering a sermon which Ngaaluh watched avidly, and she became more and more certain that this religious leader, cloaked in an ooglith masquer, was Nom Anor, a disgraced member of the Intendant caste forced into hiding following the disaster at Ebaq 9. Ngaaluh was disguised herself, her slender frame ensconced in a masquer which gave her a scarred and grotesque appearance. However, as she asked questions of Anor—questions which forced him to dig deep into his repertoire of rhetoric and specious truths—the executor realized that he was faced with a highly intelligent, articulate Yuuzhan Vong, disguised like himself and with an unknown agenda. Ngaaluh demanded to know the plans of the Prophet, and how the movement would progress further; Nom Anor saw the fiery doubt and need for purpose in her eyes and believed that she could be useful, but Ngaaluh soon disrupted the gathering as she continued to question his doctrine. When Anor realized that this acolyte was perhaps the spy he had been looking for, he bid Ngaaluh come closer. However, the priestess shocked him by revealing that she knew his identity. Unfortunately for Ngaaluh, Anor was deeply paranoid at the time, and when she reached inside her simple robe to give him an offering of an unrik, he fired his plaeryin bol from his eye socket, spitting lethal poison in her face. The moment the executor discovered her true identity and the uses the priestess could have, he administered the antidote. Anor had his aides, Kunra and Shoon-mi Esh, take the faithful priestess to a safe set of quarters and give her the best care possible. There, she gradually regained her strength and swore allegiance to Nom Anor as leader of the heresy. Although wary of the possibility that Ngaaluh was a double agent, Anor decided in any case to use her as a source of much-needed intelligence on Shimrra."}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "Ngaaluh was equipped with a villip and sent back to the court of Supreme Overlord Shimrra. In accordance with her position, the deception priestess was allowed a relatively high level of access into the Great Councils of the Yuuzhan Vong. On the first occasion of her visit to the court in this new role, however, Ngaaluh had to ask her superior Harrar to allow her into the throne room. There, she delivered intelligence on Yu'shaa, claiming that she possessed knowledge of the Prophet and his motives. Shimrra was incensed by Ngaaluh's announcement, and questioned her on the desires of the heretics. However, the Dread Lord's fury abated, and he was left to consider the ramifications of this growing heresy. Ngaaluh was allowed to act as an \"inquisitor\" of sorts, rooting out heresy for the Supreme Overlord and granting him victims to throw into the yargh'un pits."}, {"tag": "p", "text": "The priestess was soon installed by Shimrra as the leader of the movement which conducted investigations into corruption and heresy across Yuuzhan'tar. With a large number of helpers—who remained unaware of her true agenda unless they too were heretics—Ngaaluh earned a fearsome reputation among the intendants who oversaw the running of Yuuzhan'tar. Nom Anor had targeted several of his old rivals in the intendant caste for destruction, and had unleashed Ngaaluh upon them, knowing that in her new capacity as Shimrra's inquisitor she would be able to have the hapless intendants removed and killed. The deception priestess served Anor with ardent loyalty, assured that Nom Anor believed in the tenets of the heresy as much as she did, and willingly undertook her first assignment: an investigation into the affairs of Prefect Ash'ett of the Vishtu Sector. Ash'ett was an old foe from Anor's early days in the intendant caste, and while Ngaaluh regarded the framing and discrediting of the Prefect as a chance to install a loyal heretic in his place, Anor savored the chance for revenge. Ngaaluh and Anor planted heretic Shamed Ones among Ash'ett's command structure, and then had them \"uncovered\" by loyal Yuuzhan Vong."}, {"tag": "p", "text": "Once the phony evidence had been collated, Ngaaluh brought five of the captured heretics before Shimrra, and embarrassed High Prefect Drathul, a hated enemy of Anor's, by casting aspersions on the intendant caste and Prefect Ash'ett. Anor and Ngaaluh were each satisfied by the result; Ash'ett was executed along with every member of his immediate family and Drathul and the entire intendant caste fell suddenly under suspicion, much to Anor's glee. Meanwhile, Ngaaluh continued her work tirelessly, thrilled at the chance to practice the tenets of the heresy and the Jeedai by weeding out corruption among the intendants and furthering their cause. Soon, Prefect Drosh Khalii of the Geling Sector, another of Anor's former rivals, was executed on the grounds of evidence planted by Ngaaluh. However, the priestess began to worry that the tactics of the Prophet—the slow removal of lowly intendants and executors—were not sufficient in overthrowing Shimrra. Unfortunately for Ngaaluh, she never realized that Anor's goals were very different to those he espoused as the leader of the heresy. Nevertheless, the priestess mounted a campaign against another of Nom Anor's enemies, Prefect Zareb of the Numesh Sector, and planned to deliver her damning evidence to the court."}, {"tag": "h3", "text": "Discovery, death and legacy"}, {"tag": "p", "text": "Shimrra, however, was no fool, and upon the sudden revelation that two of his Prefects were heretics, had begun to conduct his own investigations—not into the heresy, but into Ngaaluh herself, who never realized what was taking place. Although Shimrra had executed the second Prefect, Drosh Khalii, he had gone on to interrogate personally the heretics planted by Ngaaluh in the Prefect's sector. Faced with the wrathful presence of the Supreme Overlord, the Shamed Ones cracked and divulged the truth of their missions. Thus, once Ngaaluh had delivered her intelligence on Prefect Zareb, Shimrra was ready. Thanking the priestess for her discoveries, the Supreme Overlord dismounted the polyp throne and walked among the Elite, questioning in turn Warmaster Nas Choka, High Prefect Drathul, Master Shaper Yal Phaath and High Priest Jakan. Eventually, having instilled a weighty sense of fear among his subordinates, Shimrra rounded upon Drathul, proclaiming that a heretic had infiltrated the highest echelons of his empire. Ngaaluh, mesmerized as everyone else was by the spectacle of a doomed High Prefect, failed to notice in time that the guards approaching to restrain Drathul were in fact encircling her. Trembling, the priestess could only watch as the massive bulk of the Supreme Overlord stalked towards her. Shimrra denounced the priestess as a fraud, though he did not reach the conclusion that she was a heretic himself; only that she had falsely incriminated several loyal supporters and that she worked for the Prophet. Before he could question her further, Ngaaluh wrestled free momentarily, long enough to take poison and die in front of the assembled mass of shocked Yuuzhan Vong. On Shimrra's orders, guards dragged her lifeless body from the throne room and hurled the corpse onto the piles of dead in a yargh'un pit; Nom Anor watched the darkening scene through the villip for some time, transfixed by the sudden reversal of his fortunes."}, {"tag": "p", "text": "Ngaaluh's heresy shocked Shimrra's court and provoked a great deal of doubt in the Supreme Overlord's tenure on power, as well as his status as a conduit to the gods. It proved that the heresy was not confined to the Shamed Ones and the workers, and had in fact spread to the highest levels of government. Shimrra became extremely vigilant of spies, and frequent sweeps of the lower levels of Yuuzhan'tar were conducted to root out the heresy. Shamed Ones were removed from positions where they might damage the Yuuzhan Vong Empire, and the Supreme Overlord was forced to reaffirm his position through the creation of the Slayers. He also tolerated the presence of the Royal Seers among his entourage to satisfy his followers. For Nom Anor, Ngaaluh's death was disconcerting; it proved that his movement remained vulnerable, and instead of feeling triumph at the apparent weakening of Shimrra's position, the executor came away from the experience believing that the Supreme Overlord remained as strong as ever, and that he would soon join her in the yargh'un pits. The loss of his spy in Shimrra's court forced him to adopt new tactics, and he began to spread rumors that a living planet would lead the heretics to salvation. In fact, the stories of Zonama Sekot had been related to him through the deceased priestess, and he corrupted them in order to retain his hold on power, as his movement was failing to grow any further. Ngaaluh's fanaticism had also made an impression on Kunra, Anor's loyal agent, and the Shamed One would later prevent Nom Anor from retreating from his role as Prophet during the last battle of the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ngaaluh was a fanatic who swore to give her life for the movement she so passionately believed in, and ultimately fulfilled that oath. Her intelligence and acumen befitted her role as a priestess of deception, and the fact that she was able to lie without showing fear in the face of the Supreme Overlord himself demonstrated considerable courage. However, the zeal with which the priestess conducted her heresy allowed her to become a tool to serve Nom Anor's purposes; Ngaaluh was naïve in her belief that Anor, a cunning and devious individual, had become a devoted religious leader. Essentially, Ngaaluh's training as a deception priestess contrasted with her impressionability and naïvete, and this mixture of character traits contributed significantly to her death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ngaaluh first appeared in The New Jedi Order: Edge of Victory II: Rebirth as an associate of Harrar's tasked with the interrogation of Vergere, an enigmatic figure in The New Jedi Order series. In The New Jedi Order: Force Heretic II: Refugee, it emerged that Ngaaluh had become corrupted by Vergere during this period, and she joins Nom Anor's heretical movement. By the time of her death towards the end of the final novel in the Force Heretic trilogy, Ngaaluh had become a character of reasonably high importance, in terms of her relationship with Anor and the insights she allowed him to obtain into the inner workings of the Yuuzhan Vong Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}