{"url": "Ni%27lyahin_Smugglers", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Smuggling organizations"], "nodes": [{"tag": "h1", "text": "Ni'lyahin Smugglers"}, {"tag": "p", "text": "The Ni'lyahin Smugglers were a group of of thieves and assassins that was active at the time of the Galactic Civil War."}, {"tag": "p", "text": "When the Rebel Alliance destroyed the Galactic Empire's Death Star in the Battle of Yavin, the explosion littered the local area of space with large and small chunks of debris. When the news of the giant battlestation's destruction broke, many rushed to the Yavin system to get their share of valueable Imperial technology. The Ni'lyahin Smugglers were one of those groups, hoping to scrounge together intact pieces of the station to sell them on the black market."}, {"tag": "p", "text": "It did not take long before the Empire established a cordon to prevent further theft. The Ni'lyahin Smugglers nonetheless stayed in the remote star system and prospered, fighting their own war against the Empire and their oppression. They gained control of various areas of space in the system, including the Ferrous Aurora Nebula and the surrounding Ferrous Aurora quadrant, which they have claimed as their own, the Smuggler's Run quadrant, the Nebulon 7 area, and the neighborhood of the destroyed space station Nova 3."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ni'lyahin Smugglers are one of various factions in the Yavin system in Sony Online Entertainment's MMORPG Star Wars Galaxies, introduced with the game's first expansion, Jump to Lightspeed. The smugglers are also mentioned on the Yavin system's Star Chart page on the official Star Wars Galaxies website, which was reprinted in the Star War Galaxies strategy guides."}, {"tag": "p", "text": "In these texts, the smugglers are first described as \"visitors\" that arrived in the system after the Death Star's explosion. But the description of the Ferrous Aurora Nebula calls it their home and then goes on to describe the nebula's inhabitants as originating from Yavin 4, \"having gained space travel later than most and only by stealing technology.\" It is unclear which account is correct, though there is no reference to such a group of smugglers originating on Yavin 4 in other sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}