{"url": "Niai_Fieso", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Con artists", "Category:Males", "Category:Merchants", "Category:Smugglers", "Category:Troiken residents", "Category:Xexto"], "nodes": [{"tag": "h1", "text": "Niai Fieso"}, {"tag": "p", "text": "Niai Fieso was a confidence trickster from Veterned, Troiken. Born into poverty, he roamed the streets of Veterned, not able to hold down a job until he found work in Freon Drevan's criminal organization as a factory worker, producing counterfeit Gasgano podracing merchandise. He was also given the opportunity to swindle innocent beings, and the way in which he acquitted himself impressed Drevan to such a degree that the young Fieso soon found himself the most valued member of the organization. Together, Fieso and Drevan entered the smuggling business."}, {"tag": "p", "text": "Fieso, however, tired of Drevan and set his elder up for a fall, alerting the authorities and leaving Drevan with tax debt. Striking out on his own, Fieso enjoyed success away from Troiken and masqueraded as an agent for Gasgano. He tried his hand at swindling the businesses of the Corporate Sector, but he soon attracted the attention of the Corporate Sector Authority. Chased out of the Corporate Sector by the Security Police, Fieso tried to lay low on the arid world of Tatooine. There, he found work as a vendor at the Mos Espa Grand Arena during the Boonta Eve Classic in 32 BBY. What Fieso did not realize was that Drevan was present in the crowd, and after a very public fight, the pair found themselves in jail, with Fieso transferred to the Corporate Sector Authority's custody."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Hailing from Veterned, the capital city of Troiken, Niai Fieso was born to a poor family. His parents could not afford an education for him, and so the young Xexto spent most of his youth roaming the city streets. He was able to find brief employment in a series of odd-jobs, but his course eventually led him into Veterned's criminal world. Fieso found himself working for the confidence trickster Freon Drevan, who ran a bootleg racket selling a variety of merchandise \"connected\" to a famous son of Troiken, the podracer Gasgano."}, {"tag": "p", "text": "Fieso's initial role in Drevan's organization was that of a factory worker, producing the merchandise for Drevan to sell. He was also given the opportunity to fleece unsuspecting citizens, and Drevan was impressed with the way in which Fieso deceived beings with his friendly demeanor. The younger Xexto quickly advanced through the ranks of the organization until he became Drevan's most trusted associate. Together, the pair expanded the organization beyond simple bootlegging and into the world of smuggling. Their cargo was, invariably, illegal wares, such as spice."}, {"tag": "h3", "text": "Lone operator"}, {"tag": "p", "text": "Eventually, Fieso tired of having Drevan as his superior, and he began plotting to be rid of the older Xexto. To begin with, he siphoned profits from their spice smuggling racket, and then tipped off the authorities as to Drevan's activities, before fleeing the system. The resulting raid ended with Devan being jailed, his business license revoked, and Fieso free to pursue his own ventures. Drevan was also left with tax debt. Fieso managed to succeed by himself as a confidence trickster, scamming naive beings and businesses for hefty profits. One of the most profitable of his schemes involved posing as Gasgano's agent."}, {"tag": "p", "text": "Taking his business to the Corporate Sector, Fieso managed to lure businesses there into \"exclusive sponsorship deals\" for Gasgano. The projected profits of the gambit would set up the Xexto for retirement, but his actions attracted the attention of the Corporate Sector Authority. One of the Authority's Attorney Generals called Fieso's bluff, and the Xexto found himself set upon by Security Police. Evading them, Fieso fled the sector with what little he still had to his name."}, {"tag": "p", "text": "In order to not attract anymore attention, Fieso traveled to Tatooine, where he intended to lay low, as he had very few credits. In the spaceport of Mos Espa, he found work as a food vendor, selling refreshments such as gorgs at the Mos Espa Grand Arena during the Boonta Eve Classic of 32 BBY. Although the job was legitimate, Fieso saw the podracing crowd as the perfect target for his scamming ways. As he searched for potential marks, he was hit thrice in the face by Drevan, who was amongst the crowd. A fight between the two Xextos broke out, and they both were thrown in jail. Subsequently, Fieso was placed in the custody of the Corporate Sector Authority."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Niai Fieso possessed a warm and friendly demeanor—at least while liberating targets of their credits. That demeanor helped Fieso rise to prominence in Freon Drevan's organization, and he advanced quickly through the ranks because of it. However, Fieso was an ambitious being, and he did not hesitate in swindling his own boss. He even sold Drevan out to local authorities so he could work as a lone operator. For a while, his skill gave him success as a con-man, but when trying to take on the Corporate Sector, he found himself out of his depth. Although he attempted to settle down and lay low, even while working in a legitimate job he found himself wanting to swindle innocent beings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Niai Fieso first appeared, unnamed, in the DVD release of 1999's Star Wars: Episode I The Phantom Menace, in a shot not included in the original theatrical release, during the film's podracing sequence. In 2007, the character was identified and given a story by Sander de Lange, writing as \"exarxan\" through the StarWars.com Hyperspace feature, \"What's The Story?\" For the character's name, de Lange used anagrams of two of his friends' names: \"Iain\" and \"Sofie.\" Searching for possible connections to the character, de Lange looked up other existing Xexto in the Expanded Universe, finding two suitable candidates: Tosinqas from HoloNet News Vol. 531 53, and Freon Drevan, identified in the \"Coruscant Limited\" set of the Star Wars Customizable Card Game. De Lange used Tosinqas in a second \"What's The Story?\" entry he sent in and opted to connect Drevan to his Fieso story."}, {"tag": "p", "text": "Drevan's card in \"Coruscant Limited\" mentioned a \"partner\" who scammed the character, leaving him with tax debt. de Lange opted to retcon his character into that role. The phrasing \"right-hands Xexto\" from the finished Databank entry de Lange attributed to Timothy Carlsson, who helped polish the submission. De Lange tied the character to the Corporate Sector from Brian Daley's 1979 novel, Han Solo at Stars' End, as he intended to have his character incarcerated in the Stars' End prison. The reference was cut from the final entry, as it was too early chronologically for the prison to have existed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}