{"url": "Nibiru_Chamas", "categories": ["Category:Canon articles", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nibiru Chamas"}, {"tag": "p", "text": "Nibiru Chamas was a male individual who served as a commander in the Galactic Empire's Navy while he was in his forties. He served alongside the Imperial Captain Rae Sloane during the Gorse conflict, which ended with the death of the Imperial Count Denetrius Vidian and Baron Lero Danthe securing control of the thorilide industry in the Gorse system."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Escorting Count Vidian"}, {"tag": "p", "text": "Nibiru Chamas was an Imperial commander during the Age of the Empire. Nine years after the establishment of the Galactic Empire, he served on board the Imperial-class Star Destroyer Ultimatum under acting-Captain Rae Sloane as it traveled to the planet Gorse. Upon arriving in the Gorse system, the Star Destroyer narrowly avoided a collision with a passing freighter named the Cynda Dreaming, after which Sloane ordered that local pilots avoid them. The order was belayed by the industrialist Denetrius Vidian, who was being transported on board the Ultimatum, and claimed the Imperials should avoid the locals as to not slow industrial progress. Sloane ordered Chamas to back their ship a kilometer away from all commercial traffic lanes and monitor all traffic."}, {"tag": "p", "text": "Vidian then fed the output of a command console directly into his optical implants and began monitoring the local traffic directly. While the industrialist was busy, Chamas began talking quietly with Sloane about rumors they had heard about Vidian, although the cyborg overheard and told them to stop wasting time. He then ordered Chamas to have the gunnery crew fire on the Cynda Dreaming, as it was slowing traffic due to damage. After checking with Sloane, Chamas gave the order and the vessel was obliterated."}, {"tag": "p", "text": "Chamas and Sloane remained aboard the Ultimatum while Vidian toured Gorse's moon Cynda, where the Empire had substantial thorilide mining operations. Later, Vidian decided to change his itinerary and visit the planet Gorse itself. On the eve of the planned tour, Chamas and Sloane discussed their impressions of the workaholic cyborg; who had implemented a series of ruthless measures designed to speed up economic production in the Gorse system. During their conversation, he reported that Vidian had designednew traffic patterns for cargo ships traveling between the two worlds and that he had changed the loader droids' subroutines on Cynda to make them more efficient. Chamas also joked that Vidian had changed the color of the plates used in the communal mess hall."}, {"tag": "p", "text": "Chamas also informed Sloane that Vidian had ordered a review of the surveillance company Transcept Media Solutions's personnel and ordered the arrest of one staff member for \"suspicious activity.\" While discussing Vidian's planned tour of Gorse, he mentioned that the Count had reorganized three guilds, merged several equipment manufacturers into one firm, and even shut down a medcenter. Unknown to the Imperial officers, Vidian had shut down the medcenter in order to conceal his past as the safety inspector Lemuel Tharsa; who was reportedly still alive and listed as a mining consultant in the Ultimatum's manifest. Chamas also reported that Vidian had been frequently contacting his main office on Calcoraan Depot and that the cyborg never slept. He informed Sloane that Vidian had wrecked his personal quarters; leading the two to conclude that Vidian had a fit of rage."}, {"tag": "p", "text": "The two then discussed Vidian's purported background as a Corellian shipbuilding engineer who had contracted Shilmer's syndrome before rebuilding his life as a management guru and businessman. Believing that Vidian was connected to the shipbuilding sector and the Admiralty, Chamas asked Sloane whether the Count could make her posting on the Ultimatum permanent by giving the ship's Captain Yale Karlsen a cushy job in one of his subsidiaries. When Sloane asked why Vidian was choosing to begin his tour at the small refinery Moonglow Polychemical, Chamas briefed the Captain that it was the same company that had captured and lost the rogue miner Skelly several hours ago. The two made an agreement to protect Vidian while demanding royalties from his next biography."}, {"tag": "h3", "text": "Vidian's gambit"}, {"tag": "p", "text": "Commander Chamas stayed aboard the Ultimatum while Captain Sloane accompanied Count Vidian on his tour of Moonglow Polychemical's refinery. Despite security precautions put in place by both Sloane and Moonglow, Skelly managed to infiltrate the factory and tried to convince Vidian not to mine Cynda because the moon's surface was delicate. Vidian attacked Skelly, who then made two attempts to assassinate the Imperial efficiency expert. Skelly managed to escape with the help of the rebel Hera Syndulla and the freight pilot Kanan Jarrus; a survivor of the Great Jedi Purge. Using Skelly's research, Vidian decided to cut his tour short and return to the Ultimatum."}, {"tag": "p", "text": "Abandoning his planned tour of Gorse's other refineries, Chamas wanted to destroy Cynda under the pretext of making it easier to harvest the planet's thorilide reserves and meeting the Emperor's new thorilide quota.Using his phantom consultant \"Lemuel Tharsa\" to fake a controlled bombing test result on Cynda, Vidian managed to convince Captain Sloane and her science officer Lieutenant Kanna Deltic to support his plan. Sloane then diverted all mining cargo ships in the Gorse system to travel to the Calcoraan Depot where Vidian had large stores of Baradium-357; an explosive matter that the Count planned to use to destroy Cynda."}, {"tag": "p", "text": "During the journey, Chamas remained aboard the Ultimatum's bridge when Captain Sloane led the mining fleet to the Calcoraan system. He was perturbed about Deltic's callous remarks about the devastation on Gorse that would be caused by Cynda's destruction. Once Deltic had left the bridge, he described her as \"Lieutenant Stangechild\" and informed Sloane that she had received an important call from Baron Lero Danthe. Danthe was Vidian's business rival and had secretly recruited Chamas' services as an informant. In his capacity as first officer, Chamas supplied information on Vidian's plans and operations."}, {"tag": "p", "text": "While Sloane visited Vidian's Calcoraan Depot, Chamas stayed aboard the Ultimatum where he monitored the loading of the cargo freighters. Meanwhile, his commanding officer and Vidian were accosted and immobilized by the rebels Kanan, Hera, Skelly, and Zaluna Myder; the latter a former Transcept employee who had agreed to help the rebels after her dismissal. While Vidian was unconscious, Kanan informed Sloane that Vidian had falsified the test results to show that Cynda's thorilide reserves would not disintegrate after the moon's destruction. The original report stated otherwise. Vidian wanted his comet-mining business to benefit from the temporary boom and to discredit Sloane and his rival Danthe when Cynda's thorilide reserves ran out."}, {"tag": "p", "text": "Since Vidian's actions endangered Imperial strategic assets, Sloane returned to the Ultimatum where Chamas arranged a secure connection with Baron Danthe, using the contact information the latter had provided. While it was outside protocol to involve a civilian in a security matter, Danthe was the only person who had a hope of directly reaching the Emperor or his minions. After Vidian awoke, the Imperials and the mining fleet returned back to the Gorse system. While cognizant of Vidian's deception, Sloane and Chamas perpetuated the ruse of pretending to assist Vidian's plan."}, {"tag": "p", "text": "During the mining fleet's return journey to the Gorse system, Chamas served on the bridge of the Ultimatum alongside Captain Sloane. Before Vidian could put his plans into action, the rebels managed to disrupt the loading process and board his ship, the Forager. Chamas was present during the skirmish and informed Sloane when she received a \"priority-one\" message from the Emperor ordering her to stop the planned detonation of Cynda. In Sloane's absence, Chamas supervised the efforts to linkup the Ultimatum to Forager's detonation control. After Sloane's return, Chamas along with Baron Danthe were present when Sloane ordered her crew to rescind the Detonation Control link to Forager and issued orders for Vidian's arrest."}, {"tag": "p", "text": "When the Count defied Captain Sloane and revealed that his crew could remotely restore the Detonation Control link, Sloane ordered her forces to attack Vidian's ship and crew. Chamas witnessed the Ultimatum and the Imperial fleet's bombardment of the Forager. This bombardment ended Vidian's plot to destroy Cynda. The Count himself was killed by a vindictive Skelly while the other rebels manged to flee in an escape pod."}, {"tag": "p", "text": "Following Vidian's death, Commander Chamas and Captain Sloane attended a formal ceremony to celebrate the opening of Gorse's sunward side to thorilide mining. Vidian's rival Baron Danthe was granted control of all mining operations in the Gorse system and decided to use his companies' heat-resistant mining drones. Cynda was also declared a natural sanctuary. In addition, Sloane was given permanent Captaincy of the Ultimatum. Chamas was visibly disappointed that he had been passed over for promotion again and did not speak with Sloane during a party held to celebrate Danthe's mining project."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Chamas loved to gossip, and because of this had been leap-frogged for promotion by younger officers several times. He was shocked when Vidian ordered that the Cynda Dream be destroyed for holding up traffic, but followed the order once it was confirmed by Sloane. In his capacity as first officer, Chamas used his position to help his friend Baron Danthe spy on his rival Count Vidian and investigate his deceptive practices including his phantom consultant \"Lemuel Tharsa.\" Chamas's decision to serve as Danthe's informant was motivate by personal enrichment. He was visibly unhappy when he was passed over for promotion by Sloane, who became the permanent Captain of the Ultimatum due to her role in foiling Vidian's plot to scam the Emperor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nibiru Chamas first appeared in A New Dawn a 2014 novel written by John Jackson Miller and the first in a new line of Canon novels. Chamas was a secondary character whose lines are told through the point of view of Rae Sloane, a secondary character in the novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}