{"url": "Nicandra_sector", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Mid Rim sectors", "Category:New Republic sectors", "Category:New Territories sectors", "Category:Nicandra sector"], "nodes": [{"tag": "h1", "text": "Nicandra sector"}, {"tag": "p", "text": "The Nicandra sector was a Mid Rim sector that contained the Ilimardon, Melus, Nicandra, Octavia, and Yde systems. By 12 ABY, it was a part of the New Republic, whose fleet carrier Endurance traveled through the sector that year to fight against the forces of the Imperial Remnant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Nicandra sector was located in the New Territories portion of the Mid Rim. By 0 ABY, it bordered the Shiwal sector Coreward, the Bright Jewel sector spinward, the Kordu and M'shinni sectors Rimward, and the Hollan sector in the trailing direction."}, {"tag": "p", "text": "The westernmost section of the Nicandra sector contained the Nicandra, Octavia, and Yde systems, while the Ilimardon and Melus systems lay in the more eastward portions of the sector. A hyperlane ran through the Ilimardon and Nicandra systems, connecting the sector to the Hollan and Kordu sectors. Another hyperspace route, running through the Hollan and M'shinni sectors, also passed through the Nicandra system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 12 ABY, the Nicandra sector fell within the borders of the New Republic. That year, the New Republic dispatched the fleet carrier Endurance to fight against the forces of the Imperial Remnant. To that end, the Endurance traveled from the Mapuzo system in the Hollan sector to the Kordu sector's Korvaii system, passing through the Nicandra sector in the process."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Yde system contained the astronomical object of the same name, while the Octavia system was the origin point of the Octavian fruit pudding. The Melus system shared its name with the 900 BBY conflict Melusi Uprising, and the Nicandra system was the eponym for the Nicandra Plaza and the Nicandra Counterrevolutionary Signalmen's Memorial Building, both located on the Core Worlds planet Coruscant. The Ilimardon system was the site of the planet Ilimardon, which was governed by the Regal Hierarchy and maintained a fleet of starships."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nicandra sector was established in the StarWars.com Online Companion to the 2009 reference book The Essential Atlas, which was written by Daniel Wallace and Jason Fry. In 2012, the sector was depicted on a map designed by Modi and published in the Online Companion feature \"Essential Atlas Extra: Sectors of the Mid Rim.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}