{"url": "Nichos_Marr", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Engineers", "Category:Humans", "Category:Jedi Purge survivors", "Category:Jedi trainees of the Jedi Order", "Category:Jedi trainees of the New Jedi Order", "Category:Males", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Nichos Marr"}, {"tag": "p", "text": "Nichos Marr, a Human male, was a Jedi trainee at the Jedi Temple on the galactic capital of Coruscant during the last days of the Galactic Republic. With the emergence of the Galactic Empire and the beginning of the Great Jedi Purge in 19 BBY, Marr was among a group of students who went into hiding in the enclave of the Ho'Din Jedi Master Plett, which was located on the planet Belsavis. Galactic Emperor Palpatine, however, discovered the group, and in 18 BBY he commissioned the colossal dreadnought Eye of Palpatine to destroy them. When the vessel failed to arrive because of Jedi sabotage, Palpatine sent a backup force of starfighters to finish the task. The Jedi repelled the attack, but had to evacuate from Belsavis, taking separate paths."}, {"tag": "p", "text": "Marr eventually became an artificial intelligence programmer at the Magrody Institute and fell in love with his colleague, Cray Mingla. The two joined Jedi Master Luke Skywalker's Jedi Praxeum on Yavin 4 in 11 ABY, where Marr trained for about a year before being struck with a fatal disease, Quannot's Syndrome. Mingla tried to save his life by transferring Marr's consciousness into a droid body using Ssi-ruuk technology, but she was unable to do so, as the droid Marr turned out to be just that—a droid, while the real Marr had died. Willing to rejoin Marr in the afterlife, Mingla later sacrificed her life to destroy the reactivated Eye of Palpatine and save Belsavis from its impending attack."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born at some point before 19 BBY, Nichos Marr was a Human male Jedi trainee at the Jedi Temple on the galactic capital of Coruscant during the waning days of the Galactic Republic. After the Republic was reformed into the Galactic Empire and the Great Jedi Purge began, Marr was among a group of Jedi children who fled to the planet Belsavis and found refuge with the Ho'Din Jedi Master Plett in his compound, which consisted of a house and a series of underground tunnels. On Belsavis, Marr and the other children were cared for by the Ho'Din Brigantes Ustu and a young woman named Margolis Mingla. Plett also took precautions to protect the children, shielding a number of tunnels with mental barriers that induced dread in those that approached, and warning the children to stay away from the tunnels because of the dangerous Kretch insects that lived there. Marr and other children, including Lagan Ismaren and Hoddas Umgil, often played in the compound, daring each other to go to the forbidden tunnels to search for the city of Plett's Well."}, {"tag": "p", "text": "In 18 BBY, Galactic Emperor Palpatine commissioned the massive asteroid-shaped dreadnought Eye of Palpatine to wipe out the Jedi community on Belsavis, but the ship failed to arrive, having been sabotaged in the Moonflower Nebula by the Jedi Knight Callista. In response, Palpatine ordered a backup wing of starfighters to destroy Plett's enclave. The Jedi defeated the Imperials by using Y-wings and then left Belsavis, erasing the memory of their presence from the local Mlukis' minds and going separate ways. Remembering little from his childhood on Belsavis, Marr went on to become one of the most brilliant artificial intelligence programmers at the Magrody Institute of Programmable Intelligence. At the institute, he met and fell in love with a fellow scientist, Cray Mingla; unbeknownst to Marr, she was the daughter of Margolis Mingla, who had taken care of him on Belsavis. Soon enough, the two became engaged. In 11 ABY, Marr sought to be tested for sensitivity to the Force, and arrived at Jedi Master Luke Skywalker's newly established Jedi Praxeum on Yavin 4, accompanied by Mingla. Skywalker confirmed that they both were Force-sensitive, and the two started training at the Praxeum."}, {"tag": "p", "text": "Marr was not the most powerful of Skywalker's students, but he proved himself to be a very steadfast learner and one that Skywalker was proud of. When Marr tried to maneuver an edged weapon with the Force for the first time at the Academy, he failed, and the weapon left a scar on the little finger of his right hand. Marr trained for about a year at Skywalker's Academy until he was diagnosed with the fatal Quannot's Syndrome, an inexplicable degenerative decay of the nervous system. Mingla spent many nights on Yavin researching, looking for a way to save her lover. As Marr was hospitalized on Coruscant and his life quickly faded away, Mingla decided to try to use forbidden Ssi-ruuk entechment technology to transfer Marr's life energy into a droid body. She personally designed a droid carcass to house Marr's essence, while the technicians of the biomedical institute on Coruscant replicated Marr's face and hands to the tinniest detail—complete with the scar and a birthmark on his right hand—creating prostheses which fitted perfectly into the droid body. Soon, Mingla performed the entechment procedure. The droid came to life and was seemingly indistinguishable from the real Marr, leading Mingla to believe that she had succeeded and had saved her fiancé from certain death."}, {"tag": "p", "text": "In reality, the transfer had not worked as planned—the real Marr had succumbed to the disease and died during the procedure, while the droid turned out to be nothing more than a machine programmed with Marr's memories and mannerisms. When Mingla realized this aboard the reactivated Eye of Palpatine six months later, she decided to sacrifice her life in order to destroy the dreadnought—which was due to arrive at Belsavis and attack Plett's Well—and to be reunited with her lover in death. Mingla exchanged places with Callista, whose essence had been trapped in the Eye's computer for many years. Callista transferred her spirit into Mingla's body and escaped from the dreadnaught, while Mingla occupied the computer and destroyed the ship with the droid Marr's help; both perished in the explosion. By 25 ABY, Skywalker had established gray memorial plinths in a grove on Yavin IV, one for each of his deceased students, including Marr."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nichos Marr possessed great knowledge in the area of artificial intelligence and was considered one of the Magrody Institute's best specialists in that area. As a Jedi, he was determined to use the Force responsibly and correctly, and he spent a lot of time in training. Marr deeply loved Cray Mingla, and she returned those feelings, going to great lengths to try to save Marr's life. Marr had blue eyes."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Nichos Marr was not very adept at using the Force, but Luke Skywalker respected his determination to learn. Marr's first attempt at using telekinesis resulted in him receiving the scar on his right hand."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Barbara Hambly created Nichos Marr for her 1995 novel Children of the Jedi. Marr later received an entry along with his first visual depiction in The Essential Guide to Characters and was briefly mentioned in several other novels and reference books. In Children of the Jedi, Marr appears in his droid form, and the question of whether he is a man or a machine is raised throughout the novel numerous times, until in the end it is finally established that Marr is, in fact, a droid. Due to this revelation, the real Marr never actually appears in Children of the Jedi, but is rather only mentioned by other characters. Some sources, such as The New Jedi Order: Force Heretic II: Refugee and The Complete Star Wars Encyclopedia, however, still erroneously imply that the real Marr and the droid were the same person. The eponymous Children of the Jedi in Hambly's novel were originally thought to be offspring of Jedi Knights of the Galactic Republic. However, with the release of the prequel trilogy and its ban on Jedi marriage, this has been retconned, with The New Essential Guide to Characters establishing that they were trainees from the Jedi Temple on Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}