{"url": "Nico_Okarr", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance individuals", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Nico Okarr"}, {"tag": "p", "text": "Nico Okarr was a male Human smuggler captain who achieved great fame in the years before the start of the Great Galactic War. He was captured during a smuggling run on the planet Korriban in 3681 BBY, but played a pivotal role in helping Satele Shan and Jace Malcom escape the returned Sith Empire's subsequent attack. He escaped custody shortly afterward and seemingly vanished, but thanks to an artifact he found on Korriban, Okarr survived for decades without aging a day. In 3631 BBY, he was recruited to aid the Alliance against the Eternal Empire, looking no older than he did almost half a century earlier."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nico Okarr was one of the most celebrated mercenary spacers in the Outer Rim Territories in the years before the return of the Sith Empire and the start of the Great Galactic War. His debts were as legendary as his deeds, leading Okarr to take the most high-risk and even-higher-reward jobs available in the underworld. No matter the odds, he always delivered the goods, and every criminal syndicate from the Hutt Cartel down competed for his services. At some point he stole engine schematics from a Valahari noble to sell to his competitor and used them to upgrade his XS stock light freighter Redshifter in process."}, {"tag": "p", "text": "In 3681 BBY, an astromech droid T7-O1 was assigned by Jedi Master Ven Zallow to work undercover as Okarr's co-pilot and mechanic. While attempting to smuggle Sith artifacts off the Sith homeworld of Korriban, Okarr and Teeseven were captured by Republic forces over the planet. The Republic arrested Okarr and impounded the smuggler's ship the Korriban's orbital security station. However, Okarr's transfer to a holding cell by Zabrak Jedi Master Kao Cen Darach, his Padawan Satele Shan, and two Republic troopers was interrupted by the arrival of the Sith Empire. A massive fleet arrived in-system and launched an offensive against the station, intending to retake their homeworld. When the Jedi Master decided that the Galactic Republic needed to be warned of the Sith's return, Okarr volunteered the Redshifter to help them escape and used his two custom blaster pistols to help the Jedi fight off the Sith. After they defeated the Sith troopers guarding the hangar, two Sith Lords named Vindican and Malgus arrived. While the Jedi confronted the Sith, Okarr and Jace Malcom, the only remaining Republic trooper, prepared the ship for departure. The smuggler instructed Teeseven, who had been on-board the ship performing maintenance, to prepare the ship's weapons in preparation for their escape. While Master Darach stayed behind to duel the Sith, his Padawan Satele Shan boarded the ship as it was taking off under the orders of her Master. Okarr then told Shan and the trooper to mount the laser turrets to defend against the Sith interceptors. After precisely maneuvering through a Sith battlecruiser, Okarr activated the ship's hyperdrive and jumped to hyperspace to make their escape."}, {"tag": "p", "text": "Okarr delivered Shan, Malcom and T7-O1 to warn Coruscant of the danger, after which he promptly escaped custody again and his trail went cold. With no sightings of him in decades, everyone eventually assumed that Okarr had died, though there was no official record of it. At some point Nico Okarr settled on a \"vacation\" on Molavar, spending his time in the Sarlacc and Loaded cantina under alias \"Snare\". Eventually, he was approached there by Seamus Kaldo and his bodyaguard Vhonu, who were looking to hire \"Snare\" to help them locate Nico Okarr and extract vengeance on him for stealing schematics from Kaldo's father many years ago. After confirming that Kaldo had the money on his person, \"Snare\" accepted the job and revealed himself as Nico Okarr, asking his payment for delivering the target to Kaldo's table. Having no intentions to pay the man that he was going to bring to justice, Kaldo asked his bodygard to stun Okarr, but Nico saw this a breach of contract and shot both men on stun setting. He then retrieved his payment from Kaldo's unconcious body and departed Molavar, abandoning \"Snare\" as the alias."}, {"tag": "p", "text": "By 3631 BBY, almost fifty years after being last seen in the larger galaxy, Nico Okarr was touring the cantinas in the Spire, the capital city of the Unknown Regions planet Zakuul. Rumours of his stay there reached smuggler captain Hylo Visz who was a member of the Alliance that opposed Zakuul's Eternal Empire. Visz asked the Alliance Commander to investogate the rumours, who managed to track down and approach Nico Okarr in the Platform 6 cantina in Zakuul's Old World. The smuggler recognized the famous galactic figure, but was unable to remember their name on the spot. He was then inquired about how he managed not to age in almost half a century and implied that a relic from Korriban might be involved. Okarr than asked his potential employee to make him a drink to show their character. Approving of their choice of ingridients, Okarr agreed to work for the Alliance and piloted Redshifter to the Alliance base on Odessen. There, he worked alongside underworld logistics specialist Hylo Visz and later helped defend the Alliance base during the Assault on Odessen by Eternal Empress Vaylin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nico Okarr first appeared in Return, a cinematic trailer made to advertise Star Wars: The Old Republic, a 2011 massively multiplayer online role-playing video game by BioWare, where he is voiced by the veteran voice actor John DiMaggio. The circumstances of his appearance in the trailer were elaborated by Star Wars: The Old Republic Encyclopedia and The Journal of Master Gnost-Dural, which also revealed his name for the first time. Nico Okarr later appeared in the Knights of the Fallen Empire expansion of the game, released in 2015, as a companion character available exclusively to players who were active subscribers on August 10, 2015. Nico Okarr was later made available for players who were subscribed on April 3, 2018. The character has also since then been made available to all players as part of Galactic Season 1, following the release of Update 6.3 \"The Dark Descent\"."}, {"tag": "p", "text": "His appearance in the game matches that from the Return trailer, despite taking place almost fifty years later, his improbable age is also mentioned in the Vacation short story released on the game's website. The player has the option to ask Nico Okarr about the secret of his good look, in response to which he mentions the relic he found on Korriban, but does not elaborate on specifics.[source?]"}, {"tag": "p", "text": "The 2014 Canon mobile game Star Wars: Commander has artwork of a Tatooine cantina that displays several outlaw patrons, including a Human who resembles Nico Okarr."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}