{"url": "Nigel_VI", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Kira sector planets", "Category:Nigel VI locations", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Nigel VI"}, {"tag": "p", "text": "Nigel VI was a planet in the Nigel system of the Expansion Region, and was the site of a little-known Human colony. The planet was somewhat cold, with glaciers, plains, and large polar ice caps among the dominant topographical features. Nigel VI was governed by a local republic that chiefly focused on combating crime. The planet did not establish trade connections with the rest of the galaxy until around the time of the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nigel VI was located in the Nigel system of the Kira sector, part of the Expansion Region. It was one of many worlds along the Enarc Run, a trade route that ran from the Enarc system to the Vondarc system. Nigel VI was a cold world with large polar ice caps, covered in glaciers and plains, and its atmosphere was breathable for most species. A local year was 325 days long, with each day consisting of 20 standard hours. The capital city of Nigel VI was Nargo."}, {"tag": "p", "text": "The planet was governed by a local republic with a large focus on combating crime. As a consequence, the planetary laws were somewhat strict and visiting starships were thoroughly inspected. Laws concerning the unauthorized export or possession of lexonite—a native poisonous substance popular among terrorist groups—were especially harsh, with any infractions punished by immediate execution. Most of Nigel VI's imported goods fell into the category of high technology, while the chief export was the planet's own natural resources."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, a Human colony was established on Nigel VI, but the planet remained fairly unknown to the rest of the galaxy. Over the years, crime grew to be a large irritant to the settlers. A local republic was established to combat the issue; an endeavor at which it proved quite successful. Nigel VI did not partake in interplanetary trade until around the time of the New Republic."}, {"tag": "p", "text": "Following the fall of the Galactic Empire, lexonite became a favored poison among terrorists sympathetic to the Imperial cause. One such group arranged for the illegal export of a shipment of the substance through Und'l, a Buzchub smuggler. Und'l, in turn, hired a group of spacers to handle the actual transport of the lexonite."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The majority of Nigel VI's population were members of the galaxy-spanning and numerically peerless Human species."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Nargo"}, {"tag": "p", "text": "Nargo was the capital of Nigel VI. In accordance with the planetary government's focus on fighting crime, security was a priority for the city."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nigel VI was created for Twin Stars of Kira (1993), a roleplaying game supplement published by West End Games. Aside from a brief list entry for the Nigel system in The Essential Atlas (2009), the planet has not been mentioned in any other Star Wars products."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}