{"url": "Night-Soarer", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Avian and airborne sentient species", "Category:Mid Rim species", "Category:Night-Soarers"], "nodes": [{"tag": "h1", "text": "Night-Soarer"}, {"tag": "p", "text": "The Night-Soarers were a sentient species from the planet Tyluun. They were bipedal in form, and large wings extended from their ribcages and arms, making them capable of independent flight. Night-Soarers earned a reputation in the galaxy as assassins through their stealth and cunning. Some Night-Soarers participated in gladiatorial games, such as the Tandem Open on Jervo's World or death matches aboard The Wheel."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Night-Soarers were a sentient species, of either blue or brown skin pigmentation. They had pointed ears and a bald head with a central cranial projection. The Night-Soarers were bipedal in form, and their arms ended in five-fingered hands that were tipped with sharp claws. Their most distinguishing characteristic was a pair of membranous wings formed by webbing that extended from their ribcages. For some Night-Soarers, these wings extended out to about the elbow, whereas for others, the wings extended well beyond their wrists. These wings were strong enough for the Night-Soarers to achieve independent flight."}, {"tag": "p", "text": "Some Night-Soarers wore garments only on their lower half, while others also wore armless tunics. They were capable of speaking Galactic Basic Standard."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "The Night-Soarers originated from Tyluun, a gloomy planet located in the Juvex sector of the Mid Rim. They were part of the wider galaxy by as early as 3963 BBY. In that year, two Night-Soarers competed in the Tandem Open on Jervo's World, a space station orbiting Pantolomin. The Tandem Open was one of the feature events at the station, in which all competitors were airborne; working in pairs, they attempted to defeat all other opponents using non-lethal weapons, until only two participants were left standing in each heat. Those two survivors then progressed through to the next round. One of the Night-Soarer players was knocked out in the semi-final round while trying to eliminate two other players—a Mandalorian going by the name of \"Spikes,\" and Goethar Kleej, a Gotal veteran of the competition—who were fighting each other on the ground. The Night-Soarer and his jetpack-using partner approached them from the air, believing them to be too distracted to notice their arrival; however, Goethar and Spikes saw them coming and shot them both out of the air, eliminating them from the event."}, {"tag": "p", "text": "The second Night-Soarer—considered to be among the meanest Franchise players in the competition—survived through to the final. For that round, the organizers had a vested interest in ensuring certain finalists were eliminated: Goethar and his son Aubin, who was trying to expose the inhumane training and recruitment practices behind the franchise running the tournament, as well as Spikes and Zayne Carrick, against whom one of the organizers, Jervo Thalien, carried a grudge. In order to facilitate those players' elimination, the organizers soaked the Night-Soarer's claws in venom. He then proceeded to attack Goethar directly while the Gotal was riding his swoop. However, when Goethar accelerated into his attacker, the Night-Soarer was pinned to the front of the vehicle as Goethar crashed through one of the windows overlooking the course. The Night-Soarer was eliminated from the Tandem Open, with Spikes eventually declared the winner."}, {"tag": "h3", "text": "Republic Dark Age"}, {"tag": "p", "text": "During the Republic Dark Age, large numbers of Night-Soarers served in Sith Lord Malakite's Menagerie forces. The technology-hating Sith Lord bred them in large numbers since his strategy involved using large waves of organic troops to overwhelm technologically-superior enemies. They saw action during the Second Battle of Skarpos where they ferried Malakite's Mutate soldiers."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "By the time of the Galactic Civil War, Night-Soarers had earned a reputation throughout the galaxy as cunning and stealthy assassins, making them invaluable to the criminal underworld. In 0 ABY, a Night-Soarer participated in a death duel aboard The Wheel, a space station and gambling haven located in the Besh Gorgon system of the Mid Rim. Held in a zero gravity arena filled with explosive planetoids, the Night-Soarer was one of the last four surviving gladiators. Knowing that two of the other competitors—a smuggler Han Solo and his Wookiee companion, Chewbacca—would work together, the Night-Soarer hid behind a planetoid, waiting to strike when they were committed to attacking other opponents. When it appeared that Chewbacca had struck down Solo, the Night-Soarer moved in on the Wookiee from behind, wanting to get close enough to ensure a clean kill. His plan failed, however, when Solo—only faking his own death—signaled to the Wookiee that the Night-Soarer was approaching. Chewbacca spun around, shooting the Night-Soarer with his blaster and killing him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Night-Soarer species first appeared in two successive issues of the Star Wars comic series published by Marvel Comics in 1979. The two issues, Star Wars 22 and Star Wars 23, were written Archie Goodwin and penciled by Carmine Infantino. Following this, the Night-Soarers were absent from Star Wars continuity for almost 30 years, until receiving an entry in The Complete Star Wars Encyclopedia, which clarified the correct capitalization; prior to this the species had only been spelled all in capitals."}, {"tag": "p", "text": "The next year, Night-Soarers appeared in two successive issues of the Knights of the Old Republic comic books published by Dark Horse Comics in 2009. These two issues, Knights of the Old Republic 40 and Knights of the Old Republic 41, were written by John Jackson Miller and penciled by Brian Ching. In his production notes for issue 41, Miller reveals that this story arc was in part a tribute to the work of Goodwin, hence the re-appearance of the Night-Soarers as well as other elements such as a Mandallian Giant and the spectator riot that occurs at the close of the comic."}, {"tag": "p", "text": "Night-Soarers also appeared in Knight Errant: Escape 3 and Knight Errant: Escape 4, the thirteenth and fourteenth issues of Star Wars: Knight Errant: Escape, which were released on August 8 and September 12 2012. In this story arc, they appeared as minions of the Sith Lord Malakite, a lesser antagonist within the series. Their story plot was also written by Miller and they were penciled by Marco Castiello."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}