{"url": "Nightbrothers/Legends", "categories": ["Category:Legends articles", "Category:Culture of Dathomir", "Category:Dark side organizations", "Category:Nightbrothers", "Category:Shadow Collective organizations", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Nightbrothers"}, {"tag": "p", "text": "The Nightbrothers were a tribal group of Dathomirian Zabrak men subservient to the Nightsisters. They lived in a village on the far side of the planet Dathomir. The infamous Darth Maul, apprentice to the Dark Lord of the Sith Darth Sidious, was born a Nightbrother. They were all Force-sensitive."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Nightbrothers spent most of their lives training in their village, learning to fight with axes, daggers, and spears, or even their bare hands. They were divided into several tribes, all of which were overseen by the same leading Brother—around 21 BBY, Brother Viscus held this position."}, {"tag": "p", "text": "The full-body tattoos covering many Dathomirian men were considered to be the traditional markings of a warrior. The facial markings were considered the equivalent of the blemishes left by the bursting of blood vessels on the faces of the Sisters. Those who had proved their worth in the arena of the Crucible were allowed to wield powerful weapons infused with Nightsister magic, and were granted cuffs and shoulder armor."}, {"tag": "p", "text": "Sometimes, the Shaman of the Nightsisters would select a gifted Nightbrother and empower him with dark energies. With the help of a full coven of crafters, the shaman injected the energies of the Spirits into the Brother's bone and muscle, turning him into a warrior behemoth. Transformed Dathomirian Zabrak were a head taller, with a broad chest, strong arms and a full crown of sharp horns."}, {"tag": "p", "text": "In her instructional treatise known as Wild Power, Clan Mother Talzin wrote the Nightbrothers were powerful warriors but lacked the ability to balance the conflicting energies of the Twin Gods. According to her, males were simpler and more beastlike than females."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Decades prior to the start of the Clone Wars, a small group of male Zabrak were brought from Rattatak during a pirate raid. The Human Nightsisters discovered they could interbreed with those Zabraks, leading to the creation of the hybrid species known as the Dathomirians. The witches isolated their new slaves to a small area of the planet where they could draw from them at whim. While the Nightsisters had always kept \"malelings\" as labor units or mating partners, the Shaman of the Nightsisters Talzin restricted the use of males to the Zabrak Nightbrothers after becoming the leader of all Nightsister covens. She also thought it was best to keep them separated from the Sisters."}, {"tag": "p", "text": "The Sith Lord Darth Maul was a member of the Nightbrothers before being taken by Darth Sidious to be trained as his apprentice. During the Clone Wars, the Nightsisters trained Savage Opress, who was Darth Maul's blood brother, to be Asajj Ventress' replacement as Count Dooku's apprentice. Ventress saw the Nightbrothers as \"adequate fighters\" but felt that they were \"ill-served in isolation\"; it was her opinion, contrary to Mother Talzin's view, that they could learn and achieve much more \"under the direct tutelage of a Nightsister.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Maul's full-body markings were originally Sith tattoos personally applied by Darth Sidious, but were later retconned into being a tradition of his tribe, the Nightbrothers, applied shortly after birth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}