{"url": "Nightbrothers", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Culture of Dathomir", "Category:Dark side organizations", "Category:Nightbrothers", "Category:Shadow Collective organizations", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Nightbrothers"}, {"tag": "p", "text": "The Nightbrothers were a small colony of Dathomirian Zabrak males who lived in a village on the far side of the planet Dathomir under the rule of the Nightsisters. After the destruction of their village, they moved to another village. They lived in subservience to the Nightsisters' matriarch Mother Talzin until the witches' near-extinction during the Clone Wars. The infamous Maul, former apprentice to the Dark Lord of the Sith Darth Sidious, was born a Nightbrother, as was his brother and later apprentice Savage Opress."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Nightsister Talzin was the mother of Maul. At some point before the Battle of Naboo, the Sith Lord Darth Sidious took Maul from Talzin, his brothers, and his village to be his apprentice."}, {"tag": "p", "text": "During the Clone Wars, Nightsister and Count Dooku's former assassin, Asajj Ventress, came to the village to choose one of the heads of the tribe to serve her. Ventress then arranged for three tests to see their potential. During the third and final test, Ventress fought Savage Opress and his brother Feral. After Feral was defeated, Savage continued to fight Ventress but lost to her becoming her servant. Following the Devaron massacre, the Nightbrothers fought Jedi Knights Obi-Wan Kenobi and Anakin Skywalker, but yielded when Skywalker subdued Brother Viscus. Viscus then told them that Opress had been taken by one of Talzin's Nightsisters as a mate. As the Jedi left, Viscus ordered the Nightbrothers to let them go."}, {"tag": "p", "text": "Unlike their female counterparts, the Nightbrothers were spared the wrath of the Separatists during the Battle of Dathomir. They were sent by Talzin to Maul's aid in her stead when he requested her help. Viscus and his fellow Zabraks engaged Dooku in combat on Ord Mantell, but were swiftly defeated by the Sith Lord. Dooku would then be captured by the Shadow Collective before he had the chance to kill Viscus. Later, after Dooku feigned allegiance to Maul, the latter brought him to the Nightbrother village on Dathomir where Viscus awaited, and Viscus escorted them to the heart of Mother Talzin's power where the Great Mother possessed Dooku's body to drain his energy. Viscus and the Nightbrothers then left to prepare Talzin's chambers. Soon thereafter the village was attacked by the Confederacy and Talzin was killed after sending Maul to safety. Despite the loss of the Mother and subsequent destruction of their village at the hands of the Separatists, the Nightbrother clan remained active on Dathomir under the leadership of Viscus."}, {"tag": "p", "text": "Following the end of the Clone Wars, Jedi Master Taron Malicos was stranded on Dathomir. Embracing the dark side, Malicos killed Brother Viscus and several Nightbrothers, taking their horns as trophies and becoming their new leader. The surviving Nightsister Merrin was then manipulated against the Jedi by Malicos and the two took control of the Nightbrothers by 14 BBY. By this point the Nightbrothers lived in a village in the Dathomir wilds. There, the Nightbrothers started domesticating bane back spiders. When Cal Kestis came to the planet during his secret mission to rebuild the Jedi Order, Merrin threatened him and left her magically-enhanced brothers to face him. Kestis took down his attackers and survived. Kestis and Merrin would later team up to defeat Malicos in a duel and the pair departed from Dathomir, leaving the Nightbrothers behind."}, {"tag": "p", "text": "The Nardithi Nightsister Jerserra, another survivor of Grievous' massacre, had several Nightbrothers. including Freff and Eegrig, who served her."}, {"tag": "p", "text": "Maul later returned to establish a powerbase on his homeworld, where he ruled the Crimson Dawn criminal organization from the shadows. Shortly before the Galactic Civil War, Maul stated he was the last survivor of the Nightsisters' civilization. He later met his end at the hands of Jedi Master Obi-Wan Kenobi on Tatooine."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "A simple society, the Nightbrothers of Dathomir were known to be territorial and hostile to outsiders, subservient to the Nightsisters' whims as both servants and mates."}, {"tag": "p", "text": "Nightbrothers were accustomed to engaging in rites of passage; one such practice involved covering their faces with thin, dark tattoos. The best and boldest of the Nightbrothers faced another sort of rite of passage in which they battled beasts known as  chirodactyls. Those that faced these behemoth creatures and survived were deemed worthy."}, {"tag": "p", "text": "Nightbrothers practiced painting glyphs using acid from hydraatis on hard rock surfaces. Their usage of it was deliberately careful to preserve accuracy and damage to themselves. Those who were master calligraphers—rare positions within the society—were extremely valued for their talents."}, {"tag": "p", "text": "The Nightbrothers respected power and honor, often fighting in a combat arena to demonstrate their strength with intent to win. Although hostile to outsiders, one that proved powerful could be given substantial influence over the group, be it through respect or fear, even allowing them to gain leadership over the society and worship."}, {"tag": "h2", "text": "Skills and training"}, {"tag": "p", "text": "The Nightbrothers were capable fighters best known for their agility & highly acrobatic mixture of fighting styles, abilities that they used to gain an advantage over their enemies. Nightbrothers Maul and Savage Opress were considered among the best users of this fighting style. Their ranks included both warriors and archers. Some Nightbrothers were even skilled in the art of pottery."}, {"tag": "p", "text": "Some Nightbrothers were capable of utilizing basic force abilities in combat, such as the Force push. They could also be magically-enhanced through the power of a Nightsister, a technique employed by the witch Merrin to deter the Jedi Padawan Cal Kestis. A more intensive ritual transformed selected Nightbrother warriors into monstrous, hate-filled warriors strong in the dark side of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}