{"url": "Nightsisters", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Culture of Dathomir", "Category:Nightsisters"], "nodes": [{"tag": "h1", "text": "Nightsisters"}, {"tag": "p", "text": "The Nightsisters, also known as the Witches of Dathomir, were a clan and order of magick-wielding females who lived on Dathomir, a planet bathed in dark energies. These Dark side users were able to perform their arcane magicks by tapping into the magical ichor that flowed from the depths of their planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "According to a commonly told story, the first Nightsisters were trained in the ways of the Force by Allya, a female Jedi whom the Jedi Council had sent into exile on the mysterious planet of Dathomir. However, the Jedi Council had no records of an exile named Allya, and the Nightsisters themselves had other, contradicting tales about their origins. Even if she was not the founder of the sisters, Allya also wrote the Book of Law that taught the sisters to dislike the Jedi."}, {"tag": "p", "text": "When the Fromprath came to Dathomir, they exploited the natural resources of the planet. The Nightsisters opposed thie technological invasion, forming a symbiotic alliance with the rancors, in order to drive out the colonizers. They mounted them in combat and succeeded in driving the colonizers out of the soil of Dathomir."}, {"tag": "p", "text": "Knowing that technologically advanced aliens posed a threat to coven, the Nightsisters modernized some of their weapons, such as their energy bows."}, {"tag": "p", "text": "According to legend, the Nightsister Zeldin went after the Sith Darth Caldoth, after he stole a burial pod from Dathomir. Zeldin attempted to manipulate Caldoth into causing his own death out of revenge, but Caldoth was aware of Zeldin's presence, exploiting their connection before trapping her consciousness within his mind."}, {"tag": "p", "text": "Though a weapon used more commonly by Jedi, the Nightsisters had adopted lightwhips by the High Republic Era."}, {"tag": "p", "text": "Since their power was at its most potent on their home planet, the Nightsisters rarely ventured off-world during the height of the Galactic Republic. However, this changed when a sister named Talzin became the clan's Mother. During this time, Talzin worked alongside the Sith Lord, Darth Sidious. Talzin became wary of her machinations knowing there could only be two powerful dark side factions at one time due to the Rule of Two. Sidious ultimately betrayed Talzin and took her son Maul from her. At the time of the Clone Wars, Talzin began to sell her sisters' services as mercenaries to the galaxy's wealthy citizens."}, {"tag": "p", "text": "In 50 BBY, the clan was forced to give up the young Asajj Ventress to the Siniteen criminal Hal'Sted as insurance for protection."}, {"tag": "p", "text": "A couple years before the Clone Wars, Talzin came to tell the witch of no clan Falta to give up her daughter, Yenna. After Falta declined, Yenna slowly became frustrated with her mother's teachings, and one day left to join the Nightsisters in hopes of different teaching."}, {"tag": "h3", "text": "Decimation of the Nightsisters"}, {"tag": "p", "text": "Ventress later returned to her people after being betrayed by Count Dooku, seeking their help for revenge against her former master. After the failure of their first attempt, the Nightsisters used the Nightbrother, Savage Opress, as an instrument to destroy Dooku.They used their magic to increase his size, rage, and power. However, their scheme would earn them the ire of Dooku, who would later dispatch General Grievous to Dathomir in retaliation. Grievous then destroyed their fortress and killed off the majority of the Nightsisters during the battle, with Ventress, Talzin, Merrin, Yenna, Jerserra, and Shelish being the few survivors."}, {"tag": "p", "text": "While Ventress pursued a path as a bounty hunter, Mother Talzin continued to live in seclusion in the Nightsisters' ruined fortress, where she helped heal the broken body and mind of her son, Darth Maul. She orchestrated the kidnapping of Bardottan Queen Julia to make her more powerful than the Jedi and the Sith. However, she failed when Jedi Master Mace Windu and Representative Jar Jar Binks foiled her plans and she disappeared. Maul and Talzin conspired to eliminate Darth Sidious and Dooku, but Talzin was killed in the eventual confrontation. Meanwhile, Ventress joined Quinlan Vos in one final assassination attempt against Dooku, but was killed by the Count while protecting Vos, her newfound lover."}, {"tag": "h3", "text": "Adapting"}, {"tag": "p", "text": "Following the end of the Clone Wars, the Nightsisters' massacre at the hands of Grievous and Dooku became known, with very few Nightsisters remaining, like Merrin. However, as the Nightbrothers weren't wiped out. Merrin would take them as her servants and they took control of Dathomir during the age of the Galactic Empire."}, {"tag": "p", "text": "At some point during the age of the Galactic Empire, a female Inquisitor found Jerserra, a member of a Nightsister sect known as the Nardithi Nightsisters, and took her as an apprentice. However, years later, Jerserra betrayed her master, covered up her death, and took her double-bladed spinning lightsaber."}, {"tag": "p", "text": "In 14 BBY, Merrin joined the crew of the Stinger Mantis."}, {"tag": "p", "text": "Around 2 BBY, two spirits of the Nightsisters were summoned by Maul and Ezra Bridger in order to break their Force-bond. However, the spirits demanded their flesh and blood as payment. The Nightsister spirits attacked and possessed Kanan Jarrus and Sabine Wren. Together they fought Maul and Bridger. Maul abandoned the fight, but Bridger continued fighting. Bridger spoke with the Nightsister that possessed Kanan. The Nightsister told Bridger that Maul promised flesh and blood to rebuild the Nightsister clan. However, Bridger was able to destroy the source of the Nightsisters' powers, the altar, and the spirits disappeared."}, {"tag": "p", "text": "By the Galactic Civil War, Shelish was among the sole known surviving Nightsisters. During the lockdown of the Anoat sector between 4 and 5 ABY, she taught the ways of the Force to a smuggler from Burnin Konn who ultimately emerged as the leader of the Uprising."}, {"tag": "h2", "text": "Religion and philosophy"}, {"tag": "p", "text": "By tapping into the magical ichor that flowed from Dathomir's depths, the witches could harness a power they referred to as \"magick.\" The most powerful of the Nightsisters could use that ichor to create objects out of thin air, transform people into ghostly versions of their true forms, or even reanimate the dead. They were also known to domesticate benign rancors."}, {"tag": "p", "text": "Although they both used the dark side of the force, Nightsisters had different ambitions then the Sith. Some Nightsisters believed in the Winged Goddess, a deity of life, fertility, and divination, while some others believed in the Fanged God, a deity of death and the hunt. The Nightsisters did not celebrate death, but did not fear it and saw it as a part of life, with the divide being a veil that they would all eventually pass through."}, {"tag": "p", "text": "The Nightsisters used spells once intended to help plants and animals thrive, to create incantations of dark magic that gave supernatural strength to their best warriors, imbuing them with ichor."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Several studies indicated that the Nightsisters were a peaceful tribe who lived in harmony with their planet, however this was not true. The Nightsisters of Dathomir lived in the seclusion of a stone fortress that bordered dense swamplands. A matriarchal society, the coven of sisters lived apart from the men of Dathomir, the Nightbrothers, whose only use was to serve the sisters as servants and breeders."}, {"tag": "p", "text": "Young women aspiring to join the ranks of the Nightsisters first had to use the Dark side to subdue a powerful, strong-willed creature living in the depths of the pools in the village known as the Sleeper, and bring back a part of its body. The harvested remains would then be converted into the Water of Life, a major component of Nightsister magicks. Any initiate who gave into their fear, such as Talia's twin sister, would be dragged down into the depths and killed."}, {"tag": "p", "text": "The Nightsisters mummified their dead before placing them in pods of animal skin decorated with tassels, which were hung on structures made of branches, bones, animal skins and shells. Their graveyards mimicked the configuration of the plant life seen on Dathomir, with its crooked trees burdened by large, cocoon-like fruits."}, {"tag": "p", "text": "Years before they were wiped out, the Nightsisters practiced their magic inside the Witches Horn, a cliff high above the cave of the chirodactyl Gorgara. A Nightsister there made potions and elixirs. Some were medicine, while others were poisons"}, {"tag": "h3", "text": "Nightsister funerals"}, {"tag": "p", "text": "Before placing dead Nightsisters in burial pods, Nightsisters went through many steps to prepare a funeral. When using cloth for burial pods, the cloth was washed in magickal water. Then, the cloth was hand-braided together while Nightsisters recited a spell of protection. Finally, the bodies were cleansed with fragrant oils and placed in the newly created burial pod and mummified them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nightsisters were created by Dave Wolverton, and first appeared in his Star Wars Legends 1994 novel The Courtship of Princess Leia. In Legends, they are depicted as a splinter faction of the native Witches of Dathomir; descendants of the fallen Jedi Allya and appeared in multiple Legends works. Wolverton himself noted in an interview that he sought to create a set of powerful female figures in the Star Wars universe that had been dominated by men at the time, and expressed delight that the concept was picked up by George Lucas for his backstory of Darth Maul."}, {"tag": "p", "text": "George Lucas later decided to integrate them in his TV series Star Wars: The Clone Wars after he saw Lucasfilm Animation Singapore's use of the Nightsisters in the video game Star Wars: The Clone Wars: Jedi Alliance (2008), and how they were inspired by a concept art by Iain McCaig for The Phantom Menace. They were first introduced in the current canon with the twelfth episode of the third season, \"Nightsisters,\" aired on January 7, 2011."}, {"tag": "p", "text": "Tricia Barr, author of the 2018 reference book Star Wars: The Dark Side, extrapolated from source material that the Nightsisters had enough magic and technology to reproduce without the necessity of the Nightbrothers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}