{"url": "Nightsisters/Legends", "categories": ["Category:Legends articles", "Category:Culture of Dathomir", "Category:Nightsisters"], "nodes": [{"tag": "h1", "text": "Nightsisters"}, {"tag": "p", "text": "The Nightsisters were a sect of the Witches of Dathomir who embraced the usage of dark arts within their Force-driven Magics. The Nightsisters were originally members of other witch clans who began to utilize the dark side in defiance of the light-sided orthodoxy found in the Book of Law—the governing holy text of the Dathomiri. These witches adopted a shamanistic culture that rejected the notion of \"good\" and \"evil\", and instead chose to call upon the twin energies of the Winged Goddess and the Fanged God in order to utilize their Magicks and communicate with the spirit realm. They focused extensively on the art of casting Force illusions through \"illusion spells.\" Witches found guilty of practicing these heretical techniques were banished into Dathomir's wilderness and left for dead. However, in the final decades of the Galactic Republic's reign, the exiled witch Gethzerion used her superior powers to unite the wandering outcasts into a new clan—the Nightsisters."}, {"tag": "p", "text": "Operating under a revised holy text known as the Book of Shadows, these sorceresses used their powerful connection to Dathomir's untamed wilds to terrorize their fellow clans and fight for dominance over the planet. Although the witches had designs for galactic dominance, they were largely confined to their own world, as the Jedi Order maintained active interdiction of the planet. The Nightsisters themselves were divided into various competing clans of their own until approximately 32 BBY, when Clan mother Zalem attempted to use Dathomir's legendary Infinity Gate to destroy Coruscant, the capital world of the Galactic Republic. After the plot was foiled and Zalem was killed by her daughter, the numerous clans of Nightsisters were united into a single coven by the shaman Mother Talzin. During the Clone Wars, the Nightsisters came to the forefront of galactic notoriety when Talzin transformed her people into a mercenary society that trained in combat and Magick so that their services as bodyguards, assassins, and soldiers could be sold to off-world bidders."}, {"tag": "p", "text": "The time of relative prosperity would come to an end when the clan was drawn into the Clone Wars after Talzin's failed assassination attempt on Count Dooku with former Sister Asajj Ventress. Sending General Grievous and a Confederacy of Independent Systems army to Dathomir, Dooku assaulted the Nightsisters' Fortress. The ensuing battle resulted in the near-extermination of the Nightsisters, though enough survivors remained for the Nightsisters to eventually resume their dominant position in Dathomir's affairs."}, {"tag": "p", "text": "During the Imperial Period, the Galactic Empire maintained a significant presence on Dathomir, but after the Dark Lord of the Sith and Galactic Emperor Palpatine came to understand the depths of the Nightsisters' power and the strength of their founder, Gethzerion, he resumed the Jedi's former quarantine of the planet in an attempt to ensure that none of the witches escaped off-world. Despite Palpatine's efforts, many of the Nightsisters were able to flee Dathomir by allying with the criminal Zann Consortium. In the final years of the Emperor's reign, Dathomir was placed under the command of Zsinj, an Imperial admiral who declared himself a warlord after Palpatine's death in 4 ABY. Zsinj maintained the Emperor's forced isolation of Dathomir until 8 ABY, when Gethzerion and her Nightsisters succeeded in capturing New Republic General Han Solo on the planet's surface. The Clan Mother brokered a deal with the Imperial Warlord to trade General Solo for interstellar transport, but reneged on the arrangement and attempted to flee Dathomir without Zsinj's blessing. In retaliation, Zsinj directed his forces to destroy Gethzerion's transport, thereby killing her and all the Nightsisters aboard. This betrayal fragmented the Nightsisters, however the witches were able to reorganize by around 23 ABY, when Tamith Kai and her new Nightsisters allied with the Second Imperium faction of the Imperial Remnant. The clan survived through the Second Galactic Civil War and in 43.5 ABY, briefly allied with a Lost Tribe of the Sith Order against the New Jedi Order."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding"}, {"tag": "p", "text": "The female Force-users of the planet Dathomir traced their roots back to Mother Allya, a rogue Jedi Knight who had been sentenced to exile on that penitentiary colony around 600 BBY. After using her powers to subjugate the other exiles, Allya showed the first Dathomirian women how to use the Force, managing to create her own sect of all-female Force users. Concerned with regulating her new community's social life, Allya wrote the Book of Law, which she based on the Jedi Code."}, {"tag": "p", "text": "Over the ensuing centuries, the Witches of Dathomir—also known as \"Daughters of Allya\"—divided into different clans or sisterhoods. However, some of the Sisters let themselves drown in the dark side of the Force, just like Allya herself before she was redeemed. As a consequence, the Witches of Dathomir instated a tradition of exiling darksiders and others who broke their ancient code to live outside their clans in solitude and contemplation."}, {"tag": "p", "text": "However, at some point during the waning decades of the Galactic Republic, while Allaya Djo was the warmaster of the Singing Mountain Clan, two Sisters named Gethzerion and Baritha were exiled after attempting to assassinate their leader, Augwynne Djo (who was also Gethzerion's birth mother). They banded together with other outcasts to form a new clan, which became known as the Nightsisters—as they studied the forbidden \"night spells.\" Over time, this group came to resemble the traditional clans and started to expand, raising its own children to obey the power of the dark side, although they did not regard it in those terms. While the other clans refused to forcibly oppose them, their numbers rose steadily."}, {"tag": "p", "text": "The self-proclaimed Mother Gethzerion even provided her flock with the Book of Shadows, an instructional treatise on the Nightsisters' new sinister spells and rituals. As years went by, this initial group of exiles divided into multiple covens, which quickly started competing for food, land domination, male slaves and magical supremacy."}, {"tag": "h3", "text": "Rise of the Dathomirians"}, {"tag": "p", "text": "Several decades prior to the fall of the Republic, a band of pirates came to Dathomir with a shipment of male Zabrak, a species of horned Near-Humans. The all-Human Nightsisters took interest in those newcomers and discovered that they were genetically compatible. The interbreeding of Humans and Zabraks resulted in the emergence of a hybrid race known as the Dathomirians. Gethzerion herself, for example, was Dathomirian, the product of a full Human mother, Augwynne Djo, and her Zabrak \"maleling,\" or breeding mate. The girls were integrated into the covens, while the boys, known as the Nightbrothers, were kept as slaves and breeders. From this period on, the Nightsister clans' population was made up of both full Humans and Dathomirian hybrids."}, {"tag": "h3", "text": "Queen Zalem's ambition"}, {"tag": "p", "text": "The Nightsisters remained divided into various competing covens until 31 BBY, when Clan mother Zalem anointed herself \"Queen of Dathomir\". An ambitious matriarch, Zalem had learned a higher mastery of the Force by capturing a Jedi Knight on Dathomir and forcing him to become her mate. After learning everything she could from the Jedi and siring a daughter named Ros Lai, Zalem had killed her male slave. Now strong in the Force, she rediscovered Dathomir's legendary and forgotten Star Temples, a series of mysterious pyramids built by the long-lost Kwa civilization. Zalem successfully unlocked the secrets of the pyramids and discovered the Infinity Gates, powerful artifacts that could project devastating energy waves capable of sucking entire planets into infinity. Haunted with ambition, Zalem hatched a plot to destroy Coruscant, the capital world of the Galactic Republic, with the help of those ancient Kwa. However, the self-appointed queen's plan for galactic domination was foiled by the Jedi Knight Quinlan Vos, with the help of Zalem's own daughter. Ros Lai stabbed her mother in the chest with a lightsaber, ending her reign over the united Sisters. While the other witches expected her to take the mantle of Queen, Ros Lai was taken into custody on Coruscant by Vos, therefore ending Zalem's lineage."}, {"tag": "p", "text": "Following Zalem's failure, a new authority figure arose. Talzin, who was both Clan Mother and shaman of her coven, succeeded in reuniting the competing clans under her banner. Under Talzin, the Nightsisters entered into a prosperous era. At that time, Mother Talzin decreed that the Sisters under her lead could only mate with Zabrak Nightbrothers. Talzin also established a clear policy of separation, with the Brothers staying aloof from the Sisters."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 22 BBY, the Galactic Republic went to war against the Confederacy of Independent Systems. At some point during that pan-galactic conflict, a group of Nightsisters came into contact with the Count Dooku, Sith Lord and leader of the Confederacy. That sisterhood were under the control of Sai Sircu and Yansu Grjak. Dooku recruited them into the Confederacy to help with espionage, but their true goals were their own. They were involved in the plot to smuggle and make use of lightsaber crystals for a Separatist superweapon which made the Jedi Council aware of this new threat. They eventually betrayed Dooku and his mysterious master in part to prevent Dathomir's destruction."}, {"tag": "p", "text": "Later during the war, the Nightsisters welcomed back and helped their estranged sister Asajj Ventress in her quest for vengeance against Count Dooku, who had betrayed her. Two other Nightsisters went with her to Serenno, bent on assassinating the Count. When their attempt failed, Mother Talzin provided Dooku with an apprentice following the apparent \"death\" of Asajj Ventress. The Nightbrother Savage Opress was presented to the Count by Talzin in person. Around this time, they also discussed using her Nightsisters against the Jedi in the Separatist war effort."}, {"tag": "p", "text": "The Nightsisters subsequently came under attack from General Grievous, who was ordered to wipe them out. The resulting battle ended with a CIS victory that essentially amounted to genocide, Ventress and Talzin being the only survivors. Despite enduring heavy losses and greatly reduced numbers, the Nightsisters' presence on Dathomir would never be completely eliminated and the eradication of most of the Dathomirians led to the original human Nightsisters restored to their former prominence. Indeed, by the time of the Galactic Civil War, the Nightsisters were re-organized back into a single coven once again under the iron fist of Gethzerion."}, {"tag": "h3", "text": "Fall of the Nightsisters"}, {"tag": "p", "text": "After a stinging defeat at Yavin 4, the Galactic Empire established a prison colony on Dathomir. Gethzerion aided them, tracking down escapees and renegades who hoped to obtain passage off world. When Emperor Palpatine came to learn the true extent of Gethzerion's dark power, however, he began to fear the formidable threat she posed to him. He had all the ships stationed on Dathomir destroyed and detached a fleet group to enforce a quarantine on the planet in order to keep Gethzerion and her clans grounded. The Nightsisters then took over the Imperial prison, and enslaved all the stranded Imperials stationed there, trying but failing to cobble together an escape craft."}, {"tag": "p", "text": "Despite this, there were several Nightsisters, such as Silri, who apparently managed to escape this fate. They allied themselves with Tyber Zann of the Zann Consortium. The Nightsisters fought on the side of the Zann Consortium riding mighty rancors. Other escapees included Charal, who ended up on Endor."}, {"tag": "p", "text": "In 8 ABY, when a number of the Rebellion's heroes were stranded on Dathomir, Gethzerion made a deal with Warlord Zsinj that in exchange for turning over Han Solo, the Nightsisters would get access to a ship so they could escape the planet. However, Zsinj double-crossed them and had two Imperial Star Destroyers fire upon their escape shuttle, killing them all."}, {"tag": "h3", "text": "Rebirth"}, {"tag": "p", "text": "Around 23 ABY, a new clan of Nightsisters was formed by Tamith Kai in the Great Canyon. This clan accepted males and treated them as equals instead of slaves, as opposite to traditional Dathomiri society. The best of the clan were sent to the Shadow Academy for more training, with the rest remaining in the Great Canyon. Unlike the traditional Nightsisters, this new clan was heavily influenced by Imperial Dark Jedi teachings and drew upon the dark side of the Force as a concept. The fate of those left behind after the Shadow Academy fell is unknown, although at least one of them, Lomi Plo, later left the planet after the Second Imperium's fall."}, {"tag": "p", "text": "In 43.5 ABY, a clan of Nightsisters attacked the unification ceremony of the Broken Columns Clan and the Raining Leaves Clan. They were repelled by the combined might of the clans with the assistance of Luke and Ben, and Vestara Khai. Some of the remaining Nightsisters were captured by the Lost Tribe of Sith and were forced to teach them their Control web technique."}, {"tag": "h2", "text": "Religion and philosophy"}, {"tag": "p", "text": "The Nightsisters, like all other Daughters of Allya, attributed the work of the Force as that of the Spirits, a group of supernatural beings that were thought to inhabit a parallel plane to the mundane world. They had special veneration for the \"Twin Deities,\" the Fanged God and the Winged Goddess, who were thought to bring balance to the universe."}, {"tag": "p", "text": "The nefarious witches used the Force through a series of techniques they called Allyan Magic, having developed their own \"night spells\" by tapping into the dark side. Nightsisters were expert at casting illusions through \"illusion spells,\" and it appeared that, like the Fallanassi, this was an integral part of the way they used the Force."}, {"tag": "p", "text": "Due to their constant wielding of dark energies, the first Nightsisters tended to display ruptured blood vessels in their bodies, especially around their eyes. Certain Jedi Masters like Yoda also believed it was their power to manipulate weather patterns that made their aspect so peculiar."}, {"tag": "p", "text": "There was no \"uniform\" or standard dress for the Nightsisters, and each wore clothing that suited them personally, although most tended towards black robes and cloaks, adorned with tribal jewelry and accessories. Many of them also had unusually pale skin, which might be enhanced by applied tinctures. Nightsisters were known to be able to empower swords and other simple weapons with the Force, making them unbreakable even to the lightsabers worn by the Jedi and the Sith. Although they typically used more primitive weapons such as swords and spears, some Nightsisters did use lightsabers and other variants. Sister Silri used a lightwhip during the Galactic Civil War, and even Gethzerion herself was known to use a red-bladed lightsaber."}, {"tag": "p", "text": "Either due to their affinity to the Force and/or their magic practices, the Nightsisters possessed advanced longevity, with some witches known to have lived more than one to several centuries. These included Zalem, Gethzerion, Baritha, Talzin, Daka, and Charal."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "All the witch clans of Dathomir were matriarchal societies. Each coven was a \"sisterhood\" composed of Sisters under the guidance of the Clan Mother, and the \"malelings\" were generally disregarded. However, the Nightsisters of a few clans had male warriors, believing them to be beings who were capable of balancing the masculine and feminine energies of the spirit realm. Despite being considered as skilled fighters, these Brothers were still subservient to the Nightsisters, and were kept in isolation."}, {"tag": "p", "text": "Most Nightsisters were full-blooded Humans, but some of their covens consisted entirely of Dathomirians, the result of hybridization between Human witches and male Zabrak from Rattatak. However, the Dathomirian racial group was drawn to near-extinction during the Clone Wars, when the General Grievous attacked Dathomir. When heroes of the New Republic visited the planet in 8 ABY, all the Force witches they encountered were Human."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nightsisters were created by Star Wars author Dave Wolverton in The Courtship of Princess Leia, a 1994 novel published by Bantam Spectra. However, the sorceress Charal from the TV-movie Ewoks: The Battle for Endor was retconned into a Nightsister in The Illustrated Star Wars Universe, setting the Force witches' first canonical appearance in 1985."}, {"tag": "p", "text": "Wolverton noted in an interview that he sought to create a set of powerful female figures in the Star Wars universe that had been dominated by men at the time, expressing delight that the concept had been picked up by George Lucas for his Darth Maul backstory."}, {"tag": "h3", "text": "Comparison with Wicca"}, {"tag": "p", "text": "There are multiple points of comparison between the Nightsisters and the Wicca, a neopagan religious system based on witchcraft and polytheism. In an interview with the fan website TheForce.net, Daniel Wallace, author of the Book of Sith: Secrets from the Dark Side, explicitly compared the Nightsisters' beliefs with that of Wiccan witches. In his official endnotes for Book of Sith, Wallace also stated he invented the idea that the Nightsisters worshiped the Twin Deities after reading up on Wicca and other pagan movements. One of the twin gods, the Winged Goddess, was admittedly based on the principles behind the maid-mother-crone of the Triple Goddess—a triune female deity, a goddess with three distinct manifestations."}, {"tag": "p", "text": "The concept of the Triple Goddess was also implied to be part of the Force witches' culture in the defunct massively multiplayer online role-playing game Star Wars Galaxies. In the game, players could travel to Dathomir and purchase local hanging banners in three different models called The Maiden, The Mother and The Crone respectively."}, {"tag": "p", "text": "Additionally, the Nightsisters refer to their assemblies as covens, a term that has been associated with sorcery throughout the centuries and is now reused by Wiccans. Similarly, the laws and spells of the Nightsisters are written in the Book of Shadows, the name of which is identical to the real-world texts containing Wiccan religious instructions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}