{"url": "Nihil", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Nihil"], "nodes": [{"tag": "h1", "text": "Nihil"}, {"tag": "p", "text": "The Nihil were a group of  marauders who were active during the High Republic Era. Based in the Outer Rim Territories, the Nihil caused havoc throughout the galaxy and were responsible for various incidents, such as an attack on Trymant IV and the torching of the planet Nelgenam. The Nihil were obsolete by the time of the Galactic Empire, though rhetoric and imagery associated with the marauders survived, as did their technology, such as the design of the Path engine."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Philosophy"}, {"tag": "p", "text": "The Nihil were a criminal organization of anarchistic marauders based in the Outer Rim Territories. The Nihil operated by a code of taking what they wanted and killing those that stood in their way. They viewed themselves as a sort of counterculture that opposed the expanding Galactic Republic, who they believed were encroaching on Nihil territory as well as robbing people of their freedom. After receiving access to the Paths from the Ro family, they adopted the Rule of Three to divide the proceeds of their raids, with the Eye of the Nihil receiving shares from raids that utilized the Paths. They saw themselves as riders of a \"storm,\" and to that end used weather-related terminology in their structure and ranks, as well as a symbol of three lightning bolts. Their rhetoric and imagery outlived the organization's prominence."}, {"tag": "h3", "text": "Structure"}, {"tag": "p", "text": "The Nihil were divided into three Tempests, each led by a Tempest Runner who wielded sole control over the unit. Below the Runners were the Storms, Clouds, and finally the Strikes. Promotion was driven by recruitment and reputation: Strikes brought new blood into the Nihil, and when they had enough recruits under them, they became Clouds; Clouds could become Storms if they gained a strong enough reputation."}, {"tag": "p", "text": "Alongside the Tempest Runners was the Eye of the Nihil, a position created after Asgar Ro gave the Nihil access to the hyperspace Paths. In votes with the Tempest Runners, the Eye had a double vote, and was considered the symbolic head of the organization. However, they did not give orders. This changed around 232 BBY after the Battle of Kur, when Marchion Ro united all of the Nihil under his rule with the promise of expanding their operations throughout the galaxy and defending their way of life from the Galactic Republic and the Jedi Order."}, {"tag": "h3", "text": "Technology and tactics"}, {"tag": "p", "text": "Utilizing bizarre and intimidating tactics that included chemical weapons and poison, the Nihil could seemingly appear anywhere at will thanks to the Path engines which allowed them to travel through hyperspace in a manner unlike anyone else in the galaxy. The marauders utilized various type of starships, including battleships. The ships were divided into three types; Stormships, Cloudships, and Strikeships. Each of the Tempest Runners also had a corvette-sized flagship. At Trymant IV, the Nihil used a large starship with spider-like appendages. All Nihil starships were painted with the group's symbol. Despite the loner attitude they kept, the group had extensive contacts, including prominent Republic officials such as chief aide Jeni Wataro, throughout the galaxy and participated in mainstream activities, such as viewing operas in Pan Eyta's case. When the group would participated in a raid, a third of the bounty would go to the the Eye if the raid used the Paths but the rest would go to their secret bank accounts, known as their black accounts."}, {"tag": "p", "text": "Nihil often recruited new members from people who felt disenfranchised and forgotten by the Republic. Members of the Nihil, who were individuals of numerous species, wore heavy masks and helmets that often featured tubing, and were equipped with various weapons and pieces of armor. The masks' purpose was both symbolic and practical: they gave the pirates an intimidating appearance, while protecting their identities and themselves from the poisonous gases they frequently unleashed in battle. Nihil pirates Gwishi and Klinith Da both utilized blasters, while Klinith also carried knives."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The marauder group known as the Nihil began as a small pirate group operating out of Thull's Shroud, near Belsavis. Sometime during the High Republic Era, a time period approximately between 300 BBY and 82 BBY, they were approached by Asgar Ro, who offered them the use of the Path engine, a device which he promised would allow them incredible mobility through hyperspace. Ro subsequently became the Eye of the Nihil, sole granter of the Paths the engines traveled through hyperspace. Unbeknownst to the Nihil, the source of the Paths was the hyperspace prospector Mari San Tekka, who was kept alive in a medical pod after having been captured by the Ro family some time prior. Eventually, Asgar was murdered, and his son Marchion succeeded him as Eye of the Nihil. The three Tempest Runners at this time were Lourna Dee, Kassav Milliko, and Pan Eyta."}, {"tag": "h3", "text": "Agents of chaos"}, {"tag": "h4", "text": "Causing a great disaster"}, {"tag": "p", "text": "By around 232 BBY, Ro had plans to strike against the expanding Galactic Republic, for reasons connected to his family history. To that end, he arranged for a Nihil Stormship to be sent on a Path which intercepted with a hyperspace lane—something the Republic thought was impossible to do—in the Outer Rim near the Hetzal system. Encountering the Nihil ship at Hetzal's transit point, the freighter Legacy Run—detecting the ship in their path with only ten seconds until a possible impact—was torn apart attempting to avoid a collision. Thus began the Great Hyperspace Disaster; some fragments of the ship began to emerge from hyperspace almost at random across the galaxy, while many others began to rain upon the Hetzal system. Hoping to rescue as many people as possible, a joint-Republic Defense Coalition/Jedi Order effort was launched from Starlight Beacon to the system, yet the Republic remained unaware of what had caused the event. While some feared the crisis could be an attack, Republic Admiral Pevel Kronara  felt that was unlikely, knowing enemies did not normally broadcast intentions to attack before a conflict."}, {"tag": "h4", "text": "Spreading destruction"}, {"tag": "p", "text": "Members of the Nihil were involved in a battle against the Jedi Order in the Kur Nebula, in which Ro sacrificed Kassav's Tempest in an attempt to deflect attention away from the greater organization, hoping the Jedi would believe the Nihil were dealt with. As fallout from the Great Disaster entered the Trymant system, the Nihil arrived above the planet Trymant IV in a large starship. Nihil landed in Bralanak City as burning debris descended on the city, evacuating select residents of the planet, including the Elders."}, {"tag": "p", "text": "Wishing to drive the Republic from the remote area near the edge of the Dalnan sector, the Nihil sent the pirates Gwishi and Klinith to sabotage the luxury liner Steady Wing as it departed the remote outpost of Port Haileap with an important Republic individual aboard. Arriving at Port Haileap on a stolen cargo hauler, the two impersonated mechanics, intending to incapacitate the real mechanics with ovax gas and damage the Steady Wing's escape pods to leave no survivors. A number of Nihil raiders torched the paradise planet Nelgenam, causing the world to become a desolate wasteland and its famed library to fall into ruin."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Around 82 BBY, towards the end of the High Republic Era, the Jedi Padawan Sean recalled the Nihil as an illicit organization that once invaded the Galactic Republic."}, {"tag": "p", "text": "By the year 0 BBY, the Nihil had become obsolete. During the time of the Galactic Empire, the warlord Burnium Ro utilized rhetoric and imagery associated with the organization. As such, Grand Moff Wilhuff Tarkin of the Empire sent his protégé, Lieutenant Commander Ellian Zahra, to destroy Ro and his operation. Around 3 ABY, Beol De'Rruyet of De'Rruyet Industries claimed to possess a Nihil path engine and have the ability to replicate it, which would subsequently unlock the ancient method of lightspeed travel. As the unveiling of such technology would have a significant effect on the galactic economy, Domina Tagge of the Tagge family intended to stop De'Rruyet, recruiting the rogue archaeologist Doctor Chelli Aphra to ascertain whether De'Rruyet's claims were true."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nihil were created for the Star Wars: The High Republic publishing project. The group was devised as a possible answer to the question of what would scare the Jedi, which was posed by High Republic writer Cavan Scott during an initial meeting. The Nihil first received a mention in the comic story \"The Lost Stories, Part 1,\" written by Scott and published in Star Wars Adventures 30 by IDW Publishing on January 29, 2020. During the official announcement panel for Star Wars: The High Republic, the Nihil were revealed to be connected to the project, and concept art for members of the group was shown."}, {"tag": "p", "text": "In the project's announcement trailer, the Nihil were described as \"space Vikings.\" The look of the Nihil was derived from art that was specifically developed for the initiative. Concepts from other Star Wars works such as Star Wars: Episode VII The Force Awakens that explored individuals such as pirates and scavengers pointed toward a force that was uniform in its non-uniformity."}, {"tag": "p", "text": "In writing the Nihil, Charles Soule, author of the novel The High Republic: Light of the Jedi, wished to explore a villain that was truly frightening and lacked a loyalty to any ideology, unlike the majority of villains in Star Wars. Justina Ireland, author of The High Republic: A Test of Courage, saw the Nihil and the havoc they wreaked in different parts of the galaxy as an opportunity for smaller storytelling as well as the Jedi engaging in a battle that did not necessarily involve the light side of the Force against the dark side but instead was simply survival."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}