{"url": "Nightwatcher_worm", "categories": ["Category:Canon articles", "Category:Carnivorous creatures", "Category:Creatures of Jakku", "Category:Nocturnal creatures", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Worms"], "nodes": [{"tag": "h1", "text": "Nightwatcher worm"}, {"tag": "p", "text": "Nightwatcher worms, also known as Arconan night terrors and sandborers, were a little-documented species of nocturnal sand-boring worms native to the planet Jakku. Mature specimens topped 20 meters in length, although some were reputed to be much larger. According to the scavengers of Jakku, nightwatchers remained under the sands motionless, but at the slightest vibration from something moving on the surface, they sprung up out of the sand and snapped onto their preys. With their triangular heads featuring large red eyes, nightwatchers bore a passing resemblance to the Arcona, a sentient species with a humanoid body. They could eat anything, since their mouthparts could grind metal into scrap, and their stomachs generated acid to melt down anything they could not digest."}, {"tag": "p", "text": "Following the attack on Tuanul, the astromech droid BB-8 was spied upon by one such worm. The nightwatcher rose from its burrow and squinted its red eyes, making a curious sound as the BB unit rolled by."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Nightwatcher worms were a species of worm that could reach up to twenty meters in length, although reports existed of specimens five or six times that length. The front of their lengthy, segmented body consisted of a huge maw with several blue tongues inside and large teeth like protrusions surrounding it. Above the mouth was a pair of small red eyes, capable of blinking and mounted on a stalk that was capable of some amount of rotation and movement independant on the body. Two short tendrils hung below the eyes. Given the resemblance that nightwatcher worm's eye stalks bore to the head of the Arcona species, some nicknamed the worms Arconan night terrors."}, {"tag": "p", "text": "The worm's body itself was reddish-gray in color, with a brown mantle covering the upper half of the body and stout red legs protruding from each segment, ending in a single black claw. The body narrowed after the mantle and ended with two tails, each tipped with several red segmented spines. The creatures were capable of producing loud roaring noises—similar in sound to members of the acklay species—but could also produce sounds more similar to sentient speech. They produced large amounts of spittle from their mouths."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Native to the desert planet Jakku, nightwatcher worms mostly inhabited the area known as the Sinking Fields, although they were sometimes found in the Goazon Badlands if particularly bad sand storms pushed sand dunes in that direction. worms spent most of their time submerged beneath the desert sands, and were capable of moving through them at speeds greater than that of a running human. These tendencies caused the species to also be called sandborers by some Jakku locals."}, {"tag": "p", "text": "According to lore told by the scavengers of Jakku, the worms were able to sense vibrations in the sand above them, although they also often poked their eye stalk above the sand to watch their prey. The worms fed upon the large amounts of junk that could be found strewn across Jakku's deserts, but would also hunt droids and even attacked humans. They were a nocturnal species although if they had not managed to eat some would hunt during the day."}, {"tag": "p", "text": "Upon locating prey, the worms would often burrow underneath it and then burst from the sands either close to it or directly underneath it before attempting to grab the desired food item in its jaws. The worms would not always consume the food immediately, sometimes holding it between their jaws and moving away from the catch site beneath the sands. When denied a meal by prey outsmarting it, a nightwatcher worm would sometimes emit a low mournful sound and bow its eye stalk. The worms spoke in a language known as Hideo."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Hunting BB-8"}, {"tag": "p", "text": "The nightwatcher worm was generally a little-documented species and was considered mysterious by many. Some artisans on Jakku harvested their casing and used them to make lamps, one of which the scavenger Rey purchased to use in her home, the collapsed All Terrain Armored Transport named Hellhound Two. In the year 34 ABY, the astromech droid BB-8 escaped alone from Tuanul village on Jakku after it was attacked by the forces of the First Order. As the droid made its way through the desert alone, a nightwatcher worm raised its eyes from the sand behind BB-8. Soon after, BB-8 was captured by the scavenger\nTeedo, but then freed by the Rey, who agreed to let the droid stay with her for the night. As the pair walked back toward Hellhound Two, a male nightwatcher worm's eyes surfaced behind BB-8 once again, but this time Rey recognised the beast and the threat it posed to the droid as she had previously written about the species in her survival guide."}, {"tag": "p", "text": "Warning BB-8 that worm would likely want to eat him, Rey and the astromech froze in place, hoping the beast would leave them be; however, it quickly submerged and began heading straight for them under the sand, causing the pair to flee. The worm proved quicker than its prey, and erupted from the sand in front of them roaring and trying to bite down on Rey. The scavenger managed to use her quarterstaff to wedge the worm's mouth open, giving her and astromech time to get away from it. Rearing up, the worm bit down on the staff, launching it from its maw back towards Rey, who managed to catch it. Free of the staff, the worm submerged itself once again and passed under Rey to quickly catch up with BB-8, bursting up directly beneath him and grabbing the droid in its jaws."}, {"tag": "h3", "text": "Making an ally"}, {"tag": "p", "text": "With its prey captured, the worm submerged and began heading away from Rey toward Hellhound Two; however, the scavenger hurled her quarterstaff and managed to pierce the sand that the worm was submerged beneath, causing it to emerge again and release BB-8 while roaring. As the droid flew through the air, Rey leapt over the roaring beast from behind and then caught the astromech, quickly climbing up onto the walker. With the worm unable to reach them on top of the vehicle, Rey felt sorry for the hungry beast and hurled a piece of scrap she had gathered to it so that it did not starve. Satisfied with the meal, the worm submerged and left to eat."}, {"tag": "p", "text": "The following day, the Teedo returned with two thugs and speeder bikes to reclaim BB-8 from Rey, who was riding on her speeder with the droid, having originally planned to head for Niima Outpost. After managing to cause the thugs to crash, Rey led the Teedo into the wreckage of an Imperial-class Star Destroyer where she knew the nightwatcher worm she had previously encountered dwelt. Once inside she dismounted and challenged Teedo to fight for the droid, causing him to halt his bike and with draw a JSP-14 pistol. As he sat stationary, the nightwatcher worm passed beneath the bike once and then burst from the ground behind it, consuming the bike in a single bite and knocking its rider flying. Scared of the beast, the Teedo fled, allowing Rey and BB-8 to depart safely and head for Niima."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The nightwatcher worm was created as a hand puppet for the film Star Wars: Episode VII The Force Awakens, which was released on December 18, 2015. The film's director J.J. Abrams originally came up with the concept, but by the point in production where he spoke to creative supervisor Neal Scanlan about making it, they had run out of money. Scanlan then offered to have the creature made for only £100, after which sculptor Ivan Manzella offered to cut the price down to only £50 and made the creature during his lunchbreak. While speaking about the creature on stage during the \"The Creatures, Droids and Aliens of Star Wars: The Force Awakens\" panel at Celebration Europe in 2016, Scanlan jokingly claimed that he had received the £50 payment for the creature but never actually given it to production. Scanlan himself played the creature, popping his hand up with the puppet on while being buried beneath the sand in Abu-Dhabi."}, {"tag": "p", "text": "A transcript of various sound audio from the film revealed that the noise made by the nightwatcher worm was the word \"Kojima\", which was a reference to the Japanese video game designer Hideo Kojima, who is a real life friend of Abrams. Continuing this reference to the game designer, the 2019 video \"Every Language in Star Wars\", which was released as part of the Star Wars By the Numbers series on the Star Wars Kids YouTube channel, revealed that the language spoken by the nightwatcher worm is called \"Hideo\"."}, {"tag": "p", "text": "The worm was not named in the film itself, but received identification in the reference books Star Wars: The Force Awakens: The Visual Dictionary by Pablo Hidalgo and Rey's Survival Guide by Jason Fry, which were both released in conjunction with the film. Although only a worm's eyes appeared in the film, their full appearance was revealed when one starred as a major character in the animated short \"Sands of Jakku\", released as part of the Star Wars: Forces of Destiny series on Youtube on July 3, 2017."}, {"tag": "p", "text": "Dave Filoni and Ghostbot animation studio, the animators of Forces of Destiny, staff, including the series' director Brad Rau and Ghostbot co-founders Alan Lau and Roque Ballesteros researched possibilities for the design. They looked at various real-world worms and slugs, of which Ballesteros was afraid of, microscopic photography of \"bugs\", inluding the Tardigrade, nicknamed the \"water bear,\" creature designs by Ralph McQuarrie and Terryl Whitlatch and footage of the sandworms in the 1984 film Dune. The animation director, Tatyana Drewry Carvin, then worked on balancing 'the worm's weight and mass with his ability to move under and through the sand,\" specifically referencing Dune."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}