{"url": "Niima_Outpost", "categories": ["Category:Canon articles", "Category:City stubs", "Category:Jakku locations", "Category:Settlements"], "nodes": [{"tag": "h1", "text": "Niima Outpost"}, {"tag": "p", "text": "Niima Outpost was a junkyard settlement on Jakku, a desert planet in the Western Reaches of the galaxy. The outpost was named for and founded by Niima the Hutt after the Battle of Jakku to capitalize on the new scavenging opportunities the battle created on the planet. Niima Outpost was the only spaceport on the planet, although it was referred more as a landing field rather than a spaceport. Scavengers, like Rey, salvaged materials from the technology leftover from the Battle of Jakku. Salvage made up the backbone of the economy, but other branches such as black market trading, mercenaries for hire, and other unlawful activities exist."}, {"tag": "p", "text": "Niima's fuel supplies were basic, though there were some scavengers who located military grade supplies, such as rhydonium. Niima attracted a lot of attention offworld because of it being the only navigational beacon on the planet. These foreigners were encouraged to lock up their ships. Most travelers opted to sleep on their ships due to lack of permanent structures in the outpost. Scavengers brought their finds to Niima Outpost in exchange for supplies from Unkar Plutt, the local boss who operated from the center of awning-roofed blockhouse known as the Concession Stand. Niima Outpost was also the location of Constable Zuvio's office. The outpost's main gate utilized architecture akin to that found on other Hutt worlds such as Teth. Sarco Plank opened a gun shop at the outpost to modify and enhance blasters."}, {"tag": "p", "text": "The outpost was attacked by the First Order, who were looking for the astromech droid BB-8 and stormtrooper defector Finn."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The story Destroyer Down from the Loot Crate exclusive comic Star Wars Adventures: Destroyer Down repeatedly misspells Niima Outpost as Nima Outpost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}