{"url": "Niima", "categories": ["Category:Canon articles", "Category:Females", "Category:Hutts"], "nodes": [{"tag": "h1", "text": "Niima"}, {"tag": "p", "text": "Niima was an enterprising female Hutt scoundrel who operated far from the borders of Hutt Space, a province of the galaxy that became embroiled in conflict as the Hutts attempted to carve up the deceased crime lord Jabba Desilijic Tiure's territory. Niima resided in a temple on the desert planet of Jakku. Prior to the Battle of Jakku, Niima struck a deal with Gallius Rax, the Counselor to the Empire, to guard the pass to the Plaintive Hand plateau and kidnap local orphans in return for receiving weapons. Later, Rae Sloane struck a deal with Niima to gain access to the Jakku Observatory, claiming that it hid a powerful weapon there."}, {"tag": "p", "text": "Niima was later wounded when Rax ambushed her convoy and captured Sloane and Brentin Lore Wexley. Despite being wounded, Niima survived with the help of the bounty hunter Jas Emari, who ferried her back to her temple. Following the Battle of Jakku, Niima monopolized the salvage collection efforts on Jakku and established Niima Outpost. Though Niima was later killed by a bounty hunter, Niima Outpost continued to bear her name. It was rumored that a group who worshiped the Hutts as gods constructed their village around the cranial mantle of Niima herself, gilded in precious metals and covered with jewels, following her demise."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "During the Age of the Empire, Niima the Hutt lived in a temple on the desert planet of Jakku where she ruled over many slaves and servants. As a mark of their servitude, these slaves wore nothing but a loincloth around their waists. They also wore a pair of hooks around their mouths, which cause the, to only murmur and mumble. All those who entered her temple became her slaves. Niima's slaves treated her like a goddess and lived to serve her completely. She controlled all traffic that moved through the narrow canyons and deep caverns of Jakku."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "After the self-proclaimed Counselor to the Empire Gallius Rax brought most of the remnants of the Galactic Empire to Jakku in 5 ABY, he struck a deal with Niima. In return for receiving weapons, equipment, and supplies from Rax, Niima agreed to employ her henchmen to kidnap local orphans and children for Rax and to guard the path to the Plaintive Hand plateau. Unknown to Niima, the Plaintive Hand plateau contained the Jakku Observatory, which was central to the Emperor's posthumous Contingency plan to destroy the Empire and start anew. During their investigation into Rax, the former Grand Admiral Rae Sloane and the rebel Brentin Lore Wexley sought an audience with Niima to gain permission to travel through her domain to the Plaintive Hand plateau."}, {"tag": "p", "text": "Posing as prospective slaves, Sloane and Rax met with Niima in her throne room. Sloane identified herself as an Imperial Grand Admiral and offered to reward Niima if she allowed them to pass through her territory to the Plaintive Hand plateau. Niima at first taunted Sloane and ordered her coterie to forcibly induct Sloane and Brentin as her newest slaves. When Sloane countered that Rax was a pretender to the throne, Niima revealed she had already made a deal with him. Following a brief struggle with the slaves, Sloane managed to convince Niima to let her and Brentin travel to the Plaintive Hand plateau by claiming that it was the site of a weapon more powerful than the Death Star. Niima accepted the deal and told Sloane to lead her to the weapons facility. She announced that they would feast before leaving at dawn."}, {"tag": "p", "text": "For nearly a week, Niima and her caravan traveled through the deserts of Jakku to the Plaintive Hand. During the journey, Niima rode on top of a massive platform drawn by several of her slaves. Other slaves rode wheel-bikes, old speeders, and luggabeasts. Unhappy with the slow progress, Sloane tried to steal a wheel-bike. Niima ordered her slaves to subdue the Grand Admiral but Brentin came to Sloane's aid. Before the fight could escalate, Rax learned that they had breached the outer perimeters of the Jakku Observatory and ordered turbolasers to bombard them. Many of Niima's slaves were killed during the bombardment but the Hutt crime lady and several slaves managed to seek refuge in the shadow of the western plateau."}, {"tag": "p", "text": "Counselor Rax later arrived with three Imperial shuttles and stormtroopers to arrest Sloane and Rax. Niima interrupted the \"reunion\" and demanded that Rax tell her what he was hiding in the Plaintive Hand. At Rax's gesture, his troopers opened fire on Niima and the slaves riding her. However, Niima's body was able to withstand blaster bolts and she charged at one of the shuttles, toppling it and snapping one of its wings. Niima was wounded by repeated blaster fire and toppled to the ground. Rax's men killed her remaining followers and then took Sloane and Rax to the main Imperial base beyond the Goazon Badlands."}, {"tag": "h3", "text": "New allies"}, {"tag": "p", "text": "After Rax, Sloane, and Brentin had departed, the wounded Niima encountered the Zabrak bounty hunter Jas Emari and the New Republic operative Norra Wexley. Niima recognised Jas as the Zabrak captive she had been intending to hand over to the bounty hunter Mercurial Swift and his crew. Despite wanting to kill her, Niima managed to convince Jas and Norra to give her a ride in their Corellian shuttle back to her temple. In return, she offered to provide them with clearance codes to the Imperial base, where Sloane and Brentin had been taken to. Jas accepted the deal and told Norra to ready the shuttle."}, {"tag": "p", "text": "Back at her temple, a grateful Niima outfitted Jas and Norra with old Imperial uniforms, an old Imperial shuttle, and the necessary clearance codes to reach the main Imperial base. Before they could depart, Mercurial Swift and his bounty hunting crew Dengar, Embo, and Jeeta confronted Niima and demanded that she hand over the Zabrak, Niima refused and she choked Swift around the neck when he reminded her that he was working for the Black Sun crime syndicate. However, Dengar managed to force her to release her grip by threatening to shoot her in the face. Jas allowed herself to be captured so that Norra and the B1-series battle droid Mister Bones could continue their mission to capture Sloane."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Ultimately, Jas managed to escape Swift's grip by convincing his crew to change sides in return for receiving pardons and money from the New Republic. Following the Battle of Jakku, Niima took charge of a black market operation to salvage weapons, computers, and engines from the wrecked Imperial and New Republic starships that had crashed on the planet during the fighting. Niima established a settlement to facilitate this salvage work which later became known as Niima Outpost. Niima was later assassinated by a bounty hunter. Following her death, it was rumored that a group who worshipped the Hutts as God built their sacred villages around the cranial mantle of Niima herself, gilded in precious metals and coveted in jewels."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Niima was a female Hutt with a worm-like body. She spoke an ancient dialect of Huttese and her voice sounded like someone who had swallowed broken glass. Niima used a translator device that translated her words from Huttese into Galactic Basic Standard. Niima regarded herself as a divine worm born of sand and stone. Her servants and slaves treated her like a deity and lived to serve her. Niima had delusions of grandeur and sought every opportunity to increase her power and influence on Jakku. Rae Sloane managed to manipulate her narcissism by offering her access to a powerful weapon if she gave her and Brentin passage into the Plaintive Hand plateau."}, {"tag": "p", "text": "As a Hutt, Niima's body was able to withstand blaster bolts. She also had enough strength and power to topple an Imperial shuttle and to carry several humanoid slaves. Niima had no true loyalty and was willing to change sides if the opposing side could offer a better deal. Niima was also known to keep her promises and outfitted Jas Emari and Norra with Imperial uniforms, a shuttle, and clearance codes in return for saving her life. Niima was also strong enough to grab a humanoid being around the neck. Despite her fearsome persona, Niima was known to back down in the face of superior force such as when Dengar threatened her with a blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Niima was first mentioned in the 2015 reference books Star Wars: The Force Awakens: The Visual Dictionary and Rey's Survival Guide, which were released to promote Star Wars: Episode VII The Force Awakens. Niima appeared as a supporting character in Chuck Wendig's 2017 novel Aftermath: Empire's End, the last installment in Star Wars: The Aftermath Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}