{"url": "Niklos", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Gamblers", "Category:Humans", "Category:Males", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Niklos"}, {"tag": "p", "text": "Niklos was a male Human who frequented the Upper City Cantina on Taris during the time of the Jedi Civil War, claiming to be the \"unofficial champion of the pazaak circuit on Taris.\" He used to have frequent games with fellow player Gelrood, until the latter was banned from the Upper Cantina on suspicion of cheating."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Niklos was a Human male gambler who resided on the planet Taris during the Jedi Civil War. He was a patron of the Upper City Cantina, where he spent his time playing pazaak. He used to play against fellow player Gelrood, until the latter was banned from the cantina on suspicion of cheating. Following this, Niklos was unable to find a rival who could match his skill in the game."}, {"tag": "p", "text": "In 3956 BBY, Former Sith Lord and redeemed Jedi Revan, who was on Taris in search of Jedi Knight Bastila Shan, visited the Upper City Cantina and bought a pazaak deck from the retired player Garouk."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Niklos wasn't nearly as fine a pazaak player as he stated; he would often blame his failure on his opponent cheating, which he did to both Revan and Gelrood. Once he decided someone was a cheater, he would call them that at every opportunity; he would also refuse to play against them under any circumstance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the player beats Niklos in pazaak 5 times in a row without losing, he will eventually accuse the player of cheating and will refuse to play pazaak anymore. If Mission Vao is with you she will comment on his accusation of the player cheating calling him a sore loser. Another pazaak player in Javyar's Cantina named Gelrood got banned from the Upper City Cantina due to cheating despite denying these claims, it is possible Niklos got Gelrood banned from the cantina due to getting beaten by him multiple times."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}