{"url": "Nikto", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Races and species stubs", "Category:Hutt Space species", "Category:Nikto subspecies", "Category:Nikto"], "nodes": [{"tag": "h1", "text": "Nikto"}, {"tag": "p", "text": "The Nikto were a humanoid sentient species native to the planet Kintan. There existed at least three Nikto subspecies: the Kajain'sa'Nikto (red Nikto), the Kadas'sa'Nikto (green Nikto), and the Esral'sa'Nikto (mountain Nikto). Many Kajain'sa'Nikto were employed by the Hutt Clan as enforcers during the Clone Wars, and centuries prior, while several green and red Nikto served the crime lord Jabba the Hutt shortly before the Battle of Endor. Some Nikto were members of the Jedi Order, such as the male Kajain'sa'Nikto Jedi Master Ima-Gun Di."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Nikto species had at least three subspecies: the Kajain'sa'Nikto (red Nikto) and the Kadas'sa'Nikto (green Nikto), which were both well acclimated to desert climates, and the Esral'sa'Nikto (mountain Nikto). The red and green Nikto were distinguished by their scaly, coarse skin, horns and spikes. The mountain Nikto stood out from the red and green Nikto as they had no horns with facial fins instead. Green Nikto young were born from eggs and consequently their young were called hatchlings."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Nikto originated from Kintan. At some point in time their home planet was discovered and taken over by the Hutts, who enslaved their race. Some Niktos were appointed as guards and thugs for their Hutt overlords and became a common sight in most of their enslavers' entourages."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "Some time after the death of Jabba the Hutt, the Niktos managed to break free from their oppressors and at least one Nikto cartel existed during the New Republic's existence. It was led by a Kajain'sa'Nikto named Rinnrivin Di."}, {"tag": "p", "text": "Some 30-odd years later, the young male Kadas'sa'Nikto Neeku Vozo served as a mechanic at Yeager's Repairs, a garage bay aboard the Colossus run by Team Fireball. He would later be promoted as the Colossus' chief engineer, once the station left its home planet of Castilon, pursued by the First Order."}, {"tag": "p", "text": "During the cat-and-mouse chase of the next months, the Colossus happened upon another Nikto in the person of Nenavakasa \"Nena\" Nalor, a female Esral'sa'Nikto. After socializing with the station's inhabitants and helping with repairs, which were abundant, Nalor's real motives were revealed upon investigation of her ship, which she claimed had barely survived a First Order attack. Nalor had in fact been hired by the First Order to infiltrate the Colossus and sabotage it, so that Commander Pyre and Agent Tierny could finally get their hands on the refueling station they had been after for too long. The plan failed, however, due to the quick thinking and rapid fixes performed by Vozo, resident engineer of the Colossus. Nena fled the station, and her failure was taken by the First Order with a sentence of her summary execution should they ever encounter her again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}