{"url": "Nilash_III", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Empire planets", "Category:Grumani sector planets", "Category:Jungle planets", "Category:New Republic planets", "Category:Sith planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Nilash III"}, {"tag": "p", "text": "Nilash III, also called simply Nilash, was the third planet in the Nilash system, located close to the baradium-rich planet Chelloa. It was home to a tree-dwelling, telepathic native species and a known source of anthracite. During the New Sith Wars the jungle-covered planet housed a Daimanite munitions plant while, under the rule of the Galactic Empire, the Nilash Imperial Impound Facility was established in an orbit around the world. It was on this world that the later-famous smuggling freighter the Millennium Falcon, at the time known as the Second Chance, first came into Rebel possession. During the following years, the control over Nilash was repeatedly transferred between the Empire and Rebellion's respective incarnations."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "New Sith Wars"}, {"tag": "p", "text": "At some point before or during the New Sith Wars, the Ithor Outreach carried out anthropological studies on the native tree-dwelling species and reported their findings in narratives."}, {"tag": "p", "text": "Later, during the conflict between Sith Lords Daiman and Odion, Nilash III was a part of Daiman's territory and housed a munitions factory where the enslaved natives were forced to work."}, {"tag": "p", "text": "Shortly before the Jedi-led Operation Influx in 1032 BBY, Jedi Master Vannar Treece compiled a report for the Republic Supreme Chancellor Genarra on the worlds of the Grumani sector and included in it a brief description of Nilash III and its natives, whose inventiveness and spirit he described as \"inspiring\" and telepathic ability as \"remarkable\"."}, {"tag": "p", "text": "After the disastrous Jedi mission and the subsequent devastation of the baradium-rich Daimanite planet Chelloa, Jedi Knight Kerra Holt visited Nilash and freed the native slave workers, who disappeared in the surrounding jungle. In addition to that, since Daiman had ordered that all of his statues throughout his realm be coated with cortosis plating due to Holt decapitating more than a dozen of them on Chelloa as a sign of defiance and warning, the young Jedi also appropriated from the weapons plant a high-powered laser, designed for cutting cortosis, and used it to remove the heads of thirteen statues that were located in a small plaza at the complex. On the notice of the administrator of the munitions plant, Daiman himself arrived on the planet, where, together with his aide Uleeta, he inspected the damage and interpreted the act of vandalism as a message that Holt \"existed\" and was \"not going away\"."}, {"tag": "p", "text": "Five to six weeks later, when the Odionite spy Narsk Ka'hane was sent to Daiman's capital world of Darkknell on a mission to destroy the Daimanate Dynamic Testing Facility, he made up a cover identity of a machine tool operator transferred from Nilash."}, {"tag": "p", "text": "During the war between the Republic and the Brotherhood of Darkness led by Sith Lord Kaan three decades later, Nilash III was still located in Sith space."}, {"tag": "h3", "text": "Clone Wars and early Imperial Period"}, {"tag": "p", "text": "During the Clone Wars, the Grumani sector, including Nilash III, was under the control of the Separatists."}, {"tag": "p", "text": "During the Imperial Period, it was the site of the Nilash Imperial Impound Facility, an orbital Imperial impound yard. In 10 BBY, the YT-1300 light freighter the Second Chance, later known as the Millennium Falcon, was liberated from Nilash III by the ship thief Zenn Bien and the Rebel agents Quip Fargil and Luufkin."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Shortly after the death of the Emperor Palpatine at the Battle of Endor in 4 ABY, a large portion of the Grumani sector, including Sanrafsix, came under the control of Admiral Sander Delvardus's recently-formed Imperial faction, the Eriadu Authority. His rule proved to be short, however, since in the following year the nascent New Republic recaptured Sanrafsix and the rest of the sector."}, {"tag": "p", "text": "When the Imperial Grand Admiral Thrawn returned to the known space in 9 ABY and began his campaign of conquest, the Grumani sector either was conquered or allied itself with Thrawn's forces."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "The Grumani sector, Nilash included, remained unscathed by the Yuuzhan Vong War that ravaged the galaxy from 25 ABY to 29 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}