{"url": "Nile_Owen", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males", "Category:Moffs of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Nile Owen"}, {"tag": "p", "text": "Moff Nile Owen was an ambitious and talented Imperial officer who served as Governor of the Rayter sector early in the Galactic Civil War. He liked to use furred cloaks with his Imperial uniform. Threatening, intelligent and cultured, Owen also enraged easily and executed anyone failing him via either betrayal or ineptitude. As such, he killed his assistant Nak Farool when he discovered Farool was conspiring to oust him. He also killed a company of mercenaries when they failed to bring him live prisoners to question."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Joining the military forces of the Galactic Empire, Nile Owen served aboard several older Victory-class Star Destroyers. His distinguished service, coupled with his skill at making influential friends, led him to rapid, regular promotion. During his advance, Owen also fathered one daughter. Eventually becoming the Moff, or sector governor, of the Rayter sector, in charge of its stability, Owen still worked hard: He wanted to win control of another, more important sector."}, {"tag": "p", "text": "Soon after the Battle of Yavin, the Alliance to Restore the Republic began diplomatic talks with the Shashay species, hoping to convince the Shashay to join the Alliance and to allow a Rebel base in their hidden planet Crytal Nest. This was opposite the interests of the Empire. The Empire also discovered that Crying Dawn Singer, a Shashay cultural hero who was to perform for Owen in the opening of the Sector Performing Arts Center, had a Rebel undercover agent in his entourage. Owen's Special Assistant Nak Farool convinced the Moff to approve a mission: The Empire would secretly hire a criminal to kidnap Crying Dawn Singer in an operation that would lead to the discovery of the spy and, hopefully, of a Rebel base. Later, the criminal would publicly make unacceptable ransom demands while falsely claiming to be a leader of the Alliance. This would hamper the Alliance's advances and cause the Shashay to turn to the Empire."}, {"tag": "p", "text": "Hesitantly accepting, Owen did not know that Farool planned to betray him: Farool would broadcast not only the ransom demand, but also other transmission claiming that Owen was uninterested in the abduction. This would undermine Owen's popularity. Besides, when Farool hired the pirate Yearo Seville to do the dirty job, he told Seville to deliver the hostage not to Owen, but to Farool's brother Braig, Governor of the planet Narg. Braig Farool would later feign a rescue operation and \"recover\" Crying Dawn Singer, gaining prestige. Following the conspiracy, Owen would be forced to resign, and Braig Farool would replace him as Moff."}, {"tag": "p", "text": "Seville abducted Crying Dawn Singer and his entourage, and took them to an abandoned Imperial base on the planet Najarka. There, COMPNOR discovered that the secret agent was the Shashay's droid KL-6TLF7V/T. Owen was informed about this, and he set off for Najarka aboard his flagship, the Imperial-class Star Destroyer Impending Doom, as he wanted to recover the droid. Owen's staff intended to analyze the droid's memory. Seville left with the Shashay for the subspace relay station at Laim, where he would broadcast the ransom demands, leaving the droid behind as ordered."}, {"tag": "p", "text": "However, once Owen reached Najarka, he was surprised to discover a team of Rebel agents trying to leave with KL-6TLF7V/T. The Moff was unable to prevent their escape, even if he deployed a Telgorn personal carrier with stormtroopers and four TIE fighters."}, {"tag": "p", "text": "Seville broadcast his ransom notice from Laim, and the Shashay believed his lies. Shashay navigators in Rebel starships hijacked their vehicles and threatened to ask Owen for help if Crying Dawn Singer was not returned quickly."}, {"tag": "p", "text": "Owen went to Laim in the Impeding Doom. Investigating with his subordinate Admiral Sahreel, the Moff discovered a recorded message of Nak Farool vilifying Owen. Furious, he ordered Farool arrested and personally executed him in the ship's bridge, while at the same time ordered the relay station destroyed. Owen followed Farool's track to Narg and sent the Imperial Cruiser Kana's Steel, under Captain Williar Barrog, to take control of the local spaceport. The Impending Doom followed shortly afterward."}, {"tag": "p", "text": "When Owen arrived at Narg, the Rebel team he had seen on Najarka was already there, trying to rescue Crying Dawn Singer from Braig Farool's clutches. Owen intended to personally recover Crying Dawn Singer, restoring his damaged reputation. However, even if he sent a battalion of stormtroopers against Farool's corporate guards, Owen failed: The Rebel agents escaped with Crying Dawn Singer aboard the CRX-Tug Worthless Fool."}, {"tag": "p", "text": "Owen replaced Nak Farool with a new personal assistant. This new aide later decided to desert and join the Alliance with the help of Rebel officer Airen Cracken. During this time, Owen's daughter was preparing her wedding, which would include influential guests from twenty different sectors. The Rebel saboteur Aimi Loto had reprogrammed the protocol droids of these visitors to malfunction and even attack sentients during the event—a task that took Loto several years. Cracken met with Loto, and she advised him to avoid protocol droids during the ceremony. In fact, the wedding ceremony was a hotbed of exploding, hostile and otherwise treacherous droids."}, {"tag": "p", "text": "Months before the Battle of Endor, Moff Owen sent a company of mercenaries from the First Sun Mobile Regiment to take over a Rebel outpost and provide him with prisoners for questioning. Instead, the soldiers of fortune killed all the Rebel soldiers. Enraged, Owen executed his subordinates. This outraged the First Sun leaders, who began to distance themselves from the Empire for the first time since the Regiment's inception. Captain Zgorth'sth of the New Republic's Department of Threat Assessment wrote about this event in 11 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A very thin, middle-aged Human male, Moff Owen appeared threatening because of his smile and of the look in his eyes. A cultured man who excelled in management, he was commonly seen with the uniform of an Imperial officer. Owen added a furred cloak to the traditional clothes, as he was fond of this complement. His subordinates styled him \"His Excellency.\""}, {"tag": "p", "text": "Owen was known to be intelligent, determined and cunning, driven only by his desire to serve the New Order and to ambitiously advance his own career. While he intended to keep a firm control on Rayter sector, Owen was prone to outbursts of anger, during which he might literally kill anyone showing ineptitude or defiance, as shown when he killed Nak Farool or the First Sun mercenaries."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nile Owen first appeared in The Abduction (1992), a roleplaying adventure written by Chuck Truett for West End Games' Star Wars: The Roleplaying Game. Allen Nunis drew several illustrations depicting Owen. Following his role-playing stats, Owen was knowledgeable in law enforcement and had been trained to use a blaster, but not to pilot or to repair a starship."}, {"tag": "h3", "text": "Alternate endings"}, {"tag": "p", "text": "If the player characters of The Abduction leave KL-6TLF7V/T in Najarka, then Owen recovers it and his men access the droid's memory. This leads to Owen discovering the secret Rebel base at Berrol's Donn, and sending a fleet to obliterate it."}, {"tag": "p", "text": "If they can't escape Narg with Crying Dawn Singer, then Owen arrests the Shashay and tries to make him reveal the secret galactic coordinates of Crytal Nest. Owen resorts to torture, eventually killing Crying Dawn Singer. This outrages the Shashay leaders, who then refuse to help the Alliance. Losing such a powerful ally, the Alliance is unable to keep unity in the sector and fragments—something that cements Owen's power over Rayter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}