{"url": "Nils_Tenant", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Joint Chiefs of the Imperial military", "Category:Males", "Category:Republic Navy admirals"], "nodes": [{"tag": "h1", "text": "Nils Tenant"}, {"tag": "p", "text": "Nils Tenant was a human male who served as a rear admiral in the naval forces of the Galactic Republic during the Clone Wars. When the war came to an end and Supreme Chancellor Sheev Palpatine of the Republic anointed himself Emperor, Tenant continued serving in the navy of the new Galactic Empire as an admiral. Through the influence of his friend Wilhuff Tarkin, Tenant was eventually elevated to the Joint Chiefs of the Imperial Military in 14 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In his youth, Nils Tenant attended the Sullust Sector Spacefarers Academy, the graduates of which moved on to positions in local system navies, commercial piloting, or the Judicial Department of the Galactic Republic. During his time at the academy, he befriended Wilhuff Tarkin, an Eriaduan who had previously worked with the Outland Regions Security Force. Eventually, Tenant joined the naval forces of the Republic. As a navy officer, he was involved in the Clone Wars, a three-year long conflict that pitted the Republic against the Confederacy of Independent Systems."}, {"tag": "p", "text": "At some point during the war, Tenant reached the rank of Rear Admiral and was put in command of a Venator-class Star Destroyer. While patrolling the Chrelythiumn system, far beyond the Outer Rim of the galaxy, Tenant and his crew intercepted a mysterious transmission. When it transpired that the message contained a distress code abandoned by the Jedi Order more than 2,000 years earlier, the admiral transmitted said message to the planet Coruscant, where the Jedi High Council had its headquarters. The Council subsequently sent a party to investigate the source of the transmission."}, {"tag": "p", "text": "After the Clone Wars ended, Supreme Chancellor Sheev Palpatine of the Republic declared himself Emperor, abolishing the democratic government and replacing it with his Galactic Empire. Nils Tenant continued to serve in the new Imperial starfleet, now with the rank of admiral, and was assigned to pacification missions for a time. In 14 BBY, Tenant was called back to Coruscant, where he would attend a Joint Chiefs meeting. On that occasion, he was reunited with his friend Wilhuff Tarkin. In the aftermath, the shakeups in the Imperial Military led to Tenant being elevated to the Joint Chiefs due to Tarkin's influence."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nils Tenant was a fair-skinned, brown-haired human male. He had a prominent nose, blue eyes, and a downturning full-lipped mouth."}, {"tag": "p", "text": "As a veteran of the Clone Wars, Tenant disliked his pacification missions and yearned to be reintegrated back into active service. Although his friend Wilhuff Tarkin considered him genuinely competent, Tenant would not hesitate to use his connection to gain the Emperor's favor. The admiral's audacity was ultimately rewarded when he was made Joint Chief."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tenant first appeared in the newsreel prelude to \"Overlords,\" the fifteenth episode in Season Three of the Star Wars: The Clone Wars television series, which aired on January 28, 2011. Although he went unnamed on screen, the online guide to the episode identified him as \"Tenant.\" His first name and whereabouts during the Imperial period were revealed in Tarkin, a novel by James Luceno, released on November 4, 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}