{"url": "Nim_Drovis", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Meridian sector planets", "Category:New Republic planets", "Category:Nim Drovis locations", "Category:Swamp planets"], "nodes": [{"tag": "h1", "text": "Nim Drovis"}, {"tag": "p", "text": "The world of Nim Drovis was located in the Drovian system in the Meridian sector, and was a rainy planet which boasted a Sector Medical Facility and Medical Research Facility attended to by the Ho'Din physician Doctor Ism Oolos, along with a small New Republic base. The largest free port on Nim Drovis was Bagsho, which was originally settled by colonists from Alderaan turned into a link between the sector's neutral worlds and the New Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before the Galactic Republic contacted them the Drovians were a primitive species organized into a network of tribes. Many of the native Drovians were addicted to the narcotic zwil, which they absorbed by inserting fist-sized plugs into their membrane-lined breathing tubes. They were bottom-heavy and had tentacles with pincers on the ends and many different sensory devices on their bodies. After joining the Galactic community, the Drovians whom accepted Republic technology developed a deep hatred for the Gopso'o tribe, whom maintained the traditional culture of the planet. The Gopso'o maintained the ancient Drovian tongue, while the mainstream Drovians adopted Basic as their official language. The war between the advanced Drovians and Gopso'o may have started over the usage of the word truth."}, {"tag": "p", "text": "At one point, and it was one the planets which Captain Barden Golah lead an excavation on."}, {"tag": "p", "text": "After the events of the Death Seed Plague crisis, the New Republic built a weather station to regulate the teeming rain there, and Jedi Knights of the New Jedi Order negotiated an accord between the warring tribes."}, {"tag": "p", "text": "One unique thing about the rainforest planet was the acid-producing molds that grew there, capable of eating through flesh on contact. The Drovians and Gopso'o that chose not to fight each other, instead exterminated the mold with flamethrowers and acidthrowers."}, {"tag": "p", "text": "Architecture on Nim Drovis was mostly heavy stone walls, with thick wooden supports for the many balconies favored."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}