{"url": "Nim_Pianna", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Jedi trainees of the Jedi Order", "Category:Tholothians"], "nodes": [{"tag": "h1", "text": "Nim Pianna"}, {"tag": "p", "text": "Nim Pianna was a Force-sensitive Tholothian female member of the Jedi Order who trained under Jedi Knight Rael Averross as a Jedi Padawan during the Republic Era. Around 48 BBY, Averross and Pianna were tasked with protecting the Advent, a food-carrying cargo freighter, from pirates. When several members of the Advent's crew mutinied, Averross led Pianna into a confrontation with the mutineers' droids within the ship's cargo bay, where she was struck with a slicer dart during the melee. The nanotechnology caused the Padawan to lose control of her physical actions and attack her Master. Averross reluctantly chose to kill Pianna to prioritize their mission of saving the Advent's remaining loyal crew members."}, {"tag": "p", "text": "After holding hearings, the Jedi Council vindicated Averross's actions concerning Pianna's death, though not all members of the Jedi Order felt he was blameless in the incident. Averross continued to grieve over his Padawan's death for several years after the Advent mission and considered his work in preparing the Pijali Princess Fanry to be a constitutional monarch as a way to make up for the mistakes he had made with Pianna."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Apprenticeship and death"}, {"tag": "p", "text": "The Tholothian Nim Pianna was a Force-sensitive who was born around 62 BBY. During the Republic Era, as a member of the Jedi Order, she trained as a Jedi Padawan under Jedi Knight Rael Averross. Around 48 BBY, during the first year of her apprenticeship, Pianna and her Master were assigned to protect the cargo freighter Advent, which was tasked with delivering food to a star system suffering from famine. While on board the Advent, the Jedi closely monitored the ship's external sensors due to concerns about pirate activity in that sector of space."}, {"tag": "p", "text": "Several members of the Advent's crew mutinied and began killing loyal ship staffers with the aid of reprogrammed droids. Though standard protocol for mutinies dictated that securing a ship's bridge should be the first priority, Averrross instead chose to capture the Advent's cargo bay, believing that the mutineers would attempt to seek pirate assistance. Pianna and her Master engaged the mutineers from an elevated platform in the cargo hold using their lightsabers. During the melee, she was struck with a slicer dart from an enemy droid. The nanotechnology caused her to lose control of her physical actions and attack her Master. Averross reluctantly chose to kill Pianna to prioritize saving the Advent's remaining loyal crew members from the mutineers."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After the incident, the Jedi Council held hearings concerning the breach of mutiny protocol that had led to Pianna's death. During these hearings, Jedi Master Dooku testified to the Council in defense of the actions Averross had taken on the Advent. Upon reviewing hologram footage of the incident, the Council ultimately concluded that Averross was right to prioritize the lives of the Advent's remaining loyal crew members over the life of his student. The official report released by the Council concerning Pianna's death was authored by Jedi Master Mace Windu, who vindicated Averross from blame. The datapad-viewable hologram of the incident on the Advent was kept as a file accessible to members of the Jedi Order. Jedi Master Qui-Gon Jinn reviewed the footage several times and eventually came to feel that Pianna's death could have been prevented if Averross had followed mutiny protocol."}, {"tag": "p", "text": "Following the hearings, Averross was given an extended assignment on the Inner Rim planet Pijal to serve as Lord Regent. Still grieving Pianna's death, he threw himself into preparing the Pijali Princess Fanry to be the constitutional monarch of her planet. Averross saw his devotion to Fanry as a way to make up for his mistakes with Pianna. At some point during his assignment as Lord Regent, Averross and Dooku reminisced Pianna's death, and the latter offered to open a bottle of Soulean brandy in her honor. Over time, Princess Fanry came to feel that Averross's actions as Lord Regent were never aimed to help her succeed, and she resented being viewed as Pianna's replacement in his eyes."}, {"tag": "p", "text": "By 40 BBY, Pianna's fate was not widely known outside the Jedi Order. Prior to leaving on their mission to Pijal, Master Jinn told his Padawan, Obi-Wan Kenobi, about Pianna's death. Having heard many stories about the fate of Averross's Padawan, Fanry staged an assassination attempt on herself using a slicer dart, the same weapon that had once taken control of Pianna, to instill fear in her Lord Regent. Days later, after staging a revolution and seizing absolute power during her coronation, the young monarch mentally pledged to herself that she would not share Pianna's fate of dying as a result of Averross's failings."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Padawan, Nim Pianna and Rael Averross shared a workable affinity in combat. She trusted her Master's judgement, and he cared for her deeply in return. Pianna felt betrayed when Averross killed her, having retained her emotions when a slicer dart controlled her physical actions. Following Pianna's death, Averross grieved deeply for her loss. Pianna possessed a youthful appearance at the time of her death."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In combat, Nim Pianna wielded a green-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nim Pianna first appeared in a hologram in Master & Apprentice, a 2019 novel written by Claudia Gray."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}