{"url": "Nink_(uvak)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Named creatures", "Category:Uvaks"], "nodes": [{"tag": "h1", "text": "Nink  (uvak)"}, {"tag": "p", "text": "Nink was a male member of the avian uvak species who lived on the planet Kesh in the years following the Great Hyperspace War. Hatched in 5015 BBY, Nink eventually became the personal steed of the Keshiri Zhari Vaal, a member of the world's Neshtovar ruling council. However, Vaal mistreated Nink; at some point, Nink decided enough was enough and, during a flight over the ocean, dropped his master to his death. Nink was passed on to Vaal's widow, Adari Vaal, a geologist who soon had to flee the Neshtovar on Nink's back after spreading teachings of Kesh's origin that the council considered heretical. Nink carried Vaal up to the remote Cetajan Mountains, where she happened upon an encampment of Sith who had recently crashed on the planet. With Vaal's help, the Sith were delivered from their predicament; they eventually posed as the Keshiri's Skyborn gods and took control of Kesh as the new Lost Tribe of Sith."}, {"tag": "p", "text": "By 4975 BBY, Nink, at forty, was the oldest uvak in Keshiri memory. By then, his master had reached the head of a secret Keshiri resistance group dedicated to overthrowing the Lost Tribe. As part of their plot, that year Vaal flew Nink at the head of a large group of stolen uvak mounted by resistance members, hoping to sacrifice themselves as a way to cripple the Lost Tribe's ability to move across Kesh. However, after Vaal guided Nink into the chaotic air currents above the Sessal Spire volcano, Nink did not plunge into the water as planned; instead, he reached an isolated island somewhere in the ocean."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mountain excursion"}, {"tag": "p", "text": "A member of a non-sentient avian species called the uvak, the emerald-eyed, multicolored Nink was, like the rest of his kind, native to the isolated Wild Space planet of Kesh. At some point after his hatching in 5015 BBY, Nink became the personal mount of Zhari Vaal, a member of Kesh's Neshtovar ruling council, who were the planet's most celebrated uvak-riders. However, Nink's master was cruel to him—shortly before the year 5000 BBY, Vaal mistreated Nink one too many times. One morning, Nink flew Vaal far out over the ocean and dropped the Keshiri rider to his death. Nink returned to Vaal's home in the city of Tahv later that day, bearing what Vaal's wife Adari Vaal took as a look of satisfaction in his eyes. As was tradition, Nink was passed on to the woman, but without a rider the uvak spent much of the next year lounging in the backyard without anything to do. Regardless, Nink adjusted well to his new lifestyle. In that time of his life, Nink had a rather lethargic personality, quite content to do nothing and ignoring Vaal."}, {"tag": "p", "text": "In 5000 BBY, Nink's life of leisure was disrupted in a major way. Adari Vaal, a geologist, became a figure of considerable controversy when she began to promote theories of Kesh's creation that contradicted the popular religious stories of Keshiri society. Vaal was forced to defend her findings before the Neshtovar, and public disgust with the \"heretic\" Vaal grew to the point that large throngs of Keshiri gathered in front of the family home and showered the structure with rocks. After a massive explosion in the nearby Cetajan Mountains was attributed to Vaal's heresy, their ire grew so great that Vaal felt the need to flee. Her only way to escape was Nink, and although Vaal had never ridden an uvak before, Nink followed her lead and took wing. Flying far out over the ocean—much to the chagrin of Vaal, remembering how her husband had died—Nink evaded pursuit from Neshtovar fliers on their own uvaks before finding a seaside mountain roost not far from the source of the explosion. Although Nink had a chance to leave Vaal behind, he stayed and ate whatever foliage he could find. The next morning, Vaal rode Nink toward the location of the explosion, coming across a burning wreck and a man throwing something over the side of a precipice. The object descended quickly past Nink, startling him and nearly causing him to drop Vaal into the sea. After Vaal regained her balance, the frightened Nink flew back to their previous roost as fast as his wings would take him."}, {"tag": "p", "text": "That night, Vaal spied fires, obviously set by someone, further in the mountains. Feeling compelled to follow them, she journeyed forward, although Nink refused to go with her. Venturing toward the source of light, Vaal stumbled across a camp of Sith who had crashed on Kesh shortly before, on a starship whose wreck Vaal had observed earlier. The Sith, mistrustful of Vaal, took her prisoner. Fearful of the newcomers, along with the native wildlife of the Cetajan Mountain region, Nink spent the next several days watching Vaal from high above. In the Sith encampment, the group's leader, Captain Yaru Korsin, convinced Vaal to help them escape their perilous situation in the mountains. To that end, Vaal called for Nink, who flew her back to the mainland. Nink and Vaal attracted Neshtovar fliers, who followed them back into the Cetajan Mountains to the Sith camp. The Sith took the opportunity to wow the Neshtovar with their Force abilities, and they proclaimed themselves the Keshiri's Skyborn gods returned home. The Keshiri populace, save for Vaal, fell for their charade, and the Sith took control of their society."}, {"tag": "h3", "text": "The resistance"}, {"tag": "p", "text": "Over the next twenty-five years, as the new Lost Tribe of Sith expanded their dominion, virtually all of the uvak in the land were taken by the Sith. As an exception, however, Vaal was allowed to keep Nink in order to visit Yaru Korsin, with whom she had forged a friendship, at the Kesh Sith Temple in the mountains. Secretly, Vaal was at the head of an underground Keshiri resistance group dedicated to bringing down the Lost Tribe regime. By 4975 BBY, after years of surveillance and plotting, the resistance executed a plan to defeat the Lost Tribe. By then, Nink, at forty years old, was the oldest uvak in Keshiri memory. The resistance planned to steal the Sith's uvak and fly them to their doom—with their ability to effectively move across the vast Keshiri landscape crippled, the Sith would be vulnerable to an armed uprising. To that end, when Vaal took off, Nink would issue a powerful nesting cry, ordering all uvak in earshot to follow, then fly to the Sessal Spire volcano. The air currents over the Spire would carry the uvak, and their Keshiri riders, to their deaths."}, {"tag": "p", "text": "When the day came, Vaal took to the skies on Nink, planning to meet a large group of other Keshiri on uvak-back. However, an unforeseen difficulty arose, as the resistance leader's son Tona Vaal had fallen for Korsin's daughter, Nida Korsin, and divulged the details of the plan, allowing the Sith to prevent the taking of many uvak. Still, Vaal and Nink made it to the rendezvous point, along with a sizable group of resistance members and airborne uvak. Although distraught at her son's failure, Vaal determined that she would continue on, flying Nink toward the Sessal Spire and, seemingly, to her doom. However, Nink did not struggle to a watery grave. Along with some uvak and Keshiri stragglers, Nink made it to a barren island in the middle of the ocean. Although near death from exhaustion, Nink had survived. While the island did not have much in the way of resources, Vaal and other Keshiri survivors formed a makeshift settlement—when the day came that the venerable Nink finally passed on, his remains would be used for building purposes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nink first appeared in John Jackson Miller's 2009 eBook Lost Tribe of the Sith: Precipice, the first in Miller's nine-part Lost Tribe of the Sith series, although he was not identified by name until the series' next installment, Skyborn. Nink also appeared in the series' fourth story, Savior. In 2012, Nink was mentioned, and pictured for the first time, in Pablo Hidalgo's reference book The Essential Reader's Companion. Here, he was illustrated by Darren Tan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}