{"url": "Nipaltoo", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Ferren Barr's disciples", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nipaltoo"}, {"tag": "p", "text": "Nipaltoo was a male individual who served Ferren Barr as one of his six acolytes. They were stationed at Barr's refuge on Mon Cala until Darth Vader and his Inquisitors discovered their location. They evacuated the refuge to find Vader had arrived and Nipaltoo attempted to kill Vader before his helmet was crushed by the dark lord."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime before the reign of the Galactic Empire, Nipaltoo's sister, Palabee, was taken to be trained by the Jedi Order. When Nipaltoo asked his mother where she was going, she told him that she was going to have a better life as a Jedi. Then following the events of Order 66, Nipaltoo saw that the Empire had destroyed the Jedi, giving Nipaltoo a hatred against the Empire. Eventually, he encountered Jedi Padawan Ferren Barr, who stylized himself as a Jedi Master, at a cantina and was manipulated into joining Barr's band of acolytes."}, {"tag": "p", "text": "By 18 BBY,[source?] they were based on the Outer Rim water world of Mon Cala and during their time there, Darth Vader was sent to Mon Cala to hunt Barr, and found their cave refuge by torturing King of Mon Cala Lee-Char. Barr told them about Vader being Anakin Skywalker and told them of his misdoings. Nipaltoo then watched the battle with Barr and his fellow disciples. Barr was warned of Vader's approach by Lee-Char and evacuated the refuge. Nipaltoo and the other acolytes fled the refuge when they encountered Vader in an Imperial submarine, and while the others scattered and headed for the nearby Bel City, Nipaltoo decided to attack the submarine, only for Vader to crush his helmet with the Force, killing him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nipaltoo had white eyes and light skin. He hated the Empire for killing his sister and wanted to avenge her death."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Nipaltoo was skilled with a blaster and was able to accurately fire at the submarine."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Nipaltoo owned a blaster. He also has a scuba-diving outfit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nipaltoo first appeared in Darth Vader: Dark Lord of the Sith 14, a 2017 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}