{"url": "Nirauan/Legends", "categories": ["Category:Legends articles", "Category:Empire of the Hand", "Category:Gradilis sector", "Category:Infinite Empire planets", "Category:Nirauan locations", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Nirauan"}, {"tag": "p", "text": "Nirauan was the capital world of the Empire of the Hand, located in second of three inner planets in the Nirauan system. It was a planet inhabited by the indigenous avian Qom Jha and Qom Qae species, as well as by a garrison of Chiss and human personnel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The second satellite of a weak red star, it was an arboreal world with a landscape of jungle interrupted by small lakes. The Qom Jha and Qom Qae species lived on the world, and while they were Force-sensitive and sentient, they did not develop a technological culture."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A former Rakata colony in Pre-Republic times, the only known point of contact with the wider galaxy was the ancient fortress known as the High Tower or Hand of Thrawn. Built of the same black, energy-absorbing stone as the ancient citadel on Hijarna, and set above a cave system inhabited by Qom Jha and Qom Qae groups, it was a relic of an ancient, long-forgotten war. Damaged and deserted after what appeared to be a superlaser strike, the base was eventually reoccupied by forces loyal to Grand Admiral Thrawn, during or soon after the Galactic Civil War. The fortress also attracted other Imperials to the world, such as the pilot Soontir Fel, whose son Jagged was born on Nirauan.\nThrawn and his forces modified the base with a blend of Chiss and Imperial technology. In this period, the High Tower boasted command facilities comparable to a Star Destroyer, heavy defensive weaponry, and a hangar stocked with a full wing of TIE scouts. Hidden in the caves beneath the castle were a library computer and a clone of Thrawn himself, awaiting activation in a Spaarti cloning cylinder."}, {"tag": "p", "text": "However, in 19 ABY, Luke Skywalker and Mara Jade managed to inflict serious damage on the base, flooding the library computer, killing the clone, and crashing the Jade's Fire into the main hangar. Although this damage apparently allowed the Cavrilhu Pirates to temporarily occupy the base, the defenses were supposed to have been rebuilt by the time the Skywalkers returned to Nirauan three years later - although no surface landing was allowed to verify the claim."}, {"tag": "p", "text": "Officially, the High Fortress served as a liaison post between the Imperial Remnant and the Chiss Ascendancy, staffed by a small Imperial delegation under General Baron Soontir Fel and a group of Chiss warriors from Thrawn's Household Phalanx led by Commander Kres'ten'tarthi. However, given that the primary loyalties of both groups lay with Thrawn, it is believed that the base also played a role as a command center for the enigmatic Empire of the Hand."}, {"tag": "p", "text": "At some point during the Yuuzhan Vong War, the Hand of Thrawn was apparently abandoned, although the implications of this event remain unclear."}, {"tag": "p", "text": "At some point between the dissolution of the Empire of the Hand and the beginning of the Second Galactic Civil War, a team of scientists from the University of Sanbra came to Nirauan to study the remains of its Chiss occupation, hoping to learn more about the blue-skinned people."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}