{"url": "Nishr_Campaign", "categories": ["Category:Legends articles", "Category:Battles in the Hunnoverrs sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Nishr Campaign"}, {"tag": "p", "text": "The Nishr Campaign was a conflict on the Outer Rim world of Nishr, between forces of the Rebel Alliance and the Galactic Empire."}, {"tag": "h2", "text": "Origins and opposing forces"}, {"tag": "p", "text": "Nishr came to the attention of the Alliance in 0 ABY, when an uprising among the low-technology Nish population was violently quelled by Imperial forces in the Nishr Suppression. Initially, a Pathfinder platoon was sent to scout the planet, but within three weeks, they had been reinforced to create a larger SpecForce combat unit, the Nishr Taskforce, commanded by Major Fisk Csino."}, {"tag": "p", "text": "Officially, the purpose of the mission was to encourage and support local Nish resistance, but the underlying aim was to persuade the Empire to commit disproportionate numbers of troops to the planet. This would have the effect of reducing Imperial Army numbers elsewhere in the Sector, creating weaknesses in deployment which the local Alliance Sector Force could exploit."}, {"tag": "p", "text": "The Nishr Taskforce was a company-strength unit with an emphasis on fast, mobile armor, including one platoon each of repulsorlift tanks, scout cars, troop transports and speeder bikes. They were opposed by a much larger Imperial Army garrison under Major General Vin Kollis, the main fighting force of which had recently been reinforced to the level of a regiment of infantry: two battalions of line troops, one battalion of assault infantry, and one repulsorlift battalion with troopers and transports."}, {"tag": "p", "text": "The other elements of the Imperial garrison imply the presence of a Corps HQ, the standard planetary-occupation deployment: a wing of TIE/LN starfighters, including some TIE/gt ground-attack fighters, and a full company of security troops, plus a limited number of stormtroopers and some walker armor (such as AT-ATs and AT-STs). There was also heavy weaponry defending the garrison's main stronghold, suggesting the use of a prefabricated garrison base."}, {"tag": "h2", "text": "Campaign overview"}, {"tag": "p", "text": "During the initial landing of the Rebel taskforce, aerial cover was provided by X-wing starfighters, which took out the entire Imperial fighter wing, eliminating the element of the garrison that would have caused most problems for the fast-moving Rebel armor. However, the Rebels failed to find widespread support among the Nish, who had been taught to fear Imperial reprisals during the Suppression. Thus, the ostensible purpose of the mission, providing support for a Nish insurrection, appears never to have been achieved."}, {"tag": "p", "text": "The Rebels did find some eager local allies, however, and used a series of strikes by these Nish resistance forces to draw the Imperials away from their defensive positions. Evenually, a large-scale ambush was mounted, destroying most of the repulsorlift battalion, the main mobile element of the Imperial garrison. With this gone, the Imperials were reduced to just dismounted infantry and lumbering heavy armor. While the Imperial armor had much heavier firepower than the Alliance taskforce, it lacked the agility to pin down the fast-moving Rebel vehicles, and the garrison's infantry simply could not stand up against the firepower of light tanks and armored cars."}, {"tag": "p", "text": "Without mobile forces or fighter support, the Imperials had to cede territorial control of the planet to the Rebels. Kollis withdrew his forces into the uplands around their garrison base, deploying troops to hold the passes, and requesting reinforcements. Major Csino knew that he could not overwhelm the garrison's defenses, so he requested an Infiltrator unit to attack the base. However, neither command could spare the troops to decide the campaign."}, {"tag": "p", "text": "At least in the short term, the refusal of the Empire to be drawn further into the struggle represented the defeat of the Rebels' underlying strategic goal on Nishr. Also, as mentioned above, there is no evidence that their presence provoked a widespread rising among the Nish, even though they now had nominal territorial control of most of the planet. The Rebel bases remained in areas far removed from the Nish centers of population, and Alliance sources would later acknowledge that the mission profile had not been though through in detail. By this stage, however, the taskforce was committed to the campaign, and the Imperials had at least been driven back into defensive positions."}, {"tag": "p", "text": "On the ground, a stalemate ensued. Rebel sources record that Csino's men kept up the pressure by launching night-time raids to weaken the Imperial perimeter positions, and in Operation Shadowplay, Rebel Sector Command simulated the deployment of an Infiltrator team, making the Imperials believe that the taskforce had acquired the ability to make a direct assault on their defenses. However, it could also be noted that a valuable SpecForce taskforce, with significant heavy equipment, had been drawn into a relatively protracted and conventional surface campaign."}, {"tag": "p", "text": "How the campaign developed beyond this point is not revealed in available sources."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nishr Campaign was created for the Star Wars RPG from West End Games, and as such, the scenario is left open-ended."}, {"tag": "h2", "text": "Sources"}]}