{"url": "Nite_Owls/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Nite Owls"}, {"tag": "p", "text": "The Nite Owls were an elite unit of Mandalorian soldiers within the Death Watch. During the galaxy-spanning conflict known as the Clone Wars, the unit was led by the female Mandalorian Bo-Katan Kryze, a trusted lieutenant of the Death Watch's leader, Pre Vizsla."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 21 BBY, the Nite Owls were present on the planet Carlac along with the rest of the Death Watch. They fought for the Death Watch in the First Skirmish on Carlac."}, {"tag": "p", "text": "Around 20 BBY, the Nite Owls would participate in the Takeover of Mandalore with the rest of the Death Watch. They split apart from the Death Watch after the Sith Lord Darth Maul killed Vizsla and proclaimed himself the Death Watch leader. Refusing to recognize an outsider as her superior, Bo-Katan fled with the Nite Owls."}, {"tag": "p", "text": "The Nite Owls allied themselves with Satine's loyalists led by her nephew Korkie, and they attempted to break the former Duchess from prison in order to send a message to Jedi Master Obi-Wan Kenobi for help against Maul. During the break out, the Nite Owls and loyalists were engaged by several members of Maul's Death Watch loyalists as they attempted to take Satine out of the city of Sundari. They were ultimately overwhelmed, and Satine was recaptured, but the members of the squad escaped."}, {"tag": "p", "text": "Kenobi would soon come to Mandalore and free her himself, but they were stopped while they were trying to escape, and Satine was executed. As Kenobi was being taken to prison, Bo-Katan and the Nite Owls rescued him. This began the Battle of Sundari, with the Nite Owls and Kenobi on one side, and the Mandalorian super commandos on the other. Eventually, Bo-Katan and Kenobi fought their way to a starship, and Kenobi left to inform the Republic of the situation on Mandalore."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Nite Owls equipment was similar to that of the rest of Death Watch wearing a set of Mandalorian armor, comprising of several individual plates colored in both metallic gray and blue. Even though each of their armor had unique symbols on them they all used the same type of weaponry equipped to their armor including dart launchers, blasters and possibly hidden blades within their gauntlets as well as trip wire and a jetpack for flight."}, {"tag": "p", "text": "The group was also able to gain control of two Kom'rk-class fighter/transports to carry their group into battle once they were most likely either abandoned or stolen from the former Death Watch Members."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the trivia gallery for \"A Friend in Need\" originally referred to the group as the \"Night Owls,\" The Clone Wars: Darth Maul: Shadow Conspiracy listed them as the \"Nite Owls,\" which was reflected in the episode guides for their Season Five appearances."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}