{"url": "Nix_Card", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Galactic Republic senators", "Category:InterGalactic Banking Clan members", "Category:Males", "Category:Muuns", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Nix Card"}, {"tag": "p", "text": "Nix Card was a male Muun executive and senator of the InterGalactic Banking Clan, replacing Rush Clovis, who had filled the position earlier in the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 21 BBY during the Clone Wars, Card was Senator for the InterGalactic Banking Clan in the Galactic Republic's Senate, having succeeded Baron Rush Clovis. Following the proposal of bill that would have deregulated the banks, Card spoke with Lott Dod and Gume Saam in his office about the reasons of its failed passing. Despite Saam's idea of assassinating Senator Padmé Amidala, Card knew that the Senate would not deregulate the banks. Thus, Card said they would have to bring the war to Coruscant in order to force the congress to deregulate the banks. He and Dod agreed to contact their clients on the side of the Confederacy of Independent Systems."}, {"tag": "p", "text": "Card spoke with Count Dooku and General Grievous and urged them to launch their attack on Coruscant. After the Separatist Senate voted to open peace talks with the Republic, Card, Dod, and Saam spoke with Dooku. They were displeased that the Separatist Congress had voted to open negotiations, but the Count assured them that chances of peace would disappear after their attack. Dooku and Grievous were able to carry out the attack. Seeing confirmation of the Confederacy's involvement, the Galactic Senate was persuaded by Saam to retaliate by deregulating the banks to access much-needed funds for the military."}, {"tag": "p", "text": "Card attended a slave auction on Zygerria in 20 BBY. In 19 BBY Card escorted Senator Amidala to the world of Scipio and later had her arrested for espionage. After Amidala's liberation, the Core Five blamed Card for his failure to prevent her from uncovering information, which proved their corruption had almost caused the bankruptcy of the Banking Clan. In his private office, Card contacted Darth Sidious and informed him that their plan was ready. His benefactor then eased his concerns by assuring him that he would be protected."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Card was voiced by Corey Burton, who also voices Separatist leader Count Dooku and Hutt crime lord Ziro Desilijic Tiure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}