{"url": "Nizuc_Bek/Legends", "categories": ["Category:Legends articles", "Category:Bartenders", "Category:Corulag residents", "Category:Desilijic servants", "Category:Humans", "Category:Males", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Nizuc Bek"}, {"tag": "p", "text": "Nizuc Bek was Jabba the Hutt's band manager, responsible for hiring bands to play at his Palace. He was also the bartender aboard Jabba's sail barge and would do anything for a cup of juri juice."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Bek was born on Corulag. For a time he worked as a bouncer at Chalmun's Cantina and became friends with the bartender, Wuher. By 4 ABY Bek came under the employment of Jabba the Hutt, accepting the proposal without regret, where he worked as a guard for visiting celebrities to Jabba's Palace, including Sy Snootles and the Max Rebo Band."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "When Luke Skywalker visited Jabba's palace to release Han Solo, Bek's DL-18 blaster pistol was force pulled from his holster by Luke, who used the Force to obtain it and try to defend himself."}, {"tag": "p", "text": "Nizuc Bek was aboard the Khetanna when Jabba traveled to the Great Pit of Carkoon to execute Skywalker and his companions. The captives fought back, leading to the Khetanna's destruction and Bek's death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nizuc Bek first appeared in the 1983 film Star Wars: Episode VI Return of the Jedi, the final installment of the Star Wars original trilogy. In the film, he was played by an uncredited actor. Despite his minimal appearance in Return of the Jedi, his backstory has been fleshed out in several Expanded Universe sources, such as Star Wars: Behind the Magic."}, {"tag": "p", "text": "In James Kahn's novelization, the guard who falls into the pit of Jabba's Rancor is the same one Luke Skywalker disarms (fulfilling the role of Bek and Jubnuk) and thus gets eaten alive by the beast. The novel reveals that before getting killed, he takes his blaster to fire on the rancor, to no avail and enraging it. This version of the rancor scene was actually present in the film's rough draft, describing the guard as a \"man\", but was changed in the final cut."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}