{"url": "2BB-2", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:BB-series astromech droids", "Category:Masculine programming", "Category:Resistance droids"], "nodes": [{"tag": "h1", "text": "2BB-2"}, {"tag": "p", "text": "2BB-2 was a blue-plated BB-series astromech droid with masculine programming in the service of the Resistance. He was present aboard the MC85 Star Cruiser Raddus during the evacuation of the Resistance base on the planet D'Qar in 34 ABY. After the destruction of the Raddus's bridge, 2BB-2 attended a meeting during which command of the Resistance was granted to Vice Admiral Amilyn Holdo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "2BB-2 was a BB-series astromech droid with masculine programming that served in the Resistance during its war against the First Order. In 34 ABY, 2BB-2 was among the forces stationed aboard the MC85 Star Cruiser Raddus while the Resistance evacuated its base on the planet D'Qar. 2BB-2 was on the cruiser's command bridge supervising the evacuation when a fleet of First Order vessels arrived above D'Qar and attacked the retreating Resistance."}, {"tag": "p", "text": "The Resistance fleet successfully escaped its attacking foes and jumped to hyperspace. However, upon arriving at its destination, the fleet immediately came under attack from the First Order again, having been tracked through hyperspace. At some point, 2BB-2 exited the command bridge, which was soon destroyed, killing all who had remained there except for General Leia Organa."}, {"tag": "p", "text": "The astromech droid then attended a meeting on the Raddus's ventral emergency bridge, where Commander Larma D'Acy announced the Resistance's casualties and named Vice Admiral Amilyn Holdo the Resistance's new leader while Organa recovered from her injuries. A small portion of the Resistance ultimately survived the attack and escaped from the First Order on the planet Crait."}, {"tag": "p", "text": "The B1-series battle droid R0-GR later wrote about 2BB-2 and his fellow Resistance BB unit BB-4 in a work he compiled and called a \"droidography.\" R0-GR claimed that the two Resistance droids were not as popular as another BB unit, BB-8."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "2BB-2 had blue plating and was equipped with a black security-grade photoreceptor with a telescopic lens. 2BB-2's head did not include the full dome that some BB-series droids possessed, instead lacking plating in some areas and revealing the workings beneath."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "2BB-2 was created as a prop for the 2017 sequel trilogy film, Star Wars: Episode VIII The Last Jedi. The droid was first revealed prior to the film's release on September 1, 2017, as part of the Force Friday promotional event, where he appeared in the Find the Force feature on the Star Wars App. Creature concept designer Jake Lunt Davies produced concept art of 2BB-2 for The Last Jedi, titled \"Rebel BB Head Design 01,\" which included a deconstructed diagram of the droid's new head design."}, {"tag": "p", "text": "In the non-canon Star Wars Blips animated short \"Fan Droids,\" which debuted on YouTube on September 3, 2017, 2BB-2 and several other Resistance droids watch a holographic projection depicting the past exploits of the astromech droid R2-D2. 2BB-2 then spots R2-D2 approaching the group, and the droids all become extremely excited as he passes. The Star Wars Droids App by Sphero mistakenly refers to 2BB-2 as \"BB-2.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}