{"url": "Noble/Legends", "categories": ["Category:Legends articles", "Category:Stub", "Category:Nobility", "Category:Phrases"], "nodes": [{"tag": "h1", "text": "Noble"}, {"tag": "p", "text": "\"Noble\" was a term often used as a category for those individuals that served as the dignitaries of the galaxy. Nobles were typically members of the upper parts of galactic society. Sometimes, they were born into the upper classes and were from families of noble or similar status on their home planets. Others worked their way up the social ladder via their political, diplomatic, military, commercial, artistic, media, and sometimes even criminal careers."}, {"tag": "h2", "text": "Noble privileges"}, {"tag": "p", "text": "Privileges associated with their social state could constitute substantial advantages over or relative to non-nobles, or could be largely honorary, but were apparently maintained, or officially acknowledged, by law or governments. After the destruction of her homeworld, Leia Organa of Alderaan was still addressed to as \"Princess\", despite the de facto disparition of Alderaanian monarchy."}, {"tag": "p", "text": "Nobles would often use intelligence or charisma rather than brute force and direct confrontation. They were typically well-versed in the arts of rhetoric and negotiation and were highly socially skilled. Some nobles were truly honest and honorable people—as exemplified by Bail Prestor Organa—while others were sly and treacherous—like the young Palpatine."}, {"tag": "p", "text": "They were, due to their status as dignities and their social skills, typically influential people who were well-suited for leadership.\nPopular conception of nobles would see them as staying as far as possible from warfare, but many nobles steeled themselves for battles, coordinating tactics and sometimes leading the charges from the front lines. In fact, many noble families had a proud history of military service, and more than a few of those houses had laid the foundations of their business empires by working as part of mercenary units. Some of them, like the Count Dooku of Serenno, even became Jedi, which had them renounce their privileges. Many Nobles worn notable rings or other artifacts that distinguished them from the common people, like the ones from the planet Kilia IV, who used Marker Rings."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "From 3959 to 3956 BBY, Darth Revan's Sith Empire fought the Galactic Republic. At that time, nobles were more likely to be drawn to leadership and action, due to the fewer opportunities for peaceful negotiation and rhetoric in this area. Many of them served as inspiring officers were required to bolster the spirit of the war-weary galactic citizens in their fight against the bellicose Mandalorians and the Sith. Many nobles decided to create successful careers by serving major interstellar corporations, either to keep themselves from the war, or to preserve a high degree of autonomy."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "The Clone Wars, a galactic conflict between the Republic and the Confederacy of Independent Systems, ran from 22 to 19 BBY. This period was a difficult one for nobles too, as their resources were likely to be drained by either the Republic or the Confederacy ; some of them even saw their homes completely destroyed and pillaged when the conflict reached their home planet. Some fled their homeworlds with nothing left to lose, hoping to find safety, while others decided to play their part in the war on either side."}, {"tag": "h3", "text": "The Dark Times"}, {"tag": "p", "text": "When the Clone Wars ended, the Supreme Chancellor Palpatine, leader of the Republic, revealed his true agenda. Palpatine dismantled the government, turning it into the first Galactic Empire. Members of the nobility were urged to decide their allegiance quite quickly. Those who were close to the Imperial power would either support the New Order wholeheartedly or work in secret as rebels. For the nobles of the the fringe, that new era known as the \"Dark Times\" offered many new possibilities, as governmental confusion allowed more discretion for less than legal activities."}, {"tag": "h3", "text": "Rebellion era"}, {"tag": "p", "text": "Following the signing of the Corellian Treaty in 2 BBY, the Rebel Alliance was created, with the intention to defeat the Empire and restore the Republic. In that era, most nobles were tempted to embrace the philosophy of the Empire, especially Human nobles, as it could be a fast track to wealth and increased power due to the Human High Culture. Privileged noble youth were expected to enroll in the New Order's programs, such as the Sub-Adult Group of COMPNOR, in order to better prepare themselves as future Imperial leaders, such as future Moffs, or join the ranks of the Imperial Military. However, some young idealistic nobles just couldn't follow the edicts of the Empire and decided to support the Rebel Alliance—often in secret, but sometimes overtly. The ones who chose the latter option would be socially disgraced, sometimes exiled or murdered."}, {"tag": "h2", "text": "Titles within the \"true\" nobility"}, {"tag": "p", "text": "Titles of sovereignty"}, {"tag": "p", "text": "Titles of other nobility"}, {"tag": "h2", "text": "Examples of nobles"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Noble is a heroic class in the Star Wars Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}