{"url": "Noble_Court", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Governments in exile", "Category:Interplanetary governments", "Category:Members of the Noble Court", "Category:Outer Rim Territories governments", "Category:Secret societies"], "nodes": [{"tag": "h1", "text": "Noble Court"}, {"tag": "p", "text": "The Noble Court was the autocratic government of the Nothoiin species that controlled the Anoat sector, an independent sector located in the galaxy's Outer Rim. The Noble Court had ruled the sector since before the rise of the Galactic Republic and were not part of the galactic government, remaining independent throughout the Republic's existence."}, {"tag": "p", "text": "However when the Republic fell and was replaced by the authoritarian Galactic Empire, who had little tolerance for the Noble Court independence and annexed the Anoat sector, leading to the Court almost being eradicated. The Court, however, managed to survive the Empire's efforts to stomp them and went into hiding, becoming a government in exile in the form of a secret society as the Empire reigned over the sector."}, {"tag": "p", "text": "Throughout the Galactic Civil War, the nobles actively worked to protect the citizens of the Anoat sector and to return to their former power. With the untimely death of Palpatine, sole ruler of the Empire, at the Battle of Endor, the sector was put on lockdown by Imperial Governor Ubrik Adelhard. Thanks to the influence of a young smuggler from Burnin Konn, the Noble Court joined the Uprising, a resistance movement that tried to fight the Empire in the Anoat sector."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rulers of the Anoat sector"}, {"tag": "p", "text": "Before the rise of the Galactic Republic, a democratic union that governed many solar systems across the whole galaxy, the Anoat sector of the Outer Rim Territories was ruled by families of Nothoiin nobles collectively referred to as the Noble Court. Even after the Republic came into existence, the sector remained independent. However, despite the dominance of the Court over the entire sector, the Hutts were in control of the planet Mataou. At one point, the two groups gathered at Mataou's Shrine of Dynasties in order to discuss matters of peace and cooperation. With the aid of their advisers, the nobles and their monarchs managed to maintain their independence for many centuries."}, {"tag": "h3", "text": "Purges of the Empire"}, {"tag": "p", "text": "However, the Republic was replaced by the Galactic Empire, a new tyrannical regime, after the end of the three-year-long Clone Wars. That Empire had little tolerance for the Court's desire of independence and as an effect of the Great Jedi Purge, the Empire almost wiped out the Advisers, a Force-using organization and issued a number of kill orders on the nobles themselves. Although the Empire claimed to have wiped out the Anoat nobility, many members of the Court managed to survive and went in hiding along with the Advisers. Despite the loss of their power in the sector, the nobles continued to thrive in secret through the support of their many retainers, agents, and advisers. Additionally, the aristocrats still lived under constant threat, and royals were forced to learn how to avoid assassination. As the years passed, the nobles worked to reclaim their former prestige."}, {"tag": "h3", "text": "Joining the Uprising"}, {"tag": "p", "text": "Twenty-three years after founding the Empire, the malevolent Emperor Sheev Palpatine was killed during the Battle of Endor. Ubrik Adelhard, the Imperial governor in charge of the Anoat sector, immediately set up a blockade to try and suppress the knowledge of Palpatine's demise from spreading. However, a young smuggler from Burnin Konn discovered a holomessage from Princess Leia Organa, enemy of the Empire, explaining the events at Endor. The Noble Court of the time, led by the queen-in-exile only referred to as Her Majesty, eventually learned of that message when the Ivax Syndicate contacted them with an offer of alliance. Sir Corto Belrake, an agent to Her Majesty, engaged in negotiations with the Burnin Konn smuggler, who served as a representative of the Syndicate. After the smuggler defeated Earl Alner on Her Majesty's behalf, the queen-in-exile agreed to the proposed alliance, whose aim was to capture Bragh, commander of the deadly Imperial Purge Troopers. Later on, the alliance came to include a third party, an order of assassins known as the Kouhun. That new, tripartie resistance movement came to be known as the Uprising."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Government"}, {"tag": "p", "text": "The Noble Court was a aristocratic government dominated by a collective of noble families which were led by a king or queen. The aristocrats were once consisted only of Nothoiins, over time it grew to be more diverse with many species in the aristocracy but the Nothoiins would still processed the majority of power within the court including the monarch who was of Nothoiin blood, it members held titles such as Duke and Earl."}, {"tag": "p", "text": "After the rise of the Galactic Empire, the Anoat nobility was almost wiped out and forced into exile after kill orders were ordered on the nobles, the court then lost all it territory and the monarch and her government were forced into hiding. By 4 ABY the court in-exile acted as a secret society seeking to reclaim it lost domain and was ruled by a female Nothoiin only known as Her Majesty, the real identity of Her Majesty remained hidden by tradition."}, {"tag": "h3", "text": "Defense"}, {"tag": "p", "text": "Nobles of the Court had masked, sword-wielding protectors to defend them."}, {"tag": "p", "text": "In addition to the nobles and their protectors themselves, the Court also included different types of personnel. The nobles notably employed secret agents who, despite not being assassins, were as deadly as any gun-for-hire. There were also archivists tasked with maintaining the court's extensive archives. Last but not least, there were also mysterious advisers who knew the way of the Force, a mystical energy field that bound the galaxy together."}, {"tag": "h3", "text": "Foreign affairs"}, {"tag": "p", "text": "While the nobles had difficulties working with assassins and criminals, all three groups had a common goal and were tied together by the unifying influence of the Burnin Konn smuggler. To confront Commander Bragh's Imperial-class Star Destroyer, Her Majesty provided several Throneships, which were fitted with weapons salvaged from the icy plains of Hoth."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Demographics"}, {"tag": "p", "text": "The Noble Court was a group noble families headed by a king or queen. Among them was a fairly large contingent of Nothoiin, a species of gold-skinned humanoids that hailed from a world of the same name. Aristocrats that ranked below the monarch held titles such as Duke and Earl and held a powerful, regal and prestige presence."}, {"tag": "p", "text": "By the time of the Iron Blockade that took place throughout the Anoat sector during the Galactic Civil War in the aftermath of the Battle of Endor, the Court-in-exile was more diverse in species and come to include humans."}, {"tag": "h3", "text": "Religion"}, {"tag": "p", "text": "An ancient Force-using order, called the Advisers, had the role to ensure the survival of the Noble Court and helped the nobles maintain their independence under the Galactic Republic and survive the purges of the Galactic Empire, which involved the teaching of Force techniques to some nobles. Their existence was tied to the assembled ruling families of the sector. The order was led by a Mentor, who trained several acolytes, including a Nothoiin named Amrosio under Xiath, who upon sensing the Force-sensitivity of his visitor, Xiath offered to train the young smuggler during the Iron Blockade."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The Noble Court once controlled most of the Anoat sector in the Outer Rim Territories, with sprawling city-world, Anoat serving as the capital world of the whole sector, known Court worlds included Burnin Konn, Allyuen and Zhanox. After Noble Court space fell to the Galactic Empire during its mass expansion, the court lost all territory and was forced into hiding."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}