{"url": "Nocturn%C3%B4", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Death Stars", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Nocturnô"}, {"tag": "p", "text": "The Nocturnô was an unfinished prototype of a Death Star, a class of moon-sized battlestations armed with a planet-destroying superlaser."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was never fully completed, and concealed by the Galactic Empire in low orbit around a gas-giant in an unknown system. At some point, apparently in the years between the Battle of Yavin and the Battle of Endor, the female shapeshifter known as the Hydra took the place of the Nocturnô's commander, General Tarkhan, and attempted to seize control of the battlemoon for her own nefarious purposes."}, {"tag": "p", "text": "The Imperial forces assigned to the station seem to have served primarily as a protective garrison, including an extensive array of security droids, plus a force of elite Stormtroopers in black armor, who spent much of their time in cryopreservation cabinets, and were no longer entirely sane after years serving aboard the station. The garrison also had some light armor, including scout walkers, which—perhaps in a manifestation of their state of mind—they stationed inside the docking bays."}, {"tag": "p", "text": "The habitable areas aboard the Nocturnô were distinguished from those of the other Death Stars by somber lighting and an air of neglect, but although incomplete, the station did boast a number of docking bays, powerful tractor beams, and detention blocks similar to those of her sisters, and a functional superlaser prime weapon. The main generator appears to have been deactivated, but the Hydra brought with her a stolen Imperial energy-source capable of rendering the superlaser fully armed and operational."}, {"tag": "p", "text": "However, there is no indication that the psychopathic shapeshifter was ever allowed to make any effective use of the battlemoon's planet-cracking firepower; although direct evidence is lacking, it seems likely that the Rebel Alliance team who arrived at the same time prevented her plans, but whether the Nocturnô was actually destroyed in the process remains unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nocturnô appears only in the French-language RPG magazine Casus Belli 99; as a result, its canonical status is unclear."}, {"tag": "p", "text": "The scout walkers carried aboard the battlemoon are identified in French by the designation TR-TT or Transport de Reconnaissance Tout Terrain. At the time the magazine was written, this designation indicated the AT-ST; but some French fansites claim that the same designation is shared by the smaller, older vehicle known in English-language material as the AT-RT.  ."}, {"tag": "p", "text": "In French, the words \"Reconnaissance\" and \"Scout\" can only be translated by a single word : \"Reconnaissance\" (others translations are less adequate, like \"Observation\" or \"Exploration\"). The AT-S(scout)T is translated officially into TR-TT, and AT-R(reconnaissance)T must also be translated into \"TR-TT\" - or \"Clone Army TR-TT\". However, the Transport de Reconnaissance Tout Terrain designate in French the Imperial model of TR-TT (All Terrain Scout Transport), not the Grand Army one (All Terrain Reconnaissance Transport)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}