{"url": "Noe%27ha%27on/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Jungle planets", "Category:Piryn Shar sector planets"], "nodes": [{"tag": "h1", "text": "Noe'ha'on"}, {"tag": "p", "text": "Noe'ha'on was a jungle planet located in the Expansion Region's Piryn Shar sector. Its fauna included poisonous insects and k'lor'slugs—ferocious, worm-like swamp predators. Noe'ha'on also had large fossil beds rich with the preserved remains of organisms."}, {"tag": "p", "text": "The Noehons were sentient insectoids native to Noe'ha'on. They lived in communities called welds and were at an industrial level of technology, harvesting their homeworld's natural resources and crafting several materials and substances from them."}, {"tag": "p", "text": "Noe'ha'on lay along the Great Gran Run hyperlane, and it served as a frequent stopping point for interstellar merchants. Off-world traders introduced the Noehons to more advanced weaponry, leading to heightened inter-tribal violence and anarchy on their homeworld. Eventually, Noe'ha'on became a member of the Galactic Republic and its successor, the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Noe'ha'on was a distant planet located in the Noe'ha'on system, a part of the Piryn Shar sector of the Expansion Region. The hyperlane known as the Great Gran Run connected it to the Natalon system as well as the New Balosar system in the Arc d'Stot sector."}, {"tag": "p", "text": "A jungle world, Noe'ha'on also featured swamps, in which pink-colored mud-clay could be found. In addition, the planet's surface included large fossil beds, where many preserved remains of Noe'ha'on's wildlife were located."}, {"tag": "p", "text": "Noe'ha'on was the homeworld of the k'lor'slug, an aggressive species of venomous, worm-like swamp predators. K'lor'slugs could already be found off-world a century before the outbreak of the Galactic War. Poisonous insects also populated Noe'ha'on, and diseases could be contracted in the planet's wilderness."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 3630 BBY, several expeditions were sent to Noe'ha'on to recover fossils, with the planet's fossil beds eventually becoming littered with the tools of those failed ventures. That year, the commander of the Eternal Alliance dispatched a companion to Noe'ha'on, where the latter found an abandoned paleontologists' camp and scavenged what had been left behind there."}, {"tag": "p", "text": "The area of space surrounding Noe'ha'on was explored between 1000 BBY and 25 BBY, with the Galactic Republic establishing first contact with the native Noehon species at some point. The planet fell within the borders of the Republic during the Clone Wars of 22 BBY–19 BBY. During the first campaigns of that conflict, the Nineteenth Army of the Republic Military was tasked with defending Noe'ha'on's vicinity against the military forces of the Confederacy of Independent Systems. Between 19 BBY and 17 BBY, Noe'ha'on was incorporated into the territory controlled by the Galactic Empire."}, {"tag": "p", "text": "At some point during the Galactic Civil War, a group of individuals became interested in obtaining and selling a valuable medicinal drug only available on Noe'ha'on. The individuals underwent a dangerous and uncomfortable journey to the planet, where they faced capture by a dominant Noehon male."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Noe'ha'on was inhabited by the Noehons, a species of sentient arboreal insectoid. They were small, four-armed bipeds who spoke the Noehonese language. Noehons lived in welds, isolated communities whose membership could range from a few hundred to 10,000 individuals. The population of the Noe'ha'on system around 25 ABY numbered from 100 million to 500 million."}, {"tag": "p", "text": "Eventually, the Noehon society reached industrial level of technology. The insectoids harvested and refined their homeworld's natural resources and manufactured rubber products, glues, spices, wood-fiber products, and specialty paper goods. Due to the potent natural healing agents present in Noe'ha'on's jungles, the Noehons also crafted relatively advanced medicines. To obtain energy, Noehons burned petroleum, coal, and wood. The Noehon weapons were usually inaccurate rapid-fire projectile devices."}, {"tag": "p", "text": "Noe'ha'on was frequently visited by off-worlders, serving as a regular stopping point for several galactic merchants. Unscrupulous, independent interstellar traders introduced the natives to blasters and vibroweapons. As a result, Noehon tribal rivalries transformed into full-scale wars between the welds that would continue until one of the sides in the conflict was annihilated. Another effect of the inter-weld violence was that the reigning anarchy prevented the Noehons from ever developing space-flight technology of their own. However, the off-world visitors were willing to transport the Noehons off Noe'ha'on for a price, allowing a small fraction of the species to colonize other worlds in the galaxy."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A camp used by paleontologists was located near the fossil beds on Noe'ha'on. By 3630 BBY, the camp had been abandoned, with functional equipment and a carefully-cleaned fossil left behind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Noe'ha'on was created by Lisa Smedman and introduced in Galaxy Guide 12: Aliens — Enemies and Allies, a 1995 sourcebook for use with West End Games' Star Wars: The Roleplaying Game. The book includes a roleplaying game adventure seed set on Noe'ha'on. This article assumes the scenario plays out as described. The 2009 reference book The Essential Atlas placed the Noe'ha'on system, and therefore the planet Noe'ha'on, in grid square K-16."}, {"tag": "p", "text": "Noe'ha'on was later mentioned in Rise of the Hutt Cartel, a 2013 expansion for Star Wars: The Old Republic, a 2011 massively multiplayer online roleplaying game developed by BioWare. In the expansion, players could assign their companions on individual quests to visit Noe'ha'on, where Sith Lord Skatheris was studying k'lor'slugs in their native habitat. If particularly successful, the companions would help the Sith develop an anti-k'lor'slug serum. With the 2016 Game Update 4.1, however, the text of the relevant mission was changed to instead state that \"Professor\" Skatheris was studying the dianoga creatures on Vodran. In the 2016 expansion Knights of the Eternal Throne, players could once again dispatch their companions on a mission, albeit a different one, to Noe'ha'on."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}