{"url": "Noel_Rubin", "categories": ["Category:Real-world articles", "Category:Star Wars production staff"], "nodes": [{"tag": "h1", "text": "Noel Rubin"}, {"tag": "p", "text": "Noel Rubin created user-interface (UI) motion graphics for the prequel trilogy of Star Wars. Rubin's work on the prequels is most heavily featured in Star Wars: Episode I The Phantom Menace, where he created the UI for the Lucrehulk-class freighter, the Naboo Royal Starship, Anakin Skywalker's Podracer, and R2-D2's hologram of the Theed Royal Palace. In Star Wars: Episode III Revenge of the Sith, Rubin designed the interface of the Invisible Hand."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born in 1970, Noel Rubin grew up during the age of classic science-fiction movies of the late 1970s and early 1980s, Rubin took a vivid interest in the futuristic computer displays that were featured in films of that time, including Tron, Blade Runner and the original trilogy of Star Wars. Because of that, Rubin decided that, one day, he too would create user interfaces for movies."}, {"tag": "h3", "text": "Work on the Star Wars prequels"}, {"tag": "p", "text": "In 1998, he met Michael Brunsfeld, then senior art director of Industrial Light & Magic (ILM), who forwarded his demo reel to the team that would create the effects for the prequel trilogy of Star Wars films. Rubin was offered a job at ILM, although there was initially no guarantee that he would work on the prequels. However, he eventually was tasked with designing and animating several user interfaces' motion graphics in both Star Wars: Episode I The Phantom Menace and Star Wars: Episode III Revenge of the Sith. Rubin's work on the those movies encompassed five distinct interfaces: those of the Lucrehulk-class freighter, the J-type 327 Nubian, Anakin Skywalker's Podracer, R2-D2's hologram of the Theed Royal Palace, and the Invisible Hand."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}