{"url": "Noehon", "categories": ["Category:Legends articles", "Category:Expansion Region species", "Category:Insectoid sentient species"], "nodes": [{"tag": "h1", "text": "Noehon"}, {"tag": "p", "text": "The Noehons were sentient arboreal insectoids indigenous to Noe'ha'on. Noehons were well-known throughout the galaxy as a species of slaves and slave-traders. Their culture was often considered brutal and violent, though Noehons raised away from Noe'ha'on's rigid, hierarchical society showed a talent for organization which served them well in technical and bureaucratic fields."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Noehons had large red compound eyes, with each facet responsible for a different aspect of vision; such as motion or the fine details of nearby objects. They had large mandibles, and a soft, bristly carapace, which was mottled green in color. They walked on two legs, and had four arms with which they could use tools or brachiate through the jungles of their homeworld. Since they were used to hanging upside-down in trees, they were resistant to the disorientation and motion sickness, which afflicted some species in zero-gravity conditions."}, {"tag": "p", "text": "Every Noehon had a pair of scent glands, one of each side of their mouth, which produced a strong, musky scent. Each individual Noehon had a unique scent, which they used to mark possessions, territory, and their subordinates. The scent was difficult to remove, even with repeated washing. Noehons were typically possessive, frequently marking items in their possession and rarely discarding items which they thought might be useful later. They also tended to organize their possessions fastidiously, ensuring everything was in its proper place."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "Noehon society was based on tightly-knit communities called welds, containing anywhere from a few hundred to ten thousand members. Each weld was ruled by a single dominant \"alpha\" male. The alpha male's \"harem\" of females were treated as commodities, with excess adolescent females traded to other welds for technology and other valuables. Some welds would steal females from smaller, poorly defended welds. Noehon females also organized themselves hierarchically, with the oldest females dominating the youngest or most recently captured females."}, {"tag": "p", "text": "Adolescent males in the weld were driven off by the dominant male as soon as they came of age. Elderly male leaders would usually be killed by a younger male, who then took control of the weld. Despite the rigidity of gender roles within the weld, Noehons did not treat female and male offworlders differently. Even among offworlders, however, they understood society in a hierarchical way: bullying subordinates while fearing and trying to appease superiors. Noehons had a natural talent for managing others through intimidation."}, {"tag": "p", "text": "Noehon males who had never established or taken control of a weld were often less domineering, and lived a solitary existence on Noe'ha'on. Others went offworld to establish their dominance over slaves of other species. Females such as Tir'uh, one of the leaders of the Mytaranor Slaving Council, also went offworld to take up the slave trade. Female Noehon slavers were sometimes crueler masters than males, even though they usually began their own lives as chattel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Noehons never developed spaceflight or galactic-level technology on their own, though they did develop their own crude industrial technology powered by wood and fossil fuels. Visiting spacers traded advanced technology to the welds, including blasters and vibroweapons, in exchange for Noehon slaves, medicinal products, and natural resources. With a glut of advanced weapons replacing Noehon slugthrowers, tribal rivalries turned into violent conflicts which only ended when one weld was utterly destroyed."}, {"tag": "p", "text": "Though the vast majority of Noehons remained on their homeworld, slaves and descendants of slaves were found throughout the galaxy. Noehons were able to adapt to life on many worlds, as well as zero-gravity conditions. Noehon raised outside a weld were calmer than their counterparts from their homeworld, and could integrate more successfully with the galactic community."}, {"tag": "p", "text": "During the Galactic Civil War, the brutality of Noehon culture fit in well with the needs of the Galactic Empire's war machine. Other Noehons, especially those raised outside of welds, used their fastidious organizational talents to help the Alliance to Restore the Republic. One such Noehon was Captain Hark'r, supply master of the Alliance to Restore the Republic's Home base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}