{"url": "Astri_Oddo", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Character stubs", "Category:Business owners and executives", "Category:Coruscanti", "Category:Females", "Category:Humans", "Category:Resistance fighters", "Category:Slicers", "Category:Waiters"], "nodes": [{"tag": "h1", "text": "Astri Oddo"}, {"tag": "p", "text": "Astri Oddo was a cook, adopted daughter of Didi Oddo, and pre-owner of Dex's Diner."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Astri served as the cook at Didi's Cafe, owned by her adopted father, Didi Oddo, who found her at the doorstep of the cafe. She came to meet Qui-Gon Jinn and his apprentice Obi-Wan Kenobi through her father. Later, when Obi-Wan's Master was captured and her father shot by the bounty hunter Ona Nobis, she went with Obi-Wan to find Jenna Zan Arbor, who held Qui-Gon Jinn captive, and the cure for Didi. She then \"married a homesteader in the Outer Rim.\" She was later married to Senator Bog Divinian, by whom she had a son, Lune Oddo Divinian. However, with the Jedi's help she left Bog behind for a long while, after taking up Nuralee as her adopted homeworld."}, {"tag": "h3", "text": "Running from Bog"}, {"tag": "p", "text": "In 18 BBY, she sabotaged the computer systems of the planet Samaria with the permission of prime minister Aaren Larker, prompting Emperor Palpatine to send Ferus Olin to hunt her down. However, the ex-Jedi instead helped her and her son escape the clutches of the Galactic Empire, and relocate on an secret asteroid base located in an atmospheric storm near the planet of Acherin.\nLater, she as well as her son Lune went to live in the Orange Sector of Coruscant, in the safe house of Dex."}, {"tag": "h3", "text": "Lune's kidnapping"}, {"tag": "p", "text": "She spent much time with the Erased and trusted them enough to send Keets Freely and Curran Caladian to look after Lune. Unfortunately Imperial Stormtroopers kidnapped Lune to train as an Imperial Pilot. But Dexter sent Trever Flume and Ferus Olin to save him. She was very grateful to have Lune returned."}, {"tag": "h3", "text": "Tracking Flame"}, {"tag": "p", "text": "When a mysterious young woman named Flam arrived to create a Rebellion team called Moonstrike, a friend of Ferus, Clive Flax, suspected her as an Imperial spy. He asked Astri to help. They then discovered that Flame was in fact Eve Yarrow, and that she was in league with the Sith Lord Darth Vader. Clive and her then contacted the base, warning them of this."}, {"tag": "p", "text": "After the base was destroyed by Vader's superweapon, Astri and Clive agreed to adopt Trever after his memory was wiped to protect him, making him forget what he knew about Darth Vader's real identity and everything that happened in the last year."}, {"tag": "p", "text": "Astri was killed along with Clive and Trever in their attempt to destroy an Imperial factory on Bellazura. Their son, Lune Divinian was unable to participate in the battle, and thus survived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}