{"url": "Nom_Anor", "categories": ["Category:Legends articles", "Category:Domain Anor", "Category:Males", "Category:Planetary leaders", "Category:Spies", "Category:Yuuzhan Vong intendants"], "nodes": [{"tag": "h1", "text": "Nom Anor"}, {"tag": "p", "text": "Nom Anor was an ambitious male Yuuzhan Vong from the Intendant caste's Domain Anor who contributed greatly in shaping the events of the Yuuzhan Vong War, fought between his species and the inhabitants of the galaxy that the Yuuzhan Vong were invading. Born prior to the year 6 ABY, Anor was dispatched as an agent and saboteur to a galaxy other than the Yuuzhan Vong's own to prepare the way for an extra-galactic invasion. Working behind the scenes, Anor scouted out the battlefield ahead of schedule, gathering information, and destabilized the galaxy where he could by inciting conflicts that would make the Yuuzhan Vong's task easier when they went to war. He manipulated the Imperial Ruling Council and contributed to its downfall, and helped create numerous flashpoints of trouble over his years working in the galaxy."}, {"tag": "p", "text": "In 25 ABY, Anor—ranked as an Executor by this time—sided with the Intendant caste's Praetorite Vong, and aided them in being the initial strike force of the invasion, though they would fail against the forces of the New Republic despite Anor's efforts; at the same time, his destabilization work culminated in starting a full-scale war between the planets of Osarian and Rhommamool. Anor also helped found the Peace Brigade organization, a group who would go on to aid the Yuuzhan Vong in their conquest over the course of the war. Later changing allegiances slightly to aid the warrior caste as they took up the invasion, the Executor helped plan an assassination attempt against members of the New Jedi Order, with the help of other Yuuzhan Vong, though their plot fell apart in the Bilbringi system. Later that year, Anor went on to establish relations between the Hutt species and the Yuuzhan Vong, and was instrumental in using the double-dealing Hutts to convince the New Republic that an imminent Yuuzhan Vong attack would occur at the world of Corellia, instead of at the actual target: the shipyards in the Fondor system. Anor participated in the attack that caught the New Republic unawares, though the glory of arranging such a grand victory for his people was swept from his grasp when much of both fleets were destroyed by a blast from the Centerpoint Station superweapon."}, {"tag": "p", "text": "Following the disaster at Fondor, Anor helped in successfully clearing the way for a Yuuzhan Vong invasion of the heavily polluted world of Duro, though his later efforts to sabotage the defensive systems in the Yag'Dhul system to prepare for an attack were compromised by Jedi involvement. In 27 ABY, the Executor was dispatched alongside Vergere to prevent a Jedi strike team from eliminating the queen of the Jedi-hunting voxyn on the world of Myrkr, and to capture the Jedi Solo twins. The agent was only partly successful in his mission, detaining only Jacen Solo while the queen was slain, and Anor was further undermined in the eyes of his superiors after he inadvertently let Solo escape from Yuuzhan Vong custody with Vergere."}, {"tag": "p", "text": "In seeking to provide a culminating victory for his people, Anor was tricked into following a trial of false information dropped by New Republic operatives, and led Warmaster Tsavong Lah into a massive defeat in the Treskov system, where the Warmaster perished against the forces arrayed there. Anor fled to the underworld of the Alliance capital Coruscant, now occupied by the Yuuzhan Vong and renamed Yuuzhan'tar, throwing his lot in with the Shamed Ones who believed in the Jeedai heresy to escape retribution for his failure. The disgraced agent eventually chose to lead the heretics as the prophet Yu'shaa in a bid to regain more power. Discovering evidence that the legendary living world of Zonama Sekot was in fact real, Anor briefly teamed up with Jedi Knights and rogue Yuuzhan Vong to find the planet, though he ultimately betrayed them and the world to win back the graces of Supreme Overlord Shimrra Jamaane. However, although promoted to prefect, Anor soon became disillusioned with Jamaane's rule, and once again took up the role of the Prophet to lead the heretics against the Supreme Overlord as the Jedi and the Galactic Alliance attempted to retake Coruscant. In the end, Anor was captured by the Jedi, while the Yuuzhan Vong surrendered after the death of Jamaane. Realizing that the future held nothing but uncertainty for him, Anor chose to remain on a disintegrating starship as it fell apart over the reclaimed Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The rise of Nom Anor, and initial scouting"}, {"tag": "p", "text": "A male Yuuzhan Vong, Nom Anor was born into the intendant caste's Domain Anor prior to 6 ABY, and as such was destined to live a life as a politician. He rose through the ranks of the caste, quickly being given the rank of Executor among the Yuuzhan Vong, and was given the job of being the first advance scout of the intendant caste's Praetorite Vong. At that time, the Yuuzhan Vong were preparing to invade a galaxy other then their own to establish a new home. That same day, Anor gouged out his left eye with a burning stick in a show of devotion. After doing so, Anor filled the socket with a plaeryin bol, a small organism that could spit poison when Anor willed it to."}, {"tag": "p", "text": "In 6 ABY, Nom Anor was sent on a mission to scout out the galaxy and destabilize any governments that posed a threat to the swift invasion of the galaxy. During one of his first reconnaissance missions, Anor traveled to the cityscape world of Coruscant, the capital of the New Republic, where he observed the market area known as the Calocour Heights. In 11 ABY, in order to secure a potential alliance with the Sith, Anor met with aspiring Galactic Emperor Carnor Jax, who notified his master, Lumiya, about the agent. However, before anything could come of it, Jax was slain by the former Emperor's Royal Guard Kir Kanos."}, {"tag": "p", "text": "Anor turned his sights on the Imperial Ruling Council, which led the remains of the Galactic Empire that year. He met with council member Xandel Carivus, whom he had follow a set of instructions that would see Carivus gain power in the Imperial Ruling Council. On the planet of Ord Cantrell, Anor assassinated the current Head of the Council Burr Nolyds by planting in the Human's chambers an explosive device, which was decorated with the designation of Kanos, a plan devised to place the blame on the former Guardsman. Like Anor planned, Carivus was appointed the Head of the Council following Nolyd's demise, and the Yuuzhan Vong agent met briefly with Carivus following the event after slipping through the high security around the man's rooms. Anor had Carivus, who was pleased at the turn of events, continue to follow the Yuuzhan Vong's instructions, before departing."}, {"tag": "p", "text": "However, Carivus's power began to be questioned by fellow member Feena D'Asta, and Carivus was furious that Anor's plan had not taken this into account when they next met. Anor refused to reveal his plans to the other, and instead sent him off with the knowledge that there would be another assassination. Anor was true to his word, and General Immodet was later found dead. In response to this, Carivus used the excuse to bring in his personal guards. However, as Immodet was one of Carivus's supporters, the man was confused when he met Anor again, who once again did not reveal any more of his plans to the Imperial. Over the next while, Carivus took matters into his own plans, ignoring Anor's plans, as he cemented his leadership of the Imperial Ruling Council with might. Anor confronted the man once about his lack of obedience, but did not interfere as Carivus made enemies with the D'Asta family and drew the attention of Kanos himself."}, {"tag": "p", "text": "Before Carivus was killed by Kanos during an attack on Ord Cantrell by Ex-Imperial Baron Ragez D'Asta's forces, Anor informed the self-proclaimed Emperor Carivus that his and his leaders' plans no longer included the Imperial. In manipulating Carivus, the agent helped prevent the Galactic Empire from ever regaining power. Anor also had dealings of an unknown nature with Grappa the Hutt, and several other shadowy groups and organizations in order to further his goals."}, {"tag": "p", "text": "By around 14 ABY, Anor was stirring up unrest on the planet of Rhommamool, in the Osarian system, with the help of a group of agitators known as the Red Knights of Life. Although representatives from Rhommamool pleaded with the New Republic for help, they were turned down, as in their eyes Anor had committed no crimes. Anor later paid a group of individuals to raid a Class-3 toxic weapons dump on the world of Nyara and obtain a chunk of zinethium material, which had explosive capabilities. While on the planet Adumar stirring up anti–New Republic sentiments, Anor met up with an individual who gave him the zinethium. That zinethium found its way into the hands of the Restored Empire, an organization plotting the destruction of the New Republic and the Imperial Remnant, the successor state to the Galactic Empire. They used it in an attempt to blow up the Imperial Palace on the New Republic controlled capital of Coruscant. However, due to the intervention of Jedi Master Luke Skywalker, the plan failed. Anor also destabilized the Imperial Moffs, to make the invasion easier."}, {"tag": "h3", "text": "Pre-invasion"}, {"tag": "p", "text": "As years went by, Anor continued to destabilize the New Republic in anyway he could, and frequently stirred up resentment against the Jedi Knights. At one point in time, Anor met Jedi Knight Mara Jade Skywalker, who later remarked that the disguised Yuuzhan Vong was one of the strangest beings she ever met. Anor also seeded several different worlds with a range of illnesses carried by spores that the Yuuzhan Vong agent had created himself, and, thirteen years after Carivus' death, Nom Anor placed coomb spores, which were a poisonous airborne microorganism, in the breath masks of one hundred New Republic diplomats on the world of Monor II, including Jade Skywalker, at the event that marked the ascension of the Priest-Prince Agapos the Tenth to the throne. All of them became infected and many died within a period ranging from several days to weeks of the initial exposure, though the time frame differed depending on the species of the infected individual. Eventually, all except Mara Jade Skywalker died from the spores, though she was able to hold the disease back using the Force."}, {"tag": "p", "text": "During his time in the galaxy, Anor learned to play the game dejarik, and was frequently forced to play the holographic version of it, though he himself did not like the game. Despite the years that Anor spent among the future enemies of his species gathering intelligence, he never discovered that the birth of twins among Humans was a relatively common occurrence, and that some of the larger capital ships used in the galaxy were sometimes used to perform orbital bombardments against enemy ground troops."}, {"tag": "p", "text": "In preparation for the Yuuzhan Vong assault, Anor initiated a destabilization program, which sought to incite old conflicts and grudges into wars that would distract their enemies. The Executor also recruited many agents from the native populations of the galaxy to further his goals. A member of the Praetorite Vong, Anor conspired with them to ensure they would be the ones to lead the initial attack on the galaxy, instead of members of the warrior caste. He also helped them obtain a war-coordinating telepathic yammosk for use in battle, though it was a faulty one that would have been put down by the shapers had Anor not exchanged favors for its life."}, {"tag": "p", "text": "Alerted by the Yuuzhan Vong–allied Fosh Vergere that the Mandalorians were a strong race of warriors that had fought the Jedi in the past, Anor set out to buy their services in 24 ABY to help him destabilize the galaxy. He traveled to the moon of Nar Shaddaa disguised as a man named Udelen in the fifth month of that year, and went searching in the Bar Jaraniz tapcafe for Mandalorian assistance in his plans. There, Anor met with the Mandalorian Goran Beviin, and although the mercenary momentarily drew a blaster on Anor after Beviin mistook one of his movements for a threat, Anor hired Beviin to assassinate Tholote B'Leph, a politician from the industrial world of Ter Abbes. Anor agreed to pay Beviin a hundred thousand credits to kill B'Leph a few days before an election that may have seen him become a governmental leader. Though Beviin briefly left to consider the deal and to sort out backup, the Mandalorian came back and agreed to the terms, with Anor paying the man half of the credits up front, promising to pay the rest once the job was complete."}, {"tag": "p", "text": "Beviin was successful in his mission, eliminating B'leph, and the resulting chaos caused a civil war to erupt, just as Anor had hoped. The Mandalorians' proved to be so efficient in carrying out tasks, Anor would use them multiple times over the following year, and at one point conferred with their leader Boba Fett, though he withheld his grand plans from the famous bounty hunter. Around two weeks before the scheduled arrival of the Praetorite Vong, Anor traveled to the city of Keldabe on the world of Mandalore in a starship to meet personally with Fett. Speaking to the bounty hunter at the base of Anor's ship's ramp, the Executor informed Fett that a war was coming, and requested that he take a few warriors to a specified rendezvous in two weeks time."}, {"tag": "p", "text": "In 25 ABY, two days before the scheduled arrival of the vanguard, Anor rendezvoused in space with the Mandalorians, accompanied by a sizable fleet of Yuuzhan Vong battleships, ensuring that the Mandalorians were the first to witness the arrival of their new masters. Greeting the few assembled Mandalorian ships via comlink, Anor revealed his true name to them, and the purpose of the fleet; invasion. Anor also invited Fett to come dock with the miid ro'ik battleship Anor was aboard to learn more. After Fett, alongside Beviin, docked aboard the living ship, Anor proceeded to give them a grand tour of both the ship and the living technologies within. Wearing no disguising masquer, Anor led them deep into the heart of the miid ro'ik, pointing out to the pair amphistaffs and Vonduun crab armor, and explaining to Fett that the role that the Mandalorians would play would be related to intelligence gathering and covert operations."}, {"tag": "p", "text": "Informing the Mandalorians that the Yuuzhan Vong intended to cleanse the galaxy of machines, which they viewed as abominations, Anor showed the pair a prisoner from Ter Abbes that had been fitted with a Yorik-Kul slave implant. This led Fett and Beviin to suspect that they might become slaves too, though Anor informed them that was not necessarily the fate of the Mandalorian race. With Fett acknowledging the threat of the Yuuzhan Vong race to the Mandalorians, he tried to get Anor to leave the Mandalore sector alone if the Mandalorians continued to aid them. While Anor and the two watched a Yuuzhan Vong remove the implant, killing the prisoner in the process in order to use it on a new Twi'lek prisoner, the Executor considered the offer, and eventually agreed to Fett's terms. Anor then tasked Fett with assembling a team to secure a landing zone for a Yuuzhan Vong assault on the world of Birgis in five days time, and handed the bounty hunter a datachip filled with the necessary information before the pair departed in the miid ro'ik. For the Mandalorian attack on Birgis, Fett refused to use villips, and insisted upon using his own communications devices, which Anor allowed."}, {"tag": "h3", "text": "The invasion begins"}, {"tag": "h4", "text": "Rhommamool"}, {"tag": "p", "text": "With the time for the invasion nearing, Anor continued to stir up trouble on Rhommamool, and its sister planet Osarian, and he used his followers—the Red Knights—and his rhetoric to change a simple mining rights dispute into a struggle against the oppression of Osarian for the people of Rhommamool. In this capacity, Anor kept advisers at hand, but those that voiced their doubts about Anor's abilities soon ended up dead. As a direct result of Anor inflaming the two sides, the New Republic sent a Mon Calamari capital ship Mediator to the Osarian system by 25 ABY in order to prevent the tension between the two planets from breaking out into a full war. Around that time, the two planets were nearing the point in their orbits where they would be the closest to each other for many years, enabling both sides to potentially launch rockets at each other."}, {"tag": "p", "text": "By that time, Anor had gotten his Red Knights of Life to frequently purge Rhommamoolian cities like Redhaven of all mechanical things, such as landspeeders and droids. The public square of Redhaven had also been turned into the Square of Hopeful Redemption, where a huge pit was filled with the droids caught by the Red Knights. In 25 ABY, Anor, wearing an ooglith masquer to disguise his true form, attended a huge gathering at the Square of Hopeful Redemption. There, as he stood on a platform above the gathered, the ten thousand gathered Rhommamoolians stoned the droids in the pit for the entire afternoon after Anor commanded it. Soon after the event, Anor was contacted via communicating villip by Yomin Carr, who was a Yuuzhan Vong agent disguised as a member of the team that serviced the ExGal-4 outpost on the planet of Belkadan. Carr informed the other Yuuzhan Vong that the Praetorite Vong had entered the galaxy as the spearhead of the Yuuzhan Vong invasion."}, {"tag": "p", "text": "Later that night, Anor's latest aide Shok Tinoktin reported to the Executor that the custom shuttle Jade Sabre had entered the orbit of Rhommamool; aboard it were Jedi Knight Jade Skywalker, former politician Leia Organa Solo and her daughter Jaina, Organa Solo's Noghri bodyguard Bolpuhr, and the protocol droid C-3PO. The Jade Sabre was in the Osarian system so the occupants could meet with Anor, an event arranged between the Executor and New Republic Chief of State Borsk Fey'lya to try to reach an agreement that benefited both planets. Before sending Tinoktin off to escort the group from the Jade Sabre, Anor made sure that his aide had a shlecho newt with him, and instructed Tinoktin to bring the lizard near the mouth of Jade Sabre during the meeting. The newt would then be able to tell whether the Jedi, one of the only individuals infected with the comb spores who were still alive, was still in the clutches of the disease."}, {"tag": "p", "text": "To avoid meeting the group in his private quarters, Anor intercepted them in a hallway leading to his quarters. In the hallway, Anor lectured the group about failings of the New Republic and the New Jedi Order after refusing to let them discuss the Rhommamoolian-Osarian problem in a more comfortable location. Anor's only suggestion to stop the looming war between the two planets was have the Mediator destroy the weapons systems of the Osarians. This possibility was quickly ruled out by Organa Solo and Jade Skywalker, and they left, disgusted at Anor's unwillingness to do anything to stop the war. After the short meeting, Tamaktis Breetha, the former mayor of Redhaven, questioned why Anor had refused New Republic assistance in stopping a war, though Anor reassured him that the Rhommamoolians were fighting for a cause greater than just their homeworld's freedom; in truth, the Executor did not care about the fate of the two worlds, and was merely trying to destabilize the New Republic by creating another flashpoint. Tinoktin reported after the mayor left that the newt had confirmed that Jade Skywalker was still struggling with the comb spores in her system."}, {"tag": "p", "text": "In order to bring the war about, Anor secretly had several high ranking Rhommamoolian officials murdered, which gave Breetha no support in his opposition of an extra-planetary missile strike that the Executor had been planning for weeks. After Anor contacted Commander Ackdool of the Mediator, and arranged a meeting aboard the vessel between the commander, Anor, and a diplomatic party from Osarian in order to calm down the hostilities, the missiles were fired at Osarian. Launched from places where the liftoff of the rockets would be difficult to detect, the rockets turned off their fuel once they reached the edge of Rhommamool's atmosphere and drifted, unnoticeable by the Mediator, to the edge of Osarian's atmosphere. There, they re-engaged their fuel, and streaked for Osa-Prime, the capital city of the planet."}, {"tag": "p", "text": "Three hours after the launch of the rockets, when the missiles reached the atmosphere of Osarian, Ackdool contacted Anor, furious that he had attacked the other planet. Before cutting the Mon Calamari off and ending the conversation, the disguised Executor took responsibility for the attacks, claiming that the dead Rhommamoolian officials justified the attack, even though Anor was the one who secretly had had them killed. The missile strike authorized by Anor started a war between the two worlds, with both sides shooting missiles—some nuclear—at each other while starfighters from the Mediator attempted to shoot down as many missiles as they could."}, {"tag": "p", "text": "Due to the escalating war between the two sides, Ackdool was quite happy to go through with the meeting with Anor in order to find peace, and thus, the Executor and his aide left Rhommamool on a two-stage rocket. Before the rocket broke orbit, Anor made sure that his decoy, a decapitated body on whose neck rested one of Anor's villips, was ready, and proceeded to enter the second-stage booster. The booster contained a concealed A-wing starfighter with an enlarged cockpit, in which Anor and Tinoktin placed themselves. When the rocket left the orbit of Rhommamool, the second-stage booster was detached, taking with it the Yuuzhan Vong and his aide. Tinoktin remotely opened the comm channel on the capsule that was headed for the Mediator, and Anor greeted Ackdool, through the use of the twin of the villip he placed on the body. That same villip used its abilities to resemble Anor's face, making it seem that Ackdool was actually talking to the Rhommamoolian leader, not a villip on a decapitated body."}, {"tag": "p", "text": "However, Osarian Z-95 Headhunters attempted to intercept the capsule and prevent it from reaching the Mediator, indicating that the Osarians were not open to negotiating with Anor. To stop the Headhunters from destroying the capsule, Ackdool was forced to send starfighters of his own out, and they succeeded in driving off the attackers. One of the proton torpedoes fired at the capsule however detonated near it, due to intervening X-wing starfighter fire, and the explosion sent the capsule into an uncontrolled spin, which prompted Anor to become panicked to keep up his charade. Though the booster and the A-wing within it began to bounce across the atmosphere of Rhommamool, Tinoktin managed to keep a line of sight to the Mediator, allowing Anor to see the capsule enter the docking bay of the war cruiser after the Mediator guided it in with a tractor beam."}, {"tag": "p", "text": "There, nuclear fission explosives crammed inside the capsule detonated, and the resulting explosion blew a massive section of the Mediator to bits, temporarily lifting the rear of the cruiser by ninety degrees; as Anor had been presumed to be on the capsule when it detonated, the Executor managed to fake his death as a martyr above Rhommamool. After the booster drifted far enough away, the A-wing that Anor and his aide resided in disengaged itself from the booster, and streaked away unnoticed. From the Osarian system, Anor traveled by lightspeed to the next destination from where he could stir up more trouble, and distract the New Republic from the threat of the Praetorite Vong in the Outer Rim."}, {"tag": "h4", "text": "Advising Da'Gara"}, {"tag": "p", "text": "With Tinoktin asleep, Anor used one of his villips to contact Prefect Da'Gara, the leader of the Praetorite Vong, from the A-wing. The Prefect informed Anor that Carr had successfully terraformed Belkadan for their purposes, and was ready to use ExGal-4's visual scopes to the advantage of the Yuuzhan Vong. Da'Gara and Anor agreed that the biggest current threat to the discovery of the Praetorite Vong, who were holed up on a base on the Outer Rim ice planet of Helska IV, would be the world of Sernpidal and its inhabitants. Because of this, the pair decided to use a tactic known as Yo'gand's Core—where a gravity manipulating dovin basal was used to crash a planet's moon into itself—to destroy the threat it posed."}, {"tag": "p", "text": "Da'Gara later communicated with the Executor once again via villip, and the Praetorite Vong leader informed Anor that their forces had encountered a starfighter squadron allied with the New Republic. Although they had eradicated the majority of the fighters and captured the Jedi Miko Reglia, two of enemy fighters had managed to escape the system by hyperspace. Although Da'Gara insisted that neither of the starfighter pilots had managed to escape alive, as ravenous grutchin creatures had latched onto both craft, Anor was skeptical. He was unsure whether or not the Praetorite Vong would be discovered sooner than they wished, as either one of the pilots might survive to relate the tale, and there was potential for the grutchins to be sighted. Before consoling Da'Gara to fortify his position and prepare for any unexpected New Republic activity, the Executor agreed with the Prefect that Reglia should be broken via mental torture."}, {"tag": "p", "text": "After the Praetorite Vong's position was secured enough, Da'Gara contacted Anor once more. The Prefect explained that they were launching their preliminary assault, as the yammosk that controlled their troops had dispatched four battle groups to Sernpidal. There, the groups would engage the refuges who were fleeing the destruction of their homeworld caused after a dovin basal brought the moon Dobido crashing into the planet. However, the Praetorite Vong force was later defeated at Helska IV after the invaders had fully engaged the people of the galaxy and made themselves known. Anor found out about the fall of the Praetorite Vong through rumors, and his inability to contact either Da'Gara or Carr, who both had died. Despite the setback, the Executor continued to arouse strife and conflict near to the Core Worlds, in order to keep more attention away from the Outer Rim, where more Yuuzhan Vong forces would soon appear."}, {"tag": "h3", "text": "After the Praetorite Vong"}, {"tag": "p", "text": "Anor continued to use the Mandalorians as a way to smooth the invasion path, with the warriors participating in battles such as one on the world of New Holgha, and he kept the existence of their pact with the Yuuzhan Vong secret from the warriors of Anor's race. Following the failure of the Praetorite Vong, a warrior faction underneath Commander Shedao Shai struck the Outer Rim. Attacking in places where the Praetorite Vong had failed in order to redeem the honor of the race, Shai led the warriors on an invasion path that was situated at the border of Imperial Remnant and New Republic space. This path had been advised earlier by Anor, because the relations between the two would prevent them from aiding each other. Anor was slightly wrong in this regard, as an Imperial and New Republic joint-effort at the world of Ithor resulted in the death of Shai, though the Imperial Remnant would regress to its insular nature for a long time after the incident. During these early stages of the war, Anor formed the Peace Brigade, a pro–Yuuzhan Vong group that supported the attempt to make peace with the invaders by giving them Jedi Knights."}, {"tag": "h4", "text": "The bo'tous plan"}, {"tag": "h5", "text": "Setting the operation in motion"}, {"tag": "p", "text": "In an effort to redeem himself in the eyes of his superiors, Anor became involved with a plot formed by the deception sect priest Harrar. In the Obroa-skai system after the Yuuzhan Vong seized the library world of Obroa-skai, Anor was present on Harrar's priestship. There, Harrar and Anor briefed the Priestess Elan, who was accompanied by her familiar Vergere, on the plan, which was to fatally infect as many Jedi as they could in order to weaken the moral of the New Republic. Shortly afterwards, twenty living captives from Obroa-skai were brought into the command room and placed inside an inhibition field so that they could not escape. While Anor and the others waited and observed from atop the command platform, an assassin set about demonstrating the capabilities of the bo'tous spore, which would be used against the Jedi."}, {"tag": "p", "text": "The assassin entered the inhibition field, and once inside, emptied his lungs. The bo'tous insects contained in the breath grew rapidly in the abundant oxygen, and, because they carried the deadly spores of the bo'tous disease, killed all of the captives in the containment field; the assassin also perished after taking a lung full of contaminated air. With a bo'tous bug as an aid in explaining, Anor informed Elan that the effects of the toxin were brief, and the deliverer of the bo'tous had to be close to her targets. Harrar also told Elan that a skilled host of the toxin could hold up to four batches of the disease in his or her lungs, and deploy them all, given that the host did not succumb to the spores."}, {"tag": "p", "text": "The plan was for Elan to be captured by the New Republic, and ask for political asylum from her race. After gaining their trust through telling them important strategic information, Elan would get close to the Jedi by claiming to know the coomb spores that had infected Jade Skywalker, and, when Elan was meeting with a group of Jedi, would use the bo'tous spores to kill them. At the end of the briefing, Elan took the bo'tous specimen, and clenched it in her palm so that it could migrate to her lungs and begin to develop. After Elan and Vergere had left, Anor briefly discussed with the priest the plan, and Elan's role, which would almost certainly bring about her death. As a part of the plot, Elan and Vergere were allowed to fall into the hands of the enemy at the world of Exodo II after the New Republic light cruiser Soothfast destroyed the Yuuzhan Vong vessel Elan was being held on; the priestess and her pet were then placed into protective custody after Elan told her captors that she was a defector."}, {"tag": "p", "text": "Following Elan's capture, Commander Tla confronted Harrar and Anor, as he was angered that a Yuuzhan Vong ship had had to be destroyed for the initial stage of the plot to succeed. The pair countered that it had been necessary to make the capture of Elan look credible, and also revealed to the commander that, due to a concealed villip the priestess had managed to keep with her, they knew where Elan was being held: the planet of Wayland. In an effort to make it appear that Yuuzhan Vong did not want Elan in the hands of the enemy where she could give them important information, Anor led a small raid on Wayland, targeting Elan's position in particular. After a single assassin attacked the safe house the priestess was being held in, Anor sent half a dozen coralskippers to conduct strafing runs on the city of New Nystao, the location of the safe house. Located in a gunship out of the action on the edge of the Wayland system, Anor instructed his fighters to only try hard enough to convince the New Republic that the invaders wanted the priestess dead and buried. Anor's mission succeeded in this aspect, as the unsuccessful attack prompted the New Republic to put more effort into keeping Elan safe."}, {"tag": "p", "text": "Around that time, Anor had several meetings, while disguised as an intercessor, with the Hutt Borga, who represented the interests of the Hutts in the area of the galaxy known as Hutt Space. Due to his guise as the intercessor between the Yuuzhan Vong and the Hutts, Anor discovered that the species was more interested in reaching an agreement with the invaders than waging war on them. Through the negotiations with Borga, the Executor also managed to have one of the Hutt's many worlds put at the disposal of the Yuuzhan Vong. After the raid on Wayland, Anor was present on Harrar's ship, once again over Obroa-skai. There, along with Harrar, Tla, and the tactician Raff, Anor met with Commander Malik Carr, who had recently arrived in the Wayland system with a contingent of battleships."}, {"tag": "p", "text": "As the others reported various details about the campaign against the New Republic to Carr, Anor informed him of the state of the Hutts, and suggested that a detour be made into Hutt Space; Anor also related that he had tasked several of his agents with sowing bits of disinformation prior to the Yuuzhan Vong's arrival there. During that meeting, a herald approached the group carrying a villip, and Anor used one of his dedicated villips to help receive a message from one of his underlings. That agent informed the disbelieving Executor that the Peace Brigade had taken it upon themselves to free Elan, and bring the priestess back to their allies. They had managed to obtain the whereabouts of Elan, something Anor had been hard pressed to find, and were moving against the passenger liner Queen of Empire, which was headed for the Bilbringi system and carrying the priestess. Anor's underling also informed the Executor that the Peace Brigade elements involved in the planned attack had a dovin basal."}, {"tag": "h5", "text": "Trying to salvage a mission"}, {"tag": "p", "text": "Anxious to prevent the Peace Brigade from messing with their plans, Anor appropriated the quickest of Carr's frigates, the Supreme Commander's personal ship, in order to stop them meddling. Arriving where the Queen of Empire had been pulled out of hyperspace by the capabilities of the Peace Brigade's dovin basal, Anor was in time to witness the group in the act of boarding the liner with a corvette. From Carr's personal ship, the Executor kept an eye on the corvette, as well as the three Martial-class shuttles that had launched from the ship before docking on the Queen of Empire. Anor also managed to neutralize the Peace Brigade's dovin basal, and used his own dovin basal to prevent the corvette from leaving its docking position with the liner even if it tried; this was done to prevent the Peace Brigadiers from escaping with Elan, and to give more time for the New Republic's forces to recapture her."}, {"tag": "p", "text": "While at Bilbringi, the Executor kept in contact with Harrar and Carr, informing them of the situation. Just then, the Quasar Fire-class bulk cruiser Thurse from the New Republic arrived at the scene, in an attempt to rescue the liner and drive off the Yuuzhan Vong present there. Anor saw a way to make it appear that the Yuuzhan Vong had unsuccessfully tried to obtain Elan, and a way to get the Peace Brigade caught, which would put the deserting priestess back into the New Republic's hands. At Carr's orders, the Executor had his dovin basal launched as a remote—with it detached from the ship and left in space to complete its objectives—and the frigate's complement of coralskippers engage the enemy, in a withdrawal from the Queen of Empire's position that the agent sought to disguise as a defeat."}, {"tag": "p", "text": "The Peace Brigade corvette made multiple calls to the Yuuzhan Vong to help aid them, but Anor and his crew refused to answer them. Still in contact Harrar and the others, Anor had his frigate commit a microjump whenever a group of enemy starfighters neared it in order to distance itself from their attacks, though Harrar found that Anor's actions could be considered cowardly. During the continued battle around the Queen of Empire, the modified New Republic freighter Millennium Falcon's crew took it upon themselves to target the remote, and soon destroyed it, allowing the Peace Brigade shuttles to un-dock from the liner. At Anor's orders, the pilots of the coral skippers behaved as if in a sudden disarray after the dovin basal was destroyed, to make the New Republic believe that they had killed a yammosk coordinator."}, {"tag": "p", "text": "Free to leave the liner, the three Peace Brigade shuttles scrambled away from it, with two bearing towards one of the planetoids in the Bilbringi system, and the last heading for Anor's frigate. Knowing that the Peace Brigade had succeeded in apprehending Elan and were bringing her to the Yuuzhan Vong aboard that same shuttle, Harrar ordered Anor to hold the shuttle at bay. Using one of the onboard dovin basals, the frigate halted the shuttle in its tracks, and the Millennium Falcon soon linked up with the stricken shuttle in an attempt to regain possession of Elan; by then, the Peace Brigade corvette had broken away from the Queen of Empire, and was trying to escape. Anor let the freighter have a few moments docked with the shuttle, so that they could retrieve Elan, before he pursued them to convince the New Republic that the Yuuzhan Vong wanted the priestess back."}, {"tag": "p", "text": "Using a microjump to bring the frigate practically on top of the Millennium Falcon, Anor had his vessel spew missiles at the freighter, though the majority missed on purpose. However, the crew of the Falcon soon caught on that the Yuuzhan Vong wanted them to keep Elan, and guessing that they would not try to shoot a freighter with Elan aboard to pieces, started to fly directly towards Anor's frigate. Flying as if it intend to bring Elan back to the members of her race, the Millennium Falcon turned around before it got close to Anor's frigate, and proceeded to launch a single escape pod. The Executor was unable to obtain it however, as the Thurse opened fire upon the other vessel with all of its guns after the freighter cleared the space between them. Taking damage to his frigate, Anor was forced to withdraw from the system with no knowledge as to what had transpired on the freighter, and whether or not Elan and Vergere were alive or not."}, {"tag": "p", "text": "Back at Obroa-skai in Harrar's priest ship, Anor was present with the priest, Tla, Raff, and Carr as they reported the failure of their plan to high priest Jakan, Supreme Commander Nas Choka, and Prefect Drathul via villip. The group aboard the priestship explained that they did not know for certain whether or not Elan and Vergere were dead, but that they suspected that the pod launched from the freighter may have contained one or both of their operatives, in the case that the crew of the Millennium Falcon were attempting to send the priest and her pet back to the Yuuzhan Vong. Anor and the others had to answer for the failure of the mission, as well as the amount of capital that had been expended in the attempt. After being informed that the next stage of the Yuuzhan Vong invasion would involve Hutt Space, punishments and new assignments were handed out."}, {"tag": "p", "text": "Harrar and Tla were recalled to the Outer Rim, while Carr was assigned to head the invasion into the Hutt territories. However, as Drathul wanted to speak with Anor alone, all of the others left the command center before the Prefect decided Anor's fate. When asked by Drathul what actually had occurred, Anor blamed Harrar's and Elan's inability to improvise for the outcome. Though Drathul did inform him that Anor was treading on thin ice in the eyes of Warmaster Tsavong Lah, the Prefect did not punish him. Before ending the conversation, Anor informed Drathul that a certain individual from the New Republic had reached out to them through the Executor's agents from Coruscant, and could prove to be a potential ally."}, {"tag": "h4", "text": "Involved with the Hutts"}, {"tag": "h5", "text": "Preparing a trap"}, {"tag": "p", "text": "Working on the Yuuzhan Vong advance into Hutt space, Anor accompanied Carr to the planet of Nal Hutta, where they were to meet Borga. With Anor disguised via an ooglith masquer so as to appear as the Human intercessor Pedric Cuf, he and the Commander lingered for a long while in the waiting room of Borga's palace before they were allowed to have the audience with the Hutt. The wait, although it was tradition, vexed both of the Yuuzhan Vong, with Carr the more unhappy of the two. Eventually informed by the Rodian majordomo Leenik that they were permitted to see Borga, Anor and the Commander entered Borga's court alongside ten honor guards and ten attendants, and the Executor, in the guise of Cuf, had the attendants bring forth boxes that were tributes for the Hutt. Anor opened one of them himself, and the dovin basal within prevented the antigravity couch Borga was lounging on from operating, sending both the Hutt and the couch to the ground. Although Anor apologized for the mishap, as the dovin basal was really a gift, he succeeded in revenging themselves upon the Hutt for the long wait."}, {"tag": "p", "text": "After bestowing more gifts upon the Hutt, the group began their negotiations. It was decided after some discussion that the Yuuzhan Vong would be allowed to use certain worlds for gathering resources, while in turn the invaders would steer clear of important Hutt worlds such as Rodia, Ryloth, and Tatooine. However, the specific details of the deal were not to be settled until Borga met Choka at a later date. The Hutts would also help the Yuuzhan Vong transport the invaders' slaves in return for no interference into the Hutts' business in spice trafficking. At the end of the meeting Borga asked, as Anor had predicted, that the Hutts be informed of any activities that might affect spice trade on any worlds; this information would allow the Hutts to secretly sell the information on impending attacks to the New Republic for a price. However, as Anor knew that the Hutts were notorious for double dealings, the offer was accepted, so the Yuuzhan Vong could use the Hutts to distribute false data to the New Republic."}, {"tag": "p", "text": "Anor was later present on the Yuuzhan Vong warship Yammka when Choka was welcomed aboard via a celebratory parade. Anor waited with Carr and his chief subalterns, as well as a group of priests, on a dais that was opposite the landing bay Choka had arrived in, and to which the Supreme Commander was proceeding. After Choka had reached the dais, he escalated four of the subalterns there—Doshao, Sata'ak, Harmae, and Tugorn— for their various deeds in the invasion. Following the short ceremony, Choka called forth Anor before he got to the business at hand, which was discussing the invasion. The Supreme Commander surprised the Executor by favoring the demotion of the latter, due to Anor's alliance with the Praetorite Vong, and his failure in the bo'tous plot that had likely resulted in Elan's death. Anor countered most of Choka's grievances with him with excuses, and informed his superior of the plot by him and Carr to strike a crippling blow to the New Republic through the use of the Hutts. Before allowing them to fill him in on the details, Choka questioned how far the Executor's ambition would take him."}, {"tag": "p", "text": "In his guise as Pedric Cuf, Anor taught some rudimentary lessons of the Yuuzhan Vong language to Borga during the while that he worked as the intercessor between the Hutts and his race. The Executor also accompanied Choka, along with Carr, to the Supreme Commander's first meeting with the Hutt. Still disguised as the intercessor, Anor observed as Choka dismissed the Hutt's offer of helping with the transport of slaves, and as the Supreme Commander proceeded to show Borga that the Yuuzhan Vong were the ones in control. Anor also watched the standoff that ensued between the two sides' guards after Choka insulted Borga for speaking out of line, though the Hutt backed down before there was a fight."}, {"tag": "p", "text": "Through the use of his plan, which involved the Hutts passing on to the New Republic combat information sent to them by the Yuuzhan Vong, the Executor managed to mislead the other government. By telling the Hutts to stop their spice movements in the Tynnani system so they did not get caught in any combat engagements, and then attacking the world, Anor managed to make it appear as if the information the Hutts were giving to the New Republic was good intelligence. The Yuuzhan Vong also told the Hutts to stop spice trafficking in the areas surrounding the worlds of Bothawui and Corellia, making it appear as if those two worlds were prime targets for an attack to the New Republic. When the Hutts were informed that they could once again go in to the spice business near Bothawui, the New Republic decided that the enemy's target was Corellia, and arrayed its fleets in a position that left the world practically unguarded, with battleships positioned a short distance from the system. This was in the hopes that the New Republic would be able to spring a trap upon the Yuuzhan Vong."}, {"tag": "h5", "text": "Disaster at Fondor"}, {"tag": "p", "text": "In making the New Republic think that Corellia was the target, Anor managed to disguise the real objective of the Yuuzhan Vong: the New Republic shipyards of the Colonies' world of Fondor. At a time where Anor's plan was coming to a close, the Executor was present on Choka's battleship while it was in Hutt Space. There, he, Carr, and Choka learned that the Crèche, the Yuuzhan Vong vessel that was carrying the yammosk for the assault on Fondor, had been attacked by enemy starfighters, and, in trouble, had fled to the targeted world of Fondor. Choka decided to launch the attack early, as the Crèche was unprotected at Fondor, and Anor accompanied the Supreme Commander as they headed for battle in the Fondor system. At Fondor, the Yuuzhan Vong battleships mauled the enemy contingent there and destroyed much of the shipyards. New Republic reinforcements soon arrived, mostly composed of elements of the Hapes Consortium's fleet, though the battle that might of occurred was cut short by a blast from Centerpoint Station, an ancient artificial construct near Corellia."}, {"tag": "p", "text": "The beam of energy from the superweapon destroyed half of the Yuuzhan Vong armada at Fondor, but also took out three quarters of the Hapan ships. Moments later, Anor and the others on Choka's ship, still shocked at the destruction, were contacted by Chine-kal, the commander of the Crèche. Before dying, Chine-kal informed them that New Republic personnel had boarded his ship after the Hutts had told them the location of the vessel, and had freed captives before killing the yammosk with the help of the Hutt Randa, who had been aboard the Crèche at the time. Seeing a score to settle with the Hutts, and having fulfilled their objective at Fondor, Choka had the fleet depart the system."}, {"tag": "p", "text": "Shortly after the events at Fondor, Anor visited Senator Viqi Shesh—his contact from Coruscant—for the first time on the cityworld in her private office, in the guise of Cuf. Obliquely thanking Shesh for her work, Anor almost left when Shesh denied any involvement with certain events that had transpired, though the Senator was eager to talk business with Anor after she realized that Cuf was indeed a Yuuzhan Vong agent."}, {"tag": "h4", "text": "Duro"}, {"tag": "h5", "text": "Undercover as Cree'Ar"}, {"tag": "p", "text": "Anor was disgraced because of the plans of his that never fully fulfilled their purpose, such as the debacle involving Elan. Due to this, the Executor was sent undercover to the heavily polluted New Republic world of Duro by Warmaster Lah. There, he disguised himself as Duros researcher Dassid Cree'Ar, seemingly working with other SELCORE scientists to make the uninhabitable surface of Duro a haven for the refugees from the war. However, his real task while stationed on Duro was to help the Yuuzhan Vong claim the planet for their own. In preparation for this, Anor's contact Shesh agreed to ship vessels full of refugees to Duro to give the Yuuzhan Vong more captives when they took the world. In 26 ABY, Anor contacted Lah via villip aboard the warmaster's battleship Sunulok to report that more refugees had come to Duro, and he was commanded by Lah to watch for potential worthy sacrifices for when the Yuuzhan Vong arrived at Duro."}, {"tag": "p", "text": "During Anor's tenure as Cree'Ar, he worked in the Gateway dome, located on the surface of the planet; Gateway served as the research complex, and was overseen by Organa Solo, who was mildly skilled with the use of the Force. While there, Anor learned from his agents that Jedi Knights Jaina and Jacen Solo were present on Duro as well, in Gateway's companion dome Settlement 32, bringing the total number of known Jedi on Duros up to three for when the Yuuzhan Vong came to capture them. The same day that the Executor became aware of their presence, Anor alerted Lah by villip of the Jedi's arrival. He also informed the warmaster of his plan to test out a new creation of his that was designed to take apart the domes present on Duro on Settlement 32. After being convinced that Settlement 32 was the right target, Lah had Anor avoid the presence of any Jedi, especially Organa Solo, as Force users had a knack for seeing through disguises, such as the gablith masquer Anor was using to appear like a Duros."}, {"tag": "p", "text": "Due to his inability to be near Organa Solo, Anor never attended the meetings that took place between the researchers. On more than one occasion, the disguised Executor excused himself from his attendance of the meeting via a comlink. The absence of Cree'Ar from their meetings infuriated many of the other researchers, though the Yuuzhan Vong agent did contribute to the reclamation effort on Duros. The Executor fixed ever single one of the problems that the other researchers and scientists sent his way, and the others believed that it was because of his time spent fixing those that Cree'Ar had not contributed in his own assigned area. The miracles that delighted the other researchers in Gateway were due to the small organisms that helped Anor create a lair for himself underneath the artificial dome by carving a side tunnel off a main shaft out of solid rock. Anor disposed of the organisms when they had died in the toxic swamps surrounding Gateway, and their decomposition released the bacteria in their guts, which started the process of Duro's terraforming."}, {"tag": "p", "text": "As a precaution against intrusion, Anor widened cracks in the ceiling near his lair via the use of immature naotebe winglings, which were designed by Anor to dissolve and eat building substances. He then filled those cracks with other organisms, which would inflate like a wedge at his command and thus bring spans of tunnel ceiling down if necessary. In time, Anor had immature naotebe winglings inserted into Settlement 32, where they grew up as they consumed the synthplas that the dome was made up of. Anor's objective was to breach holes in the dome via his creatures' nibbling, and expose the occupants of Settlement 32 to the toxic atmosphere of Duro. When the winglings matured, they succeeded in breaching the dome, though Jaina and Jacen managed to get everyone onto a land crawler and the group escaped to Gateway."}, {"tag": "p", "text": "During his time disguised as Cree'Ar, Anor played the Duros against the arriving refugees and regularly sent words of wisdom that preached of independence for the Duros secreted away in scientific progress reports to at least one of the space cities that orbited the planet. His words were spread by individuals such as Ducilla Brarun on the space city of Bburru Station. In preparation for the attack, Anor arranged for riots to happen on Bburru City just before the event, and for the planetary shields to be sabotaged. However, despite Anor's precaution of not meeting with Organa Solo, the Executor's real identity was eventually discovered. Jade Skywalker, who had arrived on Duro along with her husband to investigate the disappearance of a Jedi apprentice by the name of Thrynni Vae, found an old Rhommamoolian code in the regular report that was sent from the scientists of the surface and started to track it to its source after discovering Anor's words of wisdom contained within. Accompanied by Jaina, Jade Skywalker eventually discovered the whereabouts to Cree'Ar's lair after harassing his aides, and the two Jedi found the disguised agent there."}, {"tag": "h5", "text": "Invasion imminent"}, {"tag": "p", "text": "The two Jedi confronted Cree'Ar, but neither at first suspected that he was not who he said he was. However, while Jade Skywalker—disguised as a Kuati baroness with Jaina as her servant—flattered Cree'Ar about his work on Duros, Jaina sensed that the researcher was not present in the Force. Knowing that no presence in the Force could indicate a Yuuzhan Vong, the young Jedi used the Force to touch the release point of Anor's masquer, and the creature slipped off the agent's body, revealing him as Anor. The agent however, held his ground, and revealed to Jade Skywalker that he had been the one to poison her with the coomb spores. The Executor also threatened to infect the pair with the coomb spores contained within a beaker if they moved, but when Jade Skywalker feinted at him with her lightsaber, he instead fled via a back entrance to the lair. However, instead of following Anor through that entrance, the pair of Jedi went back the way they came in an attempt the head off the agent, as they believed that a trap had been set in Anor's wake. Consequently, Jaina and Jade Skywalker fell afoul of the ceiling trap the Executor had placed earlier, and after the pair were buried beneath tons of ceiling debris, Anor believed them dead."}, {"tag": "p", "text": "Following the event, the Executor reported to Lah, who was aboard the Sunulok. Anor informed the warmaster that he had successfully taken down Settlement 32, and that agents of his aboard Bburru had detained Jacen, who the Yuuzhan Vong had marked as a coward as he had seemingly deserted the Jedi cause in the war. Anor also informed Lah that he had killed Jaina and Jade Skywalker, though the warmaster was displeased at this as Lah's priests had finally decided that Jedi were worth sacrificing to the gods. Slightly doubting the death of the pair, Lah requested that Jacen be sedated so that he could be broken and studied. Anor informed Lah of his preparations for the attack, in addition to the fact that he had promised that the Duros' floating cities would remain untouched if they laid down their weapons, which was a lie on Anor's part. Despite Anor's belief that Jaina and Jade Skywalker had died in the trap, they survived, and the secret of Cree'Ar's true identity was revealed to a select few."}, {"tag": "p", "text": "Anor lived up to his promises to Lah, and the shields of Bburru, Orr-Om, and another floating city were sabotaged prior to the Yuuzhan Vong arrival, leaving them vulnerable to attack. At around the time that Lah's forces arrived at Duro, Anor revealed his true self to his fellow researchers, who had not been informed of the Cree'Ar's deception. Anor told the scientists that the ones who were found by the Yuuzhan Vong invasion force still working on taking the toxins out of the soil would be specially awarded. However, even though the Executor offered full amnesty, two of the researchers refused to work any further. Additionally, all declined Anor's offer of positions helping the Yuuzhan Vong with their research."}, {"tag": "p", "text": "While the Duros in orbit laid down their arms after several of the sky cities were destroyed, the Yuuzhan Vong landed a ground force on the surface, led by Lah himself. Free of the masquer, Anor led Lah toward the laboratory in Gateway after the landing force had taken it for their own. Anor's path led them past where his former co-workers, minus the two who refused to work anymore, were diligently toiling away, before bringing the warmaster to a small building. There, Lah questioned as to why the researchers would want to escape their destiny by being offered amnesty and mercy. After Anor explained that they did not understand death, Lah decided to give the researchers what they deserved for their work: a ritual killing. As such, the warmaster had researchers brought to the room, and the scientist Abbela Oldsong was one of the researchers who perished there."}, {"tag": "p", "text": "Shortly after Organa Solo caused a brief distraction with the help of Jaina and Jacen that allowed some of the captives to escape the custody of the Yuuzhan Vong, several warriors captured her in a stairwell in Gateway. Anor was present when Organa Solo regained consciousness after being knocked out, and, taking her lightsaber, led her under guard to her own office quarters, where Lah was currently located. The Executor observed as Lah dominated the administrator of Gateway in an argument on life and death, before threatening here with an imminent demise. With Organa Solo sent away for confinement for a time, she and the captive Randa were brought into Anor's and the warmaster's presence once more, and Lah made the former administrator witness the deaths of many of the refuges in Gateway, along with the destruction of all technological devices, from the room's window. However, it was then that Randa used his tail to overwhelm his guards, creating chaos in the room."}, {"tag": "p", "text": "Organa Solo rushed Anor, attempting to regain control of her lightsaber to free herself. Although the administrator managed to get her hands on it in the confrontation with the agent, Lah grabbed the Jedi, ending her struggles as Anor kept the lightsaber; while this was happening, the priestess Vaecta strangled Randa with a tkun garrote. As a trio of Yuuzhan Vong musicians played music, Anor looked on as Organa Solo was restrained, and as her legs were lacerated by Vaecta with a tkun. The administrator was saved, to Anor's surprise, when Jacen, who he believed still held by his agents on Bburru, dispatched the two guards at the entrance to the chambers and interrupted his mother's torture. As Jacen dueled the warmaster, Anor slipped out of the room, as some of the Yuuzhan Vong watchers had indicated that another Jedi approached."}, {"tag": "p", "text": "In the duel with Jacen, Lah was thrown out of the window through use of the Force, and shortly Anor arrived beside the fallen warmaster, though Anor had to claim that it had been prudent to leave with the other Jedi coming when Lah accused his agent of cowardice. Despite the efforts of the Yuuzhan Vong, a portion of the refugees escaped Duro with the help of the Jedi while all but the floating city of Urrdorf were destroyed by the invaders. Later, after a small delegation of Duros and Humans landed at the remnants of Gateway, Anor stood by as Lah demanded from them the name of the young Jedi who had defeated him in the duel: Jacen Solo. The warmaster then turned his attention to the Executor, and proclaimed that his penance for his earlier failures was over. Although Anor gloated at this, he was not given the promotion that he expected."}, {"tag": "p", "text": "Lah then brought all of his forces in a grand circle around the burning pit that filled the center of Gateway, and during his speech, the warmaster publicly declared Anor's punishment over, and that he would be sent to a new location, a fact which confused the agent. The Executor surrendered Organa Solo's lightsaber to Lah at the latter's request, and observed as the warrior used a special villip to communicate with the New Republic. He demanded that they turn over the Jedi to him, especially Jacen Solo. If the citizens of the New Republic did so, Lah would halt the invasion, instead of pushing forward into the Core Worlds. In a symbolic gesture, Lah then threw the lightsaber into the pit to be consumed by flames."}, {"tag": "h4", "text": "Among the Givin"}, {"tag": "p", "text": "Despite attempting to apprehend Jacen Solo with the use of his agents, Anor failed to bring the young Jedi before Lah, much to the latter's disappointment. Anor later met with Warmaster Lah to discuss another one of the Executor's schemes, and with Lah's crèche-brother Qurang Lah standing by, Anor explained how the system housing the planet of Yag'Dhul was a perfect spot for a new assault against the New Republic. Despite Qurang counseling the warmaster that it would be ill-advised to break the temporary ceasefire between the two sides, so that the shipwomb at Sernpidal might produce more vessels for the war effort, the Executor persuaded his superior to endorse the attack, as the number of Jedi turned over to the Yuuzhan Vong had decreased, and because Lah wanted revenge for the Jedi victory on the moon of Yavin 4. Anor was assigned to advise Qurang, who was to lead the battle-group destined for Yag'Dhul, though Lah advised Anor to not fail him lest the Executor suffer the consequences of doing so."}, {"tag": "p", "text": "In preparation for the attack against Yag'Dhul, the home of the highly intellectual Givin race, Anor disguised himself as one of Givin via a gablith masque, and used a translating tizowyrm to help him communicate. While among the Givin on the space station of Yag'Dhul Station, Anor's inability to express himself properly with mathematical equations that the Givin liked to use meant that many of the Givin aboard the station suspected that Anor was not who he said he was. However, with the help of his local agents, the Executor retained his disguise as a Givin in the eyes of those who did not suspect him. To make matters worse, the Rodian Jedi Kelbis Nu visited the station, and recognized Anor as a Yuuzhan Vong, though the Executor dealt with this by having his Peace Brigade contacts track and kill the Jedi on the world of Eriadu; however, the dying Rodian managed with his last breath to inform a pair of Jedi—Anakin Solo and Tahiri Veila—about Yag'Dhul, alerting them of danger there."}, {"tag": "p", "text": "While on Yag'Dhul Station, Anor was contacted via villip by Qurang, while the Executor was in his sleeping quarters. Anor learned that the Stalking Moon, the Yuuzhan Vong reconnaissance vessel using a cloaking shadow tasked with arriving in the Yag'Dhul system first, was out of contact with Lah's fleet. This, along with the enemy ship that had chanced upon the Yuuzhan Vong fleet waiting for the signal to attack Yag'Dhul before being destroyed, caused the warmaster's crèche brother to believe that Anor's plan was coming apart. Anor tasked himself with discovering why the Stalking Moon was out of contact, though he did realize that Qurang was resentful of him; this was a problem, as Anor relied on the warmaster's crèche brother, because all of the warriors were loyal to him, not the agent."}, {"tag": "p", "text": "In preparation for the attack on Yag'Dhul, renegade members of the Body Calculus, the government of the Givin, sabotaged the defensive grids of Yag'Dhul so that they would fall just before the attack. However, the Stalking Moon had actually been commandeered by Jedi Knight Corran Horn, as well as Anakin and Veila, and they managed to forewarn the Givin of the imminent attack, and the sabotage of the defensive grids. Initially confined and told to wait after telling their tale, the trio were brought before Dodecian Illiet, who was in command of the space station after the attack commenced. Illiet unknowingly assigned the disguised Anor to take the trio of Jedi to claim vac-suits, as the Givin were preparing to open the space station to the vacuum, before the small group were to board a small vessel that had been set aside for their escape from the embattled space station."}, {"tag": "p", "text": "Leading the Jedi through the station, Anor took them down a turbolift, but at the bottom, Solo sensed the presence of six Yuuzhan Vong warriors—through the lambent crystal in his lightsaber—prompting the Jedi to ignite their weapons moments before the door opened to reveal five warriors. Solo, realizing that one Yuuzhan Vong was unaccounted for, turned towards the disguised Anor, but the agent managed to punch the young Jedi in the nose, sending him tumbling out of the lift and taking Horn into the corridor with him. Though Veila and Solo knocked the five warriors to the ground with a Force push followed up by a barrage of cylinders, Anor, unaffected by the Jedi's attack upon the warriors, laughed as he took his masquer off while more warriors arrived."}, {"tag": "p", "text": "Anor informed the Jedi that they were his captives now, with Solo being a valuable capture after his exploits on Yavin 4. With the Jedi refusing to surrender, Horn tried to arranged a duel with Anor, so that the agent could prove that he was not afraid to fight with the Jedi. Anor declined the offer as he claimed his duties prevented him from doing so, which caused Veila, a test subject for shapers on Yavin 4 who had learned their language, to inform the warriors facing them of Anor's cowardice in the Yuuzhan Vong language. The warriors, who did not have tizowyrms and could not understand the language of Basic, were shocked to learn this, and although Anor shouted himself hoarse trying to stop the warriors from engaging in the duel, the lead warrior Shok Choka readied himself to fight Solo; Veila had managed to convince the warriors that they would be cowards unless they fought against the Jedi who had sided with the shamed warrior Vua Rapuung on Yavin 4."}, {"tag": "p", "text": "However, Solo slew Choka in the duel before the Jedi escaped the warriors, and the Givin opening the station to the vacuum forced the warriors to break off their search to retrieve ooglith cloakers, without which they could not survive. After retrieving a cloaker for himself, Anor was angry that the Jedi had slipped out of their grasp, and confronted Qau Lah—the new leader of the Yuuzhan Vong warriors on the station—and a pair of others at the organic docking tube that connected the vessel the warriors had come in to the Givin's space station. With Qau was contemptuous of Anor for refusing to duel Solo, the trio of warriors left to continue their search for the Jedi on the station. However, Anor used a blaster to shoot all of the warriors in the back, starting with Qau, before setting off to eliminate the other warriors who had seen him refuse to duel the Jedi, in order to prevent a report of Anor's cowardice from reaching Qurang's ears."}, {"tag": "p", "text": "In his escape vessel, the Executor was later contacted by Qurang, and was informed that the entire Yuuzhan Vong attack force had been recalled from Yag'Dhul, despite the crumbling defenses there. Furious, Anor demanded to know why, and was told that the Yuuzhan Vong shipwomb at Sernpidal had been assaulted by New Republic forces. Because the Yuuzhan Vong reserves had been committed to Yag'Dhul, only a few elements had been left to guard the shipwomb, and due to the distance between Yag'Dhul and Sernpidal, the Yuuzhan Vong forces there would not be able to defend the shipwomb in time. Anor could not believe that the attack had happened, as his sources had not heard of word of an attack against Sernpidal. After pinning the failure on Anor, and hearing from Anor that the agent was the only survivor of the boarding party, Qurang promised that the warmaster would hear about the incident in detail."}, {"tag": "h3", "text": "Working with Vergere"}, {"tag": "h4", "text": "A trip to Bilbringi"}, {"tag": "p", "text": "In 27 ABY, Anor was sent as an emissary by Warmaster Lah to the shipyards of the Bilbringi system, where Yuuzhan Vong forces had correctly guessed Organa Solo would be. Anor sent a message anonymously to the staff at the shipyards claiming that he wished to discuss the fate of some refugees. Although Anor refused to reveal how he knew Organa Sol was at Bilbringi, the New Republic personnel accepted, and the agent arrived at the shipyards in a picket ship; in preparation for the arrival of the Yuuzhan Vong emissary, the New Republic had made it look like the facilities were decrepit and thus an unworthy target to assault. Upon arrival, Anor allowed the chilab organism in his nose, which used his optical nerves to record images, to get a good view of the shipyards at Bilbringi. At the shipyards, Anor was made to wear a watchcloak with a hood, and his artificial eye was confiscated. The only thing he was allowed to bring into the interrogation chamber was a small villip that had been thoroughly examined for dangerous substances."}, {"tag": "p", "text": "The interrogation chamber itself consisted of a room that could be opened to the vacuum with a touch of a button, with one wall that featured a transparisteel panel, through which Anor could talk to his interrogators. Giving no finite answers as to how the Yuuzhan Vong had known that Organa Solo and her husband would be at Bilbringi, the agent proceeded to show those looking through the transparisteel a live feed of the cruiser Nebula Chaser via his villip. Anor offered to trade the ship for information that would help the Yuuzhan Vong, but when Organa Solo flatly refused to negotiate with the likes of Lah, Anor specified the information required: the location of the secret Jedi base. However, when Organa Solo denied the existence of it, the villip depicted the live destruction of the Nebula Chaser, killing those on board."}, {"tag": "p", "text": "Explaining that those on board had died because of the presence of Jedi on the Nebula Chaser, the agent threatened that more lives would be lost unless the Jedi surrendered to the Yuuzhan Vong. Anor further elaborated that his race had put in place a blockade around the world of Talfaglio, and if the Jedi did not surrender, the refugee convoys being held there would be destroyed. Additionally, if Anor did not return from his mission, the refugees would meet the same fate. However, both Organa Solo and her husband did not take kindly to the offer, and they allowed a small amount of vacuum into the room to the surprise of Anor, who yelled that they would kill millions due to their actions. Though they resealed the room, allowing Anor to readjust to the pressure inside, the pair told him that they would not be responsible for deaths of those they did not kill, and that further emissaries would not return to Lah. This prompted Anor to take his leave, as Organa Solo had promised to let him go alive."}, {"tag": "p", "text": "Later, on the world of Obroa-skai, Anor met Lah at the Museum of Applied Photonics, and when the warmaster used a holopad to summon a life size image of an enemy X-wing starfighter from a data center, all of the occupants of the room save Lah and Anor ducked for cover when the X-wing hovered above Lah and opened fire. Although Anor did not believe that holographic devices were a danger, Lah asserted that a coralskipper pilot could easily be fooled by a similar illusionary X-wing. Briefly reprimanded by Lah for failing so often, the Executor handed the chilab over after he removed it from his sinus cavity."}, {"tag": "p", "text": "Although the Executor was confident that the Jedi would react to the ultimatum issued by Lah, the newly arrived Vergere thought that the Jedi would smell the trap; Vergere had survived the Elan debacle, and after learning much about the enemies of the Yuuzhan Vong, had become Anor's greatest rival. During the briefing Anor tried to make it seem as if the agent was in control of the interrogation at the shipyards, though Vergere was quick to point out examples of Organa Solo's control over the situation. When asked why the Princess of the world Alderaan had spared his life, Anor lied that it was because she was sending him off with a warning, and not because she had promised to let him go. Despite how the Jedi were proving to be cunning foes, the warmaster believed that the refugees would be able to drive the New Republic and the New Jedi Order apart. Over the course of the time that both Anor and Vergere were advising Lah, they frequently insulted one another, in the midst of doing their duties of interpreting and offering advice to the warmaster."}, {"tag": "h4", "text": "Emissary on Coruscant"}, {"tag": "p", "text": "Sometime after being sent to Bilbringi, Anor was summoned to Lah's private warren aboard the Sunulok, prompting the agent to slash himself hastily in multiple locations to look devout. Entering the chambers, Anor found Lah—who was talking to Shesh via a villip—and Vergere. After momentarily ceasing his conversation with Shesh, the warmaster gave the agent a thorn seat to sit on, so that the Executor could finish the devotions that Lah's summoning had seemingly interrupted. With the thorns of the seat biting into his back and buttocks, Anor listened to a briefing by Shesh, who had quickly bypassed Anor as a contact and taken her services straight to Lah as soon as she could. Shesh reported how Jacen had proposed a plan to ambush the blockade of Talfaglio, and how she had persuaded Bothan Chief of State Borsk Fey'lya to permit a military study into the matter, in order to give the Yuuzhan Vong time to prepare a counterattack. She also informed them Fey'lya had also asked for an envoy of the Yuuzhan Vong to come speak with them, purely to give more time for the military study to run its course. When the conversation with Shesh had ended, Lah tasked Anor with being the envoy that would go to Coruscant, as he did not trust the accuracy of Shesh's report, despite Vergere's attempts to get herself assigned as the envoy. Lah also gave the thorn seat to Anor as a gift."}, {"tag": "p", "text": "In preparation for his arrival on Coruscant, Anor, known to Fey'lya as only the emissary, finalized the details with the Bothan. Though the Chief of State wanted to receive the Yuuzhan Vong emissary in the State Reception Hall where both sides could script their coming conversation, Anor wanted Fey'lya to meet him as the agent disembarked from his ship. Because of the disagreement, they came to a compromise to meet in the Grand Convocation Chamber of the Senate Building, where all the citizens of the galaxy could watch as the two conversed in an unscripted event. Wearing a hooded cloak and a set of red vonduun crab armor, Anor traversed the stairs that led to the chamber's center, unescorted by bodyguards and wielding an amphistaff, all the while ignoring the senators that jeered at him, and those that offered private meetings with the emissary, as well as a barrage of cag mugs from the Togorian delegates that were intercepted by security droids."}, {"tag": "p", "text": "At the floor of the chamber, Anor was met by Fey'lya, alongside Shesh and Fyor Rodan, both members of the New Republic Advisory Council, and it was then that Anor threw off his hood, revealing himself as the emissary to all the senators present, and all those watching via the HoloNet. Fey'lya and Anor discussed the interdiction of the world of Talfaglio, and the Yuuzhan Vong's ultimatum in front of the occupants of the chamber. During the conversation, Anor used his tactics to divide the entire Senate between those the Yuuzhan Vong could intimidate, and those who would not be. Questioning why the Yuuzhan Vong valued the Jedi so high, the Bothan insulted the Yuuzhan Vong for not engaging the Jedi head on by hiding behind the lives of refugees, leaving Anor hard pressed to defend against Fey'lya's point. The Chief of State proceeded to side with the Jedi, though the Bothan had a history of not liking them, and suggested that the Jedi Order were well loved in Bothan space. As Anor was supplied with possible planets where the Jedi might reside, most of which had no populations present on them, the Bothan prevented the Executor from leaving the chamber to relay the places to his masters, forcing Anor to use a villip instead; Fey'lya wanted Anor to stay on Coruscant until he had explained the millions of hostages taken at Talfaglio."}, {"tag": "p", "text": "Sometime later, and still on Coruscant, Anor addressed those present in the Grand Convocation Chamber, and the speech was streamed on the holonetworks all over the galaxy. As he had been denied the right to wear the uniform of a Yuuzhan Vong warrior, the agent was dressed in a cloak of living glistaweb, which could stop a blaster bolt if need be. From the speaker's podium, Anor had a public audience with Fey'lya, who demanded that the Executor explain the taking of the hostages. However, Anor only wanted to inform them that the deadline had been increased, and further shocked the audience by revealing the reason for this: seventeen young Jedi had been turned over to the Yuuzhan Vong by a citizen of the New Republic. After the clamor had died down, the agent provided evidence of the capture by providing a list of the names of those captured."}, {"tag": "p", "text": "Among the list were the three young Solos—Jaina, Jacen, and Anakin— which further shocked the audience at large. However, despite the Yuuzhan Vong emissary's control of the Senate at that moment, Shesh made Anor look like a fool after she criticized him for not knowing that Jaina and Jacen were twins, an important fact in Yuuzhan Vong culture. Despite Shesh's attack at Anor, she later aided him in the debate, when the Bothan vainly sought to hide the time in which seventeen more Jedi would have to be turned over to the Yuuzhan Vong to save the hostages. For this, the Chief of State publicly defeated a political challenge by Shesh, before sending the Calibop security member Mif Kumas and three security droids to arrest Anor for the attempt on the Bothan's life that had occurred before Anor's address, though the agent had had nothing to do with as Shesh has planned it."}, {"tag": "p", "text": "As Kumas neared Anor with a pair a stun cuffs, the agent ripped off one of his little fingers, prompting a black cloud of vapor to quickly spread out from the base of the finger to engulf the droids, Anor, and the Calibop. The security droids only fired at the Executor after he shoved the base of his finger into the face of Kumas, but the glistaweb stopped those bolts. The black cloud continued to grow, and as it filled the chamber, it knocked unconscious all of the individuals inside it as Anor made his escape, knocking down the protection droids and leaving his glistaweb robe behind."}, {"tag": "h4", "text": "After the Twins"}, {"tag": "h5", "text": "Assigned a mission"}, {"tag": "p", "text": "Having just come aboard the Sunulok after escaping from Coruscant, Anor was ordered to visit the Glory Room, and complying, made his way before Lah. Vergere was also present, and she congratulated Anor on his escape, but their conversation soon took a downward turn as the discussion skirted the topic of the assassination attempt that Anor had been blamed for, and one that Vergere had helped orchestrate. However, Lah stopped the bickering of the two just before Vergere insulted Anor, which would have mandated that Anor kill her. Lah soon became angry that he had not been informed that the two Solos were twins, forcing Anor to risk much by claiming that it was good that Jacen had escaped Lah on Duro, for the sacrifice of both of the twins would be a great gift to the god Yun-Yuuzhan. This idea fixated Lah, and he agreed that the two Solos should fight each other in ritual combat to the death, an idea that Anor had further suggested. Sometime later, Anor found Vergere playing Lah a game of dejarik, and he was aghast at how the Fosh had managed to survive suggesting that the warmaster play an infidel game, though he soon found out that the Fosh had claimed that it would help Lah think like the Jedi."}, {"tag": "p", "text": "As the Exquisite Death, the vessel on which the seventeen young Jedi were being transported, was a day overdue at its destination, Lah took Vergere's advice to think like the Jedi would. Concluding that the Jedi would strike at the target that threatened them the most, the warmaster ordered Anor to go to the worldship of Baanu Rass over the world of Myrkr; the Baanu Rass was the origin of all of the cloned Jedi-hunting voxyn hounds, as the voxyn queen, the original subject, resided there. Lah tasked Anor with traveling to Myrkr aboard the frigate Ksstarr and eliminating the seventeen Jedi, save for the twins whom he was ordered be brought back alive. Given such an important task, Executor was elated, but as he backed towards the door, Anor heard Vergere express her doubts about his abilities to Lah."}, {"tag": "p", "text": "Lah called to Anor before he left the room entirely, and after Anor accidentally insulted the warmaster for trusting Vergere, Lah grew tired of the bickering of the two. Thus, he had Vergere accompany Anor on his mission, despite the protests of the Fosh. During the mission, both would fail, or both would succeed, and they would need to work together to make sure that happened. For the mission to Myrkr, Anor was not permitted to use his plaeryin bol, so he was forced to leave his one eye socket empty. Anor was also not to contact Lah himself until his mission was complete."}, {"tag": "h5", "text": "A reluctant alliance"}, {"tag": "p", "text": "The Ksstarr arrived near Myrkr shortly after the Jedi team that had escaped Yuuzhan Vong custody made landfall on the worldship. Anor and Vergere—along with over a hundred and four warriors from the frigate's complement of troops—descended to the Baanu Rass in a shuttle, and landed in a port on the worldship's surface. Upon exiting the shuttle, Anor and Vergere conferred with a Yuuzhan Vong who had seen the team earlier, and he pointed the Executor in the direction where the Jedi were currently: the detention warren near the port. Anor and Vergere then began to pursue the Jedi team with One Scourge, one of the three companies of warriors from the Ksstarr, as the Jedi entered the training course for the voxyn."}, {"tag": "p", "text": "Anor and the group tracked the Jedi into a swampy area situated along the floor of the canyon that served as the training area for the voxyn. However, it was there among the trees in the swamp that Anor's contingent of warriors were ambushed by the Jedi team. Anor's warriors were picked off by fragmentation grenades and blaster fire, and the panicking Executor would have succumbed as well to the ambush had it not been for Jacen's indecision that delayed his blaster shot long enough for Vergere to drag Anor behind cover. The surviving warriors of One Scourge hid behind the trees in the swamp, and began to fire back at the Jedi with their own weapons, but Jacen drew over a half dozen voxyn to their position by opening himself to the Force. After the voxyn reached the location of the battle, Jacen manipulated the voxyn into attacking everything in the water, as the Jedi team had climbed up the trees."}, {"tag": "p", "text": "The combination between the voxyn and the Jedi's long range weapons proved fatal for all of Anor's warriors in One Scourge, leaving Vergere and Anor with no support; the Jedi killed the voxyn that Jacen had summoned not long after the warriors were slain. Despite losing the initial engagement, Anor's forces and the constant attacks on the Jedi team began to wear them down. Although Anor's forces were initially ordered to capture the strike team alive if possible, once the Jedi continued to get closer to the location of the voxyn queen, the Yuuzhan Vong forces began to use more dangerous weaponry such as razor bugs. Following the battle in the training area, the Executor had his troops ambush the Jedi team in the city where the Baanu Rass's slaves were kept, after infiltrating disguised Yuuzhan Vong warriors among the slave populace. The resulting attack killed Jedi Jovan Drark and Eryl Besa, and seriously wounded Anakin before the team escaped."}, {"tag": "p", "text": "After the slave city incident, Anor and the warriors of Two Scourge constantly harried the Jedi, staying just far enough behind that the team's Barabel Jedi could not hear them, but close enough so that the Jedi were forced to keep moving, lest they be captured. This wore down the Jedi even more, as they could not stop to rest at all. The pursuing warriors soon caught up to the Jedi, only to have the Jedi bring down a portion of the tunnel they were in with explosives. This momentarily halted the advance of Anor's warriors, though the Yuuzhan Vong clambered over the rubble pile that had been created to engage the Jedi. Mines that had been planted earlier on the opposite side of the rumble pile went off then, killing more warriors, but not before the Barabel Jedi Bela Hara was slain. Despite the mound of bodies and rubble that now stopped the Yuuzhan Vong from advancing, Anor ordered his troops to crawl over the bodies to continue harassing the Jedi."}, {"tag": "p", "text": "While the Executor was still in pursuit of the Jedi with Two Scourge, Lah contacted Anor via a villip. Anor informed Lah of the situation, and how even as he pursued the Jed with Two Scourge, the forces of Three Scourge lay in wait at the end of a transit, where they would ambush the Jedi team. Lah emphasized the fact that the Solo twins were to be taken alive, as well as the fate that any warrior who took one of the Solo twins' lives would meet. However, the Jedi force outwitted Anor, hiding in a short access tunnel that led to an enormous feral voxyn den. Anor's forces from Two Scourge passed right by, partially because the pack of voxyn they had had initially with them had all been slain earlier by the Jedi, and thus no beasts alerted the warriors to the presence of the Jedi. Because of this, the Jedi force was never hammered between Two Scourge and Three Scourge. Over an hour after the Jedi escaped Anor's trap, Anor's frigate the Ksstarr pursued a serviceable YV-888 freighter as it left the atmosphere of the Baanu Rass, after a small part of the Jedi team utilized the freighter that they had found to try to escape."}, {"tag": "p", "text": "It was then, after the YV-888 left the worldship, that the remaining Jedi launched their attack on a grashal in which the voxyn queen was located. With the Jedi engaged with the warriors at the grashal, Anor and some of his forces arrived to back them up, with an artillery squad with magma spitters preventing the Jedi from escaping from the makeshift door they had created, while Anor's other troops approached the primary entrance. Disguised as a sandy-haired Human and wielding an E-11 blaster rifle, Anor entered the grashal through the primary entrance before any of his warriors did. Anor was spotted by Anakin—who was on the verge of dying and was only surviving by using the Force to keep himself functioning—and although the Jedi saw through the disguise, the Executor escaped after firing upon the Anakin. Despite Anakin alerting the rest of the Jedi, the agent made it to the voxyn queen's pen, and released the beast. Collecting a cargo pod full of voxyn tissue that would be able to clone a million more voxyn, Anor dragged the pod toward the Jedi team's original entry point in order to escape, as Anakin was currently engaging the Yuuzhan Vong warriors that were pouring through the primary entrance."}, {"tag": "p", "text": "However, before Anor escaped, Anakin, who was succumbing to the Force as he used it to kill the warriors, threw a thermal detonator that hit the agent in the head. When the agent reached for the detonator, Anakin used the Force to move it out of Anor's reach, before the Jedi guided it under the cargo pod. With no time left before it exploded, Anor was forced to abandon the materials and fled cursing, just as Anakin fell to the warriors' attacks and died. The cloning grashal itself did not survive the fight, putting another smear on Anor's record, and although the Jedi team failed to kill the voxyn queen there, Anor did not succeed in capturing the twins at the grashal either. Shortly after the Jedi escaped, a portion of the team stole the Ksstarr's assault shuttle, as well as the body of Anakin, which was until then in Yuuzhan Vong possession."}, {"tag": "h5", "text": "Following the voxyn queen"}, {"tag": "p", "text": "As both sides pursued the runaway voxyn queen, Anor's frigate landed near where the Yuuzhan Vong had located her: in an underground abandoned insectile hive on the surface on the worldship. Disembarking from his ship alongside other members of his race, Anor met with a shaper near the position of the voxyn queen, whom they could not approach in the fear that it would run off. Vergere soon joined Anor and the shaper there, and a shouting match broke out between the three as they decided what to do about the voxyn queen and the stolen shuttle. However, their argument was interrupted when the Ksstarr on the surface was assaulted by the stolen shuttle, piloted by Jaina. The resulting explosions sent Vergere scurrying away, and moments later, a cascade of ruble from the weakened ceiling landed around Anor and the shaper; the explosions also scared off the voxyn queen."}, {"tag": "p", "text": "By the time Anor had reached the edge of the fallen hive, the shuttle had been shot down by the landed Ksstarr, causing the shuttle to crash with its Jedi occupants in it upon the Baanu Rass. While the shaper, who had also survived the rain of debris, went in search of the voxyn queen, Anor headed to the surface—which possessed an atmosphere allowing sentient beings to survive—towards the position of his frigate. There, Anor stripped some of the Ksstarr's crew to arm a company of approximately fifty warriors before he approached the position of the crashed shuttle. The shuttle had landed in the center of a huge depression that housed a honeycomb-like formation of dovin basals, and the Executor and his group picked their way towards the position of the crashed shuttle along the edges of the basal-comb while the Jedi in the shuttle fired upon the warriors."}, {"tag": "p", "text": "Meanwhile, the shaper managed to regain control of the voxyn queen, and escorted it to the frigate in order to keep it safe. However, before the shaper and the warrior escorts could bring it inside the frigate, Jacen, who was watching the events in the depression alongside some of the other Jedi, as well as Vergere, prompted the queen to flee the Yuuzhan Vong via use of the Force; Vergere had approached the Jedi team and was secretly aiding them in their pursuit of the voxyn queen. The beast escaped its captors, and proceeded to flee to the basal-comb, with both the shaper and Jacen in pursuit. While Jacen's pursuit of the queen distracted the warriors guarding the Ksstarr, other members of the strike team seized control of Anor's frigate. Although harried by coralskippers and a Yuuzhan Vong corvette, the rogue Ksstarr evacuated all of the surviving Jedi team save for Jacen. With Jaina no longer in the shuttle to capture, Anor and his warriors instead headed for where Jacen was confronting the voxyn queen, all the while taking fire from his own ship, now in the hands of the Jedi."}, {"tag": "p", "text": "Jacen killed the voxyn queen with help from Vergere, who had followed him after he had run out after the queen. However, Vergere, although she had just aided the other side, restrained the young wounded Jedi from fighting against Anor and the others. As Anor's frigate carried away the remnants of the Jedi team to safety, following a failed attempt to break through a screen of corvettes to rescue Jacen, the male Solo twin fell into Anor's clutches. Shortly after the capture of Jacen, Anor reported to Harrar, who had been sent to consecrate the twins for sacrifice, that although Jaina had escaped, she was still in the agent's reach. Harrar later called on Anor to field another report through the use of a villip, in which Anor outlined the losses, informing Harrar and the warrior Khalee Lah that Jaina Solo had escaped with the survivors of the Jedi strike team aboard the Ksstarr, which was currently vectoring away from the Baanu Rass. However, the agent also stressed that Jacen had been captured, and that Anakin had been slain. After Harrar stated that it would be prudent for Anor not to take Jacen with him as he searched for Jaina, so that they might not telepathically communicate, Anor handed the job of pursuing Jaina to Harrar and his priestship, while he himself took Jacen back to the warmaster."}, {"tag": "h4", "text": "Solo Project"}, {"tag": "h5", "text": "The seedship"}, {"tag": "p", "text": "Following the capture of Jacen, Anor, with Vergere's help, began the secret Solo Project, which had a goal of converting the young Jedi to the beliefs of the Yuuzhan Vong. Aboard a small ship, Anor monitored Jacen as he was subjected to an Embrace of Pain torture device in order to break his will, or to let him begin to relish physical torment. Very early on in the initial stages of the project, the Executor predicted that the Jedi would turn to the True Way of the Yuuzhan Vong, and he was proven right after Jacen was in the Embrace of Pain for a significant amount of time. Anor furnished a report of the Embrace of Pain's analysis of Jacen's brain chemistry, and he listened to a drone relay the findings of Anor's report to Warmaster Lah via villip."}, {"tag": "p", "text": "With Vergere in the room beside him, Anor specifically waited for when Lah would become irate at the boring report from the drone, and after the drone had scurried from the room, Anor began to offer his own interpretation of the data in a much more clear and concise tone than the drone's report that he himself had written. While depicting the earlier attempts to convert Jedi as failures, and the one where Veila had almost been turned into a Yuuzhan Vong a blasphemy, Anor reported that the Solo Project would work, as the data from the Embrace of Pain showed that Jacen was accepting pain. Though Lah at first did not see what benefit turning Jacen to the True Way gave, Anor cemented the value of Jacen's conversion with a suggestion that the changed Jacen would fulfill the Great Sacrifice by capturing his sister and taking her life. However, Lah took this in a more fanatic state of mind than Anor would have liked, and the warmaster declared that if Anor failed to bring this scenario to be, Anor would be sacrificed, despite the Executor's attempts to reason with the warmaster."}, {"tag": "p", "text": "As the Jacen Project continued, the young Jedi was moved from the Embrace of Pain, after he had learned to not fight against the pain, to the Nursery on a Yuuzhan Vong seedship. The Nursery was where infant dhuryams, destined to be world-coordinators, were raised as they learned to telepathically control slave gangs in the Nursery. Jacen was placed into the Nursery among the slaves, and Anor and Vergere were keen to watch his interactions with the dhuryams. Anor and Vergere monitored Jacen's progress as he first began to administer aid to the wounded slaves, and then as he became allies of sorts with one of the dhuryams. To keep an eye on Jacen, the Executor and the Fosh observed the Jedi through the use of a viewspider, though Anor soon worried about Jacen's increased freedom."}, {"tag": "p", "text": "As Anor had underestimated Jedi far too often, the agent was concerned that the Jedi might wreak havoc on the seedship, which was irreplaceable as it was full of gene samples from the Yuuzhan Vong's destroyed homeworld of Yuuzhan'tar. Because of this, he ordered a special contingent of over a hundred warriors to go undercover in the Nursery via the use of masquers to guard against any attempt Jacen might have of destroying the seedship. The Executor also decided to have his personal coralcraft prepped so it would be ready if he had to make a quick escape, in the event that Jacen did something unpredictable, and Anor was forced to deal with the consequences."}, {"tag": "p", "text": "It soon became time for the tizo'pil Yun'tchilat, a ceremony in which one of the dhuryams would be chosen to be the World Brain of the world of Coruscant, which had fallen to the Yuuzhan Vong while Anor was occupied at Myrkr. For the ceremony, one of the yammosk's brethren—a shreeyam'tiz—prevented the dhuryams from commanding their slaves groups as guarded shapers evaluated the domains that each of the dhuryams had created up until then. During the ceremony, Anor watched Jacen with the use of the viewing spider, and was amazed and annoyed by two things the Jedi did: Jacen did not run to the coraltree basals like the rest of the slaves did after the dhuryams lost their control over the slaves—as the Jedi could endure the pain that came from not staying in physical contact with the coraltrees—and he also situated himself in an amphistaff grove, which would have usually killed anything, Yuuzhan Vong or not, that came inside it. The Executor was confused and agitated at Jacen's behavior, as he knew that the Jedi was aware that all of the other slaves were to be killed following the ceremony."}, {"tag": "p", "text": "Despite Vergere's assurances that it was good that Jacen stood alone, as he was embracing the Yuuzhan Vong way by not going to the other slaves, Anor did not trust that the Jedi had been converted. Fearing that Jacen might in some way disrupt the important ceremony, the Executor communicated with the cloaked warriors in the Nursery and ordered them to capture Jacen in the amphistaff grove, and to kill him if they could not apprehend him. The warriors were to then bring the bound Jedi to Anor's coralskipper, if Jacen was still alive. However, instead of the warriors capturing Jacen, the Jedi lured one of the warriors who came to get him into the amphistaff grove to be ripped apart by maturing amphistaffs, before summoning multiple amphistaffs to form an armor for him so he could engage the heavily armed warrior squads coming for him. Realizing that Jacen was going to throw away his life, and make a scene doing so, Anor was furious enough that he briefly considered defecting to the enemy rather than face Lah's wrath at the death of Jacen. With Jacen racing to engage the warriors head on, Anor prevented Vergere from going to Jacen's side to try to salvage the situation."}, {"tag": "p", "text": "After Jacen dispatched a few of the warriors before being knocked unconscious, Anor took this as a sign that the Jedi could be constrained. However, Vergere showed the Executor that the danger was not over in the Nursery, as the slave gangs were now engaging the warriors and slaughtering the warriors in there; Jacen's real target had not been warriors but the shreeyam'tiz, which when destroyed had released the slaves to be once more telepathically controlled by the dhuryams. Anor became deeply shocked as the slaves controlled by the dhuryam that Jacen had bonded with used spade rays as makeshift catapults to fling flammable sparkbee honey in order to set fire to much of the area surrounding the hive-island where the dhuryams dwelt. As the chaos progressed, the dhuryams not affiliated with Jacen brought all of their slaves near the hive-island to defend themselves, and in doing so forced their slaves upon the surviving warriors that had formed a ring around the dhuryams. By then, as the coral tree basals were afire, Anor had descended into a dazed state because he knew that Lah would kill him for failing to keep the situation under control."}, {"tag": "p", "text": "It took both Vergere's insistence and the sight of Jacen making his way through the frenzied slaves around the hive-island to kill his first dhuryam for a dazed Anor to allow his Fosh companion to go to Jacen to stop him. As soon as Vergere was gone, Anor sprinted for his coralcraft in order to escape the chaos on the seed ship and save his life. Despite Solo's drive to kill the dhuryams, Vergere interceded before the Jedi could kill the dhuryam he had bonded with, though she failed to save the others. In this way, the surviving dhuryam became the World Brain for Coruscant, renamed Yuuzhan'tar by the Yuuzhan Vong as they began its terraforming. Jacen also did not die, and was inserted onto Yuuzhan'tar in the seedfall, where the seedship that had held the Nursery deposited its valuable living cargo onto the planet to further change Coruscant into a representation of the original Yuuzhan'tar."}, {"tag": "h5", "text": "The World Well"}, {"tag": "p", "text": "Because Vergere had managed to save the seedship and one of the dhuryams, Anor was not faulted by Lah for dooming the Yuuzhan Vong's ability to create a new Yuuzhan'tar. Despite the mishap in the Nursery, Anor was still on board with the Solo Project, and thus continued to help Vergere. Around the time that the old Galactic Senate was being converted into the Well of the World Brain to house the single surviving dhuryam so it could become the World Brain for the new Yuuzhan'tar, Anor bribed a shaper to grow a concealed coralcraft near the World Well. This would allow the agent to make a quick escape if he needed to. While the craft was growing, the agent secretly visited the coralcraft numerous times using a hidden hatch sphincter that was concealed in the outer coral of the World Well, and during these visits, Anor allowed the craft to imprint itself to his mental signature so that only he would be able to use its pilot brain."}, {"tag": "p", "text": "Weeks after the seedfall on Yuuzhan'tar, Anor, in helping with Vergere's conversion of Jacen, met with Master Shaper Ch'Gang Hool—the Yuuzhan Vong in charge of the shaping of captured Coruscant—to convince him to throw all of his resources towards catching Jacen. Lying that he had been sent by Lah, Anor revealed that Jacen, who had almost destroyed the seedship, was alive and well on the world Hool was tasked with shaping in order to get him to aid them. Even though Hool was aghast at learning this, it took Anor stating that he knew where Jacen was at that moment and what he was doing to persuade Hool to send troops out to catch the Jedi."}, {"tag": "p", "text": "After Hool released the warriors to hunt for Jacen, Vergere, who had been with the Jedi since the seedfall, accompanied the young Jedi as he fled from the warriors pursuing him. Vergere led Jacen to where Anor and a dozen of Hool's warriors waited, deep down in the lower levels of Yuuzhan'tar, below where the original Jedi Temple had stood, and near to where a nexus of dark side energy existed. When the lights in that room went on, Jacen saw Vergere betray him by consulting with the Executor, and the combination between this act and the dark side energy close at hand caused the Jedi to unleash his anger. Jacen hit Vergere with a blast of Force lightning, and when he could not do that to Anor and the other Yuuzhan Vong warriors, as they could not be reached by the Force, Jacen channeled the power of a storm that was raging on the surface of Yuuzhan'tar. The wind that Jacen summoned pelted the warriors and Anor before pushing them back into a corner of the room."}, {"tag": "p", "text": "Jacen then brought down the room's ceiling, and the resulting avalanche of rubble almost buried the Executor and his warriors, though they all miraculously were unharmed as the rubble proceeded to separate the Yuuzhan Vong from Jacen and the wounded Vergere. Vergere eventually made it over to where Anor and the warriors were, and proceeded to use her tears to heal her scrapes and burns; Vergere had successfully manipulated Jacen into using the dark side of the Force, thus opening him to both sides of the Force. Shaken from the near miss and with Jacen running off, Anor berated Vergere for unleashing the Jedi when it was not necessary for their goal, though the Fosh convinced Anor that Jacen had to first unlearn lies for the Solo Project to succeed."}, {"tag": "p", "text": "Vergere eventually tracked Jacen down to what remained of the apartment that he had lived in before Coruscant fell, and Anor and his warriors followed the Fosh there. He and the others waited outside of the apartment until Vergere managed to get Jacen to open himself to the Yuuzhan Vong part of the world around him, allowing him to sense the Yuuzhan Vong creatures for the first time. Feeling triumphant, Anor entered the apartment on the heels of Hool's warriors, and begged Jacen to embrace the True Way, as the Force was corrupt and had no purpose. The agent proclaimed that Jacen could become a God, and proceeded to take the lightsaber of Anakin out and used it to cut away the web cables of some arachnoids who had bound Jacen to a chair while he had contemplated his existence. Kneeling before the Jedi, Anor offered him the lightsaber, giving him the choice to either slay all the Yuuzhan Vong in the room with it, or join their side."}, {"tag": "p", "text": "Jacen, after thinking on the choice, decided to join the Yuuzhan Vong in their worship of the True Way, and used the Force to send the lightsaber to Vergere instead of taking it up in battle. However, Anor, though he felt triumphant at completing his mission, was like the other Yuuzhan Vong a bit mistrustful of the conversion of Jacen, and thus did not let the Jedi anywhere near the location of the World Brain. Anor was placed under Jacen's control, and the plan of having Jacen slay his sister in battle was moved foreword, with Jacen setting about trying to capture his sister. A rumor was spread that Jacen had been spotted, and the Yuuzhan Vong hoped that Jacen's sister would track down the origin of that source. However, it was the Jedi Knight Ganner Rhysode who instead tracked the rumor to its source weeks after it had been spread, and was captured by Jacen and a group of warriors waiting there. Anor was informed of the plan's failure via villip, and the operation was called off because of the potential danger of Jedi other than Jaina finding the rumor's source."}, {"tag": "p", "text": "Rhysode was brought drugged to Yuuzhan'tar instead of being killed, and Jacen eased Anor's doubts about this turn of events by claiming that Rhysode should be sacrificed in the right way, and went as far as to suggest that the sacrifice could be a dry-run for the one where Jacen would sacrifice his sister, as he needed practice making a Jedi a willing sacrifice. Thus it was eventually decided that a dry-run of the Great Sacrifice would be attempted with Rhysode. Jacen was left for a while with Rhysode to convert him, but when the monitor creatures used to observe the two Jedi went unconscious, Anor, along with Hool and a contingent of warriors and priests, arrived at the chamber the two were in to make sure everything was all right."}, {"tag": "p", "text": "However, when Anor inquired as to why the monitors were out, Jacen, playing his role as a Sacred Twin, declared that Anor's concern was an insult, and that the monitors must have fallen asleep because he willed it. This show frightened the priests present, but not Anor, who was still not completely convinced of Jacen's devotion. At Jacen's orders, Rhysode then declared that he was a willing sacrifice, and despite having his reservations about the conversion, the Executor was willing to set the dry-run in motion. The Yuuzhan Vong created a procession that would take Jacen and Rhysode to the Well of the World Brain, and, ringed by honor guards, Anor and Hool walked ahead of the two Jedi. The procession passed through a growing hedge maze that ringed the Well of the World Brain, before eventually mounting a causeway that led to the entrance of the Well. It was there that Rhysode collapsed, and Anor was forced to lie to Hool that the Jedi was merely expressing his reverence to the gods. Making his way to where Rhysode lay, Anor begged Jacen to get the other Jedi moving again. Jacen, after a moment, fooled Anor into thinking Rhysode was alright after the converted Jedi lifted Rhysode up with the Force and made it look as if he was walking towards the World Well."}, {"tag": "p", "text": "The procession stopped at the Great Door, and after Jacen addressed the procession behind him, declaring his devotion to the true gods, the pair of Jedi entered through the entrance way. Although Anor, Hool, and the priests and warriors made to follow them, Jacen closed the door with the Force before they could do so. With a pair of Jedi near the Well of the World Brain, the door was blown to allow a host of warriors to enter the old Galactic Senate, with a squad being sent to check the corridor that led to where the World Brain was situated. Anor hung back near the wreckage of the Great Door as a precaution, and five minutes after the squad—who never came back—had been sent down the corridor, Rhysode appeared in the doorway that led to it. Prompted by the leader of the warriors to do something, as it was the Executor's event, Anor ordered Rhysode to step aside, emboldened by the fact that Rhysode was a weak Jedi."}, {"tag": "p", "text": "However, though Anor explained how desperate Rhysode's situation was, Rhysode proceeded to buy Jacen time with the World Brain and guarded the corridor, using Anakin's lightsaber that Jacen had given to him, against the Yuuzhan Vong warriors who attempted to get past him. As the warriors failed to get past Rhysode, Anor was appalled at the turn of events, and tried to get the Yuuzhan Vong warrior commander to either gas Rhysode or blow him up, so that they could stop Jacen from being alone with the World Brain. However, the commander refused to do such a dishonorable deed, and neither Hool nor the commander were very concerned that Jacen was alone with the World Brain, as the Master Shaper believed that the dhuryam could defend itself if necessary. Anor, however, was near panicking, because he would be held responsible for the disaster that was occurring as they spoke."}, {"tag": "p", "text": "Seeing Vergere motion for him to come to her, after neither Hool or the commander would authorize drastic measures to get past Rhysode, the Executor went angrily over to the Fosh. Brushing aside his attempts to involve her with the disaster at hand, Vergere told Anor that she should accompany him as he fled the consequences of the disaster in the World Well to defect to the New Republic. The Fosh even explained that she knew of Anor's secret coralcraft, and Vergere eventually convinced Anor that they had to leave immediately, as the Fosh claimed that Jacen would soon steal the craft, and in doing so, foil their own departure. The Executor was convinced by this, and led the feathered creature away to the coral side of the World Well, where he opened a secret hatchway and he and Vergere descended into it."}, {"tag": "p", "text": "The pair winded their way through a series of corridor, before reaching the wrecked area that was the offices of the Galactic Republic's Supreme Chancellor, where they found the coralcraft. Upon reaching the craft, Anor began to flaunt his preparedness for disasters. However, the agent soon found himself confronted by Vergere holding Jacen's lightsaber. Although Anor told Vergere that she could not possibly betray him, the Fosh though otherwise, and she used the Force to make the tangled wreckage in the derelict office wrap Anor's limbs with knots, binding the agent to the spot. Despite Anor's desperate insistence that only he could pilot the craft, Vergere believed that Jacen could definitely fly the living ship by himself, due to his knack with animals. Vergere left Anor, who was in disbelief at this turn of events, to go get Jacen, after amiably telling the agent that she had told him that Jacen would steal his ship."}, {"tag": "p", "text": "Eventually, Vergere brought Jacen after he had succeeded in his primary objective of talking to the World Brain back to Anor's location. At first, the agent begged to be brought with them, declaring that they might as well be murdering him, as Lah would do the job himself. However, when this did not get him a spot on the Executor's personal coralcraft, Anor resorted to cursing both Vergere and Jacen, who left shortly after in the craft; meanwhile, Rhysode fell in battle, but only after slaying numerous beasts and warriors before finally bringing the ceiling of the corridor down to crush both him and the opponents he fought."}, {"tag": "h3", "text": "Yuuzhan'tar, and the debacle at Ebaq 9"}, {"tag": "h4", "text": "Escaping blame for the Word Well incident"}, {"tag": "p", "text": "Despite Solo's escape, and his association with Vergere's betrayal, Anor was not executed for his failure, and continued to work for good of the Yuuzhan Vong cause in 28 ABY. That year, Anor was present at the arrival of Supreme Overlord Shimrra Jamaane's worldship on Yuuzhan'tar. Situated among the intendants who were in turn arrayed in front of orderly groups of thousands of priests, shapers, and warriors, Anor watched as the worldship settled into its prepared berth on Yuuzhan'tar, so that the vessel would become Jamaane's citadel on the captured world. Just after the worldship reached its final resting place, the Executor felt an aggravating itch start at his feet, but Anor did not let himself to show any outer signs of torment, as higher up Yuuzhan Vong were not supposed to be bothered by pain. From the crowds, Anor listened to Jamaane's brief address."}, {"tag": "p", "text": "Shortly after Jamaane arrived on Yuuzhan'tar, Anor and other high ranking Yuuzhan Vong met with the Supreme Overlord in the Hall of Confluence, in the Citadel. Featuring architecture that created a trompe l'oeil with Jamaane's hau polyp throne as the artificial vanishing point, the hall also had dovin basals installed into it that made it seem via their gravitational manipulation that Anor and the others were walking uphill as they approached Jamaane. Prostrating themselves on the ground before the massive Yuuzhan Vong that was Jamaane, Anor and the others rose after they were permitted to, but only the Great Council was allowed to sit, leaving Anor to stand off to the side."}, {"tag": "p", "text": "With the Shamed One Onimi providing some comic relief at the beginning, Jamaane started the meeting by going over Lah's work towards the war effort. Citing that the depleted Yuuzhan Vong military could not continue its offensive, the Supreme Overlord ordered the stop of all new strikes again the New Republic and other groups. Throughout the meeting, as the Supreme Overlord oversaw the reports of his advisers, the itch continued to bother Anor. As High Prefect Yoog Skell of the intendants made his report about the state of the New Republic from information gained via their agents, Skell passed Anor Jamaane's question about whether Rodan and Cal Omas, the two candidates for the leadership of the New Republic, would favor submission to the Yuuzhan Vong or war."}, {"tag": "p", "text": "With the Supreme Overlord's entire focus upon him, Anor managed to relay the information that, of the two, Omas was more inclined towards the Jedi without stammering in front of Jamaane. As the Supreme Overlord saw Omas as the worst of the two, he ordered Anor to have Omas assassinated, after the Supreme Overlord crushed the Executor's brief protest that he did not have the personnel in place. However, the Supreme Overlord was not done with Anor, and asked him whose fault the debacle in the Well of the World Brain has been. With the viable presence of Jamaane pushing against his thoughts, Anor at first tried to shrug some of the blame upon Lah, for he had acted under the warmaster's authority, but when this failed the Executor attempted to explain that Vergere has misled all of them. With the Supreme Overlord' presence growing bigger in his mind by the moment, Anor's attempt to lay the blame away from himself ended with his crying out loud that it was all Vergere's fault."}, {"tag": "p", "text": "However, Harrar saved Anor by interceding that Vergere had indeed fooled both him and Khalee Lah, and many others. With Harrar's remark, Jamaane shifted his full attention away from Anor, and the topic at hand away from Anor's failure. The Supreme Overlord went on to authorize limited action against the heretical groups that had risen up to venerate the Jedi, before Hool reported. In his report, he mentioned a fungal infection that was bothering certain individuals—this same infection was the cause of the itch that Anor and others in that same room had at that moment. Hool did not get much further however, as Jamaane accused him of relieving his itch by scratching, even though he was a distinguished member of the Yuuzhan Vong, and went on to pin the botched worldshaping of the new Yuuzhan'tar on Hool. Anor and the others were furious that Hool was the reason, and the shaper was taken from the room to be executed."}, {"tag": "p", "text": "After the meeting was finished, Anor and the Skell walked back to the Damutek of the Intendants, and it was there in the damutek's corridors that Skell conversed with Anor about the power of the Supreme Overlord. Skell knew that Anor had felt the power of Jamaane when he had interrogated him about the incident at the Well of the World Brain, and informed a shocked Anor that it was actually the Supreme Overlord himself who had incited his advisers to be furious at Hool at the end of the meeting. Listing Hool's many failures as a reason for the shaper's demise, the High Prefect advised Anor not to make any more mistakes, lest he end up like Hool."}, {"tag": "h4", "text": "The eighth cortex"}, {"tag": "p", "text": "Shortly after learning about the Jeedai heresy that had come into being, Anor infiltrated a group of Shamed Ones that were practicing the heresy as he was curious about it. Using an ooglith masque to pass unseen among the heretics as one of the worker caste, Anor attended two such meetings, where a Shamed One led them through prayers that idealized the Jedi Knights. The itch still affected many of the Yuuzhan Vong on Yuuzhan'tar, and Anor was forced to scratch himself to make him appear as a worker. From his time at the meetings, Anor came to believe that the heresy's lack of direction had muddied many teachings, but an iron-willed Prophet would be able to lead the heretics to great heights. After the second meeting had finished, the Executor left the minor intendant office that the heretics had used for the meeting, and departed from the vicinity. However, Anor came across a road far out from the area settled by the Yuuzhan Vong, and upon seeing a being riding a quednak, stopped by the roadside and bowed in a guise of servitude until the beast of burden and its rider went by. However, as the quednak passed, Anor recognized the rider as Onimi, and curiously tailed the Shamed One to his destination."}, {"tag": "p", "text": "Anor followed Onimi to a heavily guarded damutek, and there, approached the warriors stationed outside. Pretending like he was searching for the damutek of Hooley Krekk, Anor, in his guise as a befuddled worker, pranced about after being informed that Krekk did not own the damutek. Anor's antics drew more warriors, and a subaltern slashed the disguised Executor with an amphistaff to make him go away. Anor vacated the premises, but not before deducing that the damutek was being used for an important secret shaper project, as he had seen two shapers outside of the facility, and the damutek was built in the middle of nowhere. Because of his treatment at the hands of the subaltern, Anor understood the anger of the Shamed Ones due to how they were treated."}, {"tag": "p", "text": "Sometime after Anor discovered the secret shaper damutek, the shapers produced an anti-fungal balm that allowed Anor and the other Yuuzhan Vong affected by itching to finally relax. A few days after the introduction of the balm, Anor attended a gathering in a temple where a head priest passed word of the condemnation of all of the heretical Jedi beliefs among the Shamed Ones and other lowly castes. Although he at first approved of the message, Anor, upon leaving the site of the gathering, found that the message about the heresy had been too detailed, as it specifically told the heretics what not to practice. This would allow those heretic groups that had a muddled doctrine to tweak it so that it more followed the beliefs of all other heretics. While leaving the temple, the Executor found that he walked side by side with a shaper."}, {"tag": "p", "text": "Using the fake name of Hooley Krekk, Anor asked the shaper what a cortex was, and after learning that it was a body of knowledge, inquired as to how many there were. The shaper told Anor that there were eight, and the eighth had not been given to the master shapers by Jamaane yet. A shocked Anor departed the shaper's company, so that he could think about what he had just learned. Anor deduced that the eighth cortex did not exist, as the shaper damutek he had just discovered was most likely supposed to produce that knowledge. The lack of an eighth cortex meant that the Yuuzhan Vong would not gain any extra aid from creations by the shapers in their war, while the New Republic continued to innovate and learn Yuuzhan Vong weaknesses. Anor had always suspected that some of the pillars of faith and obedience of the Yuuzhan Vong had been fake, but this was the first proof he had that they were. A stricken Anor was forced to pull himself back together to avoid drawing the attention of passersby."}, {"tag": "h4", "text": "Seeking an end to the war"}, {"tag": "p", "text": "Meanwhile, the pair of assassins that Anor had dispatched to kill Omas failed in their mission, after Jade Skywalker slew the two assassins on the world of Mon Calamari, where the remnants of the New Republic's government was holed up. Additionally, to add to the woes of the Yuuzhan Vong, the Shamed Ones continued to worship the Jedi, and the world brain of Yuuzhan'tar frequently made errors in its duty of managing the world. Anor's attempt to shove the blame for the World Brain incident upon Lah furthered the rift between the too individuals as well. Shortly after the bungled assassination attempt by Anor's agents, the Executor attended a ceremony in a square on the Yuuzhan Vong capital, where numerous captives were to be sacrificed. However, the World Brain made a mistake in its duties, and the maw luur organisms beneath the ground regurgitated noxious waste into the square. Jamaane was forced to cancel the ceremony, and ordered the captives to be killed, before having Anor and the other high ranking Yuuzhan Vong retreat into a temple to get away from the smell."}, {"tag": "p", "text": "In the temple, Jamaane asked Anor if the Executor's spies had found any underground activity, in response to the public failure that some of the higher ups were pinning on the underground. Anor, wilting under the fierce gaze of the Supreme Overlord, was able to respond that he had not, before Jamaane's attention turned elsewhere. Lah wished to the take the battle to the New Republic, and seize a decisive victory, but the Supreme Overlord ordered the warmaster silent. Anor interceded here, agreeing that a decisive battle should be fought soon, ideally just after the Yuuzhan Vong fleet was at full strength. Despite Jamaane mocking the Executor for his failures, the Supreme Overlord authorized the strike. However, the battle would only be fought after significant information had been gathered by Anor's agents, and if either Lah or Anor failed, both would pay the price."}, {"tag": "p", "text": "As the Yuuzhan Vong still searched for their battle, Thrackan Sal-Solo, one of the most important Corellians, came to Yuuzhan'tar to negotiate a deal that would make the Corellian system friends with the invaders. Sal-Solo brought along with him a companion by the name of Darjeelai Swan, whom the Yuuzhan Vong interrogated while Anor interviewed Sal-Solo. From Swan it was learned that not only was Centerpoint Station not operational—which nullified Sal-Solo's part of the bargain that had him not use the super weapon against the Yuuzhan Vong—but Sal-Solo had been the one who had fired Centerpoint Station at the Yuuzhan Vong fleet at Fondor."}, {"tag": "p", "text": "With news of the enemy movements not pertaining to the decisive battle that the Yuuzhan Vong needed, Anor visited Jamaane in the Supreme Overlord's private audience room. Greeted by Onimi in the doorway, the Executor reported alone before the Supreme Overlord that the New Republic continued to raid Yuuzhan Vong held targets, and that they fled before any substantial fleet could oppose them. Anor also explained that the New Republic task force leaders were picking their own targets and not having them designated by the government on Mon Calamari, saving the Executor from taking the blame of the failure of his agents to discover their designated targets."}, {"tag": "p", "text": "The Executor then informed his higher-up of the latest developments regarding the Peace Brigade, who had established themselves on the Hutt Space world Ylesia; the Peace Brigadiers had turned into various squabbling factions, and had no real leader, as the leader the Yuuzhan Vong had intended them to have was the Senator Shesh, who had perished earlier. In addition, Anor also reported on the situation in the Corellian system, and explained how Sal-Solo wished to become friends with the Yuuzhan Vong. Bringing Sal-Solo and his pair of bodyguards before Jamaane, Anor knocked the Corellian flat on his face for failing to show proper respect to the leader of the Yuuzhan Vong. Then, acting as a translator between Jamaane and the Corellian, Anor informed a shocked Sal-Solo that Jamaane had decided to take the Corellian up on his offer."}, {"tag": "p", "text": "Although Sal-Solo requested that he be given free-hand in Corellia, Jamaane instead clarified, through Anor, that the Supreme Overlord would be the one given a free-hand in the affairs of Corellia. Jamaane also wanted Centerpoint Station to be turned over to the Yuuzhan Vong before the deal between Sal-Solo and Jamaane was finalized. Sal-Solo however could not promise anything, and despite the Corellian agreeing to keep quiet about the Centerpoint Station deal when he went back to Corellia, the Supreme Overlord and Anor suspected that the Corellian was lying. Because of this, Jamaane ordered Sal-Solo to become the leader of the Peace Brigade forces on Ylesia; in this way, the Corellian would lose reputation by being publicly aligned with a Yuuzhan Vong allied government, which was a way of revenge for what occurred at Fondor. The visitor from Corellia was taken aback at this turn in the negotiations, and began a lengthy explanation about how being the leader of the Peace Brigade could not let the Yuuzhan Vong realize their plans for Corellia."}, {"tag": "p", "text": "Both Jamaane and Anor soon grew tired and annoyed with Sal-Solo, and upon Jamaane's orders, Onimi stealthily approached the talking Corellian, and proceeded to stab Sal-Solo in the kidneys with a baton after Anor identified that spot as a good target, knocking the man to the floor. Picking Sal-Solo's face from the floor via his hair, Anor informed him that his resignation had been denied, and that Sal-Solo would be traveling to Ylesia. With the help of Onimi, Anor dragged Sal-Solo to the door, and before the Corellian left, Anor asked Sal-Solo if he had a preferred way for Swan's body to be disposed in, as the female had been killed during interrogation. When no answer came, the Executor ordered the body to be destroyed."}, {"tag": "h4", "text": "Ebaq 9"}, {"tag": "p", "text": "A while later, Anor's spies managed to find valuable information that would help bring about the decisive battle that the Yuuzhan Vong needed, and he went to give news of this to the Supreme Lord. Opening the door of the Hall of Confluence, Anor was once again scared by the sudden appearance of Onimi in his face. The Shamed One brought him to the Supreme Overlord's throne, where Anor informed Jamaane that he believed that he had the information needed to win the war. The Supreme Overlord called for Lah, and Anor was forced to wait before the Supreme Overlord alone until the Warmaster arrived. With Lah there, Anor congratulated the warmaster on his recent mating, though Lah quickly went to business, and asked the Supreme Overlord for permission to attack the Corellian system with his prepared fleet. However, Anor had another target in mind."}, {"tag": "p", "text": "The Executor informed the pair of the Final Redoubt, the new Deep Core location of the New Republic's government. Anor's most reliable spies had confirmed that the location was accurate, and he speculated that after the warmaster had crushed the Final Redoubt along with the government body there, the Corellian system would be easy pickings. In addition, Anor told Lah and Jamaane that both of the Solo twins were stationed at the Final Redoubt, and triumphantly suggested that Lah could sacrifice Omas, the Solo twins, and many other important New Republic figures after only one battle. Trusting his report so much, Anor offered his life in payment if he was wrong. Jamaane promised that Anor would be killed if he failed, but accepted the plan to take battle to the New Republic."}, {"tag": "p", "text": "Using Anor's information, Lah planned and launched an assault on the Deep Core Treskov system, the location of the Final Redoubt. There, the warmaster engaged the New Republic forces with the might of the Yuuzhan Vong fleet. While the battle was occurring, Anor kept in contact with an executor who was among the Yuuzhan Vong fleet in the Treskov system via a villip, while he himself stayed in the Damutek of the Intendants at the side of Skell. Anor reported to Skell that though the enemy was maneuvering well near the gas giant Ebaq, Lah's numbers would soon crush them. However, Skell was worried, as the New Republic had surprised Lah in the Treskov system with its movements. As the battle progressed, Skell's worries proved true. Multiple New Republic attack groups arrived in the system, and combined with their excellent maneuvers, they quickly began to destroy numerous Yuuzhan Vong vessels."}, {"tag": "p", "text": "Skell concluded that Anor had betrayed them, as the Treskov system was clearly the site of a trap that the New Republic had laid to attack the Yuuzhan Vong, and ordered that the Executor give his life for his failure. However, Anor did not wish to have his life ended, and calmly threw a glob of blorash jelly from his pocket to secure Skell's feet, before hitting the High Prefect on the head with his amphistaff, killing Skell. Although Anor had not betrayed Lah and Jamaane, he knew he was still at fault: his spies had been fed false information that had let Anor to conclude that the Final Redoubt, the location of the trap, was where the New Republic had moved its leadership. Knowing that he would be killed for his part in the disaster in the Treskov system, and seeing no purpose in explaining that he had been played by the enemy, Anor chose to flee and used an ooglith masquer to disguise himself as a part of a lower caste."}, {"tag": "h3", "text": "The Prophet"}, {"tag": "h4", "text": "Living with the Shamed Ones"}, {"tag": "h5", "text": "Finding a refuge"}, {"tag": "p", "text": "Fleeing from the wrath of Jamaane and the Yuuzhan Vong elite for his part in the battle that had left Lah dead, Anor learned to hide in the underground tunnels and passageways that made up the deeper levels of Yuuzhan'tar, surviving by eating granite slugs. The former Executor remained hidden for months there, remaining alive as he was never caught. Before long, Anor's masquer that concealed his identity began to decay and die, leaving him with a cracked disguise. Walking along underneath Yuuzhan'tar, Anor came across a derelict droid, and took out his anger on it by smashing it to the ground, though he bloodied his hands in the process. Almost immediately afterwards, Anor heard the voice of an approaching person, and hid in an alcove after abandoning his failing masquer. Presently, a Shamed One came into sight, carrying a lamp, assuaging Anor's fears that another search party had come after him. When the Shamed One came close to the disgraced spy's hiding place, Anor quickly stepped out, demanding to know what the Shamed One was doing deep underground. The Shamed One, Vuurok I'pan, lied to Anor that he had merely gotten lost, but Anor called him out on the lie."}, {"tag": "p", "text": "Briefly beating the Shamed One, Anor deduced that I'pan was a runaway, and that there were more like him. Explaining to the Shamed One that I'pan was of use to him, Anor ordered him to take him to meet the other runaways. Anor followed I'pan back the way that the Shamed One had come, though as the pair continued their journey, I'pan began to get bolder towards Anor, repeatedly glancing back at the former Executor. Anor demanded to know why, and after seizing the Shamed One by the collar, got the answer: I'pan wished to know if Anor was a Shamed One like he. This enraged the former spy, and Anor beat I'pan heavily in a fit of rage, throwing the Shamed One repeatedly around, while I'pan tried to protect himself by curling up. When Anor finally came out of his fit, he eventually pulled the beaten Shamed One to his feet, and advised I'pan to not ask him that again. The pair then continued their journey, with the Shamed One not looking back at Anor again."}, {"tag": "p", "text": "Traveling deep underground, the pair eventually came to their destination: a huge cavern that housed multiple renegade Shamed Ones. In a shaft to the side, the Shames Ones had a chuk'a waste processor that they had found abandoned working to make more habitable areas for the Shamed Ones. When Anor demanded to know where the other Shamed Ones were, I'pan summoned them with a bell, and fifteen of them emerged from the shadows and from the digging shaft; two of those were members of the warrior caste. One of those warriors, Niiriit Esh, confronted Anor, as she recognized him as an Executor. Niiriit deduced that Anor had failed for the last time, though Anor insisted that his fortune would soon rise again, and promised the group that he would aid the Shamed Ones when he regained power."}, {"tag": "p", "text": "Both Niiriit and the other warrior Kunra did not trust the disgraced Executor, but Anor was able to convince them they he would not betray them, as betraying them meant betraying himself to his searchers. Though Anor tried to display his trust by reopening the wound on his fingers to display his devotion to the gods, Niiriit informed him that the Shamed Ones worshiped the Jedi, not the gods, and an intrigued Anor stayed with the Shamed Ones to learn more. During his time with them, Niiriit proved to be the one Anor enjoyed spending company with the most, as she had the only mind keen enough to interest him. A couple of weeks later, I'pan—who acted as the story teller of the group—told the tale of the Shamed warrior Vua Rapuung by the fireside. In the story, Rapuung was betrayed by his lover, the Shaper Mezhan Kwaad, who caused his implants to not take, thus Shaming him. Because of this, Rapuung set out for revenge on Yavin 4 with the help of Jedi Anakin Solo, who taught him the ways of the Jeedai heresy. In the end, Rapuung got Kwaad to admit in front of witnesses that she had Shamed him, and not the gods, but he was killed by Kwaad shortly after, though Kwaad herself perished to Solo and his allies. Additionally, some warriors inspired by Rapuung's alliance with the Jedi fought off those still worshiping the old beliefs in order for Solo and his allies to escape."}, {"tag": "p", "text": "As Anor had studied the Yavin 4 heresy incident in detail, which was where the Jeedai heresy had originated, Anor noticed differences in the story from what he knew as fact, but the tone and message of the story resonated even with the disgraced Executor. Though Anor voiced his appreciation of the tale, Kunra still felt that the new addition to their group should not have been told the story. After Kunra declared that Anor would betray them, the former Executor faced off with the warrior, and only Niiriit forbidding it prevented Kunra from challenging the other to a fight, just like Anor had hoped. Shortly after the incident, Anor decided that he would indeed betray the Shames Ones, by giving Shimrra everything there was to know about the Jeedai heresy, and thus regain the Supreme Overlord's trust."}, {"tag": "h5", "text": "Investigating stories"}, {"tag": "p", "text": "During Anor's stay with the Shamed Ones, Niiriit talked with the former agent numerous times about the teachings of the Jedi. In the time after Anor was told the story of Rapuung, he set about gaining the trust of the group of Shamed Ones by acquiring resources that they could not get themselves. Anor did this by accompanying I'pan on missions to the levels near the surface of Coruscant, where he used his knowledge of certain codes and how resources were managed by the Yuuzhan Vong to find and take them. Soon, the former Executor supplied the group with lambents, arksh, and h'merrig, which eased living in the lower levels for the Shamed Ones; despite this, Kunra still distrusted Anor and his motives. Anor later accompanied I'pan on a mission to the upper levels so that the former Executor could learn other versions of the Rapuung story, as I'pan's tale was one of many variants. The pair's journey ended in a sub-basement, where they were forced to sit and wait for I'pan's contacts, who were going to help inform Anor of the different story variants."}, {"tag": "p", "text": "Three members of the Shamed Ones eventually entered, and were introduced to Anor as Aarn, T'less, and Shoon-mi Esh; the three Shamed Ones were not actually part of a rogue group like Anor's one, but laborers operating undercover. Using a false name of Amorrn to protect himself during their meeting, Anor was forced to lie to Shoon-mi that Niiriit had told Anor about him, as the former agent knew that Shoon-mi wanted acknowledgement from his crèche-mate Niiriit. However, before Shoon-mi could tell Anor of the other version of the story, Shoon-mi had T'less leave them, as she was nervous about meeting with a rogue group. It was then that Anor first learned that things were chaotic on the surface, with rebellion being discussed by the lower ranking Yuuzhan Vong; this shocked Anor, as he had not been aware of such a mood in the lower class ever before."}, {"tag": "p", "text": "Shoon-mi briefly told Anor of his version of the story, which sounded similar to the course of events that Anor had heard of when he investigated the incident, as there was notably no battle between warriors of different beliefs fighting each other. Although learning that Aarn had heard the story from a worker who had toiled on the world Garqi, Anor was not able to discover anything about the origin of the story from the two Shamed Ones. During the meeting, Anor decided that he could not allow this heresy to topple the Yuuzhan Vong ways and religion. Before he and I'pan departed, Anor had Shoon-mi agree to look out for different versions of the Rapuung tale on his journeys."}, {"tag": "p", "text": "On their way home, I'pan brought with them a sack of old clothes and food that Shoon-mi had given for Niiriit. After Anor inquired as to why Niiriit did not speak of Shoon-mi, I'pan enlightened the disgraced Executor that the warrior considered Shoon-mi a traitor of the truth as he did not completely embrace the Jeedai heresy; despite this, she still regularly took the supplies that Shoon-mi sent to her to make her life better. During his time with the Shamed Ones, the disgraced Executor carved himself a coufee out of a discarded coral flask. Sometime after meeting Shoon-mi, Anor was visited one night by Niiriit. However, due to his habit of sleeping light with a coufee within reach, Anor leapt up and almost slashed out the warrior's throat with his knife before he recognized who had awoken him. Niiriit, who had merely intended to sleep with Anor, left hurriedly, leaving Anor mildly embarrassed."}, {"tag": "h5", "text": "Hunted"}, {"tag": "p", "text": "A week after the incident with Niiriit, Anor woke to the sound of screaming Shamed Ones as they died. Quickly deducing that his comrades were being killed by warriors sent to wipe the camp out and Anor with it, the former Executor gathered all of his belongings and left his sleeping hollow. On the way out, he was passed by a running figure, who he assumed was I'pan, and momentarily followed him after deciding that dying to the kill squad would not benefit anyone. However, while heading down the shaft to where the chuk'a hibernated, he heard Niiriit's death cry, which caused Anor to briefly hesitate before continuing his flight. Anor continued down the shaft until he was near to where the biot blocked any access to the shaft further down, and hearing breathing, the former Executor located who he thought was I'pan."}, {"tag": "p", "text": "However, it was not I'pan but Kunra who turned to face him when Anor called out to the Shamed One. Kunra, who was still mistrustful of Anor, had been trying to awaken the chuk'a at his feet so that the creature, which was anchored to the sides of the shaft, would let go out of reflex and allow them to travel further down the shaft and escape the pursuing warriors. Anor took over the task of stimulating the chuk'a by stabbing at it with his coufee, and while he did this, he questioned Kunra if he had brought the warriors down upon them. Though Kunra denied that vehemently, the ex-warrior revealed that he had run away from the fight as a coward, which was the reason that he was Shamed in the first place. Anor, with his coufee buried in the flesh of the chuk'a, continued to cut flesh with his weapon until he pulled the blade out, afraid that he would lose his only weapon in the gore hole he had created. However, seconds later, the chuk'a withdrew the claws that anchored it to the wall of the shaft due to the pain, and it fell, sending Kunra and Anor tumbling down with it."}, {"tag": "p", "text": "As the shaft was slightly sloped, the decent of the chuk'a was slowed due to the friction between it and the wall. The chuk'a also began to tumble, sending Anor and Kunra bouncing up and down on top of the descending biot; to protect himself, Anor rolled himself into a ball so as to keep his head and stomach safe from the numerous impacts his body was receiving. Finally, the chuk'a and the pair hit the bottom of the shaft, with the crustacean's body absorbing most of the impact for Anor and Kunra. In serious pain, Anor managed to get to his feet after the fall, and used a light-giving lambent to discover that they had landed in a bowl shaped depression at the bottom of the shaft. There, Anor found Kunra with a piece of the now-dead chuk'a shell through his leg. Ignoring Kunra's pleas for help, Anor criticized Kunra's cowardice as the former warrior continued to beg. However, as soon as Kunra lapsed into unconsciousness from blood loss, Anor set to work mending the impaled leg, using medical supplies that he had stolen while on missions with I'pan. Anor explored his surroundings until Kunra awoke, and when he did, the former Executor held the coufee to Kunra's throat. Making clear to Kunra that he would not hesitate to kill the Shamed One even though Anor had just saved him, the disgraced Executor made Kunra choose between dying to the coufee or serving Anor."}, {"tag": "p", "text": "The ex-warrior chose the latter, and Anor commanded that Kunra to never question his orders, and to never use the name Nom Anor to address him; the second command was to prevent the reputation of Anor from bringing other warriors hunting for the disgraced Executor. As Anor had business that needed to be taken care of, Anor and Kunra then traveled up towards the surface of Yuuzhan'tar until they reached the vicinity of where Shoon-mi worked, and Kunra set up a meeting with Shoon-mi. When the Shamed One passed by on the way to the meeting, Anor grabbed Shoon-mi and dragged him into a sub-basement with a coufee to Shoon-mi's throat. Without letting Shoon-mi get a look at him by holding the coufee to Shoon-mi's throat from behind, Anor demanded to know if the Shamed One had sold Niiriit and the others out. Anor learned from the whimpering Shoon-mi that the warriors had actually been after the thieves who had been stealing supplies, and had hit at least two other camps as well. This information served to enlighten Anor that he nor the heresy practitioners had not been the target of the attack, though he did realize that his stealing of supplies with I'pan had led the warriors to the Shamed Ones."}, {"tag": "p", "text": "Knowing that the message of the Jedi heresy was safe, Anor broached the idea that the heresy should be spread farther and quicker, to avoid just preaching to those who already followed. Once Anor clarified that they would only preach to the Shamed Ones in the beginning to gain a momentum, Shoon-mi agreed to join him in spreading the word, and Kunra agreed as well. Deciding that he would need a new name other than Amorrn to preach the word, Anor chose to take the title of Yu'Shaa, the Prophet, and he demanded that Shoon-mi not use Amorrn any longer."}, {"tag": "h4", "text": "Leader of the lowly"}, {"tag": "h5", "text": "Spreading the word"}, {"tag": "p", "text": "With the help of Kunra and Shoon-mi, Anor started to spread the word of the Jeedai heresy to the masses via ceremonies. These ceremonies, which took place in a cellar deep beneath the surface of Yuuzhan'tar, were planned extensively by Anor with the aid of Kunra and Shoon-mi, with every detail part of the script that Anor followed. Warders who stood outside the ceremony hall instructed those who entered on how and when to speak in the ceremony. For the events, Anor himself wore a mask that barely resembled a face due to the scarring, and beneath it, the Prophet had on an ooglith masquer that made him appear like one of the Shamed Ones; this allowed Anor hide his true face and his identity when he took off the mask as part of the ceremony. As Anor continued preaching to the Shamed Ones in his ceremonies, he learned to use gestures and animation in his speaking, as the monotone that he first utilized could not keep the attention of his listeners. By using I'pan's story telling techniques, Anor was able to enthrall those how came to listen to him."}, {"tag": "p", "text": "From his throne—a chair covered with different varieties of moss—Anor taught in his sermons that the Jedi were the ones sent by the gods to bring down Jamaane to allow the Yuuzhan Vong to live in a galaxy at peace. In his Message, he also taught that though Shamed Ones individually were weak, many Shamed Ones together could accomplish great things. During the meetings, Anor always shared the tale of Rapuung—a cleaned-up version that portrayed the right message for the Shamed Ones listening—with the ending identical to the one that I'pan had shared with Anor when he first heard the story. Typically after telling the story of Rapuung, Anor would allow the attendees to ask questions of him, and these usually related to the nature of the Jedi, and the Force itself."}, {"tag": "p", "text": "When asked during one of his ceremonies whether war was wrong, Anor replied that it was fine to fight for something that was theirs by right, such as the galaxy that Yuuzhan'tar was in, but it was fundamentally wrong to fight against the Jedi. Anor's meetings ended with the Prophet commanding that the attendees spread the word of the heresy discreetly, before opening his arms, signaling the end of the meeting as the doors of the cellar opened due to his signal. Following the end of the meeting where Anor was asked about war, the Prophet, alone with Kunra and Shoon-mi, voiced his concerns that though they had many who came to the meetings, not many were truly dedicated Yuuzhan Vong. He also ordered Shoon-mi to bring the Select, a group of seventeen devotees that had been individually picked for their attributes, to Anor so he could train them."}, {"tag": "p", "text": "When Shoon-mi left them, Kunra showed Anor a female Yuuzhan Vong whom the former-warrior had detained after he found that she had been carrying a villip to allow someone on the other end to see the Prophet in action during one of the ceremonies. Due to concerns that they could be exposed, Anor ordered Kunra to extract the information of who the villip communicated to from the female, before killing her. Because of this turn of events, Anor and the others were forced to relocate the place where they held their ceremonies, and they found a new set of headquarters. Due to Anor's worries that he would be exposed and caught by Yuuzhan Vong loyal to Jamaane, the former-Executor began to have dreams of warriors chasing and hunting for him. In his role as the Prophet Yu'shaa, Anor continued to spread the word, though he himself soon began to miss the amounts of information that his spy network once provided him with. Because of this, Anor focused on getting a villip into the Supreme Overlord's Chambers so that Anor could glean information that way."}, {"tag": "p", "text": "Anor, with the aid of Kunra and Shoon-mi, sent numerous devotees to attempt to sneak a villip into the chambers of Jamaane; they all had a tooth filled with irksh poison lest they get caught. However, none of these made it far towards their goal, and all failed to return. Anor and the others had one such spy, At'raoth, prepare her excuse for getting into the chamber many times before she left on her mission, carrying with her a k'snell vase that contained a villip. However, as Anor and his two aids watched via the villip, At'raoth was stopped by a guard just before she could enter the chambers, and her excuse failed to give her passage into it. Prior to being slain by the guard, At'raoth killed the villip, shouting her allegiance to the Jedi. Anor was particularly angry at this turn of events, as in addition to being so close to succeeding, At'raoth had inadvertently alerted Jamaane that the Jeedai heresy was something to worry about. Refusing to wait for the opportunity to place an informant in Jamaane's court, Anor ordered Kunra and Shoon-mi to find another willing to spy for them, even though he knew that more dead spies meant less volunteers for the role."}, {"tag": "h5", "text": "A way into Jamaane's court"}, {"tag": "p", "text": "After losing At'raoth as a spy, Anor continued to host meetings, and an increasing number of non-Shamed One Yuuzhan Vong began to attend. Additionally, Anor identified six acolytes who had minds keen enough to grasp some of the problems that the heresy faced, and Shoon-mi and Kunra trained them as disciples before sending them out to spread the word further afield. At one of Anor's meetings, after he had delivered the bulk of his message, one of the acolytes continued to ask questions that left the former Executor hard pressed to answer. Raising questions about the feasibility of only spreading the message among the lower ranks of the Yuuzhan Vong, the acolyte, whom Anor could tell was not a Shamed One because of her stance, managed to transfix the audience, as well as Anor."}, {"tag": "p", "text": "Anor realized that the acolyte could identify the obstacles that spreading the heresy faced, and that she had also been unable to come up with remedies to those problems, just like Anor had. When the acolyte advised Anor in front of the entire audience that he should weaken Jamaane's hold on power from within his court, the Prophet demanded to know who the acolyte was. With the acolyte refusing to give a name, Anor had her come closer, so they could talk in private. Anor's questioned whether he could trust her, and this led her to reveal that she knew his true name. Aghast by this, Anor grew alarmed that she was a spy sent to kill him, or that should would reveal to all his real name. When the acolyte tried give him something even though he had pushed himself away from her, Anor instinctively activated his plaeryin bol, which burst and shot multiple poison darts into the face of the acolyte."}, {"tag": "p", "text": "As Kunra and Shoon-mi worked to quiet the audience of penitents, Anor approached the dying acolyte, and removed the ooglith masquer that disguised her. With the mask off, Anor was shocked to recognize the acolyte as Ngaaluh, a priestess of the deception sect. Furthermore, Anor discovered that the item she had been trying to give him had not been meant to kill him, but was instead an offer of her devotion to him: a living unrik from Ngaaluh's own body. Seeing that Ngaaluh was no assassin, and that she could be the informant that he needed, the former Executor administered the antidote to the poison to the priestess by activating a needle that slid out from under the claw of his right thumb."}, {"tag": "p", "text": "Getting Shoon-mi to give Ngaaluh their best care, Anor explained in private to Kunra who the acolyte was, and the ex-warrior understood why Anor had activated his plaeryin bol. Though Kunra was willing to kill the entire audience to prevent the news of the strange incident from spreading, Anor instead explained to the audience that he had survived an attempt on his life, and the audience left to go spread the word of the heresy after Kunra had made sure that none of them had heard anything that would expose Anor. When Ngaaluh was alone with Anor after the antidote had given some of her strength back, the priestess expressed her indebtedness to the Prophet. With Ngaaluh willing to risk her life for him as Anor had saved her, the former spy finally had the informant that he had long desired. While she was recovering, Anor learned from the priestess that she had begun to doubt the existence of the gods after encountering Vergere, and had tracked the message of Yu'shaa to its source."}, {"tag": "p", "text": "Anor began to use Ngaaluh as an informant, with the priestess wearing a villip beacon disguised in her robes that allowed Anor to see the events that transpired in Jamaane's court. During a meeting Ngaaluh attended in the court after she persuaded Harrar to let her come, Anor was able to learn that the Yuuzhan Vong had been driven away during an assault on the Imperial Remnant mainly due to the intervention of a Jedi party led by the Skywalkers. Additionally, Anor discovered that the Yuuzhan Vong had not progressed in their invasion after they had seized what was Coruscant, and that resistance was increasing. Anor's destabilizing program, which was still running, was also having problems, as some remnants of the New Republic had helped settle disputes that would have distracted certain areas. Ironically, Anor was also able to listen in on Ngaaluh's report of the status of the heresy, which she delivered directly to Jamaane himself."}, {"tag": "h5", "text": "A thorn in Jamaane's side"}, {"tag": "p", "text": "With Ngaaluh on their side, the heresy began to grow, and with it Anor's influence. Shoon-mi managed the spreading of the heresy, while Kunra's team of \"special police\" made sure that the message was not traceable, killing members of the heresy who were a danger to it; these killings made it appear as if the Yuuzhan Vong authorities were hunting down the Shamed Ones practicing the heresy. As Ngaaluh was leading the investigation into the heresy, Anor supplied the priestess with members of the heresy that he worried would betray him, such as Eckla Shoolb, and Ngaaluh brought them before Jamaane and his court to be executed. Meanwhile, Anor had to constantly change the position of the heresy headquarters, lest they get caught by Yuuzhan Vong other than Ngaaluh, leading Anor to switch his base six times in six weeks. Though the sacrifice of Shoolb made Shoon-mi question Anor's use of martyrdom to further his cause, the Prophet still had Kunra prepare a candidate for the next time Ngaaluh needed to reveal a heretic. Despite the success of the heresy, Anor began to feel as if Jamaane was more angry at the existence of the heresy than afraid by it, and this dampened the Prophet's sense of success."}, {"tag": "p", "text": "As there was no way for Anor to be in multiple places at once, the ex-Executor oversaw the training of subordinate Prophets with the help of Kunra and Shoon-mi. These minions were left behind as Anor and his entourage moved from audience chamber to audience chamber, to allow the word to spread faster. In order to implicate more Yuuzhan Vong officials in the spread of the heresy to cause more confusion, Anor oversaw the selection of five would-be heretics that were too unstable or unreliable for the Prophet's purposes. He then fed them lies related to those officials, as well as a modified version of the heresy, before sending the five out to spread the word, where they were caught in due course by those working with Ngaaluh to root out the heresy. Shortly afterwards, Anor and Kunra, both disguised as workers handling baggage vrrips, secretly accompanied Ngaaluh as part of her entourage as they made their way to the command enclave of the Vishtu Sector. When the entourage, which brought with it the five captured heretics, came to a stop outside the enclave, Anor was backhanded across the face by a guard for trying to listen to a nearby argument."}, {"tag": "p", "text": "Although infuriated by the guard's actions, Anor managed to remain in the guise of a subservient worker, and the entourage passed without further incident into the enclave, though Anor did once again vow to enact revenge on all of those who had punished him over the years. After Ngaaluh had settled into her quarters in the enclave, Anor, Shoon-mi, and Kunra slipped away from the priestess's entourage as three loyal Shamed Ones took their places. Descending deep beneath the enclave, Anor and the others came to the new audience chambers that were to be used for the heresy. Retiring to his private chamber alone, Anor was soon met by Ngaaluh, who had sneaked away from the enclave above. The priestess filled him in on Jakan's increasingly radical ideas on destroying the heresy, and the pair discussed their plot to destroy Prefect Ash'ett, who was unbeknownst to Ngaaluh a former rival of Anor's that the Prophet wanted to enact revenge upon. In addition, Ngaaluh informed Anor of rumors circling in Jamaane's court that had to do with the mystical planet of Zonama Sekot being in the Unknown Regions. Although he was at first skeptical, Anor was convinced enough that he had Ngaaluh keep her ears upon for more developments related to the rumor before she left him."}, {"tag": "p", "text": "After Ngaaluh had put together her evidence against Ash'ett, Anor was able to watch from the vantage point of the priestess' villip as Jamaane punished Ash'ett and his family. Although Ngaaluh could not specifically link the five prisoners she brought to Ash'ett, Jamaane condemned Ash'ett anyway for allowing the heresy to spread, and the Supreme Overlord ordered that all of Ash'ett's immediate family be thrown into the yargh'un pits. Anor, far away from the events that were transpiring in Jamaane's court, was delighted with not only Ash'ett's punishment, but with how Jamaane was willing to make examples of his subjects if there was any suspicion against them. Jamaane's court then went on discuss the disasters created by the malfunctioning world brain, and the terrorist attacks committed by Anor's heresy, which were sabotaging the Yuuzhan Vong war effort. Both of these things served to make Anor feel that his power was spreading daily."}, {"tag": "h5", "text": "Betrayal, and setbacks"}, {"tag": "p", "text": "One night, Anor awoke to find his private quarters darker than he had left it when he went to sleep. Realizing that someone was in the room, Anor tried to find a target in the dimness of the room for his plaeryin bol. However, before he could, a voice ordered the attack, and multiple hands seized Anor from out of the darkness. Initially fighting back, Anor let himself go limp as if in defeat, which allowed him to get the right angle of attack for his plaeryin bol. Anor fired the weapon, taking out one of his assailants, though the others quickly held him down, and one of the assailants pressed something against the Prophet's plaeryin bol, preventing it from firing again. Relaxing as he was genuinely defeated by the press of bodies that was holding him down, Anor was surprised to see Shoon-mi as the leader of the group when Anor's aide lit a lambent crystal."}, {"tag": "p", "text": "As Shoon-mi held a coufee against Anor's throat, the Prophet calmly warned his aide that he would not get away with killing the leader of the heretics, and that the Jeedai heresy would collapse without a leader. However, Anor soon realized out loud that Shoon-mi planned to become the Prophet by wearing Anor's masquer, and by mutilating Anor's body so that it resembled Shoon-mi. With that done, Shoon-mi could pretend that he was the Prophet, who had survived an attempt on his life by his aide, with no one to know the real truth. As Anor played for time by continuing to talk, he asked for the reason why Shoon-mi wanted to kill him, and found out that the aide despised how Anor threw away lives in an un-Jedi like manner. Realizing that Shoon-mi was hesitant about actually killing him, the Prophet demanded that his aide go through with the act, rattling Shoon-mi."}, {"tag": "p", "text": "In a further bid for time, Anor revealed to Shoon-mi that he disbelieved that Jamaane would ever bow down to the wishes of the heretics, and that the heresy would never succeed in its goals. It was then that Kunra stabbed Shoon-mi in the back, before the ex-warrior slew the rest Shoon-mi's lackeys with aid from Anor. Although Anor was grateful that Kunra's timing was great, the other informed the Prophet that although he had been initially overcome by minions while guarding Anor's door, upon defeating them he had waited and listened to Anor's conversation with Shoon-mi before acting; this, however did not bother Anor much, as Kunra had remained loyal to him and had not allowed Shoon-mi to usurp the role of the Prophet. Before they dealt with a wounded Shoon-mi, Kunra questioned Anor if he had been truthful about Jamaane never being defeated by the likes of the heresy, though Anor was able to brush the query aside to keep secret his doubts about the heresy. Then, rolling Shoon-mi over onto his back, Anor strangled his betrayer to death, before having Kunra dispose of the bodies to hide any potential weakness in the symbol of the Prophet if word of the attempt got out."}, {"tag": "p", "text": "The day after, Anor had Ngaaluh meet him and Kunra inside his heavily guarded private quarters to discuss Shoon-mi's betrayal. The priestess was utterly shocked at the aide's treachery, showing Anor how dedicated Ngaaluh was to the heresy and the Jedi ideals. Kunra noted that some within the heresy were discontent with the speed of the order's progress, and some, such as subordinate Prophets V'tel and Idrish could be seen as rivals who could potentially betray Anor for power. As Jamaane was not behind the attack because warriors would have come for Anor instead of his aide, the Prophet forbade any attacks against Jamaane after the other two suggested it; Anor did this because he was worried that the Yuuzhan Vong would lose the war without the Supreme Overlord to lead them."}, {"tag": "p", "text": "During the brief meetings, Ngaaluh provided evidence to Anor that Zonama Sekot had indeed been discovered, and that the ruling class was trying to cover it up. However, Anor was once again skeptical, and ordered Ngaaluh to keep looking into it, to provide a definite answer to the question of Zonama Sekot's existence. After Ngaaluh left, Kunra assured Anor that the priestess was not ambitious enough to claim Anor's title as Prophet for her own, easing a bit of Anor's suspicions. Before Kunra departed, Anor named Chreev Shoon-mi's successor as chief acolyte. Despite the attack on his life, Anor continued to give sermons to the followers of the heresy immediately after the event."}, {"tag": "p", "text": "Two days later, Anor once again watched from Ngaaluh's concealed villip as the priestess presented the evidence before Shimrra and his court that would condemn a third of Anor's old rivals: Prefect Zareb. By using evidence provided from planted heretics, Ngaaluh once again concluded that Jamaane had been betrayed by a trusted individual. Jamaane was furious, and questioned many of his highest advisers as to how the heresy could have infected his court. However, when guards came into the court, they did not head for High Prefect Drathul—whom Anor believed might be executed—but Ngaaluh herself; Jamaane had found the evidence too watertight against the three intendants, and had re-interrogated the placed heretics before they were killed, which revealed Ngaaluh as the actual traitor. Anor watched as the priestess took poison to prevent Jamaane from extracting information from her, and as her body was thrown into the yargh'un pit. Ignoring Kunra's attempts to draw him into a conversation regarding the sudden turn of events, Anor watched the view of the heap of bodies from Ngaaluh's villip for a long while."}, {"tag": "h3", "text": "Zonama Sekot"}, {"tag": "h4", "text": "Journeying to the living world"}, {"tag": "p", "text": "As some of the heretics were wavering in their resolve after Ngaaluh's demise, Anor sought to invigorate them. Because the Prophet had learned from his old sources that the Jedi were interested in Zonama Sekot, and as Jamaane was clearly afraid of the planet, Anor preached to his followers from his throne that he had had a vision of a living world that could redeem the Shamed Ones and bring them harmony with the Jedi. He also informed his followers that Jamaane was afraid of the planet. This message brought hope to Anor's army of zealots, empowering Anor in the process. Due to Anor's message, some of his followers took it upon themselves to locate the prophesied planet for their Prophet, with some finding their way to the planet of Dagobah, an important Jedi location."}, {"tag": "p", "text": "Sometime after Anor delivered his message about the living world, the Shamed One Loiin Sool came to Anor as a messenger from the shaper Nen Yim. Anor spoke to Sool personally, as the Shamed One was wearing a blindfold and had been searched for implants, and the Prophet learned from Sool in front of more than thirty of his followers that Yim was hoping that the Prophet could help her get to Zonama Sekot. Aiding Yim there would involve breaking her out of Jamaane's grasp, a risky venture even if it was not a trap set up for the heretics. Kunra, who was with Anor, pushed for them to aid Yim, and volunteered himself to lead the attack that would liberate the shaper. Then, after first silencing Kunra's enthusiastic support for the plan, Anor surprised his audience by proclaiming that though the prophecy was nearing completion, Anor would need to step foot onto Zonama Sekot with a Jedi. Because of this, he told his followers that he himself would free Yim with the help of the Jedi, just like Rapuung fought with Anakin Solo, to the cheers of his audience."}, {"tag": "p", "text": "In order to obtain the aid of the Jedi, Anor sent a qahsa organism to the Jedi Knights via courier. The qahsa contained a message that begged the Jedi to come to Yuuzhan'tar, and to take only Anor to Zonama Sekot. It also contained limited information about the Yuuzhan Vong defenses around the world. The Jedi Knights agreed to the request of the Prophet, and a rendezvous time was set up on Yuuzhan'tar for the Jedi going on the mission and Anor. With the rendezvous location in a garbage pit, Anor and Kunra proceeded to the spot, with Kunra getting to the rendezvous first to make sure that it was safe for Anor. The Prophet followed close behind, and came upon the ex-warrior and the two Jedi who had been sent on the mission: Veila, and Master Horn, who both featured in the heresy's beliefs, with the former known as the One-who-was-shaped, and the latter as The-Slayer-of-Shedao-Shai."}, {"tag": "p", "text": "In his guise as the Prophet, Anor learned that the Jedi's ship had been destroyed, though they had not been discovered by the Yuuzhan Vong authorities when they came to Yuuzhan'tar. It was then that Anor informed the pair that the party had another member, the shaper Yim, and that she possessed a ship from Zonama Sekot that could be used as their vessel. Horn did not appreciate the change of plan, especially after Veila pointed out that Anor was wearing a masquer, although Anor was able to provide an excuse that he permanently wore the masquer for his people the Shamed Ones. After privately conferring about the change in their mission, the pair of Jedi agreed to take part in the liberation of Yim."}, {"tag": "p", "text": "Yu'shaa outlined his plan to the pair of Jedi: they would get close to Jamaane's palace, and after some of Anor's followers created a distraction, the Jedi would infiltrate the damutek that Yim was in, and get the ship and the shaper out of it. However, Horn did not like how the plan risked the lives of so many Shamed Ones if something went wrong, so he advocated for some of the Shamed Ones to dress up in brown robes and wield long glowing plants that were found underground to appear like Jedi. These Shamed Ones, the Jedi hoped, would serve to distract the warriors. Anor and the two Jedi used secret tunnels to get themselves close to the shaper damutek, and once there, Anor took leave of the two Jedi after pointing them in the direction of the damutek; Anor planned to wait for the Jedi to seize the ship and pick him up at a shrine to the god Yun-Harla nearby."}, {"tag": "p", "text": "The pair of Jedi succeeded in their mission with the help of the heretics, and the Prophet, along with Harrar the priest, was picked up at the shrine by the vessel of Zonama Sekot origin. Aboard the vessel, Anor, playing his role as the Prophet, exclaimed in shock when he found out that the One-who-was-shaped had been wounded. Despite Horn's great displeasure when Harrar joined the group, they were forced to depart the shrine rendezvous in the ship as Yuuzhan Vong fighters were pursuing the escaping ship. With Horn going to check on Yim, who was piloting, the Jedi ordered Anor to watch over the wounded Veila. This did not stop Anor from moving to the fore of the ship and watching over Horn's shoulder after the Jedi relieved command of the ship from Yim to fly the Sekotan ship through a gauntlet of enemy fighters before escaping by outwitting them; Anor commended the Jedi on his escape tactics afterwards."}, {"tag": "p", "text": "With the group safe for the moment, and Veila in an improved condition thanks to Yim, Anor and the others gathered together for the first time since the start of their escape, and it was then that Horn informed the Yuuzhan Vong present that they were not going to Zonama Sekot after all. This caused considerable reaction from the three, with Anor and the others pointing out that they were risking much to journey to the living planet. Horn, however, citing the addition of two Yuuzhan Vong to the party as a main reason, declared that they were instead heading to Mon Calamari to get a decision from the Jedi Council to see if the voyage should continue. After four days of traveling, Anor was locked up in his cabin aboard the Sekotan ship, presumably praying, when the vessel was yanked from hyperspace by an Imperial interdictor."}, {"tag": "p", "text": "Although the Sekotan ship managed to escape again to hyperspace after Yim used a prototype shaping device to nullify the affects of the interdiction field, the craft was badly damaged by the incident. Additionally, during the escape Horn revealed that they were indeed going to Zonama Sekot, and not Mon Calamari. Anor joined the main group after the incident, and he deduced that the Jedi had tricked them so that they could see if the Yuuzhan Vong tried to force the location of Zonama Sekot, which would have shown that their true allegiance was with Jamaane. Over the next few days on the group's journey to the living planet, they had to progress in small hyperspace jumps, but as Anor and the others neared their destination, the dovin basals of the craft began to die. The Sekotan craft managed to limp into the Klasse Ephemora system, where Zonama Sekot was orbiting the gas giant Mobus. After narrowly avoiding being drawn into the gravity well of Mobus, Horn managed to steer the craft on an intercept course for the living planet; Anor, upon seeing the world, lied to the others that he could feel that it was the planet of prophecy."}, {"tag": "p", "text": "With the crippled ship on a landing vector it had chosen, the group managed to make it in one piece to the surface of Zonama Sekot with the help of Horn's piloting skills, and the aid of the Force to cushion their final landing; the living ship, however, did not survive the journey, dying once it had reached the ground. When the group exited the dead ship, Anor and the two other Yuuzhan Vong felt a palpable sense of belonging on Zonama Sekot, and this surprised the ex-Executor, as he had not known for certain until then if Zonama Sekot was indeed the living planet that was linked to the Yuuzhan Vong race."}, {"tag": "h4", "text": "Allied with Shimrra once more"}, {"tag": "h5", "text": "Sabotage"}, {"tag": "p", "text": "When Yim went back to the ship to get supplies, Anor followed her, and managed to convince her to let him help her with lab work. Shortly after, with Horn and Harrar looking for a suitable shelter for the group, Anor and Veila accompanied Yim on a collecting expedition. Both Anor and Veila sat by idly for hours as Yim examined certain objects and documented notes in a portable qahsa. While waiting for Yim, Anor came to realize that Jamaane had been right to fear the world, as the Yuuzhan Vong were obviously connected to it. Shortly afterwards, Yim discovered a lim tree in her exploring, prompting her to get Anor to explain the nature of his visions. Yim needed to know because the lim tree had originally existed on the original Yuuzhan'tar, and since it had not been planted by a spacefaring race, this indicated that Zonama Sekot was directly related to their homeworld somehow. However, Yim refused to make any assumptions about Zonama Sekot's origin until she had more data. When Anor showed interest in learning about what Yim was doing, the shaper allowed Anor to hold her qahsa and to record what she found; this left him in possession of the vast amount of knowledge contained within."}, {"tag": "p", "text": "After a while working with Yim on her research, which served to speed the process up immensely, Anor was given full access to the qahsa by the shaper after it rejected his use. Later, while Harrar was conversing with Yim, the Prophet was able to explore the contents of the qahsa, while listening with one ear to Yim explaining to Harrar that she believed that Zonama Sekot had a dhuryam of sorts managing the ecosystem. Anor paid little attention to the dialogue until Veila informed the others that, being part Yuuzhan Vong due to the failed shaping, she felt that the Yuuzhan Vong had come from the living world originally. This got Anor's attention, though Yim refused to believe Veila's assertion, as there was bountiful evidence to show that the original Yuuzhan'tar was the homeworld of the Yuuzhan Vong."}, {"tag": "p", "text": "Allowed by Yim to go meditate, Anor realized that Jamaane would be extremely pleased if someone were to destroy the living planet, along with both the Jedi and the rogue Yuuzhan Vong, so much so that the Supreme Overlord might actually elevate Anor in rank instead of executing him if he committed the act. Still in thought, Anor made it to the top of a hill, and was truly shocked to see what he recognized as hyperdrive field guides rising from the surface of the world, large enough to indicate that the planet itself could jump to hyperspace. This discovery prompted him to take off the masquer disguising him as the Prophet, as no one was around, and activate a small dedicated villip that he had brought with him to the living world. Anor contacted a surprised former subordinate Phaa Anor on the villip, and convinced the other to tell Jamaane that Anor was on Zonama Sekot and that he had found Yim by informing Phaa that he would be rewarded for bringing the information; Anor also had his former subordinate take the villip to Jamaane, so that he could contact the Supreme Overlord personally. In reality, the ex-executor believed that Jamaane would most likely have Phaa killed for bringing such information before him, but that did not bother Anor."}, {"tag": "p", "text": "During nighttime, sometime after contacting his subordinate, Anor felt his villip move, indicating an incoming transmission, while the Prophet was staying in the rock shelter the group had found. However, because the others were light sleepers, and Veila was on watch-duty nearby, Anor was forced to ignore the communication lest it give him away. Hours later, after Anor had taken watch-duty from Veila and was certain that she was asleep, he used his villip to contact its twin. At first accosted by Onimi on the other side, the Prophet soon faced Jamaane again. With Jamaane demanding to know why Anor had not given himself up for sacrifice after the debacle at Ebaq 9, Anor lied to the Supreme Overlord that he had been held captive by the Jedi since the event, but had managed to secret away the villip he was using on his own person."}, {"tag": "p", "text": "Convincing Jamaane that he was indeed on Zonama Sekot, Anor informed him of the Jedi on the living world who were trying to persuade Zonama Sekot to side with them against the Yuuzhan Vong. After outlining how his villip could be used as a tracer to locate the living world, Anor also persuaded Jamaane to send one combat ship and a landing vessel to get Anor after the former agent told the Supreme Overlord of how he planned to sabotage the living world, killing it and ending the threat to the Yuuzhan Vong. Jamaane promised to reward him, if Anor managed to pull off his plot. In the days after his talk with Jamaane, Anor stole all of the components that he believed he would need for sabotaging the living world, save for Yim's qahsa which contained protocols that would help him with this task. With Harrar and Horn off on an expedition to the hyperdrive guidelines, Anor went to be alone in solitude, though he soon drifted back towards the camp so that he could overhear a conversation between the two females. Although he did not understand all of it, Anor heard Yim say that she had discovered the secret of Zonama Sekot. When the shaper left the shelter area to dwell on her thoughts, Anor shadowed her, and approached her when she had stopped among some trees."}, {"tag": "p", "text": "Although Yim was eager to tell Anor what she had learned, Anor took off his masquer, revealing himself as a Yuuzhan Vong executor. In response, Yim stabbed at Anor with the whip-sting of her shaper hand, though Anor blocked the lethal weapon with his arm, with the sting drilling through it. After yanking Yim towards him with the whip-sting embedded in his arm, Anor shot Yim with his plaeryin bol, causing the shaper to fall to the ground as her muscles seized up. Explaining to the dying Yim that he did not care what she had discovered, and that he would kill Zonama Sekot soon, Anor beat Yim in the head with a rock multiple times to finish her, as he doubted his poison could kill the gifted shaper. However, although Anor beat Yim until she was motionless, the shaper managed to use the whip-sting to stab Anor in the side during the struggle."}, {"tag": "p", "text": "Finishing his task, Anor took Yim's qahsa, which contained the protocols that would allow him to destroy Zonama Sekot, and departed for the hyperdrive field guides, as Jamaane's vessels were scheduled to arrive within the day; with Yim out of the way, Anor only had to deal with Harrar and the two Jedi. Anor came to the hyperdrive field guides, and seeing where Harrar and Horn had entered the facility with a Jedi lightsaber, paused and watched the hole cut in the side of the facility before making the final approach. With his Prophet masquer back on so that he could continue to fool Harrar and Horn about his identity if he encountered them, the ex-Executor entered the building and located the lifts that led down. Anor went into one of the lifts, but paused briefly when he heard Harrar and Horn exit another lift, though he soon continued his decent, knowing that no one would be at the bottom of the lift to ambush him."}, {"tag": "p", "text": "After a long while, Anor reached the bottom of the lift shaft, and found himself in a room filled with machinery that helped operate the hyperdrive of the living world. Calling all the lifts down and wedging their doors open with crates so no unwanted visitors would arrive, the former Prophet set about looking for an interface that connected the living world to the metal of the hyperdrive, and before long, located the object of his search in the center of the room. It was a pillar covered in tightly woven neural strands that descended into the floor. Anor used Yim's qahsa to install a soldier virus on an incubator of his, and the former Prophet inserted the living organism into the pillar behind the neural strands, so that the incubator was unnoticeable. Anor's sabotage would result in the failure of neural integuments to carry data effectively, leading to a feedback explosion in the core of the hyperdrive, which would prevent the planet from traveling and severely damage it."}, {"tag": "h5", "text": "Escaping Zonama Sekot"}, {"tag": "p", "text": "His task done, Anor took off his masquer, and contacted the warrior Ushk Choka, who had been sent to retrieve Anor from the living world. The ex-Executor convinced Choka, who was in orbit of the living world, to send down the lander he was in even though Zonama Sekot was not neutralized yet. The warrior complied, stating that the lander would come for Anor in seven hours, around the time at which Anor's sabotage would become apparent. Shortly afterwards, Anor heard a sound, and knew that the Jedi had managed to get down to the room without using the lifts. The former Prophet sprinted for the lifts, and got in just before Horn came into sight. Instead of staying to fight Horn when the Jedi challenged him to a duel by using his real name, Anor ascended in the lift, escaping Horn. However, Anor knew that Yim had managed to warn the others, as Horn knew his true identity, and that Veila would most likely be waiting for him when the lift door opened."}, {"tag": "p", "text": "When the door opened at the top of the lift, Anor stepped out with his hands out in surrender and was confronted by Veila and Harrar. Although Veila wanted to kill the unarmed Anor, she could not due to the ideals of the Jedi, and Anor, knowing this, taunted Veila. When Veila was briefly distracted by Harrar, who ordered the Jedi to kill Anor, the former Prophet fired his plaeryin bol at Veila. Though the female Jedi leapt to the side, she hit the guardrail of the lift shaft, and a kick from Anor was enough to send her tumbling down the shaft. Left facing only one opponent, Anor brawled with Harrar before knocking the priest flat with an uppercut to the jaw. Seeing Veila's lightsaber on the ground, the ex-Executor took it and cut the power conduits to the lifts to hinder Horn's pursuit of him before leaving the building on his way to the spot he would be picked up by the lander."}, {"tag": "p", "text": "With the rain pouring amidst a thunderstorm, Anor proceeded up a spine of rock spires that had a lengthy fall on either side as he traveled towards the rendezvous. Confident that he had done the right thing for his people in sabotaging the world, Anor yelled to the winds that he, Nom Anor, had killed the living world. However, while he was on the spine, Anor was attacked from the back by Harrar, knocking him to the ground on the thin spine. Battling his attacker off, Anor faced off with Harrar. Anor found it hard to believe that the priest was siding with the Jedi against him, though Harrar maintained that it was Jamaane who was the evil one, not Zonama Sekot. With Anor refusing to tell the priest what he had done to the hyperdrive of the living world, Harrar rushed at Anor, attempting to kill the former agent for his deeds. However, Anor ignited the lightsaber, and his swipe with the blade at Harrar's leg made the priest stumble as he tried to avoid it, sending Harrar tumbling over the edge of the spine."}, {"tag": "p", "text": "Anor made his way to the rendezvous site unhindered, and was in time to see the lander descending towards him. At that moment, the ground shuddered briefly, indicating that Anor's sabotage was about to have its intended effect. However, alerted by the rustling of grass, Anor turned to see Horn coming after him. Knowing that the lander would not get to him in time, Anor ran into a copse of trees. Dashing through the trees, Anor was sent flying into a tree after Veila intercepted him with a flying kick to the head, before retrieving her lightsaber from the winded Anor. Although Veila admitted that she was not going to kill Anor, she instead decided to cut off his hands and feet, and started to drag her blade through the ground towards Anor's leg before Horn stopped her. With the Yuuzhan Vong lander Red Qurang setting down nearby, Horn ordered the ex-Executor to call off the warriors that would disembark, or he would take Anor's head off. With Horn refusing to listen to Anor's suggestion that they would not take orders from him, Anor was getting his villip out to do the communication when the ground heaved massively, tossing them about."}, {"tag": "p", "text": "With the two Jedi briefly occupied with the pain that Zonama Sekot was sending out through the Force, Anor ran towards the lander. Though the pair of Jedi pursued him, they soon found themselves ambushed by the warriors who had disembarked from the transport. Near the lander, Anor ordered the warriors to quickly finish the Jedi, as time was short. However, at that moment, the Jedi shuttle Jade Shadow arrived at the scene, and fired upon the warriors and Anor. With the warriors being cut down around him, and Jedi disembarking from the shuttle to help their companions, Anor sprinted for the landing ramp of the Yuuzhan Vong vessel, with Veila hot on his heels. Although Anor made it to the ramp before her, he had to duck to avoid being beheaded by Veila's blade as the Jedi mounted the ramp as well. Fortunately for Anor, it was then that the lander took off, sending Veila falling from the lander to the ground below."}, {"tag": "p", "text": "Escaping the initial pursuit of the Jade Sabre, the Red Qurang with Anor aboard made orbit, but was forced to survive the onslaught of the Imperial frigate Widowmaker before it could make it to hyperspace, as the Yuuzhan Vong transport was the only ship Jamaane could spare to get Anor off Zonama Sekot. Ignoring the damage being inflicted to the small transport, Anor watched from the Red Qurang as boiling clouds of vapor continued to form around the hyperdrive field guides as he was bucked around with the ship. However, shortly after blue beams of light began to come from the location of the field guides, Zonama Sekot jumped to hyperspace, and the wake of the planet took the Widowmaker with it, saving the Red Qurang from falling apart under the barrage of the Imperial frigate; the living world had funneled the energy that would have created an explosion into a blind jump to hyperspace, sparing the world from devastation."}, {"tag": "h3", "text": "Escalation and demise"}, {"tag": "h5", "text": "High Prefect of Yuuzhan'tar"}, {"tag": "p", "text": "When Anor returned to Yuuzhan'tar, he was escalated to the position of prefect for his role in the sabotage of Zonama Sekot, receiving green robes and a new residence due to the promotion. This escalation bothered many who still remembered Anor's many failures, including Drathul himself. Despite being escalated for his actions, the Prefect did not meet Jamaane personally until sometime after Anor's return to the Yuuzhan Vong capital. When he was summoned to do so, Anor was let into Jamaane's presence by Onimi, and, genuflecting before the Supreme Overlord, offered Jamaane Anakin Solo's lightsaber, which had been previously used by the Yuuzhan Vong to test the durability of the new elite warriors known as Slayers. In a discussion about the gods, Jamaane informed Anor that the Yuuzhan Vong were fighting a war against the gods themselves, for not letting the Yuuzhan Vong share the gods' power. An astonished Anor listened to the Supreme Overlord as he went on to talk about the Jedi's potential relation to the gods. When Jamaane demanded to know if Anor had actually destroyed the threat of Zonama Sekot, Anor vowed that he had neutralized it."}, {"tag": "p", "text": "After the Galactic Alliance—the successor state of the New Republic—liberated captives from their Yuuzhan Vong and Peace Brigade guards close to the world of Selvaris, Anor accompanied Jamaane in a procession that went to meet the Peace Brigadiers that had managed to retain control of some of the prisoners near what had once been known as Westport on Yuuzhan'tar. Walking close to Jamaane's own palanquin, Anor came to the location with the rest of them, and witnessed Carr being promoted for his actions at Selvaris. With more captives soon to be acquired to fill the gap that the liberation had created, Jamaane tasked Drathul and Anor with making sure that nothing would interfere with the ritual ceremony that would see the sacrifice of those same captives."}, {"tag": "p", "text": "Drathul summoned Anor to the High Prefect's quarters shortly after the pair were assigned to the task, though Drathul kept Anor waiting half a day before seeing him. In the meeting, Drathul warned Anor of a Shamed One plot that was planning to disrupt the ceremony, and deducing a connection between Anor's escalation and the heretics, ordered Anor to preferably talk them down. The High Prefect, who was infuriated at Anor's new rank, also threatened Anor with consequences if he failed yet again. After talking with Drathul, Anor took a saddled bissop back to his residence, and on the journey there, decided to make sure that the heretics that he had given purpose would not interfere with his future plans."}, {"tag": "p", "text": "Upon arriving at his residence, Anor retrieved the masquer that he had used to disguise himself as Yu'shaa, and after informing his servants not to disturb him, left the residence secretly disguised as a lowly worker. He then proceeded to make his way down to the realm of the Shamed Ones, doing so via a meandering route to shake any spies that might be following him. Down where the Shamed Ones dwelt, Anor uttered the right passcodes to access the lowermost levels, and before long the Shamed Ones recognized Anor as their Prophet and flooded to him before he could get to Kunra. Although he tried to tell them that he had not been taken by Jamaane, nor had he been almost killed, the Shamed Ones interpreted his responses in such a way that they believed he had defeated Jamaane and death."}, {"tag": "p", "text": "In a large boulevard, with a crowd of Shamed Ones forming, Anor found Kunra, and tried to tell him not to interfere with the ceremony, lest it result in the death of heretics. However, each time Anor warned Kunra, the ex-warrior twisted Anor's words and re-uttered them in front of the crowd, urging them to attack and disrupt the ceremony in great numbers. Even when Anor addressed the crowd, Kunra twisted his words and incited the Shamed Ones, preventing Anor from backing down on his promise to lead the Shamed Ones to a better life. With the Shamed Ones cheering, Kunra came close to Anor, put a coufee to his ribs, and thanked the Prophet for helping incite the heretics once more. Thus, Anor's plans to stop the attack on the ceremony failed."}, {"tag": "p", "text": "Shortly after failing to dissuade the heretics, Anor attended the Grand Ceremony at the Place of Sacrifice, and entered it with the procession that contained the high ranking Yuuzhan Vong officials and Jamaane himself. Because he had failed in his task, Anor was apprehensive of what the Shamed Ones might do as he watched the ceremony unfold. Before the thousand odd captives could be sacrificed to the gods, Shamed Ones burst forth from holes in the ground armed with weapons, and began to free the captives after overwhelming the ceremonial guards. Although many Shamed Ones and captives were killed, many more escaped into the tunnels that the force had come from. Anor, who was aghast at the turn of events, saw Drathul staring him down for failing him, and when the High Prefect began to come towards Anor, the Prefect readied his plaeryin bol so that he could save himself by killing Drathul."}, {"tag": "p", "text": "It was then, before Drathul could reach Anor, that Jamaane ordered the High Prefect to bring him every single heretic who followed the Prophet, so that they could be punished for their actions, saving Anor from Drathul's anger. Meanwhile, Anor saw Onimi, disguised as a slayer via an ooglith masquer, slip away from the slayer group and into the crowd; Onimi was not supposed to be at the ceremony, being a Shamed One. Because of the heretics' attack during the ceremony, Jamaane ordered Drathul to round up three thousand Shamed Ones in retribution, and Anor was passed this task by the High Prefect. Three days after the ceremony, those Shamed Ones were executed in an ossuary that had once been a stadium, fed to yargh'un rodents as both elite and lowly Yuuzhan Vong watched. Anor was in attendance at the executions, and looked on as the Shamed Ones, many of whom were innocent of being heretics, went to their deaths shouting the name of Yu'shaa. Although many of the high ranking Yuuzhan Vong were dismayed by this, Jamaane laughed at the spectacle before him, though Anor was the only one who dared look at the Supreme Overlord during the executions and notice this."}, {"tag": "p", "text": "After the cleansing rite of the Shamed Ones, Anor took it upon himself to subtly question those who attended the slaughter whether any of the observers had seen Jamaane laughing, and concluded that he had indeed been the sole observer. Two days after the event, Anor was in attendance at a meeting in the Hall of Confluence, when Choka asked Jamaane to reconsider his orders to attack the enemy at Mon Calamari. Although Anor found Choka's caution good, he did not openly support him for fear of losing Jamaane's trust, and watched as Jamaane ordered the attack to commence, as the Supreme Overlord deemed the gods would look favorably upon the warriors."}, {"tag": "p", "text": "From Anor's array of consuls and executors that reported to him, the Prefect began to discover that many of the high caste Yuuzhan Vong were experiencing grave apprehension and doubt due to Jamaane's leadership. Shortly after the Supreme Overlord ordered the attack to continue on Mon Calamari, Anor was present in Jamaane's holy yacht with the other high caste members, to watch as the Yuuzhan Vong battle groups departed for Mon Calamari system. While witnessing the send-off, Anor began to grow fearful of Jamaane's actions, as the Supreme Overlord was ignoring the threat of Anor's heretics and those who were doubtful of Jamaane's rule. During the event, Onimi approached the Prefect in the holy yacht, to warn Anor how unstable his current position was."}, {"tag": "h5", "text": "The beginning of the end"}, {"tag": "p", "text": "While the Yuuzhan Vong armada was battling the Galactic Alliance's forces near Mon Calamari, Anor, with nothing else to do as the Yuuzhan Vong waited for news of the outcome, returned to his residence to take a nap. However, he was quickly awoken by a landquake that shook his entire residence, sending his furniture and belongings tumbling about. Anor made his way to the balcony that looked over the Square of Hierarchy in time to witness a gale-force wind that uprooted trees as it blew across Yuuzhan'tar. In the sky, Anor observed the world of Zonama Sekot, and he realized that the living planet had not been lost in the depths of space, but had found its way to the capital of the Yuuzhan'tar."}, {"tag": "p", "text": "Feeling defeated because his internal predictions about Zonama Sekot's return had come true, Anor started to go back into his residence as the balcony began to collapse, but the Prefect was grabbed from behind in a choke-hold by Drathul, who put a coufee to his throat. Revealing that he was a Quorealist, the High Prefect demanded to know what Anor knew about Zonama Sekot as he choked Anor, though the Prefect did not reveal his secrets as he was beginning to pass out due to air loss. When Drathul released his choke-hold, Anor surprised Drathul by informing him that he had tried to prevent Zonama Sekot's return, and it was that that had led to his escalation. As massive hailstones began to pepper the balcony outside, Anor advised Drathul to pray to the gods that Zonama Sekot came in peace. Though Zonama Sekot soon jumped through hyperspace to an orbit of Coruscant Prime that was further out then Yuuzhan'tar's, Choka brought the Yuuzhan Vong armada back to Yuuzhan'tar to defend it from the living world."}, {"tag": "p", "text": "Shortly after the arrival of the living world, litter bearers arrived at Anor's residence to bring him to Jamaane's presence, which caused Anor to be momentarily fearful that the Supreme Overlord had issued a death warrant for Anor because of his failure to neutralize Zonama Sekot's threat. However, Anor decided to stick with Jamaane, rather than once again taking up the robes of the Prophet, and departed with the litter. On his way, Anor witnessed heretics openly celebrating the arrival of the living world in public squares, despite the consequences of doing so, though most of the heretics were quickly dispersed by bands of warriors. Arriving at Jamaane's chambers in the Citadel, Anor prostrated himself before the Supreme Overlord, and admitted to failing him by not succeeding in neutralizing Zonama Sekot. However, Jamaane did not fault Anor completely, as the Supreme Overlord believed that it was the gods who had failed them, by saving Zonama Sekot so as to send it at Yuuzhan'tar and its inhabitants."}, {"tag": "p", "text": "Anor was shocked silent by Jamaane as the Supreme Overlord went on to explain that if they destroyed Zonama Sekot, they would defeat the gods themselves. Seeking to turn the gods against one another, Jamaane ordered Anor to make sure that all temples ceased worshiping Yun-Yuuzhan and Yun-Yammka, and instead fully worshiped Yun-Harla. It was then that Anor realized that Jamaane was deranged, and looking at Onimi, he saw that the Shamed One saw this too. With Anor disheartened and doubting that Jamaane could ever deal with the threat of the Galactic Alliance, Anor once again decided to think only of his own survival, and of nothing else. Fulfilling Jamaane's commands, Anor spread the Supreme Overlord's commands to the priests of the temples on Yuuzhan'tar, and the resulting shift to worshiping only one god caused some of the more pious Yuuzhan Vong to fear the worse."}, {"tag": "p", "text": "Not long after his private meeting with Jamaane, Anor once gain met the Supreme Overlord, though this time in the Hall of Confluence as Jamaane addressed his court. The Supreme Overlord admonished his court for cowering in fear before the arrival of Zonama Sekot, and surprised them all by revealing that he had known of the living world's existence. Jamaane went on to reveal that Yun-Harla had answered their offerings by providing a means to kill Zonama Sekot: a Yuuzhan Vong ship that had been infected by the Alpha Red pathogen created by the Galactic Alliance to destroy all Yuuzhan Vong related life forms. Intending to use the dying ship to infect Zonama Sekot, Jamaane ordered Choka to send his armada at the living world and bring the infected ship safely to its target."}, {"tag": "p", "text": "However, the Galactic Alliance and the Imperial Remnant fleets chose then to assault Yuuzhan'tar to retake it, and with Choka's armada engaged with the enemy near the gas giant Muscave in the Yuuzhan'tar system, Anor was present in the Hall of Confluence when Jamaane responded to a summons by one of Choka's warriors, Supreme Commander Laait. The Supreme Commander explained that living vessels similar to coral skippers had risen from Zonama Sekot to engage the Yuuzhan Vong fighters that were guarding the ship infected with Alpha Red. With even Jamaane stricken by the news, Anor witnessed as the Supreme Overlord had his quartet of seers killed for uttering heresy that the gods had aligned themselves with the Jedi. Shortly afterwards, Anor was forced by Jamaane to explain where the living ships came from, as the Prefect had been to the living world, and Anor failed to convince them that the ships were merely the results of mind tricks played by the Jedi. Ever erratic, Jamaane, ignoring the fact that Galactic Alliance forces were breaching the defenses of Yuuzhan'tar, placed half of the Citadel's garrison of warriors at Anor's hands so that he might eradicate the heretics once and for all. When the Supreme Overlord ordered Jakan, Qelah Kwaad, and Drathul to go to the Well of the World Brain before dismissing them all, Drathul pulled Anor aside as he prepared to leave, and confronted Anor for not siding with the elite caste members against Jamaane. However, Anor's new force of warriors prevented Drathul from taking revenge against the Prefect, and Anor merely advised Drathul to wait for his turn for revenge against Anor."}, {"tag": "p", "text": "Anor's contingent of three hundred warriors set about killing the masses of heretics that were publicly appearing on the surface of Yuuzhan'tar, though the Prefect himself had no control over the rampaging warriors. Feeling desperate due to his lack of control, Anor watched as the warriors began to slaughter the heretics and Shamed Ones in the Place of Hierarchy, where the latter became trapped. It was then, viewing the slaughter, that Anor saw fires rising up on the surface of Yuuzhan'tar. Realizing that the Galactic Alliance's starfighters were not responsible, the Prefect was horrified to see Yuuzhan Vong Fire Breather creatures as the cause of the conflagrations. Comprehending that Jamaane had convinced the World Brain to devastate Yuuzhan'tar to spite the gods, Anor cursed Jamaane's name, for the Supreme Overlord was destroying all that they had worked for. Slaying a warrior to grab his amphistaff, Anor disguised himself as a Shamed One with the robe of a dead Yuuzhan Vong and fought his way to the top of a rubble pile in the center of the Place of Hierarchy. There, Anor proclaimed to the Shamed Ones present that he was the Prophet, and that he would lead them to victory against the warriors. Anor's heretics heard this, and struck against the warriors that were slaughtering them."}, {"tag": "h5", "text": "The Prophet once more"}, {"tag": "p", "text": "Although the leadership of Anor allowed the heretics to get out of the Place of Hierarchy, the warriors still took a heavy toll on the Shamed Ones, and began to try to press the heretics into the Place of Bones, so that they could slaughter the Shamed Ones there. With Anor fighting in the thick of the skirmish, reinforcements soon arrived for the heretics in the form of Galactic Alliance commandos who had been inserted unto Yuuzhan'tar and Yuuzhan Vong resistance fighters. Emboldened by the sudden aid, Anor fought harder against the warriors, but as the heretics began to get the upper hand in the fight, Anor heard the sound of lightsabers being used, and realized that Jade Skywalker, Veila, and Kenth Hamner were fighting alongside the heretics."}, {"tag": "p", "text": "Although attempting to get away from the Jedi that he had affected with his various schemes over the years, Anor was pushed ever closer to the Jedi by the fighting, and despite killing a Shamed One to cover his face in blood to disguise himself, when pressed shoulder to shoulder with the fighting Veila, the Jedi Knight recognized Anor for who he was. Slashing apart the knot of robes that Veila held on to him with, Anor scurried away from Veila, and made his way to the edge of the fighting after navigating the combatants, though Veila alerted Jade Skywalker to Anor's presence. Pursued by Jade Skywalker as he ran from the battle, Anor led her on a twisting route as he made his way down deeper and deeper into the depths of Yuuzhan'tar in his attempt to escape her. Although Anor tried multiple times to outwit Jade Skywalker, setting traps for her that the Jedi avoided each time, the fleeing Prefect began to tire, and tried to make a final stand with a hand blaster pilfered off the dead remains of a Twi'lek security guard."}, {"tag": "p", "text": "After emptying the blaster against Jade Skywalker as she deflected the shots with her lightsaber, Anor tried to flee further, but found himself trapped with a wall to his back. When his Jedi opponent deactivated her lightsaber, Anor went at her with his coufee, but Jade Skywalker evaded all of his swipes, and continuously struck Anor as she dodged his blows before disarming the Prefect of his weapon. Trying to hit the Jedi with only his bare hands, Anor fell numerous times for openings in Jade Skywalker's defense that she had purposely created to allow her to further harm the Prefect. Jade Skywalker eventually inflicted enough harm on Anor that he had trouble getting up, and it was then that she held her lightsaber to his throat. Faced with death, Anor begged for mercy, being unarmed, and his pleas to the Jedi became more frantic as it appeared that Jade Skywalker was going to kill him for his numerous crimes against her."}, {"tag": "p", "text": "However, when Anor pleaded that he could help the Jedi and that he had changed, Jade Skywalker stayed her blade, though she did so not because of the Prefect's reasoning, but because others would decide Anor's fate. Momentarily spared from further harm, Anor informed Jade Skywalker of Jamaane's plan to destroy Zonama Sekot with Alpha Red. Following that, Anor and Jade Skywalker made their way to the surface of Yuuzhan'tar, and linked up with approximately fifty of the heretics, as well as Veila and Hamner, and made their way to the Well of the World Brain. Entering what once had been the Atrium of the Senate, Anor and the others found themselves faced with a hundred Yuuzhan Vong warriors, as well as Jakan, Drathul, and Kwaad, who intended to sacrifice the captured Solo couple, their two bodyguards, and Harrar to the World Brain."}, {"tag": "p", "text": "Jakan was furious that the heretics dared to enter the sacred place, but Anor and the group defied his orders to leave and prepared to fight the assembled warriors. However, before they could do so, another hundred warriors entered on the heels of the heretics and placed themselves between the two groups. Although the heretics fell back and it appeared that they were heavily outnumbered, the newly arrived warriors fell on the ones guarding Jakan and the others. With his heretics rushing to join the fight, Anor raced for Drathul as pandemonium ensues, and strangled the High Prefect to death. After killing the intendant, Anor made his way to the platform that was situated over the World Brain, while the heretics and the renegade warriors continued to kill the guards of the World Brain. The Prefect looked on as Solo coerced the captive Kwaad into communing with the World Brain. The shaper did so, and though the World Brain was angry initially, Jacen, elsewhere on Yuuzhan'tar fighting Jamaane's forces, calmed it down. In this way, they convinced the World Brain to aid the Galactic Alliance and the heretics, and not Jamaane."}, {"tag": "p", "text": "With the Jedi's task in the Well of the World Brain complete, Jade Skywalker had Anor tell the others of Jamaane's plot to kill Zonama Sekot. Accompanying the Jedi and the Solos to the Citadel in the Millennium Falcon to locate Skywalker and the Solo twins, Anor was shocked to see the destruction that had been incurred upon the buildings and structures of Yuuzhan'tar. Anor entered into the Citadel and made his way to the Hall of Confluence with the others, to find it filled with the bodies of warriors who had fallen against Galactic Alliance troops. Reasoning that Jamaane was most likely at the summit of the Citadel when Skywalker and the two others engaged him, Anor led the others up to the summit, and entered the room after the door to it opened upon detecting Anor's scent. However, the sight of Jamaane's decapitated head stopped Anor still for a long moment, as he could not believe that the Yuuzhan Vong had no Supreme Overlord anymore."}, {"tag": "p", "text": "In addition to Jamaane's body, the summit room also contained the bodies of Jamaane's dead slayers, and a seriously wounded Master Skywalker. Although Anor informed the others that the wounded Jedi Master would not make it as he had been poisoned, Skywalker managed to keep himself alive by slowing the blood flow in his body. When Skywalker told the new comers that both the Solo twins had pursued Onimi, Anor was shocked that the Shamed One had abandoned his master's side to flee up the staircase that led to the bridge of the Citadel. However, when the whole Citadel began to prepare for lift off, a command that Jamaane could only authorize, Anor began to doubt if the Supreme Overlord was truly dead. With Hamner gone and Veila and Jade Skywalker tasked with getting Skywalker to safety, Anor accompanied the two elderly Solos as they went up the staircase to the bridge of the Citadel to find the twins."}, {"tag": "h5", "text": "Death"}, {"tag": "p", "text": "As Anor led the search for the twins, the top part of the Citadel launched into orbit, taking with it Anor and everyone else at the summit of the Citadel. Although they did not locate the twins at first, Anor and the Solos found them in the bridge of the vessel, and were shocked speechless when they did. They found Jacen, resembling a blinding beam of light, as he used his power to kill Onimi—the true Supreme Overlord who had been controlling the throne from behind the scenes—with the Shamed One melting away to nothing as Jaina dangled incapacitated nearby. However, though everyone including Anor was awed by Jacen Solo's defeat of Onimi, the vessel began to break down due to the loss of Onimi, as the Shamed One was wedded to the ship. Convincing the Jedi that their best hope of escape lay in departing the doomed vessel with a yorik-trema transport, Anor led them through a maze of corridors until they came to a grotto with numerous airlocks adorning its walls."}, {"tag": "p", "text": "Attempting to rid himself of the Solo family, Anor tried to get them to enter a waste disposal chute before him as he pretended to ready the launch organ so that he could escape in the transport alone. However, Jacen caught Anor in his deceit, and pointed to the real entrance to the transport, with his recovered sister backing up his claim. Although Anor tried to assert that he had merely been confused and had mistaken the entrances, Anor was forced to use his plaeryin bol against the Solo family when Han drew his blaster on Anor. To save Jaina and Han, Jacen interposed himself between the gushing poison and his family, to the delight of Anor, and the Prefect prepared to use the knockout gas contained within the little finger of his left hand to deal with the other Jedi. To Anor's shock, Leia severed Anor's left hand at the wrist to prevent such an attack, and Jacen managed to disperse much of the strength of the poison with his new found powers, allowing him to survive."}, {"tag": "p", "text": "Although Jacen expressed regret that Anor had betrayed them when he could have escaped with them together, Anor stated that he could have been no other way, as he felt that he belonged with neither the Yuuzhan Vong or the Galactic Alliance as it rebuilt. With the lock to the transport only able to open after it responded to Yuuzhan Vong flesh, Anor used his right hand to allow the Solos access to the craft, despite the fact that they could have used his severed left hand to do so as well. With the rest of his family in the transport already, Han held Anor at blasterpoint for a moment before permitting the Prefect to enter the transport as well. However, Anor refused his offer, as he did not want to have anything to do with the new order that would be formed after the Yuuzhan Vong War, and wanted to die with Onimi, the only other Yuuzhan Vong like him. Pushing Han into the transport, Anor activated the mechanism that sent the transport away from the dying vessel, and died as the living ship disintegrated over the reclaimed Coruscant."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In the aftermath of the war, Anor was credited for being responsible for half of the invasion that took the New Republic unawares."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "An agent with great ambition"}, {"tag": "p", "text": "Anor was quite ambitious in nature, always wishing to climb up the Yuuzhan Vong ladder of command to gain more power, and this same ambition directly influenced many of the decisions that the agent made during his involvement in the Yuuzhan Vong War. Anor did not believe that pain fed the Yuuzhan Vong gods, and though he claimed to serve Yun-Harla, he doubted her actual existence. In truth, Anor only served himself, and the chance of promotion to a higher rank. Prior to the start of the war, Anor made a bid for power by supporting the Praetorite Vong of the intendant caste as the initial assault force in the Yuuzhan Vong War by secretly acquiring for them an immature yammosk; Anor enjoyed the power that came with rank and command, and on Rhommamool, he loved the adulation he received as the leader of the people there, though he did not care about fate of the planet or its inhabitants in any way. Anor's throne while he worked as the Prophet made him feel powerful, which he enjoyed, though he was careful to hide his enjoyment of this from his followers."}, {"tag": "p", "text": "Anor disliked how speaking through a gnullith-villip hybrid lessened the commanding tones of his voice, and while at the Battle of Bilbringi, Anor refused to allow Carr to take command of the Yuuzhan Vong forces away from him. One of Anor's drives for gaining power was to allow him to take revenge on all of those that had inflicted pain on him over the years, and the agent was gleeful when through the use of Ngaaluh he could set Jamaane on his old enemies. Because he had power on Yuuzhan'tar, Anor wished to save the world from Jamaane's irrational commands. While working alongside Vergere—whom he grew to hate—Anor developed an intense rivalry with her, as he felt that his power as Lah's main agent was threatened by her, and due to this the two constantly bickered."}, {"tag": "p", "text": "In his pursuit of power and escalation, Anor did not care how many people died for him to get his way, and believed that sacrifices had to be made for the good of the Yuuzhan Vong, and especially for the good of Anor. Anor thought that his hobby of playing with his deadly spores could potentially allow him to reach his desired rank of High Prefect. The agent found it a glorious day when he successfully ignited the civil war between Rhommamool and Osarian and furthered the cause of the Yuuzhan Vong, despite the fact that thousands would die due to his actions. During the bo'tous plan, which was important to Anor because it could help him regain the esteem he had lost from siding with the failed Praetorite Vong, Anor was willing to sacrifice the lives of his Peace Brigade allies to salvage the mission, and while he was looking into spreading the word of the heresy, Anor would have killed both Kunra and Shoon-mi if they had refused to aid him in his mission. In his stint as the Prophet, the agent did not care how many heretic spies died as long as he gained intelligence on what Jamaane was up to. Later, when on Zonama Sekot, Anor slew Yim to move his plans foreword even though he knew her death would be a great lose to the Yuuzhan Vong. If Anor was the Supreme Overlord, he decided he would execute all of the potential runner-ups to keep his power, like Jamaane had supposedly done. Despite Anor's propensity to harm others to achieve his ambitions, the agent believed that ruthless acts sometimes came back to haunt their owners."}, {"tag": "p", "text": "Anor thought only of his ambitions, and he went to enormous lengths to achieve power. After the debacle in the Treskov system, Anor was happy to lead the heretics that had opposed the Yuuzhan Vong cause as long as it helped him get back on top, and although he sometimes tired of the heretics and their questions, Anor stuck with them for the power that leading them promised. In his guise as the Prophet of the heretics, Anor even learned to give compliments so that he showed compassion in order to further his goal. However, when Anor saw an opportunity to gain more power by getting back in Jamaane's good graces, Anor abandoned the heretics to take it by sabotaging Zonama Sekot. Although his world was crumbling apart with Zonama Sekot in the sky at the end of the war, Anor still relished the small victory he took over Drathul after he surprised the High Prefect. However, despite the agent's great ambition and intellect, many of Anor's carefully laid plans for escalation ended badly during the war, such as the one in Bilbringi, and especially the disaster in the Treskov system. When he tried to calm the heretics down later in the war, Anor's plans fell apart when Kunra began to twist Anor's words after he tried to tell the Shamed Ones to not interfere with the ceremony."}, {"tag": "p", "text": "Anor considered himself a pragmatist, who never wasted an advantage that could help him in his quest for escalation. As such, he scrolled away that fact that the Mandalorians allied with the Yuuzhan Vong were being led by the infamous bounty hunter Boba Fett for further use as a psychological weapon, and realized that he had won a victory somehow after Yim gave him her qahsa, even though he did not know for certain what it was just then. After realizing that the eight cortex was empty, Anor wished to use that knowledge to net himself further power among the Yuuzhan Vong. Anor played the long game to accomplish his goals, and saved Kunra so that the ex-warrior would later serve and aid him. On Coruscant at the end of the war, Anor was careful in what he said to the Jedi, as he thought it might be possible for him to become a liaison between the Yuuzhan Vong and the Galactic Alliance after the fighting was over. Because of Anor's ambition, it annoyed him that Shoon-mi only worked for praise."}, {"tag": "p", "text": "Over the years, the agent handed out as many beatings as he had taken on his rise through the ranks, and Anor yearned for an escalation so much that he was excited when he was summoned to Warmaster Lah's private chambers in the middle of the war. Later, when Anor was fighting alongside his heretics on Coruscant, he felt exhilarated that he was helping topple something to create a better world with Anor at the top. This ambition infuriated and annoyed other Yuuzhan Vong, and Carr reproached Anor for his hunger for escalation after the failure of the bo'tous plan. Additionally, both Khalee Lah and Harrar believed that Anor's ambition had gotten in the way of the Yuuzhan Vong's goal, and they thought he had taken the glory by delivering Jacen to the warmaster himself, when he should have pursued Jaina instead. Anor sometimes did not give his superiors the respect they deserved when he did not bow as low as he should to them, and over the course of the war Choka occasionally reproached Anor for being too prideful in nature."}, {"tag": "p", "text": "Anor's need for power played a role in many of his dealings, and Anor decided to go through with the risky plan where the Jedi were to rescue Yim, as his influence was slipping following Ngaaluh's death. In Jamaane's good graces at the end of the war, Anor supported Choka's caution against the Mon Calamari campaign, but did not openly side with him because it might interfere with the special relationship he had with the Supreme Overlord following Anor's sabotage of Zonama Sekot. Though Anor realized that Ngaaluh could be a double-agent, the opportunity to place an informant in Jamaane's court to gain critical information was too great to pass up for Anor, and the agent was very happy when he first used Ngaaluh as a spy to further his agenda."}, {"tag": "h3", "text": "An estranged Yuuzhan Vong"}, {"tag": "p", "text": "Anor possessed many sentiments and beliefs that were in accordance with those of the Yuuzhan Vong culture and religion. As of 25 ABY, Anor considered metal technology impure because of his species' aversion to non-organic creations, and saw the iron armor of the Mandalorians as shells, and those who wore them as weak. The agent appreciated how the Mandalorians sometimes dwelt in trees, and the agent wished for them to be the first ones to see their new masters in 25 ABY. The agent also appreciated how efficient Yuuzhan Vong creatures were in fulfilling their roles, and saw the inside of a mid ro'ik warship as perfection in the first year of the invasion. In addition, he could not understand how any culture could bury the nature of their world under legions of buildings, like what had happened upon Coruscant. When the agent heard Harrar make a joke to the Jedi while on Zonama Sekot, Anor decided once and for all that the planet was driving the priest crazy, as the Yuuzhan Vong priest was joking about the use of machinery."}, {"tag": "p", "text": "Believing in the hierarchical society that the Yuuzhan Vong had established, Anor thought that he was superior to warriors at the very start of the war, and believed that warriors would never question him because he was an Executor. Anor also believed that shapers had life too good, and he found pleasure in riling Hool up about the Jacen Solo incident. Later on, Anor was furious when I'pan thought that he was Shamed following the disaster in the Treskov system, and he temporarily lost control, beating I'pan. As the Prophet, Anor tolerated some defiance in Kunra, whom he trusted more than Shoon-mi, because the ex-warrior needed it to do his task. However, Anor did not tolerate any such defiance in Shoon-mi. As Kunra was his underling, Anor was annoyed that Kunra thought that he could have Anor's ear all to himself after he saved the Prophet's life. Despite being among the infidels for a year, Anor still disliked the sharp corners of the architecture of the galaxy they were invading, as he considered it unnatural. He also found beauty in pain and ugliness, even after being among the Shamed Ones for so long, and at the end of the war, he still felt it sacrilegious that droids were in the Citadel."}, {"tag": "p", "text": "Like other Yuuzhan Vong, Anor believed that it was an honor for a captive to be sacrificed during the grand ceremony on Yuuzhan'tar, and found that the enemy had no understanding of law and order like his species did. Anor took some pleasure in harming others, and he would have liked to see the look on Organa Solo's face when she discovered that the destruction of Settlement 32 on Duro had supposedly doomed her children."}, {"tag": "p", "text": "However, Anor portrayed many traits that differed from those of the standard Yuuzhan Vong, with some due to his prolonged exposure to the cultures of the galaxy that they were invading. Although at first while on his destabilization mission Anor began to fear that he might become too much like the enemy, the agent would realize at the end of the war that he was like neither the Yuuzhan Vong nor the enemy he had fought against. Unlike other Yuuzhan Vong, Anor did not believe that pain fed the gods, and he was careful to hide from other Yuuzhan Vong the fact that he did not enjoy pain. Over the years, in a society obsessed with pain, Anor learned to use it to goad himself on. During his time as an Executor, Anor was never able to speak honestly or openly in case the priests or the Supreme Overlord—or the gods— were offended by his comments. Although Anor claimed to serve the Yuuzhan Vong deity Yun-Harla, he doubted her actual existence, and believed truly that appearing faithful to a religion was better than being completely pious; Anor himself found the pious the most easy to manipulate. However, Anor considered true fanatics such as Niiriit very dangerous. At the end of the war, Anor realized that the Yuuzhan Vong had outgrown the need for the gods."}, {"tag": "p", "text": "Due to his time among the infidels, things that would have normally disgusted a Yuuzhan Vong, such as metallic technologies, did not sicken Anor as much as they used to. When Anor used a blaster to kill Qua Lah and his warriors, Anor was only vaguely repulsed by doing the deed with an infidel weapon. Despite not being averted to the non-organic technologies used in the galaxy, Anor took care to appear as if they did before other Yuuzhan Vong. In direct opposition to Yuuzhan Vong beliefs, Anor was a coward when he realized he could not win a fight, though he hid this fact for the most part from his colleagues. After nearly being crushed by rubble when Solo used the power of the dark side, Anor was scared by the event, which was unlike how a true Yuuzhan Vong should act. He berated Vergere in Basic for the occurrence and prevented himself from trembling in order to hide his fears from the nearby warriors. Anor openly admitted to being a coward to the Jedi on Zonama Sekot, and laughed when Horn challenged him to a duel to try to stop the former Executor from escaping."}, {"tag": "p", "text": "Despite Anor's cowardice in some circumstances, he refused to be scared in others. On Nar Shaddaa, Anor was not frightened when Beviin held a blaster to his head after the Mandalorian mistook one of his moves as a threat, and later showed no fear when it appeared that Anor and the Jedi faced 200 armed Yuuzhan Vong warriors with an insignificant force in the atrium of the old New Republic Senate. In contrary to what the Yuuzhan Vong believed, Anor detested the reliance on old biots and believed that his new genetic work would help his species attain victory."}, {"tag": "p", "text": "Unlike other Yuuzhan Vong, Anor did not let his disdain for the New Republic cloud his judgment in dealing with them, and he knew that it was possible to underestimate the New Republic. The agent suspected that when the blaze bugs of the cognition throne gauged the Yuuzhan Vong forces as better in efficiency than those of the infidels, it was most likely due to the Yuuzhan Vong underestimating the enemy. However, he found that the Praetorite Vong's fall at the hands of that government was only sheer luck, and following the Bilbringi failure, he still believed that the New Republic was merely lucky. Though other Yuuzhan Vong were loath to purposely lose to the opponent, Anor was willing to let his forces seemingly lose to the New Republic to win them a greater victory in the end during the Bilbringi operation. Additionally, he was skeptical in nature, disbelieving that Da'Gara had killed all the enemy fighters in the skirmish near Helska IV. During the war with the Jedi, Anor put a lot of thought into what the Force was, and refused to dismiss it like other Yuuzhan Vong did, and unlike the rest of his civilization, never truly saw Coruscant as Yuuzhan'tar, and only ever referred to it as such when he was required to do so. He saw the city world as something that would never belong to the Yuuzhan Vong despite whatever they did to it. If Coruscant had not been at the center of the galaxy, and not the New Republic's capital, Anor would have never wished to conquer the planet."}, {"tag": "p", "text": "Although he preached it as the Prophet, Anor did not believe in ordained destiny, and instead thought that destiny was created by shear force of will, a thing that Anor believed he had lots of. Among the Shamed Ones, Anor had to sometimes suppress himself from making outbursts when the heretics talked as if they actually believed the Jedi heresy and the prophecy that he had created; the self-proclaimed Prophet would later be surprised when his prophecy turned out to be true. Due to his time among the enemy, Anor sometimes wondered if their reliance on trust was better than the Yuuzhan Vong's reliance on fear and pain. After spending a while on Zonama Sekot, Anor came to believe in the underground Quorealist view that the Yuuzhan Vong should never have came to the galaxy that contained the living world."}, {"tag": "h3", "text": "Survivor"}, {"tag": "p", "text": "Anor had a particularly strong survival instinct, unlike other Yuuzhan Vong who were willing to sacrifice themselves for the good of their gods, and Anor's disloyalty mainly stemmed from this need for self-preservation. The agent frequently used his persuasive abilities to further his life span, and when in trouble with his superiors, Anor would use doublespeak to get out of the situation intact. The agent also learned to talk warriors out of fighting with him over his years in Jamaane's court in order to survive there, and when verbally confronted by Lah for mistakes, Anor attempted to wheedle his way out of the warmaster's wrath with lies and the like. Anor also blamed others for failures on his part so that he was not punished for them, and he did just that after the debacle at Bilbringi, accusing Elan and Harrar's lack of improvisation for the failure of the mission; Yuuzhan Vong such as Harrar considered it very unseemly to foist blame on others as Anor did. When the agent felt that he might be held partially responsible for the failure of his creation the Peace Brigade late in the war, Anor prepared a rebuttal if that situation were ever to occur. While around the Jedi at the end of the war, Anor twisted the story of his sabotage of Zonama Sekot to make it seem like he was trying to help the Jedi and their allies, and he calculated every word and move he made while in the company of the Jedi to further the length of his life."}, {"tag": "p", "text": "Anor valued his own survival so high that he was considered a coward by some, though he managed to mostly hide this fact from the Yuuzhan Vong who despised this trait, and at Bilbringi claimed that his specific cowardice actions there were for the greater good and not his alone. After being betrayed by Vergere as she helped Jacen escape from Yuuzhan'tar, Anor begged them to take him with them so that he was not punished for his failure to prevent their escape. At the height of the battle on Yuuzhan'tar, Anor desperately wanted to continue to live, and afraid of Jade Skywalker's vengeance he covered great distances fleeing her before he was caught. When she did, he pleaded for her to let him live, and tried to get her to give mercy because he was unarmed. Although Anor had realized the plaeryin bol that he wore would one day save his life, he was shaken after finally having to activate it against Ngaaluh."}, {"tag": "p", "text": "Anor believe that one had to do whatever they could to survive, and he was willing to kill Drathul to save his own neck when the High Prefect came for him after the Shamed Ones launched their assault on the ceremony on Yuuzhan'tar. He also slew Skell, even though he liked the Yuuzhan Vong, to ensure his escape after Anor's failure at Ebaq. Anor even tolerated living among machines after his fall from grace due to the disaster in the Treskov system so that he could continue living, and slew Qau Lah and two other Yuuzhan Vong with a blaster at Yag'Dhul to prevent word of his cowardice from spreading At the end of the war, when fighting alongside his followers in his guise as the Prophet, Anor desperately tried to keep Jade Skywalker and Veila from seeing and recognizing him, even going as far as killing one of his Shamed Ones to disguise himself with blood. This was because the agent feared retribution for his earlier acts. Intent on escaping after witnessing Onimi's death, Anor attempted to send the Solo family into a waste disposal shoot so he could escape alone."}, {"tag": "p", "text": "An expert at the game of survival, Anor learned to be a light sleeper after experiencing years of backstabbing among the Yuuzhan Vong, and awoke easily when others were in the room. While among the Shamed Ones for the first time, the disgraced agent slept with a makeshift coufee within reach and his plaeryin bol ready to strike. The agent also recognized that his work with the Shamed Ones did him a lot of physical good. At the time of Shoon-mi's attempted coup, Anor thought up multiple ways to survive the attack, but settled with a plan that involved not fighting in blind rage, as Anor knew that that would not get him anywhere. Although frightened when Shoon-mi had complete control over him, Anor hid this from his attackers and stalled for time to further his life. On Zonama Sekot, Anor knew that when he ran into the copse with Horn on his tail he only had to buy enough time for the lander to land and release the warriors to combat the Jedi. At the very end of the war, with Onimi's ship deteriorating around him, Anor did not want to rely on the vague possibility that it might actually respond to him, and chose a better plan that would give him a better probability of survival. Anor also did not like to have to rely on other beings, as he preferred to be independent."}, {"tag": "p", "text": "The agent also was cautious and did not overestimate his own gifts, and after receiving Jamaane's transmission on Zonama Sekot he decided not to kill Veila then as it was a foolish move that would probably get him killed. Later, after he slew Yim, Anor knew that he had been lucky and had only killed her because he had surprised her. Anor acknowledged the fact that he had many enemies among the Yuuzhan Vong, but refused to increase the number of his guard as he believed that doing so only told others that you were afraid. Anor was paranoid at times, particularly when he acted as the Prophet, and his lack of intelligence on what Jamaane was up to made him feel exposed, so the agent sought to find out whether the Supreme Overlord was after him or not. Following the failed assassination attempt upon him, Anor—tainted by Shoon-mi's betrayal—was filled with raged and suspicion, evening doubting the loyalties of Kunra and Ngaaluh. When he later lost his female spy, Anor began to seriously wonder how long it was before Jamaane added him to the body pile that Ngaaluh had been thrown upon. In addition to his occasional paranoia, Anor was also cautious, advising a safe attack to Da'Gara when he helped him plan the Praetorite Vong assault."}, {"tag": "p", "text": "Despite his need to survive, at the end of the war in a nearly inescapable position above Coruscant, Anor chose to open the hatch to the lander that required a Yuuzhan Vong's hand to access it, instead of forcing the Solos to use his severed hand to open the lock, and in doing so deciding to die with dignity."}, {"tag": "h3", "text": "Wavering Loyalties"}, {"tag": "p", "text": "Initially supporting the Yuuzhan Vong, Anor's loyalties would change multiple times in the latter half of the war, though he would always look out for himself first and foremost. For the beginning stages of the Yuuzhan Vong war, Anor was glad to pay the pain of dealing with the honor-less Mandalorians, whose services he had acquired even though he did not believe that his species needed allies in their fight. Later on, Anor was shocked to learn that the eighth cortex of shaper knowledge was empty. As he did not want the New Republic to win because the Yuuzhan Vong could not deploy new creations, he vowed to end the war quickly before this could affect the Yuuzhan Vong war effort. Even after he fled to the underworld of Yuuzhan'tar following the failure that led to Lah's death, Anor was loyal to the Yuuzhan Vong cause, and he strove to find the source of the heresy, as it was his duty to eradicate it lest it toppled all that he had worked for."}, {"tag": "p", "text": "After his stint as the Prophet, Anor was completely confident that he had done the right thing in sabotaging Zonama Sekot. He considered it an abomination, being half-machine and half-living, and a thing that attracted beings to it before trapping them there. When Anor was on his way back to Jamaane from the living world, though Anor knew that he might not survive coming back to the Supreme Overlord, he was glad that he was going back to where he belonged. However, shortly after his return to the Yuuzhan Vong capital, Anor began to grow fearful for the Yuuzhan Vong cause when Jamaane started to ignore the heretics and the others who doubted him to strike at Mon Calamari. The now-Prefect found his task of quelling the rising fear and anger in the lower classes impossible, further disillusioning himself with the Yuuzhan Vong way, and when Zonama Sekot arrived in the skies of Yuuzhan'tar, Anor felt defeated because his predictions had come true despite all he had done to stop them from happening."}, {"tag": "p", "text": "Anor believed in the Yuuzhan Vong and their ability to win until he saw Jamaane trying to turn the gods against one another, which made him realize that the Supreme Overlord was truly deranged. This was the saddest moment of his life, and Anor wanted only to disappear, as he knew then that Jamaane would not be able to save the Yuuzhan Vong from their imminent destruction. At the end, knowing that the war was lost for the Yuuzhan Vong, Anor felt despair at what he had wrought against the Yuuzhan Vong cause. Upon witnessing Jacen overpower Onimi in a show of might, Anor found him to be the greatest enemy of the Yuuzhan Vong due to Jacen's abilities, enough that the Yuuzhan Vong had already lost."}, {"tag": "p", "text": "During Anor's stay with the Shamed Ones and his subsequent rule over them as the Prophet, Anor learned to stop completely detesting them, and even liked some. When the Shamed Ones he was staying with were being killed by the warriors, Anor felt regret that they had to die, as they had helped him survive in the underworld. Niiriit's death affected Anor the most, and he stopped thinking of her merely as a warrior, but instead as a Shamed One who fought for her friends. Later, Anor kept the end of the Rapuung story like I'pan had first taught it in order to remember the tale's origins, and I'pan himself, and one of the reasons that Anor did not kill Shoon-mi initially was because he felt that he owed Niiriit. In time, Anor found that he was not as disgusted by the faces of his heretics as he once was. Additionally, Anor found Zonama Sekot, the heretics' prophesied world, beautiful."}, {"tag": "p", "text": "However, despite being the leader of the Shamed Ones, Anor was not sure what end goal the heresy had, and if it involved toppling Jamaane, which would doom the Yuuzhan Vong's war effort. At the end, Anor saw no way for the heretics to win, even though Zonama Sekot had come to their world. However, he still rejoined the fight on their side to lead them after Anor saw that Jamaane was intent on devastating Yuuzhan'tar to spite the gods that the Supreme Overlord did not believe in, an act that caused Anor to wish he had killed Jamaane earlier."}, {"tag": "p", "text": "It was during the final battle on Yuuzhan'tar that Anor realized that his fight was with everyone and no one at the same time, and he felt desperate when he found himself caught between the two sides due to his various plots; in particular, he despaired because he could not control the warriors or the heretics that gladly went to their deaths against them during the Battle of Yuuzhan'tar. As he believed that masquers could not hide everything about the user, Anor knew that he had no place in a galaxy ruled by the Galactic Alliance, and did not fit with the Yuuzhan Vong because he did not believe in their gods. Because of this, when faced with an opportunity to get off of the dying ship, Anor refused, as he felt that he had no position in the new order that was to be created."}, {"tag": "h3", "text": "An expert at deception and subterfuge"}, {"tag": "p", "text": "Unlike most members of the intendant caste who played more bureaucratic roles, Anor specialized in gathering reconnaissance and being a spy, though he was also trained in the use of demolitions; due to his aptitudes, Anor sometimes forgot the true nature of most other members of his caste. As an agent tasked with destabilization, Anor knew how to use words to rile up certain groups and turn them against other people, and he used this to his advantage on Rhommamool, and was also capable of inciting people against the actions of the Jedi. As Lah's ambassador to the Senate, Anor strove to divide the senators present to create further discord in the New Republic. Although he at first did not know if Zonama Sekot actually existed, he still wove a prophecy about the world that he hoped would take Jamaane down."}, {"tag": "p", "text": "The agent was also able to manipulate members of his own race, as Anor could influence warriors by using their need for bravery against them, and he was constantly amused that he could manipulate Shamed Ones so easy while he played the role of the Prophet. Anor found that true believers in a faith were the easiest to manipulate and control. Considered by himself a professional dissembler, Anor admired how the heretics were playing on the fears of Zonama Sekot in the elite at the end of the war, and was skilled enough in his role as an agent to recognize someone wearing a masquer. Due to his talents, Anor secretly suspected that Vergere was manipulating Lah during her time as an adviser. Though he frequently manipulated others, Anor was also able to intimidate certain individuals."}, {"tag": "p", "text": "Anor preferred to be anonymous when he worked to destabilize the galaxy, though he did not particularly like perpetually hiding his true nature as a Yuuzhan Vong from the rest of the galaxy, and the agent relished being able to walk around without a masquer after he had finished with his work as Cree-Ar. The agent believed that he prepared well and left nothing for chance in his role as an undercover saboteur, and in preparation for the invasion, Anor gauged the physical abilities of the Jedi via Jade Skywalker's fight against the spores that he had infected her with."}, {"tag": "p", "text": "During his stay in the galaxy, Anor grew knowledgeable about the major events of its history, and knew of the Sith and Order 66, and once made himself resemble the Sith Lord Darth Vader in order to unnerve the Jedi on Rhommamool; later in the war, Anor was amused when visiting his secret coralcraft that he had found another use for the offices of Darth Sidious. During his reconnaissance time, the Executor became a fair hand at the game of dejarik, and knew enough to recognize a master such as Vergere. He also knew more about the Jedi than any other Yuuzhan Vong. However, despite his long time spent in the galaxy, Anor failed to discover that the birth of twins was common place, and that capital ships sometimes committed orbital bombardments. With his research on the galaxy crucial in the Yuuzhan Vong invasion, Anor helped plot the Praetorite Vong's attack, and suggested that they lure the New Republic's forces out in bits to destroy them. Anor's analysis of the political situation of the galaxy allowed the Yuuzhan Vong to take a route that left its one flank on the Imperial Remnant side protected."}, {"tag": "p", "text": "Believing himself good at improvising, Anor was a skilled actor, and used this to his advantage to fool Ackdool early in the war. Anor was good enough at his role of the Prophet that he could fool Yim, in addition to the pair of Jedi that accompanied him to Zonama Sekot, into thinking that he was only a simple Shamed One. The agent was also a skilled liar, and when Veila saw that he was wearing a masquer on Yuuzhan'tar, Anor was able to lie to Veila and Horn and give them an excuse that satisfied them. Later, when caught in the act of trying to send the Solo family down the disposal shoot, Anor tried to appear confused to look blameless, though this failed. Anor thought up contingency plans when he plotted, and during his time as the Prophet, Anor wanted to free Yim with the help of the Jedi so that if it failed, they would be blamed or killed without risking himself. If it was a success, he could bring his own prophecy about. However, he did not quite like the fact that the two Jedi sent to help him were Horn and Veila, as they could potentially reveal him as their old enemy. Despite all his intelligence and cunning, Anor was fooled by Jacen into letting the Jedi near the World Brain, which ultimately led to disaster."}, {"tag": "p", "text": "With his knowledge of certain individuals, Anor was able to occasionally predict what they would do, and the agent accurately predicted Borga's request that she be informed of imminent Yuuzhan Vong activity, and Anor's analysis of Niiriit's personality later allowed him to predict her actions; the Yuuzhan Vong agent was also able to sense the motives of individuals around him. Due to his long time among the infidels, Anor believed that he understood them more than any other Yuuzhan Vong did, and learned to look beyond appearances. At first, although Anor found the Mandalorians worthless as an army, he saw them good in the capacity of infiltrators and assassins. However, after a while, the agent decided that they were overrated, and saw them as weak and corrupt for switching sides to save their race. Anor in particular found it ironic that the Mandalorians feared slavery, as they had often pillaged and enslaved others in their long history. At the start of the war, Anor initially admired the Noghri more than he did the Jedi, until the latter began to affect his plans. Despite being an accomplished spy, Anor was no military commander, and found it hard to focus on the many aspects of a battle. Additionally, scuttling through narrow underground spaces vaguely unnerved Anor, despite his aptitude for gathering intelligence."}, {"tag": "p", "text": "Even though he was good at what he did, Anor did not think his job was absolutely necessary, as the infidels destabilized themselves more often then not without the need of his help. Despite this, he still found the plan that destroyed the Mediator to further chaos beautiful. Anor was confident in his own abilities as an agent, and was shocked when the Centerpoint Station blast eradicated both sides of the playing field, as his intelligence had firmly shown that their enemies revered life and would not sacrifice thousands to kill thousands. Later, Anor was surprised to find that the Jeedai cult had escaped his detection on Yuuzhan'tar. Trusting his own information about the Final Redoubt so much, Anor even offered his life if he was wrong, and was confident that Lah would be victorious in the battle until he realized it was a trap. Following the debacle at Ebaq 9, Anor believed that he had been played by a master in the intelligence game. Because he had had such a hard time finding where the New Republic was hiding Elan, Anor was aghast when he learned that the Peace Brigade had discovered as well."}, {"tag": "p", "text": "Anor was curious in nature, enough so that he followed Onimi to the guarded damutek when he noticed the Shamed One, and he was interested when he watched the prisoner aboard the miid ro'ik get implanted with an implanted faulty slave chip. When Jade Skywalker chose not to kill him after defeating him in battle, and not because of his pleading, Anor was curious as to why she did."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Shimrra Jamaane"}, {"tag": "p", "text": "Anor had a complicated relationship with the Supreme Overlord of the Yuuzhan Vong, one that involved Anor's admiration and fear of Jamaane, before Anor came to hate him at the end. Over the course of the war, Anor feared the Supreme Overlord and his power. Following Jacen's escape and Vergere's betrayal, the Supreme Overlord's very presence hurt Anor's mind during the Executor's meeting with Jamaane in the Hall of Confluence. This caused his verbal attempt to shrug off the blame for the incident to break down as Anor panicked. Jamaane's powers would later influence Anor to be angry at Hool after the worldshaping of Coruscant was botched, though Anor realized that he was manipulated to feel that way after the fact. Being a survivor, Anor was smart enough to ignore Jamaane's mockery of him during their meeting after the failed ceremony on Yuuzhan'tar, and the agent was wary enough of Jamaane's temperament that Anor would agree with what the Supreme Overlord said, even if he disagreed, while talking alone with Jamaane. The sight of Jamaane's face terrified Anor, so much so that he almost chose to remain in his guise as the Prophet instead of betraying his heretics on Zonama Sekot."}, {"tag": "p", "text": "While around Jamaane after his escalation to Prefect, Anor worried that the Supreme Overlord might have him killed for his past failures. Despite this, Anor stuck by Jamaane's side because he could not trust the Galactic Alliance not to kill him if he deserted the Yuuzhan Vong cause. Despite Anor's wariness of Jamaane, the Prefect developed a special relationship with the Supreme Overlord, with Anor acting as an adviser of sorts to Jamaane. Because of this relationship, Anor did not openly support Choka's caution against the Mon Cala campaign, though he agreed with it, lest it affect Jamaane's opinion of him. Indeed, during the private talks they had, Jamaane praised Anor for his skepticism, and how he only believed in things he saw with his own eyes. Additionally, Jamaane did not think that Anor was a coward, and even thought that the Prefect was a bit wise in some ways."}, {"tag": "p", "text": "Though Anor feared Jamaane, the agent found Jamaane brilliant as early as when he seized the throne of the Yuuzhan Vong before the war. Anor admired Jamaane's decision to have Sal-Solo become the Peace Brigade's leader, and found the Yuuzhan Vong leader a genius in how he used the gods to get his way, manipulating the pious to achieve what he desired. Anor's respect for the Supreme Overlord went so far that Anor was contemptuous when Sal-Solo thought he could sway Jamaane with his eloquence, and he suspected that Jamaane had manipulated the malfunctioning World Brain into thinking that allowing the maw luur to work properly for the grand ceremony would help the environment of Yuuzhan'tar, so that the event could go as planned. While playing the role of the Prophet, Anor tentatively set his sights on toppling Jamaane from power, and he was quite confident after getting his informant Ngaaluh that he could do just that. Despite this, and although Anor was pleased with the spread of the heresy, he sometimes felt like Jamaane was not afraid of the heresy's power at all."}, {"tag": "p", "text": "However, at the end of the war, Anor began to doubt Jamaane's ability to lead the Yuuzhan Vong to victory. Anor first began to grow fearful of this when Jamaane started to ignore the heretics and the others who doubted him to strike at Mon Calamari, but when Anor saw Jamaane trying to turn the gods against one another, he realized that the Supreme Overlord was truly deranged, and that he could not save the Yuuzhan Vong; because he saw Jamaane like this, Anor vowed to once again focus only on his own survival. However, the Supreme Overlord's actions continued to puzzle Anor, and the Prefect had to reevaluate if the Jamaane was brilliant, or deranged completely. Anor's question was answered after the Prefect saw that Jamaane was intent on devastating Yuuzhan'tar to spite the gods he didn't believe in. A disillusioned Anor cursed his name, as Jamaane was destroying the Prefect's Coruscant, and Anor wished that he had slain the Supreme Overlord earlier because of this. Jamaane's actions led Anor to return to the heretics to led them to overthrow Jamaane, a mission that was ultimately successful at the hands of the Jedi. Despite Jamaane's death, Anor had a hard time believing the Yuuzhan Vong leader was dead, until he realized that Jamaane had never been the true Supreme Overlord all along."}, {"tag": "h4", "text": "Onimi"}, {"tag": "p", "text": "Anor initially despised the Shamed One Onimi, and frequently wanted to harm him due to the Shamed One's antics in ceremonies and the like. However, over time, Anor noticed that there was more to Onimi than what met the eye, and found that Onimi could sense subtle shifts in those in the court, such as fear, which would lead him to his next target as the court jester. The agent also noticed over time that Onimi frequently watched Anor, which unnerved him. During the showdown in the Citadel, Anor was shocked that Onimi had not chosen to die with his master. However, the absence of the Shamed One's body was the thing that made Anor gradually realize that the Supreme Overlord was actually still alive. After witnessing Jacen slay Onimi, Anor became fully aware that Onimi had been the one who had controlled everything all along, doing things such as allowing Anor to follow him to the secret grashal, and bringing Yim to Coruscant, and most prominently manipulating everyone into thinking that Jamaane was the main power in the Yuuzhan Vong court. In the end, Anor felt that he and Onimi were two of a kind among the warrior like Yuuzhan Vong—a cowardly agent and a Shamed shaper who both valued intellect—and chose to die with Onimi instead of escaping when offered the choice."}, {"tag": "h3", "text": "Appearance and equipment"}, {"tag": "p", "text": "A male Yuuzhan Vong, Anor stood 1.77 meters tall, slightly taller than an average Human. He had a blue right eye, and, throughout the war, sported a poison spitting plaeryin bol in place of his left one; in a retractable needle that could slide out from his right thumb, Anor kept the antidote to the poison that the plaeryin bol could unleash. The agent's left pinkie finger also contained a knockout gas, which he used to considerable affect while escaping the Galactic Senate. Anor's body was tattooed, with his bald skull showing off an intricate pattern on the forehead. Anor was gaunt, and had a face that was thin-lipped with a broken nose. The agent was known to commonly carry around a tsaisi baton, a blaster pistol, villips, and a tizowyrm, in addition to the ooglith masquer he commonly wore on missions."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Adept in the role of a spy and destabilizer, Anor was skilled at recognizing tones in people's voices, and detected when talking to the Mandalorians, while they had their helmets on, that they detested slavery and feared the erasing of their culture. In addition to speaking Basic, Yuuzhan Vong, and Rhommamoolian, Anor was proficient in using the Huttese language, and was skilled in its tones enough that when he apologized for dumping Borga off of her chair, she could not detect if he was sincere or not. To aid in his reconnaissance and spying activities, Anor sometimes used his considerable shaper talents to create new organisms, such as the Naotebe wingling and the gablith masquer. His shaping skills, which rivaled those of professional Yuuzhan Vong shapers, also allowed him to make considerable gains in the recolonizing of the surface of Duro while he was disguised as Cree'Ar. The agent was also adept in astrogation and the use of starships."}, {"tag": "p", "text": "Though he was an agent, Anor still knew how to use the amphistaff weapon that most warriors used, and was proficient enough in wielding it that he could take down warriors himself; the agent was also trained in the use of the tsaisi baton. In addition to being able to use an amphistaff, Anor was able to use many of the weapons used by the inhabitants of the galaxy his species was invading, including blasters and vibroweapons. He also was able to wear heavy armor, and was skilled enough in hand-to-hand combat that he could temporarily best Veila on Zonama Sekot. However, Anor was no match for Jade Skywalker during her fight with him at the time of the Battle of Yuuzhan'tar, and she lured him multiple times into thinking that he had an opening only to deal him more harm. Anor was known to run with the stealth of a Yuuzhan Vong Executor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nom Anor's first appeared in 1998 in the premier issue of the Crimson Empire II: Council of Blood Dark Horse Comics series, though his actual species was not identified. He went on to feature in many of the installments of the series. Dark Horse was planning on creating a storyline involving an extra-galactic invasion, and Mike Richardson, one of the authors of Crimson Empire II, intended Anor to play a part in the invasion. Dark Horse also planned to have Anor be an energy creature, but that, like many of their ideas, was not approved by Lucasfilm Ltd., and Del Rey eventually took over the helm for the invasion plot. The authors who brainstormed up what would become The New Jedi Order series saw Anor as a character that could serve as a villain in the first book, Vector Prime, by R. A. Salvatore and released in 1999. The agent also served as the initial inspiration for the Yuuzhan Vong as a species. After his introduction in the first book of the series, Anor went on to play a role as one of the main villains in The New Jedi Order, appearing in the majority of the books in the series, before dying in James Luceno's The Unifying Force, the final novel of the series put out in 2003. In 2011, the agent briefly appeared in Star Wars: Crimson Empire III—Empire Lost, the sequel to the comic book series that he first starred in."}, {"tag": "p", "text": "Due to Anor's prominent role in The New Jedi Order, the Yuuzhan Vong was mentioned in many of the sourcebooks released over the years, including The New Jedi Order Sourcebook and The New Essential Guide to Characters, both released in 2002. The year 2008's The Complete Star Wars Encyclopedia also contained an entry for Anor. Star Wars Miniatures: Universe featured a Nom Anor figurine, and in addition to The New Jedi Order Sourcebook, the agent was mentioned in many guides related to the Star Wars Roleplaying Game, which provided stats for Nom Anor so that he could be interacted with by players in their games."}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia's entry for Qurang Lah states that the warrior witnessed Anor's cowardice firsthand during the fighting at Yag'Dhul, but he was killed by Anor before he could report to the Warmaster. However, although it is possible that Anor could have slain Qurang, since the warrior was not present with the Executor at any point during the fighting this article assumes that the entry's information is false. The New Jedi Order Sourcebook also has a discrepancy with the series, as it has Anor confronting the Jedi strike team in a laboratory on the Baanu Rass and demanding that they surrender. However, since the sourcebook says that a Jedi dies before they escape, and Star by Star does not mention any Jedi dying this way, this article assumes the sourcebook was wrong in that regard. While Anor declined Corran Horn's challenge of a duel in Edge of Victory II: Rebirth, Force Heretic I: Remnant and The Final Prophecy both have Anor and Veila remembering Anor declining a challenge from Anakin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}