{"url": "Nomannic", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:YT-1300 light freighters"], "nodes": [{"tag": "h1", "text": "Nomannic"}, {"tag": "p", "text": "The Nomannic was a standard Corellian civilian YT-1300 transport passing through a customs checkpoint. It was the first craft of several to be inspected by an Imperial TIE Interceptor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Nomannic was a standard YT-1300 transport that was white in color. It was lightly armed with a gun turret for use in self-defense if attacked."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The transport was present at an Imperial customs checkpoint and flew a small path ending in front of a stationary TIE Interceptor \"Gamma 1.\" The TIE pilot was ordered to target the craft and keep it in the Combat Multi-view Display and to watch as it flew slowly reaching the fighter's sensors. The ship's cargo was scanned to contain spice, matching its manifest, so it was allowed to leave. The fighter was then ordered to inspect the other ships surrounding the customs checkpoint, including the Lambda-class shuttle Startour 7; two transports, Seinar T4D and Seinar T5D; the BFF-1 bulk freighter Elorac; and the corvette Ritam. Meanwhile, the Nomannic entered hyperspace."}, {"tag": "p", "text": "The Nomannic's actions were recorded as part of a training simulation used to train future pilots, including Maarek Stele."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nomannic first appeared in the LucasArts 1994 PC game Star Wars: TIE Fighter. Its only appearance was in the Combat chamber's first TIE Interceptor training mission, \"Threat Dispay.\" The craft is coded \"Blue\" in the Combat Multi-view Display, indicating \"Neutral\" and that the ship must be inspected as part of a \"Primary\" objective, which is to inspect all the ships in the area."}, {"tag": "p", "text": "Interestingly enough, the Nomannic also appears in the sequel to TIE Fighter, Star Wars: X-Wing vs. TIE Fighter, in the training mission \"Inspection\", which is an almost exact replica of the Combat chamber mission. Unlike in TIE Fighter, not only can the player pilot any Imperial Fighter in the training mission, but the player can also play as a Rebel fighter and the game treats the scenario as its Rebel Territory. The transport performs the exact role down to its cargo being \"spices.\""}, {"tag": "h2", "text": "Appearances"}]}