{"url": "Nomi_Sunrider", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Females", "Category:Grand Masters", "Category:Humans", "Category:Jedi Consulars", "Category:Jedi High Council members"], "nodes": [{"tag": "h1", "text": "Nomi Sunrider"}, {"tag": "p", "text": "Nomi Sunrider was a Human female who served as a Jedi Master and later Grand Master of the Jedi Order in the days of the Galactic Republic. Born Nomi Da-Boda, she married Andur Sunrider, who was training to become a Jedi Knight, and eventually gave birth to a baby girl, whom they named Vima. During a trip to the Stenness system, Andur was ambushed by gang members of Bogga the Hutt, who were after the Adegan crystals carried by Sunrider and her husband. The ensuing fight witnessed the murder of Andur, and Sunrider's decision to begin down the path to become a Jedi Knight. Sunrider eventually completed her training under the Jedi Master Thon, and was placed in charge of the Jedi relief mission sent to Onderon to aid Ulic Qel-Droma in the Freedon Nadd Uprising. Along with several other Jedi, Sunrider helped Qel-Droma bring about the end of the Naddist Revolt, essentially putting an end to the reign of the Sith on Onderon. Following those events, Sunrider was one of many Jedi to participate in the Great Sith War against the rise of Exar Kun and his apprentice, the fallen Jedi Ulic Qel-Droma. During the war, Sunrider witnessed Qel-Droma slay his own brother Cay and, guided by her intense emotions, used her powers to permanently sever Qel-Droma from The Force. With Sunrider's defeat of Qel-Droma, the Sith War was soon brought to an end."}, {"tag": "p", "text": "Following the devastation of the Great Sith War, Sunrider steadily climbed the ranks of the Jedi and was eventually made Grand Master of the Jedi Order around the time of the Conclave on Exis Station, a conclave which Sunrider had assembled so the Jedi could discuss the rebuilding of the Order following the end of the war. Years after her death, her legacy was preserved in the histories of the Jedi and her stories were retold down through the centuries."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The young woman Nomi Da-Boda married Jedi Knight Andur Sunrider and gave up her maiden name. However, when she began her life with Andur, Sunrider found herself in constant awe of her husband's deep connection with the Force. Although he constantly told her that she too possessed the same power he did, Sunrider could not begin to entertain the thought that she was able to control the Force as her husband could."}, {"tag": "p", "text": "Sunrider lived with her husband on the planet of Darada, and later went with Andur when he was invited to H'ratth by Master Chamma to receive further instruction in the ways of the Force. While on this planet, Sunrider gave birth to a baby girl, whom she and Andur named Vima. After several years of training on H'ratth, Andur had learned everything that his master could teach him, and Chamma instructed Andur to travel to the planet Ambria in the Stenness system to finish his Jedi training under Master Thon. Andur was also provided with several Adegan crystals to give to his new Master. Andur followed Chamma's orders and took his wife, daughter, and the family's personal droid A-3DO aboard the Lightside Explorer to the Stenness system."}, {"tag": "h3", "text": "Ambush"}, {"tag": "p", "text": "After leaving H'ratth, Sunrider and her family arrived at a hyperspace terminal located just outside of the Stenness system. Once the couple had docked at the space station, they were set upon by members of Bogga the Hutt's gang, who had overheard Andur and Sunrider discussing the Adegan crystals they were carrying."}, {"tag": "p", "text": "Several of the criminals managed to apprehend and hold A-3D0 captive, using the droid as a diversion. Andur confronted the criminals, with his family close by, but was attacked by one of the thugs, who threw a gorm-worm at him. The gorm-worm's bite was venomous and fatal, and Andur died within moments of being bitten by the small reptile. Sunrider, upon seeing her husband killed by the criminals, rushed to his side, only to be threatened by the thugs who demanded that she hand over the crystals. At that moment Andur appeared as a Force ghost to his grief-stricken wife and told her that now was not the time for tears, but that she must pick up his lightsaber and defend herself and her daughter. Sunrider reluctantly retrieved Andur's fallen lightsaber and attacked the criminals, killing the one named Quanto along with another. The remaining criminals fled from Sunrider's sudden onslaught and retreated back to Bogga—without the Adegan crystals—to tell him what had transpired."}, {"tag": "p", "text": "However, following the withdrawal of the gang, Sunrider immediately felt immense guilt over killing the two criminals. Andur, though, revealed his Force ghost to Sunrider again and advised her that their time together was over—that she must now walk the road which she was afraid to tread. Sunrider listened as Andur told her that she must continue the journey to Ambria, and once there, find Master Thon, who would train her in the ways of the Force. Sunrider agreed to honor her husband's final wishes, gathering both her daughter and A-3DO into the Lightside Explorer and departed for Ambria. Though Sunrider had not yet started her Jedi training, she could feel Thon's presence in the Force standing out like a torch in a dark room, and used it to find the way to her destination."}, {"tag": "h3", "text": "Arrival on Ambria"}, {"tag": "p", "text": "Sunrider arrived on the ringed world of Ambria, convinced that she was close to finding Master Thon. Trusting her feelings, Sunrider left A-3DO behind with the Lightside Explorer and set out with her daughter, Vima, across the barren landscape of the planet. During her trek, Sunrider came across a foreboding lake that caused her to feel uneasy. While she walked around the lake Sunrider heard voices carried by the wind, which were telling her that only death and chaos lay ahead, and that she would regret everything. Sunrider was confused and concerned by what she was hearing, but then she heard a new voice—one which was calm and quiet—that advised her to not be lured by the power of the dark side."}, {"tag": "p", "text": "Sunrider felt that the second voice was trying to help her, and so she decided to continue on past the lake, ever deeper into the wastes of Ambria. She continued her journey, following the soothing voice as it led her farther away from her ship. Sunrider eventually crossed a small hill and found herself looking down over a valley with a small house built into the side of it. Near the house was a young Vultan riding atop a huge beast; upon seeing the rider, Sunrider immediately knew that she was looking at a Jedi."}, {"tag": "p", "text": "The Vultan Jedi, whom Sunrider believed to be Master Thon, led Sunrider and her daughter back to his home, where he provided food for the two as well as for his bestial mount. Sunrider immediately began to retell the events of the last few days, culminating with Andur's murder and the fact that she did not understand how her husband, a Jedi, could have been killed so easily. Sunrider's host explained that all Jedi were vulnerable if their attentions were not strictly focused on their enemies. He continued by telling Sunrider that over the centuries those who were not Jedi had discovered ways to exploit this vulnerability."}, {"tag": "p", "text": "During this time, Bogga the Hutt had instructed his followers to track the Lightside Explorer as it departed for Ambria—he was determined that the Adegan crystals would not slip away from him again. Bogga had his personal sail barge prepared and he gathered several members of his gang, setting out to follow Sunrider and the treasures she possessed. The Hutt followed the trail left by Sunrider to the barren world of Ambria and landed his sail barge not far from the Lightside Explorer. Bogga immediately set his mercenaries upon the ship in a rabid search for the elusive crystals—during the ravaging of the ship, A-3DO was virtually destroyed by the criminals. Not able to find the crystals on Sunrider's ship, the criminals followed her tracks to the Jedi's home where Sunrider and the child were. Upon discovering the small house, Bogga and his gang immediately set about attacking it and the surrounding property. The Vultan Jedi rushed out to confront the intruders and was forced to defend himself, his home, and those inside it from any harm. However, the young Jedi was soon overwhelmed and knocked out of the fight by one of the criminals. Sunrider, seeing this, believed that the Vultan was going to suffer the same fate as her late husband, Andur. However, at the moment that Bogga ordered his lead henchman to kill the young Jedi, the Vultan's bestial companion attacked the criminals with surprising speed, and managed to blunt their attack singlehandedly—Bogga and his gang retreated back to the sail barge due to the ferocity of the creature's onslaught."}, {"tag": "p", "text": "Following the retreat of Bogga and his gang, it was revealed that the young Vultan was actually a Jedi apprentice of Thon's named Oss Wilum, and that the beastly creature was in fact the one Sunrider had endured so much to see—Master Thon. Wilum advised Sunrider that it was Thon who was going to teach her the ways of the Force, and that her journey as a Jedi was just beginning."}, {"tag": "h3", "text": "Jedi training"}, {"tag": "p", "text": "Over the next several months, Master Thon left Sunrider alone as she dealt with the grief which was still present over Andur's unfortunate death and meditated on what her life as a Jedi would bring. During this time, Sunrider discovered that her daughter had followed a small pack of Neeks and was near Lake Natth—a lake which held the vanquished spirits of dark siders whom Thon had defeated and contained within the lake's shadowy depths. Sunrider watched as a pair of hssiss emerged from the lake and immediately set their eyes on her young daughter—the hssiss, being dark side manifestations of the evil trapped in Lake Natth, projected feelings of darkness through the Force which caused Sunrider to react through instinct."}, {"tag": "p", "text": "Acting on this instinct, Sunrider concentrated and imagined in her mind the two hssiss fighting and killing each other. Suddenly, the two reptiles began attacking and slashing at each other, which allowed Sunrider to gather up her daughter and retreat back to the safety of Thon's homestead. What Sunrider did not yet realize was that she had a natural affinity for the art of battle meditation—a very important and difficult Force skill to learn, even for the most experienced Jedi Masters."}, {"tag": "p", "text": "Eventually, Sunrider was able to come to terms with her husband's death, and Thon began to instruct her in the ways of the Force—although Sunrider was now confident that it was her destiny to become a Jedi Knight, she refused to build, or even wield, a lightsaber. For her, a lightsaber only served as a reminder of when she was forced to kill two of her husband's murderers. Master Thon, however, challenged her views on this, telling her that a lightsaber was not only a weapon to be used for attack and defense—it also provided a Jedi with a focus for their mind, and also strengthened their connection with the Force. To further strengthen his argument, Thon took Sunrider and young Vima out into the wilderness of Ambria, and showed Sunrider an ancient holocron which had been lent to him by Master Arca Jeth; the gatekeeper of the holocron was Master Ood Bnar. Master Bnar proceeded to tell Sunrider the history of the Jedi's age-old fight against the dark side, and concluded by stating that Sunrider would play an important role in the momentous events to come. Sunrider, however, found it difficult to accept that she would do anything important, or that a lightsaber was more than a tool of death—Sunrider still saw the lightsaber as something inherently wrong, and continued to believe that she should distance herself from it."}, {"tag": "p", "text": "Following the teachings of the holocron, Thon advised Sunrider that since she provided him the gift of the Adegan crystals, it was only appropriate that he return the gesture in kind—Thon gave Sunrider his personal lightsaber, the one which he had constructed while learning under his Master, citing the reason that it rightfully belonged to his greatest apprentice. Although Sunrider still refused to use a lightsaber, she reluctantly accepted the gift and placed it among her meager belongings."}, {"tag": "p", "text": "However, this moment was soon interrupted by the arrival of hired space pirates and a large number of thugs from Bogga's gang, who had the sole mission of retrieving the Adegan crystals that the Hutt coveted. Master Thon and Sunrider rushed back to Thon's home, where the pirates were setting up for their attack. Once there, Thon commanded Sunrider to pick up the lightsaber he had given her and to join him at his side for the coming battle—Sunrider, however, refused. Thon became frustrated by his apprentice's stubbornness concerning the lightsaber, and, seeing no other way to convince her to use the physical aspects of her Jedi abilities, he surrendered himself to the pirates. However, while he was being led away, Thon stretched out through the Force and told Sunrider that if she refused to use a lightsaber, then she simply had to focus her Force powers on the pirates if she wanted to save both him and her daughter. At that moment, Sunrider saw through the fog of her remaining grief and apprehension, and concentrated on the image of the pirates and the other enforcers attacking each other; suddenly, the pirates turned on each other, fighting over the crystals. The ensuing confusion allowed Sunrider the time needed to reach the decision which Thon had been trying to show her—that the lightsaber was the weapon of a Jedi, and that she was a Jedi. Upon realizing this, Sunrider picked up her Master's lightsaber and charged into the confused pirates. Sunrider was able to rescue Thon by slicing through the Mandalorian manacles which were holding him. The remaining pirates fled back to their ship under Sunrider's onslaught."}, {"tag": "p", "text": "Eventually, Sunrider would complete her training under Master Thon, and he took her to the Jedi library world of Ossus. Once there, Sunrider was placed under the tutelage of Jedi Master Vodo-Siosk Baas, who guided her in the creation of her very own lightsaber."}, {"tag": "h3", "text": "Revolt on Onderon"}, {"tag": "p", "text": "While Sunrider was studying under Master Baas, the Freedon Nadd Uprising on Onderon had steadily deteriorated for the Jedi on the planet; Jedi Master Arca Jeth had originally been dispatched to Onderon along with Ulic and Cay Qel-Droma, Oss Wilum, and Tott Doneeta to deal with the dark side powers which had mysteriously gained control of the planet. However, not long after defeating the Sith sorceress Queen Amanoa and driving back the dark spirit of the fallen Jedi Freedon Nadd, Master Jeth and the other Jedi were confronted by a new dark side power: a Sith cult, which was known as the Naddists, attacked the procession responsible for taking the sarcophagi of both Amanoa and Nadd to Dxun for burial. The Naddists were able to steal both of the sarcophagi and retreat to their underground headquarters. Also, Master Jeth was captured by King Ommin and subjected to prolonged torture. Qel-Droma, realizing that the situation on Onderon had exploded outside of his control, requested aid from both the Galactic Senate and the gathered Jedi on Ossus. After traveling to Coruscant with Master Thon to meet with the Republic Ministry of Defense, Sunrider went back to Ossus, where she was selected to lead a team of five Jedi in a relief effort for Qel-Droma."}, {"tag": "p", "text": "Sunrider, Dace Diath, Shoaneb Culu, Qrrrl Toq, and Kith Kark traveled to the walled city of Iziz on Onderon, the last reported location of Qel-Droma and the other Jedi. However, when Sunrider and her team arrived at Iziz, they sensed through the Force that Qel-Droma was not in the city, but instead in an abandoned fortress outside the city. Sunrider realized Qel-Droma's location and led the other Jedi in an effort to relieve him. Sunrider led Diath and others in a charge against the more numerous enemy soldiers, projecting a Force shield around themselves, and utilizing Force battle techniques that the Jedi had developed throughout their history. During the fight to reach Qel-Droma, Sunrider demonstrated her superior skills with a lightsaber, which she had learned during her training. However, during the Jedi's charge, Sunrider realized that something, or someone, was blocking her ability to use her battle meditation to influence the battle. Sunrider tried to combat the unseen attacks which she was experiencing through the Force—but the being who was projecting the attacks managed to overwhelm Sunrider's defenses and knock her unconscious. Following the fight, Sunrider was found among the rubble of the battle by Ulic Qel-Droma, and brought back to where the other Jedi were gathered. Eventually, Sunrider and Qel-Droma led the other Jedi against King Ommin's stronghold, launching their initial attack from the courtyard of the lair. Though the Jedi were able to defeat the guards, Ommin halted the Jedi attack by concentrating on his hatred and using its power against Sunrider to throw her against a wall. However, at that moment Qel-Droma charged Ommin and slashed at him with his lightsaber, disarming and neutralizing the old man. With Ommin defeated, Sunrider and Qel-Droma managed to free Master Jeth from his captivity."}, {"tag": "p", "text": "Following King Ommin's defeat by Sunrider's forces and the Jedi under Master Jeth, the remains of Freedon Nadd and Amanoa were transported to and entombed on the jungle moon of Dxun. It was hoped that entombing both sarcophagi on the wild moon would dissuade anyone from stealing them again. Sunrider was among the Jedi present on Dxun during the interment ceremony."}, {"tag": "h3", "text": "The Krath conflict"}, {"tag": "p", "text": "The end of the Freedon Nadd Uprising provided a brief respite for Sunrider and the other Jedi from their duties. During this time, Sunrider was among a number of Jedi who had the rare opportunity to be taught how to ride the native flying beasts of Onderon. The Jedi's rest, however, was cut short by the arrival of Master Arca Jeth, who informed Sunrider and the others of the escalating troubles in the Empress Teta system due to the rise of the Krath, a secret society which had been founded by dark side adepts. Following his briefing of events, Jeth gave out assignments to those gathered: Oss Wilum, Dace Diath, Qrrrl Toq, and Shoaneb Culu were ordered to return to Ossus, and once there they were to inform the combined leadership of the Jedi Order and the Republic about what they had encountered on Onderon and how it was related to the situation that was developing in the Empress Teta system. Sunrider was told that she was to stay, for the time being, with Jeth, and to refine her battle meditation; once that had been completed, both she and Qel-Droma were to travel immediately to the Empress Teta system and personally lead the combined Jedi/Republic effort there."}, {"tag": "p", "text": "Once the leaders of the Jedi and Republic had been made aware of the Krath coup, they organized a joint Jedi/Republic task force to be sent to the aid of Koros Major, the last planet left in the Tetan system resisting the bloody takeover—at the head of this peacekeeping fleet were the Jedi Knights Nomi Sunrider and Ulic Qel-Droma. However, when the joint fleet emerged from hyperspace, it found that Koros Major was under a heavy Krath attack, and it appeared that the battle was almost over."}, {"tag": "p", "text": "At that moment, the joint fleet was set upon by huge space grazers, which were legendary for having once preyed the Republic space lanes, looking for ships to feast upon. Sunrider, though, realized that the huge space grazers were actually illusions created by one strong in the ways of Sith magic. Sunrider continued to concentrate on the enemy fleet, probing as many minds as she could, and eventually touching the mind of a very strong Force-user—Aleema Keto. While probing Keto's mind, Sunrider discovered that a number of the Krath ships were actually Force illusions as well, just as the space grazers were. Sunrider was able to completely invade the mind of Keto and cause her to lose her concentration, thus causing the illusions to fade. However, this was not enough—while many of the ships were illusions, there were still many more that were not. It was too late by the time the Republic leader of the joint fleet, Captain Orley Vanicus, realized what had happened: the Krath, who had realized that the battle was one step away from being turned against them, ordered their ships to act as living missiles, and ram the Republic/Jedi ships."}, {"tag": "p", "text": "The Krath tactic worked, and managed to cause havoc among the joint fleet's ships—the Republic command ship Reliance I was badly damaged when a Krath CX-133 Chaos starfighter crashed into its command deck, and Qel-Droma was severely wounded by shrapnel which had been imbued with Sith magic. While Sunrider tended to Qel-Droma's wounds, the joint fleet was ordered to retreat from the Empress Teta system."}, {"tag": "h4", "text": "Battle of Deneba"}, {"tag": "p", "text": "Following the battle of Koros Major, thousands of Jedi descended upon the planet of Deneba to hold a conclave on Mount Meru, which Sunrider attended. The conclave had been called by the leaders of the Jedi Order to discuss the recent battle at Koros Major, as well as the disturbing reports of Krath attacks on Galactic Republic territory. During the convocation, Sunrider announced that Qel-Droma had a plan through which the Krath could be dealt with. Qel-Droma presented a dangerous scheme to infiltrate the Krath, which would allow him to bring the cult down from the inside. However, many Jedi, including Arca Jeth and Master Shayoto, openly spoke out against Qel-Droma's plan. While the Jedi debated the proposed strategy, Krath war droids descended upon the assembly—the battle saw young Vima snatched by a war droid, only to be rescued by the Cathar Jedi Sylvar, who returned her to Sunrider. Unfortunately, during the fight, Master Arca Jeth was killed by the enemy while defending his fellow Jedi. Qel-Droma was devastated by his master's death, and decided to go ahead with his proposed plan and infiltrate the Krath—he vowed to bring them down from within, no matter the cost."}, {"tag": "p", "text": "Sunrider accompanied Qel-Droma while he prepared for his infiltration mission. Since the first time that Sunrider had met Qel-Droma on Onderon, the two had shared a special bond together. Over the months since that initial meeting, that bond had flourished, and Sunrider had decided that she was ready to love again—even though her love for Andur was always held dear in her heart. By the time of the Conclave on Deneba, Sunrider and Qel-Droma had allowed their feelings for each other to become public and, after discussing with him the dangers that his self-assigned mission held, the two shared a passionate embrace and kiss just before Qel-Droma's departure."}, {"tag": "h4", "text": "Escalation"}, {"tag": "p", "text": "Qel-Droma departed for his mission, but after months of not hearing from the undercover Jedi, Sunrider, Cay Qel-Droma, and Doneeta developed a plan to make contact with the older Qel-Droma on Cinnagar, the Krath's capital world. Sunrider, amongst others, harbored strong feelings that Qel-Droma might have allowed himself to turn to the dark side in order to destroy the Krath. To stop this, Sunrider decided that she must somehow make contact with Qel-Droma. With the help of the other two Jedi, Sunrider was able to successfully insert herself and make her way to the Krath headquarters, where she could sense Qel-Droma through the Force. However, Sunrider realized that the only way she would be granted an audience with him was to allow herself to be captured—and that meant allowing it to be made known that she was a Jedi. Sunrider pulled out her lightsaber and ignited it in front of the Krath palace. She then surrendered to the soldiers who rushed to confront her. However, when she was brought before Qel-Droma, he was forced with a difficult decision—save the woman he loved, and essentially ruin his cover, or allow himself to stay in-character, and therefore treat Sunrider like the Krath expected him to. The other Krath leaders, Satal and Aleema Keto, advised Qel-Droma that leaving Sunrider, a fully-trained Jedi Knight, alive, was too great a risk."}, {"tag": "p", "text": "To Sunrider's horror, Qel-Droma agreed, and advised the Krath that he would personally execute Sunrider the following day—Qel-Droma, however, hoped that Sunrider would use her Force abilities to somehow escape before the morning came. Sunrider, though she was unaware of Qel-Droma's ulterior thoughts, managed to use her battle meditation against the soldiers guarding her cell, causing them to fight and kill each other. The ensuing confusion provided her the opportunity needed to escape the palace and request aid from Cay Qel-Droma and Doneeta, who were orbiting Cinnagar in their ship. However, when Doneeta and the younger Qel-Droma landed, the three Jedi decided that they must get Qel-Droma out while they could—their plans, though, were almost instantly interrupted when Satal Keto appeared to challenge Sunrider and the others. Unexpectedly, Qel-Droma arrived, and announced to Sunrider and the others that it had been Satal who had ordered the Krath attack on Deneba. Sunrider watched as Qel-Droma dueled Keto, but was unnerved when she sensed Qel-Droma strike the man down in anger. At that moment Sunrider, Qel-Droma's brother, and Doneeta tried to grab Qel-Droma and extract him from the planet, but he unleashed a wave of dark side energy which threw them away from him. Sunrider, dumbfounded by what she had experienced, retreated back to the Jedi ship along with Cay Qel-Droma and Doneeta. Upon leaving the planet, Sunrider was heartbroken to learn that she had, once again, lost the man she loved."}, {"tag": "p", "text": "Sunrider, Cay Qel-Droma, and Doneeta returned to Ossus and proposed a plan to the Jedi leaders; Sunrider believed that it was vital that the Jedi launch an attack against the Krath on Cinnagar to allow her and the others to again attempt to extract Qel-Droma, and by force if necessary. Though the masters approved of Sunrider's plan, they cautioned against removing Qel-Droma against his will. They believed that once a Jedi had started down the dark road, it was impossible for that Jedi to go back—the only way to return to the light, they told Sunrider, was for that Jedi to go through the dark path, and learn from their mistakes. Sunrider acknowledged the masters' wisdom and set off for Cinnagar to once again try and persuade Qel-Droma to return to the light."}, {"tag": "p", "text": "Having arrived at Cinnagar, numerous Jedi, including Dace Diath, Oss Wilum, and Shoaneb Culu flew Star Saber starfighters and Stinger-class fighters into battle. Meanwhile, Sunrider, Cay Qel-Droma, and Qrrrl Toq attacked the palace where Qel-Droma waited—while Cay Qel-Droma and Toq battled the Krath soldiers, Sunrider pleaded with Qel-Droma to return to the light and come with them back to Ossus. Qel-Droma again refused Sunrider's pleas, and when she continued to insist, he used a deadly Sith amulet to push her away. Sunrider, who finally realized that Qel-Droma was now one with the dark side, called for a general retreat, saying that they must remember what the masters told them—either Qel-Droma returns of his own accord, or not at all."}, {"tag": "p", "text": "However, little did Sunrider know that, after her retreat from Cinnagar, Exar Kun arrived to challenge Qel-Droma in a fight to the death, to see who would be the most powerful Dark Jedi of the galaxy. During their fight, the ancient spirit of the long-dead Dark Lord of the Sith Marka Ragnos appeared to the two Jedi and anointed them Sith Lords. The new Dark Lord of the Sith and his apprentice vowed to destroy the Republic and the Jedi—the Sith War had begun."}, {"tag": "h3", "text": "The Sith War"}, {"tag": "p", "text": "Not yet realizing that Qel-Droma and the Sith were waging war against the Republic, Sunrider traveled back to Ossus, where she continued to improve her Force skills under the guidance of the ancient Jedi Master Odan-Urr. After Sunrider had successfully learned how to further improve her battle meditation, Odan-Urr decided to teach Sunrider how to combat the Force use of a darksider, forever cutting them off from the Force—he explained to her that this technique was very old and was not used by modern Jedi; however, it had been used against the Sith in the ancient wars."}, {"tag": "p", "text": "Following her teachings with Odan-Urr, Sunrider was among the large number of Jedi to travel to Coruscant in response to the reports that a rogue Jedi Knight had been leading attacks against Republic shipyards. The Jedi, under Master Baas, had prepared themselves to stand before the Galactic Senate and convince them to let the Jedi Order handle the renegade Jedi Knight. However, it soon became known that it was Ulic Qel-Droma who had been leading the attacks on the Republic. While Sunrider and Cay Qel-Droma were astonished to learn that it was Qel-Droma, Coruscant suddenly found itself under attack by the Mandalorian forces of Mandalore the Indomitable, now under the command of Qel-Droma. During the time prior to the Battle of Coruscant, Qel-Droma had earned the allegiance of Mandalore, and planned to fully utilize the Mandalorian warrior clans in his war against the Republic. The Battle for Coruscant turned into a brutal fight between the Jedi and Mandalorians, with Sunrider and the Jedi managing to hold the line and push the Mandalorian invaders back. However, Qel-Droma was able to take a section of Mandalorians and capture the Republic command center, hoping to decide the battle there. Sunrider and the other Jedi quickly arrived and challenged Qel-Droma for control of Coruscant. Qel-Droma, however, did not realize that he had been betrayed by his mistress, Keto, and left to meet the Jedi. Keto ordered a full withdrawal from the planet, and Mandalore, believing that his Lord Qel-Droma was dead, obeyed the order. Qel-Droma was then confronted by the combined might of Sunrider, Master Baas, and many other Jedi, and was forced into captivity when they immobilized him with A wall of light side energy. Sunrider watched as Master Baas handed Qel-Droma over to the Republic officials, who declared that he would stand trial for his crimes and that the punishment would be death."}, {"tag": "p", "text": "Sunrider attended Qel-Droma's trial, and was surprised when he was brought before the Inquisition and defied those present by saying what he had done had been correct, and that he would not renounce his actions or his allegiance to the Sith. Qel-Droma gave an impassioned speech in which he claimed the knowledge of the Sith would free the Jedi and Republic from the chains of oppression they now found themselves in. During the trial, Sunrider admitted to Cay Qel-Droma and Sylvar that this Qel-Droma was no longer the man they had previously known—or the man that she had loved. However, the trial came to an abrupt halt when Exar Kun, Mandalore, and a legion of Massassi warriors arrived, with Kun casting a Sith immobilization spell over the members of the Inquisition. Sunrider begged Qel-Droma again to renounce his allegiance to Kun and the Sith, but Qel-Droma warned her that if she did not stop interfering, then he would be forced to hurt her. Sunrider and other Jedi were forced to watch as Kun killed Master Baas in a violent duel. Following this, Qel-Droma and his allies left Coruscant to continue their war of conquest."}, {"tag": "p", "text": "After the events of Qel-Droma's trial, Sunrider and her daughter Vima accompanied Sylvar to see Master Thon on Ambria for a period of quiet healing and further training. However, the stillness of Ambria was soon shattered as agents of Exar Kun, the bewitched Jedi Oss Wilum and Crado, arrived and called forth a number of deadly hssiss from Lake Natth to kill the three Jedi. The ensuing fight was fierce and Sunrider, Sylvar, and Thon all defended each other from the vicious dark side reptiles. Eventually, they were able to kill all of the hssiss and Thon managed to capture Oss Wilum. Sunrider and Sylvar were able to get Wilum back to Thon's homestead, where Master Thon was ultimately able to purge the Sith magic from Wilum's system."}, {"tag": "p", "text": "As the Sith War grew in size, so did the devastation. Following the explosion of a star by Aleema Keto at Kemplex IX, the resulting supernova put the Jedi planet of Ossus directly in its path of destruction. As a result, hundreds of Jedi, including Sunrider, descended upon the library world to help evacuate as much Jedi lore as possible. However, while the Jedi were busy loading ships with information, Sunrider and Cay Qel-Droma both sensed Qel-Droma approaching the planet in a personal starship. Believing that his brother had finally returned to the Jedi in their time of need, Cay Qel-Droma took his own ship and went to meet his older brother. Qel-Droma, though, shot his sibling's fighter down and, once on the ground, proceeded to attack his brother in a deadly lightsaber duel. Sunrider, along with Doneeta, watched as Cay Qel-Droma's fighter crashed into Ossus; they then attempted to make their way to him. However, by the time they reached the two brothers, Qel-Droma had again given into his anger and murdered his brother. Sunrider, upon witnessing Cay Qel-Droma's murder, found herself overcome with grief and torment, and unleashed her powers upon the now grieving Qel-Droma. Sunrider effectively cut Qel-Droma off from the Force, severing all connections that he could previously experience. Qel-Droma, feeling pain over his brother as well as defeated by the effects of Sunrider's punishment, repented and agreed to help Sunrider and the other Jedi end the war which he had helped start."}, {"tag": "p", "text": "Following Qel-Droma to Exar Kun's secret temple on Yavin 4, Sunrider and the other Jedi decided that they needed to create a solid wall of light side energy to be able to combat the dark effects of Exar Kun's Sith magic. Hundreds of Jedi descended into the atmosphere of Yavin 4, and together they were able to create the wall of light—with Sunrider using her superior powers to help direct the energies. However, their efforts had unforeseen effects as Sunrider watched the light side wave turn the surface of Yavin 4 into a blazing inferno. Sensing the death of the planet, Sunrider and the Jedi believed that nothing could have survived the enormous, worldwide fire. The Jedi departed the jungle moon, and set about rebuilding the Republic and the Jedi Order."}, {"tag": "h3", "text": "Head of the Order"}, {"tag": "p", "text": "With the Great Sith War behind them, Sunrider and the Jedi set about rebuilding the Order as well as the Republic. Over the next ten years Sunrider gained more and more responsibility, and the leaders of the Jedi decided to declare Sunrider, as the Grand Master, and Sunrider saw it as her responsibility to call the first Jedi conclave since the end of the Sith War. Sunrider's reasons for calling the conclave were twofold: she hoped that the gathered wisdom of the Jedi would allow for a more progressive mandate in helping to further rebuild the Republic, and she wanted to assure those gathered that the Order was, indeed, being rebuilt under her guidance."}, {"tag": "p", "text": "However, the conclave did not go as Sunrider had originally planned it would; Sylvar, who had fought beside Sunrider in the Sith War, led the gathered Jedi into a discussion on the fate of Ulic Qel-Droma, who, by law, was a convicted war criminal, yet was being allowed to wander the galaxy as a free man. Following the conclave, it was discovered that her daughter had run away from Exis Station to unknown parts of the galaxy, and Sunrider was left to worry and ponder over her daughter's seemingly constant rash decisions. Vima had become disillusioned with her mother's hesitation to train her to become a Jedi—Vima felt that her mother was more of a politician for the Jedi, rather than her mother or master. As a result, Sunrider's daughter secretly left her mother to search out a master who would further her training in the ways of the Force. Vima decided on one who had once been known as the greatest of the Jedi Knights—Ulic Qel-Droma. Sunrider, upon learning what her daughter had done, immediately began planning to find her."}, {"tag": "p", "text": "While meditating upon the best way to recover her daughter, Sunrider began to reflect on her life and her almost legendary career as a Jedi. Sunrider remembered that it was not her choice to become a Jedi, but instead that she had been forced by the circumstances of the time to pick up where her husband had left off—she realized that that was the difference between Vima and herself: Vima had made her choices of her own free will. Although young Vima had constantly asked Sunrider to advance the Jedi training they had begun together, Sunrider had consistently grew into her role as Grand Master, often neglecting her daughter's training. Upon reaching this understanding, Sunrider allowed her anger at her daughter to melt away, and instead she admitted to herself that there was no better example for young Vima than Ulic Qel-Droma to show her the cost of being a Jedi. However, upon this realization Sunrider began to question if Qel-Droma was indeed the best teacher for her daughter. Not wanting Vima to be harmed by the possible teachings of Qel-Droma, Sunrider departed Exis Station for the frozen planet of Rhen Var where her daughter was being trained."}, {"tag": "p", "text": "Sunrider arrived on Rhen Var and found Qel-Droma and her daughter training in a frozen fortress amidst the planet's tundra plains. The reunion of former lovers was a somber affair, with Vima advising her mother that she would not be returning home—Qel-Droma was her master now. Qel-Droma, however, understood why Sunrider had arrived, and advised her that if she was prepared to take Vima back as an apprentice, then Qel-Droma's tutelage of her daughter was complete; he harbored no ill feelings towards Sunrider and still only wanted what was best for her and her daughter. To demonstrate to her mother the progress of her training, Vima took Sunrider to the side of an ice-covered mountain, where Qel-Droma had shown her how to let the Force guide her actions—the end result had been an enormous sculpture being carved by Vima in the likeness of her late father, Andur. Sunrider, upon seeing this, recognized that Qel-Droma's training had indeed helped her daughter progress her training as a Jedi."}, {"tag": "p", "text": "During this time, however, Sylvar had arrived on Rhen Var in search of Qel-Droma, intending to execute him for his past crimes. Through the Force, Sunrider sensed a clash break out between the angry Cathar and the former Jedi. Sunrider and her daughter arrived just in time to watch the final stages of the vicious, one-sided duel—Qel-Droma, realizing that continuing to defend against Sylvar's attacks only fed her anger, switched off his lightsaber and refused to carry on the fight. In a surprise change of events, Sylvar discovered that she could not strike down the defenseless man, regardless of his history—Sylvar was ashamed to admit that it was Qel-Droma's choice to sacrifice himself at that moment which had shown her the errors of her dark ways. At that moment, however, Sunrider was horrified as Qel-Droma's chest was ripped apart by a powerful blaster shot—through their long-forgotten bond of love, Sunrider felt the pain of the blaster bolt in her body as it burned through Qel-Droma. The pilot who had transported Sylvar to the frozen world had seen his chance for eternal glory by killing the one-time Sith, and had decided to take it. While the vigilante escaped back to his ship, Sunrider held the dying Qel-Droma—to her surprise his physical body vanished, leaving her holding his tattered Jedi cloak. Sunrider realized that it had been her daughter's love which had shown Qel-Droma the path to redemption; and although he could no longer touch the Force, Vima advised her mother that Qel-Droma had still possessed the heart of a Jedi. Following Qel-Droma's death, Sunrider and her daughter returned to the Republic with a new sense of commitment to the Force—a commitment which helped them both further accept their destinies."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Nothing is known of the eventual death of Nomi Sunrider, except that future members of the New Jedi Order were taught about her legendary deeds."}, {"tag": "p", "text": "Sometime before the Great Galactic War, Nomi's personality and knowledge were imprinted on the Noetikon of Light, one of three Noetikons. This device was stolen from the Jedi Temple on Coruscant during the returned Sith Empire's assault on the planet. During the Cold War it was recovered by an unknown Jedi Consular in an attempt to find a cure for a strange sickness afflicting the Jedi Master Yuon Par."}, {"tag": "p", "text": "Following the death of Emperor Palpatine and the destruction of the second Death Star, Luke Skywalker took it upon himself to reestablish the Jedi Order. During this time, he searched the galaxy for Force-sensitives whom he could invite to join him on Yavin 4 to study at his Jedi Praxeum. Among the Force-sensitives that Luke found was a silver-haired woman by the name of Tionne, who had a keen interest in the history and lore of the ancient Jedi. Prior to her joining Luke's Praxeum, Tionne had met an informant on Ord Mantell who had accidentally stumbled across the long-forgotten Exis space station—the same Exis Station where Sunrider had held a Jedi conclave thousands of years earlier. Traveling to Exis Station, Tionne was met by Luke, who had received the coordinates from the same informant that had helped Tionne. Tionne managed to find ancient data plaques which contained the speech given by Sunrider during the Conclave at Exis Station. Tionne played the speech for Luke who, after seeing Tionne's dedication to preserving the Jedi's history, offered her the opportunity to study with him on Yavin 4. Tionne was also known to have been fond of singing ballads of Sunrider, allowing her music to tell the ancient Jedi's story."}, {"tag": "p", "text": "In 22 ABY Tionne and Master Ikrit, along with Anakin Solo, Tahiri Veila, and Uldir Lochett, found an antique ship on Vjun which had previously been the property of Darth Vader. Due to the ship's dimensions, it was ideally sized for the smaller Ikrit as a personal vessel, and he named it the Sunrider after Nomi Sunrider, whom he held in high esteem. This name was symbolic of Ikrit's choice to lay down his lightsaber, just as Nomi Sunrider made the similar, though eventually temporary, decision to give up her weapon after killing two of her husband's murderers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Throughout her life Sunrider experienced many degrees of love. As a young woman Sunrider fell in love with the young Jedi Andur Sunrider, and proceeded to marry him—eventually, their love for one another produced their child, Vima. Sunrider, however, was devastated when she watched her beloved husband be murdered by criminals. Though her grief was great, Sunrider still had her daughter Vima, and was eventually able to allow herself to love again when she met another young and powerful Jedi by the name of Ulic Qel-Droma. However, fate would intervene as the Krath conflict, followed by the Sith War, would be unleashed on the galaxy. The ensuing galactic turmoil forced events in motion which caused Qel-Droma to turn to the dark side, betraying the Jedi and Republic, and ultimately breaking Sunrider's heart. Although Sunrider had been gifted with two great love affairs, she had also been cursed by losing both men she had given her heart to. However, even though she had had her loves taken from her, she kept holograms of both Andur and Qel-Droma—to remind her of the times they had shared together."}, {"tag": "p", "text": "Sunrider's love also manifested itself in another way—through her daughter. Ever since Vima was a young child, Sunrider constantly protected her from the darkness of the galaxy. During the time of her training under Thon, Sunrider used her latent Force abilities to save her daughter from a pair of hssiss from Lake Natth. The tumultuous events of the Great Sith War again caused a threat to her daughter when Sith agents unleashed hssiss against Sunrider and Vima. Once again, Sunrider protected her daughter from the giant reptiles. Eventually, Vima grew into her teenage years and ran away from her mother so she could be taught by the exiled Jedi, Qel-Droma. Sunrider, fearing for her daughter's safety, followed her daughter to Rhen Var, but was confronted by her former love. Seeing the good work that Qel-Droma was doing with her daughter's training, Sunrider allowed herself to remember the times when she had been happy with Qel-Droma. When Qel-Droma was killed, Sunrider experienced his death through their Force-bond, which had been created during the days when they had been lovers."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Early in her life, Nomi Sunrider was recognized as having enormous Force potential, but it remains unknown why she was not selected by the Jedi Order for training while she was an infant. However, once she married Andur, her husband constantly made her aware of her Force sensitivity, and incessantly pushed her to seek training as a Jedi. Following Andur's death, Sunrider chose to continue on to Ambria, where she eventually trained under Master Thon. Thon immediately recognized Sunrider's Force potential and eventually trained her into his most powerful student. Sunrider's sensitivity to the Force allowed her to become one of the most powerful and accomplished users of the art of battle mediation—a skill which only a handful of Jedi had previously been able to fully master."}, {"tag": "p", "text": "Although Sunrider initially refused to take up a lightsaber following her husband's murder, she eventually became an adept swordswoman once she understood the meaning of a lightsaber to a Jedi. During the Freedon Nadd Uprising, Sunrider was among a handful of Jedi to be sent as reinforcements to Qel-Droma, and during the ensuing battle to reach him, Sunrider demonstrated her expert lightsaber skills by fighting, and defeating, a large multitude of the enemy singlehandedly. Later, during Qel-Droma's invasion of Coruscant, Sunrider used her saber skills to help hold the Republic line against the invading Mandalorians. As the war progressed, Sunrider was again provided an opportunity to demonstrate her prowess with a lightsaber when agents of Exar Kun used Sith magic to attack Sunrider, Sylvar, and Thon with a pack of hssiss. However, the three Jedi managed to combine their efforts and destroy the dark side creatures."}, {"tag": "p", "text": "During her training under Master Urr, Sunrider was taught the unique ability of combating a dark siders use of the Force by pulling the users' powers away from them, essentially cutting them off from the Force. The only time that Sunrider used this ability was during the Great Sith War following the murder of Cay Qel-Droma by his brother Ulic. Sunrider, while being influenced by her emotions, effectively cut Qel-Droma off from the Force—an act which would deny Qel-Droma the ability to touch the Force for the rest of his life."}, {"tag": "p", "text": "Additionally, Sunrider was chosen due to her superior powers to direct the full force of the Wall of Light erected by thousands of Jedi to trap the spirit of Exar Kun on Yavin 4. This was especially impressive considering that among the thousands of Jedi was her own Master, Thon, who was known to possess powers that even the Masters of Ossus had no knowledge of. Millennia after her death, Sunrider's powers continued to inspire awe; she was grouped as one of three elite Jedi Masters mentioned by the Hutt Jedi Knight Beldorion as prodigiously skilled in the use of the light side of the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nomi Sunrider was designed by artist Janine Johnston, who illustrated Tales of the Jedi 3, where Sunrider made her first appearance. Tales of the Jedi writer Tom Veitch. who wanted a female artist to create the character, specifically chose Johnston, who modeled Sunrider after a friend of hers. Johnston also designed Nomi's husband Andur, and imagined the family as \"Earth warriors.\" David Roach drew the next two issues of the Saga of Nomi Sunrider arc, and while he drew Sunrider in a different way, Dark Horse Comics editors changed some of his artwork to match Johnston's earlier portrayal of Sunrider."}, {"tag": "p", "text": "During the writing of the Tales of the Jedi comic series, Dark Horse Comics introduced several characters with the last name \"Sunrider.\" However, due to a legal issue surrounding the name \"Sunrider,\" future use of the name ceased. As a result of this, it appears that Lucasfilm was allowed continued use of their characters as long as the last name of \"Sunrider\" was not used. However, there have been several instances where the last name was used, most notably in roleplaying sourcebooks as well as in The New Essential Chronology."}, {"tag": "p", "text": "Many readers of the Tales of the Jedi comics have noted that Nomi Sunrider's hairstyle changed dramatically in the sub-series titled The Freedon Nadd Uprising. The main difference between the initial hair style and the one in this sub-series is that Sunrider appears to have the upper-front portion of her head shaved with small braids intersecting the baldness, while still maintaining the long hair which characterized her in second sub-series titled The Saga of Nomi Sunrider, where her character was first introduced. However, Sunrider's hair style repeatedly changed back and forth throughout the entirety of the comic series, disrupting the continuity of her appearance. An explanation for this is that when the character of Nomi Sunrider was first introduced, she was penciled by artists Janine Johnston and David Roach in The Saga of Nomi Sunrider; following this was The Freedon Nadd Uprising sub-series, which was entirely penciled by artist Tony Akins with the other sub-series being penciled by several different artists. Therefore, Sunrider's constant hairstyle changes could be seen as artistic interpretations."}, {"tag": "p", "text": "According to Chris Avellone, Jolee Bindo's story in Star Wars: Knights of the Old Republic where he discusses Sunrider was an oversight: for legal reasons, the developers could not use the name \"Sunrider,\" to the point of having to invent a new character, Bastila Shan, instead of reusing Sunrider's daughter Vima Sunrider for the game. But at one point, Jolee does call her \"Nomi Sunrider\" in a conversation with the player. In the sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, there is an item called \"Nomi's Robe\" (and another called \"Nomi's Armband\" which can be purchased on Nar Shaddaa), but its description only mentions \"Nomi\" and \"Andur,\" without the last name \"Sunrider.\" In Star Wars: The Old Republic, it is revealed that Sunrider's maiden name is \"Nomi-Da-Boda\"."}, {"tag": "p", "text": "In the game Star Wars Galaxies, the player can find a lightsaber crystal with the name \"Sunrider's Destiny,\" which could have possibly been named after Nomi Sunrider, or another member of the Sunrider family."}, {"tag": "p", "text": "While Andur and Vima both have established, canonical homeworlds, Sunrider does not. While it is shown in the pages of The Saga of Nomi Sunrider that Sunrider lived with Andur on the planet of Darada prior to going to H'ratth, it is never stated that Darada is her homeworld. Likewise, the Tales of the Jedi Companion openly states in Andur's entry that he was born and raised on Darada, and that Vima was born on the planet of H'ratth. Although it can be ascertained that Sunrider's birth world may have been Darada, it has never been canonically stated as such."}, {"tag": "p", "text": "The character of Nomi Sunrider was also portrayed in the two radio adaptations of Tales of the Jedi. In the Tales of the Jedi audio drama, Sunrider was voiced by Melanie Mitchell. Likewise, in the Tales of the Jedi: Dark Lords of the Sith audio drama, Sunrider's character was voiced by Glynnis Talken Campbell."}, {"tag": "p", "text": "On September 29, 2008, a new novel centered around Nomi Sunrider was announced in a blog by Sue Rostoni. It was in development by Alex Irvine, and was tentatively titled Mandorla. It was to be a hardcover novel, and was tentatively scheduled for a September 2012 release.\nIt was confirmed as cancelled on February 29, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}