{"url": "Nonvideor-class_minelayer", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Alliance starship classes", "Category:Minelayer classes", "Category:Stealth ship classes"], "nodes": [{"tag": "h1", "text": "Nonvideor-class minelayer"}, {"tag": "p", "text": "The Nonvideor-class minelayer was a small stealth minelaying warship, operated by a crew of twenty, that was used by the Galactic Alliance's naval fleets during the Second Galactic Civil War. Equipped with powerful hyperdrives and payloads of space mines, five of the minelayers were deployed by the Galactic Alliance to create a pair of mine rings around the planet Fondor in 41 ABY, but they were destroyed before they could do so after their hyperspace reversion coordinates were betrayed to the enemy."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Nonvideor-class minelayers were small warships with stealth capabilities that were equipped with disproportionately strong hyperdrives for their size. Operated by twenty crew members, the minelayer class had a payload of Merr-Sonn Vigilante space mines that used a network to self-deploy, reducing the time that it took to disperse the complement of mines, as conventional mine laying was not required. The vessels also had communications systems, though it was impossible to make contact with a Nonvideor-class minelayer while it was in stealth mode."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Nonvideor-class minelayer was used as a warship that could utilize its powerful hyperdrive to arrive close to a target, deploy its complement of mines, and retreat back into hyperspace as quickly as possible. The minelayers' stealth equipment, as well as the self-deploying mines' ability to decrease the time needed for mine laying, aided the starships in completing their missions undetected."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nonvideor-class minelayers were adopted for use by the Galactic Alliance's navy in the years following the Swarm War, which ended in 36 ABY. In 41 ABY, as the Galactic Alliance engaged the Confederation and the Jedi Coalition in the Second Galactic Civil War, Galactic Alliance Chief of State and Sith Lord Darth Caedus set his sights on reclaiming the shipyards of the planet Fondor, following the world's secession to the Confederation. In advance of a task force of the Galactic Alliance Fourth Fleet, five Nonvideor-class minelayers were dispatched to sow a double ring of mines around the entirety of Fondor in order to cut off the planet before the Fourth Fleet commenced its assault a week after the shells had been laid. The Nonvideor-class minelayers were supposed to be able to deploy their payloads within an hour of reaching Fondorian space."}, {"tag": "p", "text": "However, co-Chief of State Cha Niathal betrayed the Galactic Alliance plan for Fondor to Jedi Grand Master Luke Skywalker. As a result, instead of completing their mission unseen and unscathed, the five minelayers were ambushed at their reversion points as soon as they exited hyperspace to begin their mine laying. All took direct hits from enemy fire, which detonated the mines in their cargo and destroyed the minelayers, killing the crew. When the Imperial II-class Star Destroyer Anakin Solo and the task force from the Fourth Fleet arrived at Fondor, they discovered the debris fields of the Nonvideor-class minelayers at the reversion points, and Caedus realized that they had been betrayed. The Second Battle of Fondor that soon ensued would end with a Jedi Coalition victory and Niathal taking a third of the Galactic Alliance Defense Fleet's strength to the side of the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nonvideor-class minelayers first appeared, albeit as debris fields, in Karen Traviss' Legacy of the Force: Revelation, the eighth novel in the Star Wars: Legacy of the Force series, published in 2008. The minelayer class later received an entry in The Complete Star Wars Encyclopedia, also released in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}