{"url": "Astrography", "categories": ["Category:Legends articles", "Category:Scientific specialties"], "nodes": [{"tag": "h1", "text": "Astrography"}, {"tag": "p", "text": "Astrography was the study of locations and variations in natural and artificial phenomena in the galaxy. In other words, it was the science of mapping interstellar space."}, {"tag": "h2", "text": "Astrography of the galaxy"}, {"tag": "p", "text": "The galaxy was of SBa type and it was 120,000 light-years across. The Astrographic Survey Institute was responsible for much mapping after the Galactic Civil War."}, {"tag": "p", "text": "There were approximately 400 billion stars and around half of these had planets that could support life. 10% of those developed life, while sentient life developed in 1/1000 of those (about 20 million)."}, {"tag": "p", "text": "The galaxy was divided into several regions, listed here in ascending order of distance from the core. These regions were further divided into various sectors, systems, and planets."}, {"tag": "h3", "text": "Deep Core"}, {"tag": "p", "text": "At the very heart of the galaxy, the Deep Core (a.k.a. Core Systems) was a small region that hid unusual worlds. Due to the gravitational pull of the vast number of stars, local space-time was severely warped, making hyperspace travel difficult at best. The region was thought to be inaccessible until Emperor Palpatine found several safe hyperlanes into the region. The area remained an Imperial stronghold almost twenty years after the Battle of Endor."}, {"tag": "h3", "text": "Core Worlds"}, {"tag": "p", "text": "An ancient region bordering the outlying areas of the Deep Core, the Core Worlds were some of the most prestigious, well-developed, well-known, and heavily populated planets in the galaxy. The Core Worlds were the original areas of Human occupation. The Galactic Republic and subsequently all galaxy-wide governments were born in the Core Worlds and spread out over the galaxy. Humans are theorized to have originated from this region."}, {"tag": "h3", "text": "Colonies"}, {"tag": "p", "text": "The Colonies was the name given to a region of the galaxy between the Core Worlds and the Inner Rim. It was among the first areas outside the Core to be colonized, and the worlds there were typically heavily populated and industrialized."}, {"tag": "p", "text": "During its reign, the Galactic Empire was very forceful in controlling the Colonies, and as a result, the New Republic gained support quickly there."}, {"tag": "h3", "text": "Inner Rim"}, {"tag": "p", "text": "The Inner Rim was a region of the galaxy between the Colonies and the Expansion Region. It was originally just called \"The Rim,\" as it was expected to be the farthest extent of the known galaxy for centuries, but the Expanded Rim (later renamed the Expansion Region) was opened within a hundred years of the Inner Rim."}, {"tag": "p", "text": "During the reign of Palpatine, the Galactic Empire ruthlessly controlled the Inner Rim. Rather than rebel, many residents chose to flee to the Outer Rim Territories."}, {"tag": "p", "text": "After the Battle of Endor, the Empire, despite its unpopularity, held the region far longer than expected; many later resented the New Republic's sluggishness in liberating the region. Many worlds, despite joining the New Republic, were openly afraid that the government was not strong enough to maintain power. Their concerns were borne out following the return of Palpatine, when the Empire reclaimed most of the Inner Rim."}, {"tag": "h3", "text": "Expansion Region"}, {"tag": "p", "text": "The Expansion Region was an experiment in corporate-controlled worlds, with powerful corporations exploiting and profiting heavily from the planets for their raw materials, metals, and ores. Inhabitants were oppressed, while the corporations stripped entire stellar systems of all their resources. Eventually civil unrest spread from system to system. The Galactic Republic eventually took control of the system, due to mounting pressure from its denizens, by limiting or evicting corporate interests. Expansion Region worlds continued to be producers of raw materials and ores. However, most natural resources had been exhausted by the Imperial era."}, {"tag": "h3", "text": "Mid Rim"}, {"tag": "p", "text": "With fewer natural resources (and therefore a smaller population) than many neighboring regions, the Mid Rim was a territory where residents worked hard for everything they had. Several planets built up impressive economies, and pirate raiders often hid in the relatively unexplored spaces far from major trade routes."}, {"tag": "h3", "text": "Outer Rim"}, {"tag": "p", "text": "The Outer Rim Territories was the last widely settled expanse before Wild Space and the Unknown Regions. It was strewn with obscure worlds, and rugged, primitive frontier planets. Due to its distance from the Core, the region was home to many supporters of the Rebel Alliance. The Empire's Grand Moff Wilhuff Tarkin was assigned the difficult task of bringing the entire Outer Rim in line."}, {"tag": "h5", "text": "Tingel Arm"}, {"tag": "p", "text": "The Tingel Arm was an exterior spiral arm of the galaxy, located along the edge of the Outer Rim. It contained the Corporate Sector Authority, a political entity which was semi-independent of the Galactic Republic and the Galactic Empire. Under the Galactic Empire, the sector expanded from a few hundred to thirty thousand systems."}, {"tag": "h3", "text": "Beyond the Outer Rim"}, {"tag": "p", "text": "There were several sectors beyond the Outer Rim, on various arms of the galaxy."}, {"tag": "h4", "text": "Wild Space"}, {"tag": "p", "text": "Wild Space was the frontier of galactic society, separating the known parts of the galaxy from the Unknown Regions. One of Palpatine's last acts was to open up much of the region to more extensive exploration. Wild Space differed from the Unknown Regions in that some of Wild Space was explored, though not extensively; the Unknown Regions remained completely mysterious."}, {"tag": "h4", "text": "Unknown Regions"}, {"tag": "p", "text": "The term \"Unknown Regions\" most commonly referred to the large, unexplored region (which some interpreted to have been outside the plane of the galactic disk) between Bakura and the Imperial Remnant, which was largely dominated by the Chiss Ascendancy. The Unknown Regions comprised only a few billion stars, out of a galactic total of 400 billion. For reasons yet to be demonstrated there was a lack of reliable hyperspace routes through the region. The \"Unknown Regions\" designation included uncharted areas in dense nebulae, globular clusters, and the galactic halo."}, {"tag": "h2", "text": "Traffic Routes"}, {"tag": "p", "text": "Various established \"ways\" such as hyperlanes passed through the sectors. These routes were explored and established by spacers known as hyperspace explorers (like Gav Daragon and Aitro Koornacht). Astromech droids had the responsibility of guiding spaceships through these routes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}