{"url": "Nossor_Ri", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Admirals and generals", "Category:Confederacy of Independent Systems individuals", "Category:Galactic Republic individuals", "Category:Males", "Category:Quarren"], "nodes": [{"tag": "h1", "text": "Nossor Ri"}, {"tag": "p", "text": "Nossor Ri was a Quarren male chieftain active during the Clone Wars. Initially loyal to the Mon Cala monarchy, he defected and led the Quarren Isolation League. Tensions led to the Battle of Mon Cala, where Ri and the Quarren Isolation League joined the Confederacy of Independent Systems while the monarchy was supported by the Galactic Republic. Eventually, Ri and his faction became disillusioned and returned to the Republic, and with the combined forces were able to defeat the Separatists."}, {"tag": "p", "text": "Ri was killed during the mission to Mon Cala in orbit above Mon Cala while distracting First Order Star Destroyers. His sacrifice allowed for the Resistance and Aftab Ackbar's starship to escape Mon Cala and the First Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "By the time of the Clone Wars, Nossor Ri held the position of chieftain and represented the Quarren on Mon Cala. He was a dear friend of King of Mon Cala Yos Kolina before Kolina's death. When Kolina's son, Prince Lee-Char was to be crowned king, Ri and his Quarren Isolation League eventually defected to the Confederacy of Independent Systems. After the Battle of Mon Cala erupted between the Mon Cala monarchy and the Galactic Republic against the Quarren Isolation League and the Separatists, led by Riff Tamson, Ri and his group became disillusioned with the Separatist cause. Ri came to Lee-Char's aid, saving him from execuction by the Seperatists. The Quarrens helped the Republic forces defeated Tamson's droids, and Ri accepted Lee-Char as the king."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Imperial Era, Mon Cala came under occupation by the Galactic Empire. Ri was tortured during that time, leaving scars which would persist decades later."}, {"tag": "h3", "text": "First Order/Resistance War"}, {"tag": "p", "text": "By the time war erupted between the First Order and the Resistance, Ri held the rank of general and angrily confronted Resistance leader Leia Organa when she arrived on Mon Cala seeking their help. Ri was interrupted by Aftab Ackbar, which caused Ri's advisor, Chadkol Gee, to contact the First Order."}, {"tag": "p", "text": "After Organa's meeting with king Ech-Char ended poorly, the Resistance agents engaged in the Ancient Rite of Challenge. When Rose Tico intervened between Rey and Arkay-Nine, it was Ri who called for their exile in accord with the law."}, {"tag": "p", "text": "However, after their ship was sabotaged by one of Ri's agents, Chadkol Gee, the Resistance came to an agreement with the King for ships. As the First Order arrived to attack the Resistance at Gee's behest, General Ri volunteered as a distraction to atone for his agent's actions. He flew his fighter, and as the First Order Destroyer opened fire, he radioed his defiance. His sacrifice worked to allow the Resistance and Aftab Ackbar's starship to escape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nossor Ri was voiced by Corey Burton in Star Wars: The Clone Wars."}, {"tag": "p", "text": "Before the cancellation of The Clone Wars, in episodes envisioned for the unfinished seventh season, Nossor Ri would have been murdered near the end of the Clone Wars conflict, allowing for Tikkes to be appointed the political leader in his place. This can not be considered canonical, as Nossor Ri was depicted as having survived until after the Battle of Crait in the comic series Star Wars: Allegiance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}