{"url": "Nosteen", "categories": ["Category:Canon articles", "Category:204th Imperial Fighter Wing members", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nosteen"}, {"tag": "p", "text": "Nosteen was a human male TIE fighter pilot who served as a captain in the Galactic Empire's 204th Imperial Fighter Wing during the Galactic Civil War. Commanding a squadron, he appointed Lieutenant Yrica Quell as his second-in-command. Two weeks after the Battle of Endor in 4 ABY, Nosteen led his squadron in escorting TIE/sa bombers as part of a genocide on the planet Nacronis. Vortex detonators dropped by the bombers stoked siltstorms and the captain fell victim to a lightning strike."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A human male, Nosteen served as a TIE fighter pilot, holding the rank of captain, in the Galactic Empire's 204th Imperial Fighter Wing during the Galactic Civil War. He commanded a TIE fighter squadron of the 204th and appointed Lieutenant Yrica Quell as second-in-command upon her transfer to the squadron. Fourteen weeks later, around 4 ABY, the 204th was tasked with the destruction of civilization on the marshland planet Nacronis as part of Operation: Cinder, the Empire's contingency plan following the death of the Emperor two weeks prior."}, {"tag": "p", "text": "Nosteen's squadron was tasked with defending TIE bombers from Rebel Alliance forces while the bombers dropped vortex detonators that stoked Nacronis's siltstorms. The captain, though was killed during the mission, after his fighter was hit by a bolt of lightning. Quell took command of the remaining pilots. In 11 ABY, six years after the conclusion of the Galactic Civil War, Nosteen's name was brought up by Quell when she and fellow veterans Chass na Chadic and Wyl Lark mentioned victims of the war during a get-together."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nosteen was first mentioned in the 2019 novel Alphabet Squadron, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}