{"url": "Not_for_Nothing", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Not for Nothing"}, {"tag": "p", "text": "\"Not for Nothing\" is a short story in the anthology From a Certain Point of View. The story, written by Mur Lafferty, focuses on the band Figrin D'an and the Modal Nodes."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The chapter is presented as an excerpt from Ickabel G'ont's memoir The Lady Has a Jocimer: My Life as a Modal Node, A Memoir. Ickabel complains about her band Figrin D'an and the Modal Nodes' stay on the hot, arid world of Tatooine. The band had initially planned to play for Jabba Desilijic Tiure, the ruling Hutt crime lord on Tatooine. While their trip was supposed to last a week, it ended up lasting over a year. Ickabel soon learns that the band is in serious debt to a Hutt who has sold them into indentured servitude on Tatooine. Once they have paid off their debt, their plan is to find their way offworld."}, {"tag": "p", "text": "For several months, the Modal Nodes bid their time performing gigs on Tatooine. Ickabel recalls that Figrin D'an had a bounty on his head and that the Rodian bounty hunter delivered him to Jabba. When Jabba doubled the debt, D'an counter-offered information instead of more credits and brought Greedo down. Jabba released the band but dumped them in the middle of the desert. The band traveled to Mos Eisley where they rent two cheap rooms for the eight of them. After resting, Ickabel explores the town and encounters stormtroopers who are looking for the droids C-3PO and R2-D2."}, {"tag": "p", "text": "Ickabel replies that she has not seen the droids. The stormtroopers then leave to search for an astromech droid resembling R2-D2 in the area of the Hutt's domicile. Ickabel enters Chalmun's Spaceport Cantina and finds D'an and Tech Mo'r speaking with the cantina's Wookiee owner Chalmun. She finds D'an arguing with the Rodian musician Doda Bodonawieedo, whom Chalmun fires. Chalmun allows the Modal Nodes to play at his cantina and D'an tells Ickabel to round up the rest of the band; taking comfort that they have the Wookiee on their side."}, {"tag": "p", "text": "Ickabel and the Modal Nodes play on the same fateful day when Luke Skywalker and Obi-Wan Kenobi enter Chalmun's Cantina with C-3PO and R2-D2. Ickabel also witnesses Kenobi chopping of Ponda Baba's hand with his lightsaber. Ickabel is spooked when the band's old adversary Greedo enters the cantina. The band continues playing despite the rowdy atmosphere. They also watch Han Solo and Chewbacca interacting with the bar's manager Wuher. Out of gratitude for Han and his companions not reporting them to Greedo, they decide not to report the humans to the stormtrooper patrol that enters the cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}