{"url": "Nouane_system/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Inner Rim star systems"], "nodes": [{"tag": "h1", "text": "Nouane system"}, {"tag": "p", "text": "The Nouane system was a star system located in the Inner Rim region of Nouane. The system contained the eponymous planet Nouane, which served as the capital of the region since the early days of the Galactic Republic, when the area was a thriving mini-empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Nouane system was located in the region of space known as Nouane, an Allied Region of 212 star systems located in the area of the Inner Rim known as the Northern Dependencies. The system's most important planet was the world also named Nouane, which had served as the capital of the region since its days as one of the countless mini-empires found throughout the galaxy in the early years of the Galactic Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Since the early days of the Republic, approximately 25,000 BBY, the Nouane system—and the planet Nouane in particular—served as the heart of the eponymous region, which had become a bustling empire of 212 star systems located near the northeastern edge of the Inner Rim. Gradually, over time, the Republic expanded across the galaxy, enveloping the comparatively small government. Though the region was not a member of the Republic, ministers from the Nouane system held considerable power on various worlds within the galactic government."}, {"tag": "p", "text": "Thousands of years later, the nomadic Mandalorian warriors raged a crusade against the Republic. They launched a series of attacks into Republic space from their homeworld in Mandalorian space, and one of their Coreward invasion routes passed directly through the Nouane system. As a result, the warriors conquered the regional capital. The beleaguered Nouanese people called upon the Republic for assistance, and once the Mandalorians were driven away, Nouane space joined the Republic as a semi-autonomous Allied Region. The region would enjoy this status through the end of the Republic and the early years of the Galactic Empire. Once the Empire was defeated, the Nouane region again declared its independence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nouane system, along with the planet that shares its name, first appeared in 2009's The Essential Atlas, written by Daniel Wallace and Jason Fry."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}