{"url": "NovaSword_Space_Superiority_Fighter", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems starfighter classes", "Category:Starfighter classes", "Category:Subpro Corporation products"], "nodes": [{"tag": "h1", "text": "NovaSword Space Superiority Fighter"}, {"tag": "p", "text": "The NovaSword Space Superiority Fighter was a Subpro Corporation starfighter designed during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The NovaSword was a nimble, powerful craft that had numerous improvements over the aging Z-95 Headhunter. With fair shielding, high speed and maneuverability, and an integrated hyperdrive, the NovaSword was a capable and versatile craft that could act as an interceptor, scout, or even a light bomber."}, {"tag": "p", "text": "A large starfighter, the NovaSword had a large and roomy flight cabin, so much so that cabin access was through a ramp on the ventral surface of the ship, as opposed to an opening canopy. Further, the flight controls and chairs for pilot and passenger were parallel and equally spacious, with a center control console dividing the two."}, {"tag": "p", "text": "This worked well with the NovaSword's design philosophy; built to be operated by a single pilot, the second seat could hold a copilot, commander, systems operator, or engineer depending on the mission profile. This allowed a small organization to assign a single trained pilot and still have an effective fighting force, or for a larger outfit to assign two crew per ship for additional utility."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The NovaSword was Subpro Corporations attempt to break out into the larger galactic market; despite the fact it had designed some of the most successful starfighters of its era (such as the Z-95 Headhunter), it's location far from the Core caused it to be seen as a second-rate designer. Further, though it made many designs built by the Incom Corporation, Subpro never received a full share of the money made, nor the extensive credit for its part in creating these designs."}, {"tag": "p", "text": "Ultimately, Subpro designed the NovaSword to combat this, and the design was projected as a success; Supro's reputation, however, prevented the Republic (and, later, the Empire) from buying any of the craft, with the craft's high price relegating sales to wealthier groups. Sales remained low, and relatively few were built - the NovaSword was commonly sold to private buyers as a result, typically mercenaries and bounty hunters, with only a few small fleets being sold to Planetary defense forces."}, {"tag": "p", "text": "The Confederacy of Independent Systems purchased several dozen NovaSwords for their elite fleet commanders, with Durge using one as his personal fighter for most of the Clone Wars. When the X-wing starfighter debuted several years later, however, the NovaSword was largely forgotten."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}