{"url": "Nova_Stihl", "categories": ["Category:Legends articles", "Category:Death Star residents", "Category:Enlisted stormtroopers of the Galactic Empire", "Category:Humans", "Category:Males", "Category:Martial artists", "Category:Redeemed Force-sensitives"], "nodes": [{"tag": "h1", "text": "Nova Stihl"}, {"tag": "p", "text": "Nova Stihl was a Force-sensitive Human male Guard Sergeant in the Imperial Marines and a Death Star Trooper stationed aboard the first Death Star in 0 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nova Stihl was assigned to the garrison on the penal planet of Despayre during the construction of the Death Star. An unarmed combat specialist and Teräs Käsi practitioner, he trained prisoners in the basics of self-defense. His goal with the demonstrations was to help the weaker prisoners defend themselves against the predators in the prison. Stihl had always been somewhat philosophical, and was also aware of his ability to anticipate his opponents' attacks, a skill which he called \"Blink.\" While on the planet, he formed a loose friendship with Celot Ratua Dil, a Zelosian prisoner who aided him in his demonstrations."}, {"tag": "p", "text": "When violence on the prison planet lowered by twelve percent thanks to Stihl, he was transferred from the garrison to the Death Star in orbit. On the station, Stihl continued his self-defense classes. On a night out celebrating one of his squadmates' forthcoming engagement, he went to the Hard Heart Cantina. There, he was attacked by a drunk patron, whom he easily defeated in a short brawl. He then met the cantina's bouncer, Rodo, and he instantly recognized him as a fellow fighter. Rodo later interrupted Stihl after a class, and challenged him to a few rounds of sparring, although the fight ended quickly, when both men realized that they were evenly matched."}, {"tag": "p", "text": "During his time on the Death Star, Stihl had nightmares that revolved around him fighting off a group of men, sometimes alone, sometimes with the help of another. The dreams always seemed to end with his death. When he reported his nightmares to one of the Death Star's surgeons, Dr. Kornell \"Uli\" Divini, Uli discovered that Stihl had a midi-chlorian count of more than five thousand after the nightmares persisted, thus revealing Stihl was Force-sensitive. Nova was awoken one night during the destruction of Despayre, a test for the Death Star's superlaser. When he realized what had happened, he was shocked at what the Empire had done. He then encountered Celot Ratua Dil, who had escaped onto the Death Star, but decided not to turn him in, as they were all still recovering from Despayre's destruction. Stihl, because of his Force-sensitivity, sensed the deaths that occurred on Alderaan when the Death Star used its superlaser to destroy the planet. The effect of so many deaths in the Force knocked him unconscious. Nova decided then and there that the Empire was evil, no matter what excuses they might make, as there was no excuse for destroying a planet full of innocent civilians."}, {"tag": "p", "text": "Eventually, Stihl met Memah Roothes, the bartender of the Hard Heart who was Rodo's friend, an architect named Teela Kaarz, Villian Dance, an Imperial TIE fighter pilot, Atour Riten, chief librarian aboard the Death Star, all in the Hard Heart, where he also ran into Divini again. During a \"hypothetical\" conversation, the group decided that they could no longer be part of anything that could kill innocents on a massive scale."}, {"tag": "p", "text": "Following the destruction of Alderaan, Stihl was part of the guard detachment sent to hunt down and capture Han Solo and Chewbacca. He had previously received a Force vision in a dream of this experience and chased them, but a flash of Force-sensitivity convinced him to let them escape. Once they had cleared a set of closing blast doors, Stihl held the pursuers up long enough by claiming that the manual release was faulty and would not open the doors."}, {"tag": "p", "text": "The group planned to escape through a medical carrier, and got their chance during the Battle of Yavin. With the exception of Riten, who was forced to stay behind to ensure the others could flee, all of them attempted to escape. However, they encountered several guards outside the landing bay, and Stihl and Rodo had to stay behind and fight off an Imperial squad who tried to stop them. Stihl recognized the fight from his dreams, and knew what it meant. However, he continued fighting to allow the others to escape. He and Rodo defeated several troopers in a large fight using only their unarmed combat skills, fighting off a group of fifteen soldiers, but they were both killed, Stihl eventually succumbing to a blaster shot to the face."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The novel Death Star describes Stihl wearing the 18-piece suit of stormtrooper armor and being one of the stormtroopers who chase Han Solo and Chewbacca aboard the Death Star. However, earlier the book calls him an army trooper. Elsewhere, his description seems to indicate he is one of the Death Star troopers in the Death Star conference room when Cass tells Grand Moff Tarkin the Rebels had deserted Dantooine. The authors of the novel seem to believe army troopers, Death Star troopers, and stormtroopers are identical, just wearing different uniforms, whereas previous Expanded Universe sources indicate they are distinct, the Death Star troopers belonging to the Imperial Navy (not Army) and the Stormtrooper Corps being a separate entity. It is possible the \"Imperial Marines\" represent an elite group that cross-trains in all three branches, although this is only speculation. In addition, the novel states that he is assigned the job only when a guard is sick and that he is not frequently given that task. In his case it is stated that they like having a soldier proficient in hand-to-hand as well as ranged combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}