{"url": "Nova_flare", "categories": ["Category:Legends articles", "Category:Starfighter tactics"], "nodes": [{"tag": "h1", "text": "Nova flare"}, {"tag": "p", "text": "The Nova flare was a special anti-capital ship tactic developed in part by Commander Wedge Antilles of Rogue Squadron. First utilized sometime during the Galactic Civil War (possibly just after the Battle of Endor), the nova flare, at its most basic level, involved massed barrages of proton torpedoes or concussion missiles fired from starfighters and aimed at specific points along the shields of a capital ship. The tactic was first used by the pilots of Rogue Squadron, along with the Y-wings of Aggressor Wing under the command of Colonel Horton Salm during an engagement over Ciutric IV."}, {"tag": "p", "text": "During the Bacta War, the former New Republic pilots used the tactic to great effect to bring down the Victory II-class Star Destroyer Corrupter. The former Rogues would later use the same tactic, albeit with a minor variation that allowed for a much greater effect, during the Battle of Thyferra to severely cripple the Super Star Destroyer Lusankya. During this engagement, the Rogues linked the targeting telemetry of proton torpedoes fired from launchers affixed to their force of freighters to the telemetry from their starfighters' targeting computers, greatly increasing the widespread devastation and effectiveness of the tactic."}, {"tag": "p", "text": "However, this tactic could be countered if the captain of the capital ship being attacked was sensible enough to roll his warship in order to present undamaged shields to his attackers; this enabled the crew to repair and/or reinforce the weakened side. In turn, however, the starfighters executing the nova flare could still maneuver to reorient their fire against the damaged shields or where they had failed completely. Generally speaking, the more and larger the volleys of torpedoes or missiles that a capital ship faced, the less chance it had of surviving the encounter; this held true no matter the relative size of the warship under attack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}