{"url": "At-la%27o", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bridge cities", "Category:Confederacy of Independent Systems cities", "Category:Galactic Empire cities", "Category:Trade Federation cities"], "nodes": [{"tag": "h1", "text": "At-la'o"}, {"tag": "p", "text": "This bridge city was one of the many cities on Cato Neimoidia, and one of the largest cities on the Neimoidian controlled purse world.[source?] It was the location of Lott Dod's palace."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Jedi Council suspected Rush Clovis, the senator representing the InterGalactic Banking Clan, of conspiring with the Confederacy of Independent Systems. They needed a trustworthy senator to get close to Clovis to determine the extent of his treachery. Senator Padmé Amidala was selected by the council due to her past relationship with Clovis. She at first refused until she was informed of his suspected Separatist ties. She invited Clovis to dinner at the Senate Building dining commons where he expressed his interest in rekindling both their professional and personal relationship. When Amidala expressed a similar desire, Clovis asked that she accompany him to Cato Neimoidia where he was to have a meeting with Trade Federation senator Lott Dod. She agreed and they traveled together aboard her personal J-type star skiff with C-3PO, R2D2, Captain Typho and Jedi Knight Anakin Skywalker disguised as the ship's pilot."}, {"tag": "p", "text": "They arrived on Cato Neimoidia and landed at Lott Dod's palace. After disembarking from the skiff, they were greeted by Dod and two of his gold-colored servant droids. Dod led them into the main foyer of the palace where Clovis requested Amidala be shown to her quarters while he and Dod conducted their business meeting. After she and C-3PO were left alone in her suite, she left to reconnoiter the palace under the guise of wanted to take a walk."}, {"tag": "p", "text": "At the same time, Clovis and Dod were meeting with Geonosian Archduke Poggle the Lesser in the library about a massive new droid foundry on Geonosis that was largely funded by Clovis and the Banking Clan. Dod and Poggle demanded a larger share of the profits than was agreed upon and Clovis refused. When they noticed Amidala approaching, the hologram projection table around which they were standing was quickly deactivated and their discussion stopped. Amidala stated she was wandering the library because she was lonely and desired Clovis' company. Clovis warmly greeting her and escorted her out of the library. Dod and Poggle noticed the affection their cohort showed towards his companion and conspired to poison Amidala to force Clovis to acquiesce to their demands by offering an antidote to the poison."}, {"tag": "p", "text": "That evening, Dod offered a toast to Amidala to signify their new friendship and presented her a poisoned glass to drink from. They then sat down to a formal dinner in the dining hall. At the conclusion of the meal, Amidala began to feel faint from the effects of the poison but attributed it to having stood up too quickly. Clovis escorted her on a tour of the library during which Amidala requested a drink of water."}, {"tag": "p", "text": "After the end of the Clone Wars, the city, like the rest of the planet, was absorbed into the Galactic Empire, following the dissolution of the Trade Federation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}