{"url": "Atai_Molec/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems individuals", "Category:Males", "Category:Slavers", "Category:Zygerrians"], "nodes": [{"tag": "h1", "text": "Atai Molec"}, {"tag": "p", "text": "Atai Molec was a male Zygerrian advisor to Queen Miraj Scintel, ruler of Zygerria. He served as the Prime Minister of Zygerria and the Captain of the Guard. After Scintel's death, Atai took her place as ruler of Zygerria. Married to a Zygerrian woman, he was the father of Hordem and Sono Molec."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars Atai Molec worked with Count Dooku during the Battle of Kiros. He was receiving the slaves from Kiros and was beside Dooku when the Sith Lord commanded Darts D'Nar to bring Jedi Master Obi-Wan Kenobi to him on his knees. Molec then ran into Anakin Skywalker dressed in Zygerrian armor, who claimed to have news of Bruno Denturri. On Queen Miraj Scintel order he brought Skywalker, claiming to be Lars Quell to the Queen. After Kenobi was captured trying to free Governor Roshti, Kenobi was held captive and tortured by the Zygerrians. Molec recognized Kenobi from the hologram. Molec then informed the Queen of his discovery and had Kenobi brought to the auction. When Skywalker revealed himself to be a Jedi, a fight broke out in the arena between the Jedi and the Zygerrians. Molec was subdued by Ahsoka Tano. She was then knocked out by the Queen. After the fight, Molec taunted Tano, who was in a cage above the palace, that once Skywalker was subdued, she would belong to him, to do with whatever he wanted. Tano pushed him off the edge of the building telekinetically, nearly causing him to fall to his death. Molec then proceeded to shock Tano multiple times through her shock collar. Molec then, unbeknownst to his queen, invited Count Dooku to Zygerria. Molec informed his queen of Dooku's arrival and brought her to the palace to speak with the Separatist leader. There, the Queen told the Count of her plan to enslave the Jedi. Though Dooku was impressed with her plan, he was only interested in wiping out the Jedi and ordered the Queen to execute Skywalker. When she refused, Molec and Dooku betrayed her, saying that the Jedi (omitting Tano) must die and that she was unfit to be queen. After Scintel's death, Molec ascended to the throne as the king."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Atai Molec was first introduced to the Star Wars universe in the Star Wars: The Clone Wars comic book series' first story arc, Slaves of the Republic, that ran from September 10, 2008 to May 13, 2009. The story arc was later adapted for screen by the Star Wars: The Clone Wars television series, spanning the episodes \"Kidnapped,\" \"Slaves of the Republic,\" and \"Escape from Kadavo.\" The televised episodes effectively supplanted the comic series' former place in canon. Actor Ricardo Mamood Vega voiced Atai Molec in The Clone Wars television series."}, {"tag": "p", "text": "The Friends Like These roleplaying game adventure book, published December 8, 2016 by Fantasy Flight Games, made mention of Atai Molec and his history after the Clone Wars while discussing his newly introduced son, Sono Molec."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}