{"url": "Nrin_Vakil", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Galactic Alliance individuals", "Category:Males", "Category:Personnel of Delak Krennel's regime", "Category:Quarren", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Nrin Vakil"}, {"tag": "p", "text": "Nrin Vakil was a Quarren pilot who flew for Rogue Squadron. He joined the squadron after the mission on Mrlsst. Vakil saw himself as a knight, and wore a modified flight suit filled with salt water to remind himself of home."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Interaction with Ibtisam"}, {"tag": "p", "text": "Initially, his Quarren heritage brought Vakil into conflict with the Mon Calamari officer, Ibtisam in the squadron. However, Nrin was quite aloof with all his squadmates, and liked to complain. During the mission on Malrev IV, it appeared he had a panic attack during a ground battle with the native Irrukiine but he was actually rushing back towards his X-wing to use it as an anti-personnel weapon. This caused Ibtisam to begin to re-evaluate her feelings towards Nrin."}, {"tag": "p", "text": "During that particular mission, members of the squadron like Tycho Celchu and Ibtisam had strange dreams, influenced by the Devaronian dark side adept Cartariun. Ibtisam dreamed of Nrin addressing a crowd on Mon Calamari where he was blaming the Mon Calamari for the woes on the planet. Ibtisam dreamed that she could influence his mind and played a practical joke on him. When recounting the dream to the Bith squadron member, Herian I'ngre, she remarked that Nrin seemed so passionate and eloquent which appeared to further pique her interest."}, {"tag": "p", "text": "The campaign on Brentaal IV saw Ibitsam shot down which forced Nrin to face up to his feelings for his comrade. Her return to the squadron after being rescued by Kapp Dendo saw the two take the first steps towards a relationship. However, their relationship was not to be, as during a mission to rescue Sate Pestage, Ibtisam was shot down and killed in action. During the evacuation, Pestage was obliged to share a shuttle with Ibtisam's body but he refused. Nrin overheard this and became incensed, attacking the former Grand Vizier. He was pulled off by his fellow pilots and Pestage realized that he would not really have a place in the New Republic and sought refuge with Admiral Delak Krennel who strangled him to death."}, {"tag": "h3", "text": "Thrawn campaign"}, {"tag": "p", "text": "Saddened by Ibtisam's death and wanting to think things over, Nrin requested a transfer from Rogue Squadron and spent time training new recruits. However, the Thrawn campaign meant that the New Republic had to shift some of its assets about and Nrin was flying combat missions again. During this time, Nrin was promoted through the ranks to Major."}, {"tag": "p", "text": "Once Thrawn was defeated, the New Republic decided to go after the breakaway warlords as they did not have the protection of the central Empire, and it was predicted that they would fall in short order. During the mission against Delak Krennel, it became apparent that something big was happening in the Ciutric Hegemony. Information about the Hegemony was somewhat lacking, so it was decided that Rogue Squadron would conduct a number of reconnaissance missions. Nrin returned to the squadron to pilot a T-65BR X-wing reconnaissance starfighter otherwise known as a \"snoopscoot\". He survived the trap at Corvis Minor and helped in the liberation of the prisoners from the Lusankya. Tycho Celchu recognized his commando abilities and sent him with Corran Horn and Ooryl Qrygg to free the prisoners from Ciutric IV."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "He later married Koyi Komad, the Twi'lek chief mechanic for Rogue Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nrin was invented to place a Quarren into the series, after Isplourrdacartha Estillo (originally intended to be a Quarren) was made into a Human. The 2008 novel Luke Skywalker and the Shadows of Mindor mistakenly calls the character \"Nin.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}