{"url": "Ntthan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:New Republic Defense Force personnel", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Ntthan"}, {"tag": "p", "text": "Ntthan was a Human male starship captain who served the New Republic as a major. Following the destruction of the New Republic headquarters on the moon Da Soocha V by the reborn Emperor Palpatine, Ntthan was assigned to run supply convoys to the new temporary hideout on the world of New Alderaan. During one such run, Ntthan was captured by the Galactic Empire and brought to Bast Castle, an Imperial fortress on the planet Vjun. There, Dark Jedi Kvag Gthull tortured him for over twelve hours, until Ntthan finally told him the name and location of New Alderaan."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Convoy captured"}, {"tag": "p", "text": "Ntthan was a Human male pilot and starship captain who served the New Republic in the course of the Galactic Civil War against the Galactic Empire. During his service in the New Republic armed forces, he attained the rank of major and was twice decorated for exceptional bravery."}, {"tag": "p", "text": "In 10 ABY, the reborn Galactic Emperor Palpatine destroyed the New Republic headquarters on the fifth moon of the planet Da Soocha with the Galaxy Gun superweapon, forcing the New Republic to take refuge on the world of New Alderaan, where Princess Leia Organa Solo had been hiding her children, the twins Jacen and Jaina. In this troubled period of time for the New Republic, Ntthan was assigned to run supply convoys to New Alderaan."}, {"tag": "p", "text": "During one such supply run through an uncharted region of space, Ntthan's convoy encountered an Imperial Star Destroyer. Ntthan and the crew of the convoy tried to bluff their way out of the situation, claiming that they were mere smugglers. However, the Empire was aware of Ntthan's ties to the New Republic, and the convoy's crew was taken captive and delivered to Bast Castle on the planet Vjun, the former stronghold of the Sith Lord Darth Vader. Ntthan was eventually handed over to the Dark Jedi Kvag Gthull, the chief interrogator at Bast Castle."}, {"tag": "h3", "text": "Dark Jedi interrogation"}, {"tag": "p", "text": "Gthull began questioning Ntthan to learn the location of the New Republic base he was supplying, as Palpatine intended to locate and abduct the Solo children in order to turn them over to the dark side of the Force. When Ntthan refused to speak, Gthull and other members of the Dark Side Elite, a cadre of Dark Jedi serving Palpatine, began torturing the major. Meanwhile, Ntthan's prolonged absence worried his New Republic allies, but they were unaware of his capture and could not risk trying to contact him due to fear of exposing their location."}, {"tag": "p", "text": "Ntthan was subjected to painful procedures administered by an interrogation droid, but he resisted the interrogation for twelve hours on end, refusing to betray his allies and forcing Gthull to increase the amplitude of the droid's interrogation techniques. Eventually, Palpatine himself arrived to take command of his underlings and went to check on the results of the major's questioning. By that point, Ntthan could not withstand the pain anymore and revealed the location and name of New Alderaan to Gthull, before falling unconscious and then being dragged to a cell. Meanwhile, Palpatine assembled his forces and drove the New Republic from New Alderaan but failed to capture the Solo children."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Major Ntthan's meritorious service to the New Republic made him a known commodity to the Empire, which played to Ntthan's disadvantage during his capture, as his bluff of being a smuggler was easily seen through. Accustomed to keeping strict timetables, Ntthan made a reputation for himself of always arriving on time, which made his delay with the supplies worrisome for the New Republic forces on New Alderaan."}, {"tag": "p", "text": "While being questioned by Palpatine's Dark Jedi, Ntthan tried to resist their torture for hours. However, even as a pilot twice awarded for exceptional bravery, he eventually cracked under their interrogation techniques and betrayed the New Republic's secret base on New Alderaan. Ntthan had black hair and light skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Major Ntthan was created for the 1995 comic book Dark Empire II 6, which was written by Tom Veitch and illustrated by Cam Kennedy. He later appeared in the comic's audio dramatization, although he has no lines of dialogue except for screams of pain. The narration in the Dark Empire II comic book identifies Ntthan as an \"alien.\" However, Kennedy's artwork portrays the character as a Human."}, {"tag": "p", "text": "The Dark Empire II audio dramatization differs from the comic in some respects regarding Ntthan's role in the story. In the audio adaptation, Ntthan's interrogation is performed by Executor Xecr Nist, who uses scarab droids filled with poison, while in the comic Kvag Gthull questions Ntthan using an interrogation droid. Additionally, on New Alderaan, the news of Ntthan's delay is delivered to Organa Solo by her husband, Han Solo, whereas the comic shows this exchange taking place between Organa Solo and Winter, the caretaker of the Solo children."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}