{"url": "Nozzo_Naytaan/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Red Squadron personnel", "Category:Tierfon Yellow Aces personnel"], "nodes": [{"tag": "h1", "text": "Nozzo Naytaan"}, {"tag": "p", "text": "Lieutenant Nozzo Naytaan was a male starfighter pilot in the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Prior to the Battle of Yavin, Naytaan deserted his Imperial TIE squadron after being ordered to bombard civilian targets on Pulassas Minor. Joining the Rebel Alliance, he led the Tierfon Yellow Aces' relief effort to Clak'dor VII in the Mayagil sector, before being assigned to Red Squadron. A dazzingly skilled pilot, he became an ace in only two missions, and was considered by Red Leader Garven Dreis and General Jan Dodonna to be the squadron's most promising pilot. However, it was feared that Naytaan's career would be cut short by his excessive recklessness, a trait that his friend and squadmate Theron Nett worked to curb."}, {"tag": "p", "text": "By 0 BBY, Naytaan had attained the rank of lieutenant. He flew as Red Nine in the Battle of Yavin, during which he witnessed Dreis' unsuccessful attack run on the Death Star, erroneously observing that the squadron leader had hit the station's thermal exhaust port, before being killed in action."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the relief effort to Clak'dor VII and the Battle of Yavin, Naytaan flew a T-65 X-wing starfighter/Legends modified to have extra cargo room."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Naytaan as pictured in the Special Edition Limited is portrayed by actor Jack Klaff. The film's credits actually list Klaff as the character John D, so the CCG creators made an error in naming him Naytaan. The character John D has since been given the last name \"Branon\". According to Leland Chee, Klaff's character is still considered to be John D. with Naytaan being a different pilot."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}