{"url": "Nuclear_bomb", "categories": ["Category:Legends articles", "Category:Weapon stubs", "Category:Nuclear bombs", "Category:Weapon types"], "nodes": [{"tag": "h1", "text": "Nuclear bomb"}, {"tag": "p", "text": "Nuclear bombs were powerful explosives whose power derives from nuclear reactions; capable of ruining neighborhoods or cities. The bombs left residual radiation after their detonation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The nuclear weapons used by the Mandalorians during the Mandalorian Wars were silver missiles with long, tubular bodies and red nose cones. On the aft end of their silver bodies, they had four fins."}, {"tag": "p", "text": "The destruction capable by these weapons varied, but almost any nuclear missile could level a city. Most had a blast radius of 30 kilometers, and could deal heavy radiation damage up to a 100 kilometer radius."}, {"tag": "p", "text": "The bomb was detonated using nuclear fission. Most nuclear weapons used a radioactive substance known as uranium because of its large and unstable nucleus."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3963 BBY, after Mandalorian Neo-Crusaders invaded Galactic Republic space and initiated the Mandalorian Wars, the Mandalorians procured a supply of nuclear missiles. On the eve of the Battle of Serroco, several Force-sensitives across the galaxy experienced visions of a Mandalorian bombardment that would devastate the planet of Serroco's surface. A former Padawan, Zayne Carrick, who was actually on that world when he saw this stowed away aboard a Republic ship and announced that he was a Jedi so he would be taken to their flagship, the Courageous. However, upon discovering that Carrick had been accused of perpetrating the Padawan Massacre of Taris the commander of the Republic fleet, Saul Karath became convinced that he was misleading them on behalf of the Mandalorians."}, {"tag": "p", "text": "Nuclear weapons were also used during the Battle of Jebble by Cassus Fett to completely wipe out the Rakghoul plague that had spread to many of the Mandalorians there. This led to a sudden and severe melting of the ice that covered the planet."}, {"tag": "p", "text": "It was said that HAVw A6 Juggernauts could produce heat levels approaching that of a nuclear bomb."}, {"tag": "p", "text": "In 33 BBY, the Sith Lord Darth Sidious (alter ego of Senator Palpatine of Naboo) orchestrated the execution of a complex plot involving the procurement of a proscribed nuclear weapon to assassinate his own Sith Master Darth Plagueis (alter ego of IBC kingpin Hego Damask). To accomplish this, he covertly solicited, then manipulated the services of some of the galaxy's most feared crime lords and organizations, including Black Sun overlord Alexi Garyn and notorious gambler Gardulla Besadii the Elder, all of whom, in some way, held Damask in contempt. Foremost among them was King Ars Veruna of Naboo, who felt Damask was working to undermine his wealth-building ventures and remove him from the throne; Sidious led Veruna to believe that the King himself was the originator and organizer of the nuclear-weapons plot (indeed, it was Veruna who would issue the actual order) to kill Damask."}, {"tag": "p", "text": "Meanwhile, Sidious sent his Zabrak assassin-apprentice Darth Maul to infiltrate the 'gambling prison' Cog Hive Seven, secure the nuclear device from the prison's enigmatic recluse Iram Radique, and deliver the bomb to Komari Vosa and her Bando Gora terrorists—who would then deliver it to its target: the obscure moon Sojourn, Plagueis' private outpost. The mission failed, however, and Damask survived to mete out vengeance on those responsible. Sidious, of course, oversaw most of the avenging missions, as his master, in the end, did not hold him suspect as one who would eliminate him by nuclear blast (such as was Veruna, whose final fate Plagueis attended to himself)."}, {"tag": "p", "text": "An Imperial nuclear warhead was captured by the Rebel Alliance from the freighter Gafra during Operation Strike Fear. The warhead was then smuggled onto the Star Destroyer Invincible, destroying it from the inside."}, {"tag": "p", "text": "By the time period shortly following the Battle of Yavin in 0 BBY, nuclear weapons were usually found only in the Outer Rim Territories or beyond."}, {"tag": "p", "text": "Leia Organa believed the planet Shiva IV to have been the setting for a devastating war in which nuclear bombs had been used. Imperial General Bentilais san Sk'ar later tried to bombard the planet with anti-matter bombs, but was stopped by the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}