{"url": "Null-class_Advanced_Recon_Commando", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Clone trooper variants", "Category:Null-class Advanced Recon Commandos"], "nodes": [{"tag": "h1", "text": "Null-class Advanced Recon Commando"}, {"tag": "p", "text": "Numbering only six, the Null-class Advanced Recon Commandos were the first clones of Jango Fett created by the Kaminoan cloners, and the prototypes for the Grand Army of the Republic. They were deemed a failure by the Kaminoans and were not put into mass-production, but were saved from termination by Mandalorian mercenary Kal Skirata who later adopted all of them."}, {"tag": "p", "text": "All of the Nulls were named after Mandalorian warriors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kaminoans attempted to enhance the Fett genes: the initial production run produced six \"uncommandable\" young clones. They were designated Null-class and slated for termination, and they were saved from destruction by Kal Skirata, a Mandalorian training sergeant hired by Jango Fett to train clone commandos. The next batch of clones, 100 of them, were designated the Alpha-ARCs and trained by Fett himself."}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Kal volunteered to train them as \"black ops\" commandos, named them, and taught them their Mandalorian heritage—sequestered from the other clones throughout their training. Even before two years of age, Ordo and his Null brothers had already undergone flash instructions and live ordnance tests, obtaining immeasurably high scores. After completing their accelerated growth they trained in Mandalorian military and survival combat to kill and destroy by any means possible."}, {"tag": "p", "text": "During training, the Nulls also endured near-death \"training\" torture to become resistant to interrogation. Kal taught his clone troopers an interrogation resistance technique of shutting out reality to become someone who was not being interrogated. This technique could be done by visualizing putting the pain and fear in a box, by concentrating on its physical reality so minutely that it fragmented and ceased to register, by imagining that one were somewhere else, or by focusing on the next moment one could bear to think about—the next meal, second or step, time after time until the ordeal ended."}, {"tag": "p", "text": "They also had special training for the essentials of warfare them being: assassination, black ops, anti-terrorism, covert ops, espionage, slicing, and medicine. Kal furthered their training, teaching them how to handle a wide variety of weapons: from blaster rifles to Verpine sniper rifles and hand-to-hand combat. Later in their training, they learned the skills of maneuvering in zero-g."}, {"tag": "h3", "text": "Life during training"}, {"tag": "p", "text": "Under Kal's supervision, the Nulls were separated from the other clones throughout their training. The other clones only ever saw the Nulls around Tipoca City when they were stealing equipment or sabotaging systems. Darman of Omega Squad remembered the Nulls scaling the supports of the huge domed ceilings, swinging around hundreds of meters above the floor, and placing blaster fire to within centimeters of the Kaminoan technicians. Fett's unaltered clone son Boba Fett angered the Nulls by saying that his father could beat Kal whenever he wanted. Ordo retaliated by sticking Boba's head down a refresher."}, {"tag": "p", "text": "Under Skirata's supervision they learned to use their fierce independence, innate creativity, and physical superiority with their training in advanced combat, weapons and vehicles to become virtual one-man armies. The Null ARCs were quite unpredictable by clone standards, loyal only to Skirata and other Nulls."}, {"tag": "h3", "text": "Genes"}, {"tag": "p", "text": "Early during the clone army's development, Jango Fett and his Mandalorian military advisers advocated the creation of clones capable of handling covert missions too delicate for the standard units."}, {"tag": "p", "text": "Before the clones' gestation, the Kaminoans changed Fett's DNA to ensure the dominance of behavioral genes that emphasized such qualities as loyalty, aggression, and discipline lest the clones act too independently."}, {"tag": "p", "text": "To achieve the desired results, the Kaminoans altered the clones' aging process: each null would age at twice the rate of regular human beings. At the age of ten, a null would resemble Jango Fett in his early twenties and therefore was fit and prepared for combat."}, {"tag": "p", "text": "Their genetic structure gave them greater intelligence, better perception, and eidetic memory—allowing perfect photographic recall. During training, their intelligence tests scored thirty-five percent higher than other commando types and developed immeasurably high scores in training. The intense training and genetics gave them mental capabilities beyond that of standard clones."}, {"tag": "p", "text": "Their physiology was greatly improved: they were stronger, faster, and heavier than basic clone troopers."}, {"tag": "p", "text": "During training each clone developed Jango Fett's own Concord Dawn accent and speech patterns, just like the flash-learned standard clone troops."}, {"tag": "p", "text": "When the Kaminoans began cloning, they produced twelve prototypes, designated as Null-class Advanced Recon Commandos. Their extreme physiological modifications killed half of the prototypes during gestation. The \"enhancements\" to the Fett genome handicapped the survivors with erratic behavior and an inclination toward disobedience, making their loyalties unpredictable. Kal Skirata, a Mandalorian warrior who had been brought to Kamino to assist in the training of a special unit, concurred with the Kaminoans' rationale behind \"modified\" troopers; an \"unaltered\" Jango Fett was not the ideal infantry soldier. Disappointed with the unsatisfactory results of their wayward creations, the Kaminoans deemed 12 of the first 100 prototypes complete failures and intended to kill them."}, {"tag": "p", "text": "Kal Skirata's intervention, along with Fett's support, saved the clones. Skirata was charged with training the prototypes as intelligence units. Due to the Kaminoans' genetic tinkering, the Nulls had very intense loyalties, and were loyal only to Kal Skirata."}, {"tag": "p", "text": "Among the modifications' side effects were high sensitivity to minute personal details, a peckish appetite, and a sweet tooth, which Skirata theorized might be due to their maturation and the metabolic need to fuel their rapid aging."}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "The Null ARCs were also known as Skirata's private army. The Nulls and Kal Skirata were reluctantly tolerated in the Grand Army, if only to ensure their cooperation during the war, because they had unique skills that their brethren lacked. The Null ARC Troopers worked in the Special Operations Brigade of the Grand Army. All Null ARC's were officers, except for Null-12 who when asked why he was only a sergeant by one of the Omega Squad commandos, A'den replied, \"I preferred to be an NCO. If it's good enough for Kal'buir, it's good enough for me.\""}, {"tag": "p", "text": "Two Clone Intelligence units, Null-6 and Null-10, were the troopers who located General Grievous's hiding place on Utapau near the end of the Clone Wars. The information was sent to Kal Skirata first and the intel was traced to the Supreme Chancellor's Office. Since the trace was obvious Skirata withheld the information from his superiors pending an investigation when a diplomatic package was received from Utapau informing the Senate of Grievous's location."}, {"tag": "p", "text": "Though they worked for the Grand Army of the Republic, Kal Skirata had them keep alert for evidence leading to the location of Kaminoan Chief Scientist Ko Sai, so Skirata could find out how to decelerate the aging process to give any clone a full life span."}, {"tag": "p", "text": "The experience of developing Null ARC troopers contributed much in the production of the Alpha-class Advanced Recon Commandos. During the Clone Wars, the Null-class and Alpha-class ARCs harbored grudges against each other. Whereas the Alpha-class ARCs saw the Nulls as an embarrassment and shame to Jango Fett's legacy of a fully Republic-loyal clone army, the Nulls viewed the Alpha-class ARCs as even more stubborn than Jango and often referred to Alpha-class ARCs as \"Alpha Planks,\" nothing special, ordinary ARC troopers. The highest ranking Null, Captain Ordo, managed to retain a professional relationship with Alpha Captain Maze, although the two had originally disliked each other."}, {"tag": "h2", "text": "Known operations"}, {"tag": "p", "text": "Null ARC troopers"}, {"tag": "p", "text": "While the other six Nulls died before even being recognizable as embryos, Skirata's thoughts during the capture of Ko Sai reveal that he did name all twelve of them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}