{"url": "Null_(species)", "categories": ["Category:Legends articles", "Category:Human and Near-Human species", "Category:Mid Rim species", "Category:Nulls"], "nodes": [{"tag": "h1", "text": "Null  (species)"}, {"tag": "p", "text": "The Nulls were a species of tall Near-Humans who inhabited the eponymous planet of Null. A fierce and individualistic people, they had a culture of hunters and stonemasons, and they based their planetary economy on hunting tourism. In 22 BBY, when the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems, their planet became part of the Confederacy, although much of the populace had a great respect for the Jedi, the devoted protectors of the Republic."}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, a Null Imperial Intelligence agent was employed by the Church of the Dark Side as an imitator of the Emperor's Mage Jedgar, an imposingly tall Human who matched Nulls in height."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Nulls closely resembled baseline Humans, with four limbs, a bipedal stance and a relatively hairless body. However, the Nulls could be easily identified by their towering stature. Some individuals were known to be a meter taller than the Human Jedi Anakin Skywalker and Obi-Wan Kenobi, whose respective adult heights were 1.88 and 1.82 meters. Humans with abnormally high linear growth could easily pass as Nulls, and vice-versa."}, {"tag": "p", "text": "Like Humans, the Nulls had hair covering their scalp. Male members of the species also grew long and heavy beards on their chins, which they usually braided for aesthetical reasons. At least one male individual, a professional impersonator, was known to have light skin, a prominent chin, hooded eyes and a large, hooked nose. That one Null also had his hands roughly the size of a grown Human's head."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "On their eponymous homeworld, the Nulls lived in small individualistic communities with a strong sense of privacy. The planet had no large cities, and although there existed a planetary government with its system of laws, criminality was normally handled among villagers through fierce retaliation. The Null villages had narrow streets, cluttered with low buildings made of stone and wood. At the time of the Clone Wars, the villagers would seldom use speeders and usually relied on the bellocks for transportation."}, {"tag": "p", "text": "Individuals of both sexes dressed in thigh-length boots and animal skins. Hunting was an important activity on Null, since the planet's mountains were full of wild beasts prized for their skins—such as the wily laroon. Despite their fierce nature and their keen sense of privacy, the Nulls normally displayed a friendly demeanour towards strangers, especially since their planet's economy relied on hunting tourism."}, {"tag": "p", "text": "Although their habitations could be considered archaic by galactic standards, the Nulls were in fact master stoneworkers. They built walls from jagged stones, fitting them together in complex patterns, but without mortar or joinery to bind them. More than mere architecture, this specific knowledge was considered an art form."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Near-Humans known as the Nulls hailed from the forested planet of the same name, located within the Trans-Vulta sector, in the Mid Rim region of the galaxy. The Nulls' world was first discovered by outside observers between 5000 and 3000 BBY."}, {"tag": "p", "text": "On the fifth month of the year 22 BBY, a galaxy-wide conflict know as the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems. Since Count Dooku—former Jedi Master and head of the Confederacy—almost wholly owned the planet and had ties with its leaders, Null quickly sided with the Confederacy. However, the common people went on with welcoming tourists from other worlds. Three years later, the Clone Wars were brought to an end, and the Republic was replaced by the first Galactic Empire, an authoritarian government led by former Supreme Chancellor Palpatine."}, {"tag": "h2", "text": "Nulls in the galaxy"}, {"tag": "p", "text": "In 4 ABY, the Empire was defeated at the Battle of Endor. The former Director of the Imperial Intelligence Cronal helped acting-Emperor Sate Pestage set up a mock religion known as the \"Church of the Dark Side\" on Coruscant, establishing a body of false Prophets of the Dark Side. Cronal recruited a Null Imperial agent named Heingort Giddis, instructing him to impersonate Jedgar, the real High Prophet of the dark side, who was believed dead. The impostor served along with Rajah Ubooki, a Bimm impersonator posing as the Supreme Prophet Kadann, and they sought to seize the secrets of an ancient Jedi Library on Yavin 4. However, the so-called Prophets were defeated by the heroes of the New Republic, and were eventually murdered by the Imperial Grand Admiral Afsheen Makati."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nulls first appeared in Legacy of the Jedi, a young readers novel written by Jude Watson and published by Scholastic on August 1, 2003. In early June 2006, Star Wars author Abel G. Peña wrote Evil Never Dies: The Sith Dynasties, an online supplement to the eighty-eighth issue of the Star Wars Insider magazine. In this article, Peña identified a character from the 1990s Jedi Prince series as a Null impostor, thus retconning the species's first appearance to Paul and Hollace Davids' novel The Lost City of the Jedi, published on June 1, 1992."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}