{"url": "Numa/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Ryloth residents", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Numa"}, {"tag": "p", "text": "Numa was a Twi'lek girl who lived in the city of Nabat on the planet Ryloth during the Clone Wars. In 21 BBY, the Confederacy of Independent Systems invaded Ryloth, during which Numa's parents were presumed killed. While most of the surviving Twi'leks in Nabat were rounded up and taken as prisoners, Numa was able to avoid capture, and lived in the abandoned city and the tunnel system underneath it during the Separatist occupation. Later, the Galactic Republic launched a counterattack to free Ryloth and its people. During the subsequent battle, Numa befriended a pair of clone troopers named Waxer and Boil, who had been on a reconnaissance to Nabat. After the trio escaped from a group of gutkurrs—which had been released by the Separatist's droid army to halt the Republic's advance—through the underground tunnels, they met back up with Waxer and Boil's squad. Numa showed the company's commander, General Obi-Wan Kenobi, the system of tunnels she had been hiding in, which they used to flank the droid forces controlling Nabat and free the captured Twi'leks. During the battle, Numa was reunited with her uncle, Nilim Bril."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Numa was a young Twi'lek girl who lived in the city of Nabat on the planet of Ryloth during the Clone Wars. One day in 22 BBY, Numa was playing with her friend Lubo in Nabat's market place while her mother was shopping, when Tronda, a friend of her mother, said that she sensed a storm coming, even though the skies were clear. When Numa and her mother returned home, Numa's father asked her why he had found her tooka doll in the tunnel system underneath Nabat, which the Twi'lek's used as shelter during storms. Numa said that tooka had followed a \"bright eye\" down into the tunnels last night. Later that night, Numa again saw the \"bright eye\"—which actually was a Separatist recon droid—and began to follow it. As Numa followed the recon droid into the tunnels system, she heard several loud explosions, scaring the young Twi'lek. Numa climbed out of the tunnels, and saw a large Separatists invasion force landing on Ryloth, with the battle droids already on the ground taking away the surviving Twi'leks. The Confederacy of Independent Systems had invaded Ryloth and enslaved most of its Twi'lek populace. The Republic soon mounted a bold offensive to invade and liberate the planet."}, {"tag": "p", "text": "While scouting ahead, clone troopers Waxer and Boil of Ghost Company met Numa in an alley. Initially thinking them to be enemy droids, Numa was rather fearful of them, even going so far as to bite Boil's finger. However, after the two took off their helmets, she relaxed, even calling the two \"Nerra!\", and she accepted a ration bar from the clones. Boil was initially against helping her, but Waxer, who had developed a little compassion for the girl, worried about her well-being. Numa led the clones to her home, which was now wrecked and practically empty. After Waxer gave her a tooka doll, she began to cry, and the two clones comforted her. However, after Waxer and Boil received a transmission from Commander Cody, they realized that they were late and had disobeyed orders."}, {"tag": "p", "text": "As the two clones began to leave, a group of gutkurrs appeared, and they were forced back into the house. Numa showed the two clones an underground passage beneath a carpet in her house, and they entered it, eventually re-emerging near Obi-Wan, Cody and Ghost Company, who had just encountered the gutkurrs themselves. Cody was initially displeased with the clones, but once Obi-Wan saw Numa, he understood what had \"sidetracked\" the two. Obi-Wan conversed to Numa in Twi'leki, and learned that she could take them to the prisoners via the tunnels. Cody created a diversion, and Obi-Wan was able to free the Twi'lek prisoners, and Numa was reunited with her uncle, Nilim Bril."}, {"tag": "p", "text": "After Obi-Wan, Waxer and Boil destroyed the proton cannons, tactical droid commander TX-20 appeared in his tank and blasted the three aside. Numa, fearing for her friends, ran over to Waxer and Boil, demonstating her bravery and compassion for her friends. Once they had recovered, she returned to Obi-Wan. TX-20 targeted the two, but before he could destroy them, the Twi'leks, inspired by her courage, attacked the tactical droid and forcefully dismantled him, while Obi-Wan attempted, unsuccessfully, to shield her eyes from the violence."}, {"tag": "p", "text": "As the Republic forces prepared to march to the capital city of Lessu and retake it to free the planet, Waxer and Boil said goodbye to her, promising that they would be back. Numa called out \"Nerra!\" one last time, and Obi-Wan translated its meaning: brother."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Numa was only a child during the Clone Wars, therefore she was wary and scared of droids and other threats. However, Numa was not afraid to defend herself, as seen when she bit Boil's finger. She was nonetheless very brave and cared for her friends. Numa helped to nurture compassion in both Waxer and Boil, and the two clones cared for her to the extent of delaying their mission to help the young girl."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Numa is portrayed by voice actress Catherine Taber in The Clone Wars TV series. In a tweet, Taber opined that, in her mind, Numa was descended from the characters Mission Vao and Vette, whom she also voiced."}, {"tag": "p", "text": "A cartoon drawing of Numa appears on the right side of Boil's helmet in the episode Landing at Point Rain, and on Waxer's helmet in Darkness on Umbara and Carnage of Krell."}, {"tag": "p", "text": "An older Numa has since appeared in the Canon series Star Wars Rebels, expanding her story, in which she fought for the Free Ryloth Movement against the Galactic Empire. Given that the show itself is canon, it is unknown what became of Numa in the Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}