{"url": "Numidian_Prime", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bright Jewel sector planets", "Category:Jungle planets", "Category:Numidian Prime locations", "Category:Swamp planets"], "nodes": [{"tag": "h1", "text": "Numidian Prime"}, {"tag": "p", "text": "Numidian Prime was a jungle planet on the edge of the galaxy's Mid Rim, known for being a haven for smugglers and thieves, such as the bounty hunter Shenda Mol, who operated a stronghold on the planet. During the Imperial Era, the future smuggler Han Solo won the Millennium Falcon from the gambler Lando Calrissian on Numidian Prime."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located on the edge of the galaxy's Mid Rim, Numidian Prime was a warm and beautiful jungle planet, though it also had swamp terrain. The terrestrial planet had a breathable atmosphere, and was inhabited by species of birds."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Galactic Republic, the bounty hunter Shenda Mol had a stronghold and several followers on Numidian Prime. The Jedi Dooku and Qui-Gon Jinn, as part of a strike team, tracked her to the stronghold, apprehending both Mol and her followers and imprisoning her on the planet Stygeon Prime."}, {"tag": "p", "text": "The card game sabacc had a set of rules based on Numidian Prime, and the gambler Lando Calrissian once held a winning hand according to them. Calrissian also won a disabler device playing a game of cards on Numidian Prime."}, {"tag": "p", "text": "Following a mission undertaken by the crew of Tobias Beckett for the Crimson Dawn crime syndicate, in which Calrissian had been hired for the use of his starship, the Millennium Falcon, the gambler abandoned Beckett's gang on Savareen, visiting Numidian Prime. Two former members of Beckett's crew, Han Solo and Chewbacca, eventually made their way to the planet, where Solo won the Millennium Falcon from Calrissian in a game of sabacc."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Criminals who were trying to avoid outstanding debts were known to hide on Numidian Prime. The Falleen bounty hunter Shenda Mol resided on the planet, and had a number of followers there."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A well-hidden and secure jungle outpost was located on the planet, along with the stronghold of Shenda Mol, which was situated in a stony valley within Numidian Prime's jungles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Numidian Prime first appeared in Solo: A Star Wars Story, a 2018 theatrical film part of the Star Wars Anthology Series. The name \"Numidian Prime\" appeared for the first time in the reference book Solo: A Star Wars Story The Official Guide, written by Pablo Hidalgo, but it was not connected to the planet seen in Solo until the release of the novelization, Solo: A Star Wars Story: Expanded Edition, written by Mur Lafferty, along with the junior novelization, written by Joe Schreiber, and the Databank entry on StarWars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}