{"url": "Nuso_Esva", "categories": ["Category:Legends articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Warlords"], "nodes": [{"tag": "h1", "text": "Nuso Esva"}, {"tag": "p", "text": "Nuso Esva, was a male alien warlord who became a major power within the Unknown Regions. Esva was a brutal, yet highly intelligent mastermind within military tactics. He possessed a large navy, which was a major threat to all of the galaxy."}, {"tag": "p", "text": "Around 0 ABY, several months after the battle of Yavin, Esva had an ongoing war with Senior Captain Thrawn, who held a shadow empire rivaling Esva's empire. This would cause Esva to take the title of \"Lord Odo\", who was part of the Emperor's Ruling Council. Esva was successfully able to confuse Imperial officers, but would be defeated in the Poln system by Thrawn and the combined efforts of Darth Vader's Death Squadron."}, {"tag": "p", "text": "In 8 ABY, Esva would go on the defensive side after a major defeat. He would later establish an alliance with the Queen of the Red of Quethold. Esva would be tracked down by Thrawn, and a large scaled battle would commence. Esva would betray and kill the Queen, causing their fragile alliance to fracture. Esva would then be gunned down by the Queen's soldiers, killing the brutal warlord."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Esva was born of an unknown species that was located within the Unknown Regions. At some point, Esva made his own empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A tactical genius who rivaled Thrawn's brilliant mind, Esva was a brutal, ruthless, and sadistic military genius. Esva was extremely intelligent, due to various spies, assassins, and agents lurking throughout the galaxy. Esva was also manipulative, being able to control his subjects through blackmail, or other weak points. This was shown when he forced Governor Bidor Ferrouz to obey his every command after kidnapping his family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In a September 28, 2011, Facebook chat, Timothy Zahn confirmed that Nuso Esva's name is a coded version of Moriarty, from Sir Arthur Conan Doyle's Sherlock Holmes stories. If each consonant of \"Nuso Esva\" is replaced with the consonant before it in the Latin alphabet and each vowel is replaced with the preceding vowel in the Latin alphabet (counting y), \"Nuso Esva\" becomes \"Moriarty.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}