{"url": "Nuvo_Vindi/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Confederacy science and engineering personnel", "Category:Fausts", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nuvo Vindi"}, {"tag": "p", "text": "Nuvo Vindi was a male Faust doctor from Adana who lived during the waning years of the Galactic Republic. Vindi was mentally unstable, using his talents as a scientist and researcher to achieve his vision of a perfect galaxy. Originally employed as the senior medic for the criminal Perma families, Vindi went missing in 32 BBY and was believed dead. Reappearing on Naboo as a Confederacy of Independent Systems scientist during the Clone Wars, he became obsessed with recreating the eradicated Blue Shadow Virus, a deadly water-borne plague which resulted in instantaneous death and had no known cure. Vindi worked out of a subterranean laboratory in Naboo's eastern swamps alongside Confederate battle droids and LEP-86C8, a LEP servant droid. In 22 BBY, Vindi was not only able to re-engineer the virus, but also create an airborne strain he planned to release in key Republic star systems."}, {"tag": "p", "text": "After several of his battle droids were discovered by the Royal Naboo Security Forces, Vindi's plot was revealed to Naboo's Senator Padmé Amidala and Representative Jar Jar Binks, who then contacted the Jedi Order for assistance. Vindi captured Amidala and Binks before the arrival of the Jedi and held them hostage in his laboratory until it was attacked shortly after by Jedi Master Obi-Wan Kenobi, Knight Anakin Skywalker, Padawan Ahsoka Tano, and Republic clone troopers. After torturing Amidala and Binks for a short time, Vindi attempted to escape Naboo and reintroduce the virus to the galaxy. He was instead apprehended by Skywalker and Kenobi outside his laboratory and was transported to Naboo's capital of Theed. Although the virus was released during the battle, a cure was quickly found by Kenobi and Skywalker on the planet Iego, negating the threat. Vindi was then taken to the galactic capital of Coruscant for trial."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Criminal activity"}, {"tag": "p", "text": "Nuvo Vindi was a male Faust from the planet Adana who lived during the Republic Classic era. Although he was regarded as a brilliant scientist, Vindi had a history of mental illness that manifested itself in an unorthodox philosophy that held viruses to be the highest form of life in the galaxy. Of the viruses Vindi considered sacred, the Blue Shadow Virus held a particular interest for him. Responsible for the ancient Candorian plague which resurfaced around 42 BBY and depopulated Candoria and its colonies, the Blue Shadow Virus was lethal to all known species. The Galactic Republic enacted strict quarantines that contained the Blue Shadow Virus on affected worlds, preventing it from spreading until it eventually died out. Vindi took the eradication of the virus to be tantamount to genocide and eventually became determined to recreate it."}, {"tag": "p", "text": "During Vindi's career, a bounty was placed on him, eventually resulting in him ending up on the Republic's Most Wanted list. The day after the bounty on his head increased to 250,000, he gassed all of the bounty-posting agencies on the planet Ord Marsax, then led dozens of bounty hunters on a wild chase."}, {"tag": "p", "text": "At some point, the doctor lent his talents to the operations of a criminal organization known as the Perma families. Vindi gained infamy as the senior medic and doctor for the families, operating out of the Core World of Perma. Around 32 BBY, he reportedly went missing, believed to have been disposed of by the Perma families themselves. The doctor was in fact alive and well, and by the first year of the Clone Wars, he was associated with Count Dooku's newly formed Confederacy of Independent Systems. The Confederates, hoping to use Vindi's unusual intellect in their war against the Republic, promised Vindi that they would aid him in bringing forth an era in which viruses dominated the galaxy."}, {"tag": "p", "text": "The Confederacy assigned Vindi to the Mid Rim world of Naboo, where he was given a subterranean laboratory that had been built by the Trade Federation ten years prior. Trade Federation Viceroy and Separatist Council member Nute Gunray remained bitter toward Naboo after his failed invasion of the planet and so sponsored Vindi's and usage of the lab beneath the planet's eastern swamps. Within this laboratory, the doctor worked to recreate the Blue Shadow Virus to be unleashed against the Republic. Assisted in his work by a battalion of battle droids and the LEP servant droid LEP-86C8, Vindi was able to recreate the Blue Shadow Virus in its original, water-borne strain which was able to kill its victims almost instantly. He then began work on engineering an airborne strain of the virus that was to be stored in vials that could then be loaded into bombs and sent to key Republic star systems throughout the galaxy."}, {"tag": "h3", "text": "Reappearance"}, {"tag": "p", "text": "Unbeknownst to the doctor, the Naboo had begun investigating the reappearance of battle droids on their planet. After being informed by Gungan shaak herder Peppi Bow that her herd had sensed the presence of droids, Queen Neeyutnee dispatched Captain Gregar Typho of the Royal Naboo Security Forces to investigate. His team was able to locate and destroy a battle droid scouting party and retrieve an intact tactical droid. Due to the appearance of battle droids on the planet, Senator Padmé Amidala and Representative Jar Jar Binks of Naboo returned to their homeworld to aid in the investigation. The two witnessed a robolobotomy on the tactical droid, where they learned of the virus, which led the Naboo to contact the Jedi High Council for assistance. Shortly thereafter, Amidala and Binks began searching for the virus's source in the eastern Gungan swamp lands, as one of the destroyed battle droids was found with a slug-beetle that was native to the area. Not far from the swamplands, the two ran into Peppi Bow, whose shaak herd had recently been killed by a sample of the Blue Shadow Virus that had escaped into a Naboo river. Peppi pointed them towards the swamps where the virus might have entered the river, an area heavily monitored by Dr. Vindi's droid forces."}, {"tag": "p", "text": "Vindi discovered and captured Amidala and Binks, but not before the duo were able to report their coordinates back to Captain Typho. Holding the two prisoners within his laboratory, Vindi demonstrated his ability to create a new, airborne strain of the Blue Shadow Virus using machinery that generated arcs of electricity. Although this new viral strain was more pervasive, it killed its victims over a longer period of time than the ingested, water-borne strain, taking around forty-eight hours to cause death. Vindi explained his plan for spreading the virus throughout the Republic to his prisoners before readying his final bomb and giving it to LEP-86C8 to store."}, {"tag": "h3", "text": "Releasing the Blue Shadow Virus"}, {"tag": "p", "text": "After being dispatched to Naboo by the Jedi High Council, Jedi Master Obi-Wan Kenobi and Knight Anakin Skywalker, along with Skywalker's Padawan, Ahsoka Tano, arrived in Naboo's capital, Theed, and prepared for an assault on Vindi's lab. They had learned of the doctor's identity and his plot to release the virus from a holorecording extracted from a destroyed battle droid. Following Tano and Peppi Bow's reconnaissance of the coordinates sent to Captain Typho by Amidala, the three Jedi were able to breach the compound and proceed with their missions: Tano and Clone Captain CT-7567 were to take members of the Grand Army of the Republic and provide a distraction for the battle droids, while Kenobi deactivated the bombs. Skywalker was tasked with rescuing Amidala and Binks, in addition to capturing Vindi."}, {"tag": "p", "text": "Alerted to the breach, the doctor ordered his battle droids to combat the intruders while he stayed behind with Amidala and Binks. Preparing for the Jedi's arrival, Vindi tied his two prisoners to the equipment he had used to alter the virus. When Skywalker arrived, the doctor activated his machine, which began to electrically shock his hostages, and ordered the Jedi and his troops to lay down their arms unless they wished to see the Senator and Representative die. Skywalker complied, dropping his lightsaber as his clone troopers dropped their blasters. Although Vindi deactivated the machine, he knew he could not stop the Jedi for long, and so he offered Skywalker a choice: capture him, or save the hostages. Vindi began to shock his prisoners once again and escaped with several containers of the virus while Skywalker moved to rescue Amidala and Binks. While Vindi ran from the room, he knocked over a rack of vials containing the virus. Before they were able to hit the ground and shatter, Skywalker used the Force to grab them."}, {"tag": "p", "text": "During Vindi's flight to his shuttle in the laboratory's underground hangar, Vindi remotely activated the timers on his virus bombs. Under the threat of discharging the bombs and releasing the virus throughout the lab, Kenobi's clone bomb squad worked fervently to deactivate the explosives before their timers ran out. When Vindi reached his landing platform, which promptly began to ascend out of the hangar, Kenobi, Skywalker, and CT-7567 burst through the hangar door and advanced on him. The doctor stalled the three by throwing several vials of the virus at them, forcing Kenobi to catch the containers before they could shatter. Vindi was able to exit his laboratory, but was soon faced with Skywalker, who had managed to climb on top of the platform. While threatening to drop yet another vial, Vindi was tackled by Peppi Bow, who had remained outside the compound during the raid."}, {"tag": "p", "text": "The doctor refused to give up hope, though, and excitedly proclaimed that his bombs were about to go off. However, there was no explosion, as the clone bomb squad had deactivated all but one of them—which was still in the possession of Vindi's assistant droid. The droid was soon discovered by Senator Amidala, and the bomb was deactivated."}, {"tag": "p", "text": "As Skywalker and Kenobi ushered the captured Dr. Vindi onto his shuttle for transport to the Republic capital of Coruscant, where he would stand trial for his crimes, the three heard a red alert alarm coming from the laboratory below. To Vindi's delight, his assistant droid had been able to remove the virus container from the last bomb and ran off with it before the bomb had been deactivated. The droid had sneaked back into the bomb storage room and reactivated one of the explosives, destroying himself and two clones in the process. The explosion released the virus throughout the lab and sealed Amidala, Binks, Tano, the clones, and the surviving droids inside. Although Vindi was threatened by Skywalker, who put his lightsaber to the doctor's throat, Vindi refused to aid the Jedi in their search for an antidote, stating it had been his job to create the virus, not to cure it. Vindi was then taken to Theed and imprisoned while the Jedi sought a cure for the virus."}, {"tag": "p", "text": "Skywalker and Kenobi learned that the root of the reeksa plant of the planet Iego could negate the effects of the virus, and the two were able to secure a sample before the virus killed all those trapped in the lab or escaped to ravage Naboo. The two Jedi returned to Naboo with reeksa root, and upon the Jedi's return, Vindi was taken to Coruscant for trial."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nuvo Vindi was a Faust, a blue-skinned species with doubled eyelids. Vindi himself had large purple markings around his eyes and spoke Basic with a heavy accent. He commonly wore a white doctor's coat, as well as Permese glass spectacles and air-tight boots. When the possibility of being exposed to dangerous substances arose, Vindi donned a biohazard hood."}, {"tag": "p", "text": "A talented scientist, Vindi had an instinctual understanding of biology and biochemistry. Despite this, the doctor was mentally unstable and believed viruses were the highest form of life in the galaxy. This philosophy disturbed and frightened even the Perma families, and upon Vindi's disappearance, it was believed the families themselves had orchestrated his murder. After its eradication, Vindi became obsessed with the Blue Shadow Virus, which he saw as beautiful. He was adamant in his belief that the Blue Shadow Virus was a life-form that had been murdered and was willing to torture and kill in order to revive it. His plot to release it back into the galaxy would have resulted in countless deaths, and Vindi showed no remorse at the thought. Instead, the doctor was genuinely excited, believing it would bring peace and purity to the universe."}, {"tag": "p", "text": "Vindi could be demeaning at times to the droids under his command, yelling at LEP-86C8 following the capture of Amidala and Binks. He also stood undaunted, even with a lightsaber at his throat, after his defeat at the hands of the Jedi. The doctor was delighted at the thought of the virus escaping the lab and destroying Naboo, even if it was unable to get off of the planet. Furthermore, he enjoyed the prospect of not only the death of the Jedi, but himself as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dr. Nuvo Vindi first appeared in The Clone Wars television series as the main antagonist of the episode \"Blue Shadow Virus,\" and once again—albeit less prominently—in the following episode, \"Mystery of a Thousand Moons.\" Vindi was voiced by Michael York in the television series. and by James Arnold Taylor in LEGO Star Wars III: The Clone Wars."}, {"tag": "p", "text": "Vindi's design was based on abandoned character sketches of an alien astronaut from Star Wars: Episode II Attack of the Clones, given to The Clone Wars production staff by George Lucas, who specifically requested that Vindi's appearance correspond to the alien. Jackson Sze, normally an environment and landscape artist, designed the final version of the character. The director of \"Blue Shadow Virus,\" Giancarlo Volpe, planned for Vindi to look \"extra weird,\" leading to Sze's inclusion of the character's double eyelids. In 2014, Star Wars Blog author Kevin Beentjes also noted Vindi's resemblance to an alien senator sketch for Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "Vindi was also featured in the 2011 non-canonical video game LEGO Star Wars III: The Clone Wars, appearing in several cutscenes and featuring prominently in the game's adaptation of \"Blue Shadow Virus.\" The game implies that Vindi is in fact working for the Dark Acolyte Asajj Ventress, causing her much distress when he is captured on Naboo. After Vindi is captured, he is locked in the brig of the Venator-class Star Destroyer Resolute, which acts as the in-game hub. Players may later release Vindi from his cell by using a dark side character. Doing this makes Vindi available for purchase and use in the Free Play mode of the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}