{"url": "Nym%27s_Base", "categories": ["Category:Legends articles", "Category:Lok locations", "Category:Military bases"], "nodes": [{"tag": "h1", "text": "Nym's Base"}, {"tag": "p", "text": "Nym's Base was the hideout and main headquarters of the pirate Nym and his Lok Revenants for a period of time that lasted from prior to the Invasion of Naboo to the Galactic Civil War. It went through several reconstructions as a contested site between Nym and the Trade Federation during the Occupation of Karthakk. By the time of the Galactic Civil War, a city by the name Nym's Stronghold had been built around the base and the base itself was best known as Nym's Keep."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The base was located on the surface of Lok in a relatively desolate region called the Nym Protectorate. It was constructed out of a crater close to the Grendin River."}, {"tag": "p", "text": "Nym's base appeared to be relatively undefended, but maintained numerous hidden defenses throughout the base. It held a hangar used to launch the Havoc, as well as the other Revenant starfighters. This base was constructed into a crater, and it's primary defenses were two turrets stationed along the entrance while others were scattered across the interior. Three large cargo freighters and two smaller freighters were parked in the interior. The primary defensive weapon was the powerful Inferno Turret, which during the Trade Federation's attack was able to fend of a C-9979 landing craft from landing inside the base itself. This turret had a five barrel rotating cannon and two dual laser cannons, one on top and one to the side."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Lok Revenants operated out of the base, and would frequently attack passing Trade Federation supply ships above the planet, bringing them down and salvaging their cargo. It was unknown how long Nym had been using the base for, but as of 32 BBY it was already well established."}, {"tag": "p", "text": "Things took a turn for the worse for Nym when he and his Revenants attacked a Trade Federation Superfreighter carrying prototype Vulture droid starfighters. While the Federation had turned a blind eye to the Revenants' previous attacks, this cargo was far too valuable, and they launched a full-scale invasion of Lok, leaving Nym and his friends little option but to retreat under fire. The attack nearly caused the death of Nym's aide, Jinkins, but he was saved by Nym, and accompanied the evacuation transports as they departed Lok."}, {"tag": "h3", "text": "Trade Federation control and onwards"}, {"tag": "p", "text": "With Nym chased off the planet, the base fell under the control of the Federation, and they drastically modified it. The open crater was sealed with a large dome and the inside converted into a droid foundry and hangar."}, {"tag": "p", "text": "The hangars were converted into fueling stations for Federation freighters. In 22 BBY, these stations were destroyed in battle by the orbital cannon that had been assembled on one of Lok's moons by the returning Revenants. With the death of Lieutenant Bella, the base was once again under the control of Nym, after his assault on the complex."}, {"tag": "h3", "text": "Nym's palace"}, {"tag": "p", "text": "Nym eventually became the leader of Lok during the Galactic Civil War, and would continue to use this as his base of operations. By then, the base had once again undergone a dramatic transformation. A city known as Nym's Stronghold was built around the fortress. By the time of the Battle of Yavin, it was the largest city on Lok and held the only spaceport on the entire planet. The base was turned into a palace and Nym, Kole, Jinkins and Vana Sage could usually be found there and were known to employ a variety of spacers to carry out assignments on their behalf."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}