{"url": "Nym/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Cyborgs", "Category:Feeorin", "Category:Males", "Category:Pirates", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Nym"}, {"tag": "p", "text": "Nym was a Feeorin pirate captain who led the Lok Revenants. Known for his theft and subsequent use of a prototype Scurrg H-6 prototype bomber, the Havoc, Nym's depredations eventually earned him the ire of the Trade Federation, who hired mercenary Vana Sage to capture and imprison him. However, Nym escaped from his imprisonment, only to find that Sage, who had been double-crossed by the Trade Federation herself, wished to ally with him to inflict further damage on the Trade Federation. Furthermore, the starfighter pilot Rhys Dallows, whose homeworld had been invaded by the Trade Federation, and the Toydarian smuggler Reti joined with them as well. Together, the four launched a number of raids on Trade Federation property, culminating on attacks on the Trade Federation blockade of Naboo and the destruction of a Trade Federation droid production facility on Eos. Those actions earned Nym a pardon from the Republic, though he continued his life of piracy."}, {"tag": "p", "text": "Shortly before the outbreak of the Clone Wars, Nym's forces came under attack by the Trade Federation once again, this time in the Karthakk system. With the aid of Reti, his wingman Jinkins, and Jedi Master Adi Gallia, Nym was able to destroy several illegal Trade Federation facilities, including a weapons plant producing a biological weapon known as trihexalon. During this time, he ran afoul of a Separatist-aligned mercenary named Cavik Toth, who was behind the trihexalon production. Undaunted, Nym continued to battle Toth's Sabaoth Squadron as well as the Trade Federation, to the point where he was able to seize back his base on Lok, which had been overrun by the Trade Federation years before. Once he did so, the Feeorin ran his operation from there, into the Galactic Civil War, in which he targeted Imperial holdings and was seen as a Rebel sympathizer."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Nym was born during the waning years of the Galactic Republic, though reports on his past were not at all reliable. A male Feeorin, one of the last of his species, he was orphaned as a child on the tough streets of Lok, a barren and lawless world located in the Mid Rim's Karthakk sector. Nym began to join up with the various pirate crews who frequented Lok's spaceports, and being raised by such harsh criminals tempered his physical skills and abrasive personality. By the time he had reached adulthood, Nym had earned a reputation as a capable pilot and mechanic, a fierce fighter, and a talented tactician. He took part in violent free-for-all fights in the Blood Pits of the smuggler's moon, Nar Shaddaa, once going toe-to-toe with a Trandoshan. After winning one contest, Nym received a tattoo; the symbol was at the time meaningless, but would take on significance later in the Feeorin's life. Having become well-known and highly respected throughout the underworld, the Feeorin ultimately assembled his own, loyal crew of pirates and cutthroats and took to the space lanes, practicing piracy along the busy hyperlanes that went between the Core Worlds. At some point in his life, Nym's left hand was severed at the elbow, and he had it replaced with a metallic prosthetic hand."}, {"tag": "p", "text": "Nym quickly became a feared figure along the hyperlanes he plundered. He made every attempt to minimize the bloodshed during his raids, unlike many of his fellow pirates, known for cruelty and violence, relying instead on speed and effectiveness to get the job done. In 37 BBY, Nym was sought out by a Bith engineer named Jinkins, a member of the Nubian Design Collective and the chief designer of its Scurrg H-6 bomber project. The project never took off, however, and the Nubian Design Collective decided to scrap the idea, putting the sole prototype bomber into storage; frustrated at seeing his work scrapped, Jinkins plotted with Nym to steal the bomber. Nym launched his raid on a storage silo on Nubia and made off with the experimental craft—rechristened Havoc, it became Nym's personal fighter. Jinkins also joined the Feeorin's band of pirates, making myriad modifications to the bomber, including the installation of \"bomblet generators.\" Jinkins became an important member of Nym's cortege, as did Kole, Nym's Chadra-Fan first mate and co-pilot, and an expert in the implementation of disguises."}, {"tag": "h3", "text": "Outfoxed"}, {"tag": "p", "text": "Nym returned to Lok to construct a stronghold, which his pirate crew operated from during their years of raiding Trade Federation supply lines along the Rimma Trade Route and the Corellian Trade Spine. Nym later stole a cache of experimental Merr-Sonn Munitions Scalphunter prototype weapons from the Trade Federation, but despite the weapons' value, he was unable to find any buyers. The Trade Federation, meanwhile, hired bounty hunter Vana Sage to retrieve the weapons and rein the Feeorin in. Sage contacted Nym in the guise of a well-connected mercenary, and offered to act as a go-between in a deal for the prototypes with a group of prospective sellers. Nym would not be paid in credits, but in stygium crystals, which were used in cloaking devices. While this was not his preferred method of payment, Nym figured the crystals would be easier to sell. Sage arranged a meeting between Nym and the buyers aboard a derelict space station in orbit over the planet Maramere and was paid handsomely for her part in the deal."}, {"tag": "p", "text": "Before the meeting, Sage promised Nym that only three beings would be aboard the space station, and that no one would be armed. However, Nym was slightly put off by the fact that he had never met Sage face to face, and distrusted her. Thus, he secretly buried the blasters' power cells on Maramere and stored the coordinates, which he would provide to the buyers so they could retrieve the cells themselves if the transaction went satisfactorily. When Nym, Jinkins, and Kole arrived at the space station in the Havoc, sensor readings showed that only three, unarmed individuals were present. However, more worrying was the presence of a Trade Federation battleship in the system, which Nym ordered his two subordinates to observe closely. Nym, Jinkins, and Kole docked the Havoc at the space station and unloaded the weapons before meeting Sage's buyers. They appeared to be Senators, and Nym was strongly tempted to rob them, but resisted. Just as Nym was beginning to feel relaxed about the deal, though, Sage contacted them from a secure control room, from where she was monitoring the proceedings, and told them to make their deal quickly and then promptly leave her station."}, {"tag": "p", "text": "The deal carried on as planned at first, with Jinkins identifying the stygium as authentic, and his counterpart in the buyers' group doing the same with the blasters. However, after she noticed the missing power cells and Nym explained the changes he'd made to the deal, Sage was furious. The buyers—actually bounty hunters—told Sage that they would handle Nym, and pulled blasters on the Feeorin and his companions. Nym used the case of stygium to incapacitate one of the bounty hunters and retrieved his scepter weapon. Kole and Jinkins both ran for it, while Nym took on another the bounty hunters, but she kicked him in the head. After that, Nym decided to cut his losses and escape. He eluded the bounty hunters before they could fire on him, and ordered Kole and Jinkins to return to the Havoc. As they ran, though, Sage closed the hangar's doors from her control station, trapping Nym and his cohorts inside. Nym took his scepter to one of the attackers and ordered Jinkins to locate Sage's position, but she then activated the station's complement of B1-Series battle droids, and hordes of the armed droids filed into the hangar, blasters set to stun."}, {"tag": "p", "text": "Because of the use of their trademark droids, Nym knew the Trade Federation was responsible for the situation he was in and figured that they wanted him alive in order to learn where he had stashed all his plundered goods. He fled, but Trade Federation reinforcements quickly arrived, with a number of droidekas encircling Kole and Jinkins. Sage implored Nym to surrender, promising to spare his crew. Nym thought she would probably kill them anyway, but she promised to send them to Maramere's surface in an escape pod if Nym gave up. Nym agreed, but vowed to escape and exact his revenge on Sage, who, in addition to becoming the first person to ever successfully catch Nym, would be taking the Havoc as payment for her efforts from the Trade Federation. The Feeorin pirate was incarcerated in the bowels of the Trade Federation battleship Stockade, where he shared a cell with a Neimoidian prisoner, whom Nym believed to be mute. The Trade Federation attempted to extract the location of Nym's stash from him, without success, until they hired Merick and Bavo, two galaxy-renowned torturers, to visit the Stockade and work on Nym. The day before they arrived, the previously-quiet Neimoidian started a conversation with Nym, asking him what he knew that the Trade Federation wanted, and having him recount the story of his capture."}, {"tag": "h3", "text": "Capture and revenge"}, {"tag": "p", "text": "The torturers arrived soon thereafter. Nym vowed to tell them nothing, to grit his teeth and think of getting his revenge on Sage while they tortured him. Merick and Bavo, however, were merely pseudonyms being used by Jinkins and Kole to infiltrate the Stockade. Nym was rescued by his loyal crew, and set out to get back at Sage. Nym returned to Sage's space station, where he had been captured, intent on reclaiming his ship. Sage wasn't there when he arrived, but he waited, until she eventually returned from a mission where the Trade Federation had attempted to eliminate her. Nym held the mercenary at blasterpoint, ensuring he got a good look at the only person who had ever managed to put him behind bars. Sage tried to tell him about a droid factory on Eos, but Nym was less than grateful; however, he recognized that he might potentially need her information at a later point, so he decided not to kill her. Instead, he imprisoned her in a cell on her own, deserted space station, after she had led him to the Havoc. Nym then headed back to his base on Lok."}, {"tag": "p", "text": "Once there, Nym plotted a raid against a Trade Federation convoy near Lok. He and his forces were able to disable a Trade Federation Superfreighter in spite of considerable Trade Federation resistance. Nym's Revenants were able to fend off several groups of Scarab-class droid starfighters and Vulture droid starfighters; even the arrival of a Trade Federation Missile Frigate was unable to stop the piracy. Trade Federation repair ships attempted to link up with the damaged superfreighter but were driven off or destroyed by the Revenants."}, {"tag": "p", "text": "After the superfreighter fell to the surface of Lok and crash-landed, Nym guarded the ship while his crew scavenged its cargo, a droid control transmitter that was set for use in the Trade Federation droid army. Once the cargo was obtained, Nym flew cover for the pirate craft carrying it, fending off still more droids, both aerial craft and AATs, until the pirates could escape to Nym's base. Nym was supported in his effort by pirates riding speeder bikes, but the Trade Federation also sent in a freighter of its own to attempt a recovery. The Feeorin pirate was ultimately successful in fending off the droids long enough for his comrades to escape with the droid control transmitter. However, the Trade Federation response to the theft of the transmitter was to send an invasion army to Lok, precipitating the First Battle of Lok."}, {"tag": "p", "text": "Nym's Revenants were sent out to destroy waves of AATs, droid starfighters, and Trade Federation droid bombers intent on attacking his base in a night assault, aided by the defenses in the base. Nym also flew cover for his returning scouts, including Jinkins, the last scout to report back to base. The pirates launched several decoy freighters in order to draw off Trade Federation pursuit. However, as more droids approached, Nym evacuated his base, fending off the Trade Federation long enough to plant charges inside the base to destroy incoming C-9979 landing craft. However, one of the pirate freighters suffered engine damage and, unable to take off, was destroyed."}, {"tag": "p", "text": "Nym, his base lost and thirsty for vengeance, returned to the station where he had left Sage, only to find that she had already been freed by the Toydarian smuggler Reti and a Naboo starfighter pilot named Rhys Dallows. As all of them desired to strike against the Trade Federation, they teamed up, heading for the droid factory that Sage had previously discovered on Eos. First, Dallows and Reti had to clear out the orbital defenses situated above the planet. They did so and also assaulted a small freighter convoy departing the planet. Once that was done, Nym and Sage proceeded down to the surface of Eos."}, {"tag": "p", "text": "There, Nym used the heavy weaponry on his Havoc against a number of targets: The Trade Federation landing pad, the command center, manufacturing plant, power station, factory, and an orbital defense cannon. The Trade Federation attempted to stop Nym and Sage by launching a number of Hunter-Seeker droids from droid dispensers and firing upon his ship from a number of defensive turrets, but they were unable to stop Nym from completely destroying their facility. The bombs of the Havoc packed enough explosive power to demolish every key building on the facility, and Nym was glad to pay the Trade Federation back. However, the four pilots soon realized that there was trouble on Naboo, and headed there next."}, {"tag": "h3", "text": "Hero of the Naboo"}, {"tag": "p", "text": "Arriving in orbit over Naboo, Dallows, Sage, Nym, and Reti launched a strike on a Trade Federation freighter convoy. While Nym and the others held off the fighters, Reti boarded one of the Trade Federation superfreighters and reprogrammed a wing of Scarab droids to aid his companions. Furthermore, he was able to obtain a large cargo of munitions from the freighter and load them onto his ship, the Zoomer. Meanwhile, Nym, Dallows, and Sage attacked the rest of the convoy and its escorts, knocking out several Trade Federation missile frigates that were attempting to stop their thievery."}, {"tag": "p", "text": "From there, while Dallows and Reti made a supply run to assist the beleaguered Naboo resistance, Nym and Sage attacked part of the Trade Federation droid army that was en route to the Battle of Grassy Plains. The droid army was headed for a Naboo resistance camp, and the Feeorin pirate made numerous runs against the encroaching droids, destroying Heavy Artillery Guns, AATs, and Scarabs. Towards the end of the battle, members of Bravo Flight arrived to lend aid to the Naboo Resistance, helping Nym fend off the final waves of droids."}, {"tag": "p", "text": "Their efforts helped win the battle, though Nym asked for no reward. He earned a pardon from Supreme Chancellor Palpatine himself; the Naboo amassed a small reward to thank him for his efforts; and he was offered a place in the Royal Naboo Security Forces. Nym turned it all down, and though he took a job with the Republic Special Task Force to advise its pirate-fighting patrols for a short time, he wanted to return to his previous lifestyle and live dangerously. He parted ways with Sage and returned to Lok, but he quickly found that the Trade Federation was using his base as a staging ground for their raids in the Karthakk system; without a proper crew, Nym knew he could not take them on, but vowed to eventually purge them from his world. Instead, Nym went to Bothan Space to look for work; he told Sage his destination, promising to keep in touch with her, though he never did. He was quickly back to his old tricks, getting into a heated cantina brawl on Commenor and selling weapons on Sullust."}, {"tag": "p", "text": "In 24 BBY, eight years after the Battle of Naboo, Nym, Kole, and Jinkins took a job on the planet Rodia in the Outer Rim. Jannik the White, leader of the Rodian Reeven Clan, was participating in a doomed honor war with Evo the Blue's Cairn Clan, who greatly outnumbered Jannik's forces; Nym would, for a sum, participate in and hopefully help turn the tide of the battles. After the final battle, he would steal the treasures of the Rodian Grand Protector, who would be overseeing the various honor battles. As the exchange was likely to be picked up by cam droids, Jannik would pretend that Nym had double-crossed him, exonerating the Rodian from the crime, which would be considered grievous by the Rodian people; later, off camera, they would share the spoils. Nym came up with plans for each of the several battles he partook in that would help Jannik's lesser forces triumph, though the Reeven Clan leader tended to completely disregard them, causing Nym no end of frustration. Eventually, Jannik's clan was, along with Nym, Kole, and Jinkins, prepared for a final showdown with Evo, which would take place in a barren, remote desert on Rodia, though Nym's two sidekicks would be staying out of the conflict wherever possible. All three of them were given suits of ceremonial armor, though they were sized to fit Rodians; Nym's was too small, and the Feeorin pirate felt ridiculous as the legions of Rodians prepared to do battle with each other. Should his ceremonial sword prove not enough against Evo's Rodians, however, Nym secretly took an illegal thermal detonator with him to the battle."}, {"tag": "p", "text": "With the holocams watching, the battle began, and Nym led Jannik's Rodian crusaders towards the onrushing army of Evo the Blue, who, from his personal speeder, was leading the Cairn Clan's efforts. Nym was quickly surrounded by hordes of diminutive Rodians, though he was able to fend them off, fighting with the ceremonial sword Jannik had provided him with. Before long, Jannik had gone too deep into the throng of bodies, which was not part of Nym's plan. Nym ordered him to fall back, but the Rodian was too proud to do so, instead allowing Evo's soldiers to cut him off from his own men. Jannik apologized for not sticking to the script, but Nym improvised another plan, charging at Evo and upending his speeder. The vehicles burst into flame, and Nym assumed Evo had perished; however, he managed to survive, and ordered his men to kill Nym. Jannik and Nym were surrounded and greatly outnumbered, with the former pessimistic about their chances of survival. Nym had one trick left up his sleeve, though, throwing the thermal detonator at the ground and using a grappling hook to propel himself and Jannik out of the blast zone and up onto the Grand Protector's observation post."}, {"tag": "h3", "text": "Tackling Sol Sixxa"}, {"tag": "p", "text": "Nym and Jannik then performed their prearranged heist, with Nym making off with the Grand Protector's treasure and Jannik accusing him of betrayal. The two rendezvoused later, splitting the profits as planned. Nym noted that, once the Grand Protector learned of Jannik's involvement in the robbery, he would be the most wanted man on Rodia; for that reason, Jannik wanted Nym to ferry him and his crew offworld. Their discussion was interrupted by the arrival of a Mere female, flanked by two bodyguards, who had been present with the Grand Protector during the heist; some of the stolen loot had belonged to her. She introduced herself as Loreli Ro, a Mere ambassador, and told Nym that she was not interested in reclaiming her treasure but in acquiring Nym's services. Ro explained her proposition for Nym: she wanted him to return to Maramere, very near to Lok, to help her people rid the world of pirate and criminal Sol Sixxa. Sixxa was persistently raiding Trade Federation boats on the planet's seas, which was not a problem in itself, but Ro and her peers were worried that he would change targets, or that the Mere would be caught in the crossfire between Sixxa and his Trade Federation enemies. Not wanting to return to the Karthakk system, Nym took some convincing to take the job, but agreed when Ro offered him a fee of fifty thousand credits."}, {"tag": "p", "text": "Along with Kole, Jinkins, Jannik, and much of the Reeven Clan, Nym departed Rodia in the Havoc, having arranged to meet Loreli Ro at a designated rendezvous point on Maramere. Upon entering the planet's orbit, however, the Havoc was immediately identified by the Trade Federation as a threat, and Nym's ship was set upon by a number of Vulture droid starfighters. Ro contacted Nym via hologram to complain about his being late for their rendezvous, though through a combination of sharp maneuvering and the Havoc's bomblet generator, Nym was able to defeat the vulture droids and escape to the rendezvous point at the coastal town of Point Modie. His exploits, however, had alerted both Sol Sixxa and Harro Ruuk, the Trade Federation's commander on the planet, to his presence."}, {"tag": "p", "text": "Ro contacted Nym and had him put the Havoc down on a local beach rather than the town's starport, so as to avoid another Trade Federation attack. Nym had qualms about doing so, insisting that he could handle anything Harro Ruuk threw at him, and that he would have a better chance of finding Sixxa if he was searching from the air. Ro explained that they'd already made similar attempts; Sixxa was too well hidden, and the only way to find him, she figured, was to use a boat equipped with repulsorlift technology, known as a \"cutter,\" as Sixxa himself did. Ro showed Nym to the Sunrunner, the fastest cutter on Maramere; because of Trade Federation restrictions, it was unarmed, but Nym planned to use the Havoc's bomblet generator. He ordered Jannik to retrieve the generator, the rest of the weapons stored on the Havoc, and the remainder of his clan; Jinkins to get aboard the cutter and ensure it was ready to run smoothly; and Kole to frequent Point Modie's cantinas, eavesdropping on any conversations about Sixxa and gleaming whatever information he could from them."}, {"tag": "p", "text": "Nym didn't want to try to tackle Sixxa without first assessing his capabilities, so after Jinkins and Jannik completed their tasks, he decided to take the Sunrunner out to the location of the latest Trade Federation ship, the Syren, hit by Sixxa, to examine the wreckage and identify the weapons Sixxa was using. Nym went diving down to the wreckage himself, using a comlink to keep in contact with Jinkins. From looking at the sunken ship with his naked eye, Nym discerned that Sixxa and his pirate troupe had used thermal charges to crack the Syren's hull, and armor-piercing blaster rifles to take out the Trade Federation's combat droids. Nym eventually found a severed protocol droid head, which he knew would have a recording of Sixxa's attack. As he went deeper to retrieve some of the ship's treasure as payment for his efforts, though, a giant relix sea predator began to attack him."}, {"tag": "p", "text": "Nym knew he would not be able to outrun the creature, but formulated a plan to defeat it. He lodged the wire connecting him to the Sunrunner, losing his prosthetic arm in the process, and had Jinkins accelerate the ship as fast as possible. It dragged the relix up above the surface, and Jannik's Rodians were able to fire upon and kill the creature. Nym, meanwhile, was able to return to the ship with the droid's head. While one of Jannik's clanmates bandaged the Feeorin's severed prosthetic arm, Jinkins examined the droid's memory banks, but he could gleam only a small amount of information before it shut down. The droid told them that the Syren was carrying experimental Trade Federation prototype technology, but nothing more. Meanwhile, Kole found a survivor from one of Sixxa's raids, and took him to the Sunrunner, hoping he could lead Nym's motley crew to Sixxa's hiding place."}, {"tag": "h3", "text": "Entering the Haunted Straights"}, {"tag": "p", "text": "The Mere survivor led them through the stormy waters to where his ship had been raided, near the dreaded Haunted Straits; expecting an ambush from Sixxa, Nym had Jannik's clan hidden throughout the ship. While they traveled, Jannik fitted a small, functioning hand cannon to Nym's arm in place of his destroyed prosthetic, and Loreli Ro told them that the Haunted Straits were a figure of great superstition among the Mere, and that legend had it that there was a secret paradise island, from which Nym believed Sixxa was launching his strikes. As Nym had anticipated, Sixxa ambushed the Sunrunner as it traveled through the narrow straits, leading a raiding party onto the ship from his own vessel, Revenant."}, {"tag": "p", "text": "Wielding melee weapons, Sixxa's men charged towards Nym, Ro, Kole and Jannik, but Nym was able to use his hand cannon to keep them at bay. After Sixxa mocked Nym for attempting to take him on with only a skeleton crew, Jannik's Rodians revealed themselves, and blasterfire was exchanged between them and the Mere pirates. Sixxa had traps of his own, releasing hordes of wavespeeders from the Revenant, which rounded on the Sunrunner. The newly-installed bomblet generator, manned by Jinkins, took out many of the approaching wavespeeders, much to the surprise of the Mere, who believed all Mere ships to be unarmed. Sixxa ordered a retreat, though he himself stayed on the Sunrunner; he lunged at Nym, and was able to sever the Feeorin's hand cannon. As Sixxa made his way back to his ship, Jinkins attempted to target the Revenant with the bomblet generator, but it faded from his scanners; Sixxa was using an advanced cloaking device, the prototype he had stolen from the Syren. As he left the Sunrunner, Sixxa stabbed Jannik, badly injuring him; furious, Nym gave chase."}, {"tag": "p", "text": "The Feeorin pursued his quarry into the violent Maramere waters; the two tussled under the surface for a time, before they eventually washed up on an \"Invisible Island,\" covered in stygium crystals. The two clashed, Sixxa hoping Nym would take his knowledge of the secret island to the grave, Nym wanting to claim the island's riches for himself. However, they soon realized that Trade Federation forces had arrived and were defeating their respective crews, so they joined forces, temporarily at least, and Nym hatched a plan. Sixxa would return to his ship, where the two crews had surrendered, to sow confusion and fight off the Trade Federation, who thought he was dead; Nym would return to the Sunrunner and overload the bomblet generator, ramming the Revenant. Able to breathe underwater, Sixxa and his men would then escape, and Nym could claim to Loreli Ro that he was dead. Everything went according to plan, and Ro paid Nym for his efforts. Sixxa subsequently contacted Nym, suggesting that they joined forces. The two realized they had a shared hatred of the Trade Federation, and decided that rather than fighting each other, they should combine their effort to eradicate the Trade Federation's presence in the system. Nym agreed to secretly meet Sixxa on the Invisible Island, and they formed a coalition, though Nym made it clear he was in charge."}, {"tag": "h3", "text": "Battling on Maramere"}, {"tag": "p", "text": "Shortly before the Clone Wars, Nym and his forces were operating out of the Karthakk system. However, while on Maramere attempting to steal codes to an orbital prison station, he and the Revenants came under attack by a number of Trade Federation watercraft and starfighters. Thankfully for him, his old smuggler acquaintance Reti, along with Jedi Master Adi Gallia, arrived and fended off the Trade Federation craft long enough for Nym's forces to steal the codes and evacuate. Nym was reluctant to trust Gallia, but she was able to persuade him that she was there to help investigate illegal Trade Federation activities in the system."}, {"tag": "p", "text": "From there, Nym led the Revenants, Reti, and Gallia to Spacestation 1138, the orbital prison whose codes he'd obtained. Fighting his way through hordes of droid starfighters, Nym and his companions flew cover for the Liberator until the larger ship could free Captain Orsai and some of his other Mere Resistance members from the prison. Once that was completed, Nym returned to Maramere to plot his next move. Realizing that the Trade Federation had been using a sizable sensor station in order to spy on his movements, Nym moved to destroy it. Escorting a pair of ships equipped with demolitions charges, Nym and his group blasted their way through the Trade Federation defenses. Engaging starfighters, Trade Federation U-boats, floating mines, laser turrets and tractor towers, Nym's forces were able to successfully demolish the sensor station. Upon its destruction, however, the Trade Federation leader in the Karthakk system, Harro Ruuk, emerged in a large submersible vehicle. In response, Nym and his pirates destroyed this as well after a prolonged fight."}, {"tag": "p", "text": "Nym then planned on leading his Revenants, the Mere Resistance, Gallia, and Reti in a strike on a Trade Federation mining facility on Mount Merakan. However, before they arrived there, Gallia received a distress call from the settlement of Point Modie, which was under attack by trihexalon-based weaponry. Gallia went off to save the civilians there, accompanied by Sixxa and Reti, leaving Nym, Jinkins, and the rest of his forces to target the mining facility and the freighters that were there. Though the target was defended by numerous starfighters and missile turrets, Nym was able to destroy the ore extractors and landing pads of the facility, which he surmised was used to mine the components used in producing trihexalon. During this time, Nym and the Revenants learned that they were up against Captain Cavik Toth, the leader of the mercenary unit Sabaoth Squadron."}, {"tag": "h3", "text": "Raids on Nod Kartha"}, {"tag": "p", "text": "Gallia and Nym then prioritized the disruption and destruction of all trihexalon production facilities. As such, they next struck at Nod Kartha, where there was a trihexalon plant. However, they first had to punch through the world's orbital defenses. Bringing in two Mere cruisers, the Kethor and the Tritus, Nym's forces arrived over the planet in force. The Kethor was quickly struck by fire from the defensive platforms, leading Nym to rally his fighters to defeat incoming Trade Federation droid bombers before they could destroy the Mere Cruisers. Once the bombers were defeated, Nym's forces struck at the orbital defense platforms, hoping to open a hole in them to grant him access to the planet's surface. Even the arrival of several Sabaoth Frigates and their fighter escorts wasn't enough to stop Nym's squadron, and he defeated the mercenaries. However, during the fray, the bounty hunter Jango Fett arrived in pursuit of Reti, who had to jump into hyperspace to escape Fett, though the bounty hunter pursued him."}, {"tag": "p", "text": "Once he arrived on the surface of Nod Kartha, Nym led a commando team to assault a series of shield bunkers protecting the trihexalon plant, planting demolitions in each one to weaken the shield and render the plant vulnerable to assault. With Gallia and Jinkins flying cover, he was able to destroy all five of them despite waves of Trade Federation STAPs, battle droids, and AATs. At the last bunker, Nym ordered his team to fight to the death to defend the charges they had set on the bunker. However, Adi Gallia set her fighter down near the bunker and fought her way inside, defending Nym and his pirates to allow them to retreat. The Jedi Master and Feeorin pirate had just made it out of the bunker when it exploded, eliminating the shield and leaving the trihexalon plant open to assault. Nym then returned to the Havoc to launch a final assault on the plant."}, {"tag": "p", "text": "Nym used the Havoc to clear off the landing pad on the plant with the aid of his gunner, Kole, destroying battle droids and laser turrets, to allow Sol Sixxa to land and enter the plant in order to open the hangar doors. While Sixxa did so, Nym fended off waves of Sabaoth fighters and Trade Federation dropships that attempted to reinforce the plant's defenses. Once Sixxa opened the doors, Nym flew the Havoc inside to knock out a transmitter inside the plant. That action exposed five solar reflection towers, which Nym then destroyed to grant him access to the plant's reactor core. Nym then blew up the reactor core with his ship, destroying the weapons plant once and for all. After the battle was won, though, Adi Gallia departed the Karthakk system for Geonosis, having learned that Jedi Knight Obi-Wan Kenobi was in trouble there. Nym was sorry to see her go, as the Feeorin pirate had built up a measure of respect for her."}, {"tag": "p", "text": "Nym then took the Revenants into orbit of Nod Kartha, in order to salvage parts for an Orbital Defense Cannon. However, a Sabaoth destroyer arrived and began deploying Trade Federation tugs, along with Sabaoth and droid fighters, to take the cannon for their own. Nym led his fighters in battle once more, destroying waves of tugs and fighters while his own tugs retrieved parts for the cannon and took them back to the Tritus. However, once all the parts were recovered, three Sabaoth frigates arrived in a final attempt to seize the cannon. Those, too, were unable to stop Nym and the Revenants from escaping with the cannon, though."}, {"tag": "h3", "text": "Reclaiming his base"}, {"tag": "p", "text": "From there, Nym took the parts of the cannon to Khons, a moon of Lok, to begin re-constructing it. Before he arrived, though, he learned that several starfighters and the Tritus had failed to make it to Khons due to engine trouble. Instead, Nym had Captain Juno of the Tritus send the cannon parts to Khons via hyperspace tug to begin assembly as soon as possible. However, he first had to destroy the Trade Federation presence there, which included capital ship turrets, missile launchers, starfighters, and Trade Federation missile frigates. Nym, Jinkins, and the other Revenants defeated the Trade Federation forces once more, buying time for the cannon to be assembled. As it was nearing completion, a Trade Federation cruiser arrived insystem and began firing cruise missiles at the cannon. Nym and the Revenants shot down the cruise missiles until the cannon was ready to fire; the weapon completely destroyed the cruiser."}, {"tag": "p", "text": "Nym then led the Revenants down to the surface of Lok to reclaim his base, which the Trade Federation had converted into a refueling station. For this battle, he was joined by his old acquaintance Vana Sage. Nym used the Orbital Defense Cannon to good effect during the battle, calling down fire on large Trade Federation targets such as dropships and missile frigates. He then fended off large numbers of AATs and starfighters that emerged from the base in order to cover three transports that were carrying a strike team to assault the base. During the battle, Cavik Toth fled the station in his personal fighter, and was pursued by Sage, while the Revenants continued their assault. Once the strike team, led by Sixxa, blasted open the doors, Nym flew the Havoc inside to knock out the docks inside the base. In the final stages of the battle, though, Lieutenant Bella, Cavik Toth's second in command, emerged in her personal craft and entered the fray. Nym and his forces shot her down, killing her. With the end of Trade Federation and Sabaoth resistance, Nym had successfully reclaimed his base."}, {"tag": "p", "text": "Upon learning that Toth had taken a fleet of Hex Deployers and Hex Bombers to the Outer Rim world of Geonosis, Nym sent a message to Gallia warning her of the danger. Nym then led the Revenants to Geonosis, and assisted Adi Gallia in repelling Toth's fleet. Gallia destroyed Toth's fighter in the battle, resulting in Toth's death and an end to the hex threat. Following the Battle of Geonosis, Jedi Master Mace Windu offered Nym a position as commander of the Karthakk system. He declined, preferring to \"keep his options open.\" However, Gallia accompanied him back to the Karthakk system, and he parted on friendly terms with the Jedi."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "From his base on Lok, he became the leader of his people, and during the Galactic Civil War he was a Rebel Alliance sympathizer, although he never openly supported either side. He attacked transports, usually Imperial, along the Corellian Trade Spine and helped Rebel pilots who became stranded on his planet. While the membership in his organization was in a constant state of flux, he retained his two loyal lieutenants, Kole and Jinkins. During this time, Nym was rumored to be willing to offer Jinkins' engineering talents to those who made several smuggling runs for him. Another rumor that circulated about the Feeorin pirate was that he still had a few possessions left to him by Jedi Master Adi Gallia. Nym's faction established a factory compound on Lok, which he used to hide much of his treasures stolen over the years. However, during the Galactic Civil War, the compound was taken over by the droid bounty hunter IG-88, who used it to produce battle droids, until a group of spacers recaptured it and shut down production."}, {"tag": "p", "text": "The commander of the Imperial forces on Lok, General Otto, had an understanding with the pirate, in that Nym's activities would not be interfered. Nym, in return, refrained from making attacks on the Imperial presence there. However, while on Tatooine, Commander Oberhaur of the Storm Squadron dispatched their newest recruit on several missions to Lok in order to disrupt Nym's affairs. Nym himself broke their deal on more than one occasion; he had a fringer, whose worth had already been proven to both Kole and Jinkins, raid an Imperial research facility on Lok, recovering of the all research data and a number of Imperial Military Grade Grenade Casing Units. Nym sometimes left Lok and traveled to other worlds; at some point during the Galactic Civil War, he was seeing to business with Kole in Narmle on Rori. When a spacer came to Nym with part of an ancient starmap, the Feeorin's interest was piqued, as he had had a previous employee search for the same starmap. Nym had the spacer recover the remainder of the map, from locations on Kashyyyk, Dathomir, and finally Tatooine, where the spacer purchased the final piece from former smuggler Han Solo. However, the ultimate starmap, when assembled, proved to be a dud, leading to a dead planet Nym had already visited, and Nym was sure that Solo knew as much. Furious, the Feeorin refused to pay the spacer what he had agreed to, and he and Kole went straight to Tatooine to speak with Solo. Around the same time, Nym held a large anniversary celebration at his palace, which many beings attended. The well-known jizz band Figrin D'an and the Modal Nodes were hired to provide entertainment; a great fireworks display was organized; and free food and beverages were provided to guests. Also, at some point an unspecified individual hired a spacer through Dengar to get even with Nym for the reason he didn't care to specify."}, {"tag": "p", "text": "In 1.5 ABY, Nym's stronghold was visited by Finn Darktrin, an Imperial agent posing as a member of the Rebel Alliance and Dusque Mistflier, a former Imperial biologist who had been forced to flee the Empire. Darktrin, whom Nym owed a favor, and Mistflier met the Feeorin pirate in a cantina on Lok. Nym was impressed with Darktrin's choice of company, proclaiming that Mistflier was far better than his company on a previous occasion, and asked Darktrin what he wanted. As it turned out, Darktrin wanted a ship to get himself and his companion to the Core Worlds. Nym, however, denied the request, saying that what he owed Darktrin wasn't worth it. He did agree to make a business deal with Darktrin, though. If Darktrin and Mistflier brought back part of a hyperspace map from some corsairs that held it in a nearby camp, Nym said he would provide them the transportation they needed. Darktrin begrudgingly accepted the deal and Nym gave them permission to use his armory for any supplies or weapons they needed for their mission."}, {"tag": "p", "text": "It wasn't long before Mistflier and Darktrin returned bearing the map, having successfully defeated the corsairs. They arrived back at Nym's stronghold just as the pirate was being pitched a recruitment spiel to openly work with the Rebel Alliance by smuggler Han Solo and his Wookiee first mate, Chewbacca. Nym insisted that he would stay out of the war, rejecting Solo's offer, but upon seeing Darktrin, he did honor his deal, providing them with a transport and a Mon Calamari pilot named Peralli. Furthermore, he also provided a crate of weaponry for the pair as a parting gift before he sent them on their way to Corellia, escorted by Solo and Chewbacca in their own ship, the Millennium Falcon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Fearsome in nature and appearance to many of the galaxy's inhabitants, like all Feeorin, Nym only grew stronger with age. His reputation as a ruthless strategist and combatant even made the Empire hesitant to cross him and his organization. He was raised by criminals in the Outer Rim, and his impoverished youth afforded him time to practice his tactical skills. The Feeorin pirate was later regarded as a brilliant tactician in his own right, and was respected for his abilities. Nym was also unafraid to challenge powerful organizations, such as the Trade Federation, or launch raids deep into the Core Worlds. After his capture by Vana Sage, Nym became even more willing to target Trade Federation facilities and vessels. In battle, he was prepared to sacrifice himself if he believed the cause important. While he was unwilling to stand and fight over the loss of his base during its capture by the Trade Federation, Nym felt that the destruction of a weapons plant producing trihexalon was worth fighting to the last man for, though he and his demolition team were ultimately saved from a group of battle droids by Jedi Master Adi Gallia."}, {"tag": "p", "text": "Nym could also be vengeful, such as when he imprisoned Sage even though the mercenary tried to tell him how the Trade Federation turned on her as well. He was prone to fits of anger in combat, often shouting threats over the communication system when his opponents taunted him—threats that were usually swiftly made good upon. He was also a loyal pirate leader, who looked after his friends and comrades. Nym often placed his own welfare in jeopardy to rescue his assistant, Jinkins, and expressed regret at the loss of others, such as the presumed death of Reti at the hands of Jango Fett. He had a distrust of Jedi, however, although his suspicion towards Jedi Master Adi Gallia did soften after she helped him free the Karthakk system from the Trade Federation. His friendship with Gallia even caused him to bring his Revenants to aid her in battling Cavik Toth over Geonosis, although Toth was also a personal enemy of Nym's."}, {"tag": "p", "text": "The Feeorin was also fiercely independent. At the onset of the Clone Wars, the Republic offered him a position as commander of the Karthakk system, but he refused the offer. In his rejection, Nym said that he preferred to keep his options open. Years later, during the Galactic Civil War, he rejected another offer, this time from Rebel Han Solo, to join the Rebel Alliance, despite Solo's promises of lucrative rewards and opportunities. However, that did not stop him forming temporary partnerships with people such as Rhys Dallows and even his former enemy Vana Sage in order to strike at the Trade Federation. Nym made more than one unlikely alliance during his career; he worked alongside Vana Sage against the Trade Federation despite previously hating her with a passion, and he joined forces with Sol Sixxa even though the two had been adversaries and both nearly killed each other, as well as members of their respective crews. Ultimately, Nym's hatred of the Trade Federation was far stronger than his hatred of any individual."}, {"tag": "p", "text": "Nym enjoyed the company of humanoid females he considered attractive and witty, even those outside his species. He was also willing to honor a debt or a favor that he owed someone, though the extent to which he was return the favor depending on his interpretation of its worth. He was also a businessman, willing to make deals with people in exchange for services or tasks that he wanted performed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Havoc"}, {"tag": "p", "text": "Nym's personal starfighter was called the Havoc. Manufactured by the Nubian Design Collective at great cost, the prototype \"Scrugg H-6\" bomber that would eventually become known as Havoc was designed in the hopes of selling an entire line to the people of the planet Naboo. However, the pacifist Naboo were not interested in such a heavily armed fighter and declined Nubian's offer, and the project was scrapped. Jinkins, the ship's chief designer, subsequently conspired with Nym to have the bomber stolen, so that his work would not go to waste, and Nym piloted the Havoc in many of his most well known dogfights."}, {"tag": "p", "text": "The Havoc's speed, armor, shields, and onboard systems were all considered impressive, but the ship's powerful arsenal of weapons were what set it apart from other starfighters. With six forward-facing laser cannons, a powerful rotating laser turret mounted on top of the ship, and the ability to launch proton bombs, it was among the most well-armed ships of its size in existence. After Nym's raiders took the vessel, they heavily modified the craft. Jinkins installed the experimental and volatile bomblet generator aboard the ship, with two bomblet chutes each holding five bombs; the generator drew power from the main generator to replenish the energy bomb supply over time. It was later upgraded with an advanced version of the bomblets known as the plasma scourge. Jinkins also modified the ship, built for a crew of five, to operate with Nym as the sole pilot."}, {"tag": "p", "text": "Nym added more weaponry to his ship in later years. Shortly before the Clone Wars, the Havoc was loaded with cruise missiles in addition to the bomblet generator, and later also equipped cluster missiles and proximity mines. These heavy weapons allowed Nym to destroy entire bases or freighter convoys with the Havoc, serving him well during his battle against Cavik Toth and the Trade Federation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The pirate Nym first appeared in the 2001 game Star Wars: Starfighter as one of three playable characters. Around a month after Starfighter's release, the character appeared in W. Haden Blackman and Jan Duursema's \"Single Cell\", a short comic published in Star Wars Tales 7 which acts as a prelude to Nym's part in the game. Nym had a larger role in Starfighter's sequel, Star Wars: Jedi Starfighter, which was set just before the outbreak of the Clone Wars and featured Nym as one of the game's two protagonists. Before the game's release, Nym appeared as the lead character in Dark Horse Comics' Starfighter: Crossbones, a three-part comic tie-in to Jedi Starfighter written by Haden Blackman and illustrated by Ramón Bachs. The final issue of the comic was released several days after the game's release. Nym was voiced by Charles Rocket in both Star Wars: Starfighter and Star Wars: Jedi Starfighter. Later, Nym appeared as a non-playable character in Star Wars Galaxies, as well as a small role in a spinoff Galaxies novel, Star Wars Galaxies: The Ruins ,of Dantooine. In the Galaxies game, Nym's cybernetic hand appears on his right hand, while in other sources it is on his left."}, {"tag": "p", "text": "The character also earned a figurine in Star Wars Miniatures, as well as an entry in the official Databank. Additionally, Nym received mentions in reference guides such as The New Essential Guide to Characters, The New Essential Guide to Vehicles and Vessels, and The Clone Wars Campaign Guide. Finally, Nym, along with his powerful bomber Havoc, was featured in Star Wars: Armada, a RTS board game by Fantasy Flight Games, as an unique fighter squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}