{"url": "Nym%27s_Stronghold", "categories": ["Category:Legends articles", "Category:Cities", "Category:Lok locations"], "nodes": [{"tag": "h1", "text": "Nym's Stronghold"}, {"tag": "p", "text": "Nym's Stronghold was the largest city and sole planetary spaceport on the planet Lok. It was built prior to the Galactic Civil War around the base used by Nym and his pirates during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Nym's Stronghold was located on the desert planet Lok, in the Outer Rim Territories. The city was located on the banks of the Grendin River and bordered the cliffs where Nym established his base before the Invasion of Naboo. Considered as a stronghold itself, the city was surrounded by tall walls. It was controlled by the Lok Revenants and was patrolled by Nym's guards and by trained kusaks."}, {"tag": "p", "text": "A bridge connected the main part of the city to a landing platform, on the other shore of the Grendin River. Nym's Stronghold was the only starport in the Karthakk system. To access this starport, starships needed to be cleared for landing at the Lok Space Station orbiting the planet. In any case, Nym's Stronghold was a haven for outlaws, pirates and smugglers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nym's Stronghold was built sometime after the Lok Revenants reclaimed their old base from the Trade Federation at the beginning of the Clone Wars. By the time of the Battle of Yavin, Nym had become the unique ruler of Lok and the city could be considered de facto as his capital. Nevertheless, Nym remained a pirate and was quite reluctant to deal with daily matters of his city. After the Battle of Yavin, a mob of disgruntled townspeople protested near Nym's fortress against the shortage of drinkable water in the city. This situation forced Nym to send his henchmen fix the water treatment facility. Around the same time, another Revenant, Ran Machado, was tasked by Nym to pull up some of the unintended foliage in the Stronghold."}, {"tag": "p", "text": "Nym's Stronghold was the starting point of the Lok Marathon swoop race. After the Battle of Yavin, the champion Kimmi Chyler used to travel to the city to participate to the race. During one such race, a firefight erupted between the smuggler Dash Rendar and ISB Captain Jeffren Brek."}, {"tag": "p", "text": "After the Battle of Yavin, Han Solo and Chewbacca traveled to the Stronghold. As Nym was sympathetic towards the Rebel Alliance, they wished to convince him to support actively the Rebellion. Dusque Mistflier and Finn Darktrin also visited the city in 1 ABY and met Nym on his fortress."}, {"tag": "p", "text": "The same year, Nym's Stronghold held a large anniversary celebration known as Nym's Anniversary Bash."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}