{"url": "Nyo", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Nyo"}, {"tag": "p", "text": "Nyo was a male Force-sensitive Human from Morado who lived during the Galactic Empire and dreamed of being a Jedi Knight."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human born to parents on the planet of Morado during the reign of the Galactic Empire, Nyo always dreamed of becoming a Jedi Knight despite that the Jedi Order had been dismantled and outlawed by the Empire the year before his birth. When he was old enough, Nyo took up gambling with his entire savings of credits to raise money to buy a lightsaber, despite the fact that lightsabers were illegal under Imperial law. When Nyo got in over his head with a Herglic named Doune, losing all but one credit, he was rescued by a gambler named Kinnin Vo-Shay who used the single credit to win more than 200,000 credits for Nyo to use to purchase the lightsaber. Traveling to Nar Shaddaa with Vo-Shay, Nyo intended to receive a lightsaber from a dealer he had paid in advance for the weapon. Upon arriving, they discovered that Doune had already arrived ahead of them and stole the lightsaber."}, {"tag": "p", "text": "Determined to win back the lightsaber, Vo-Shay bet the amulet around his neck which supposedly granted him his prowess in gambling in exchange for the lightsaber. Purposely throwing the match, Vo-Shay handed over the amulet while Doune handed over the lightsaber as he claimed he no longer needed it with such a powerful amulet in his possession. As Doune wandered away, Vo-Shay handed over the lightsaber to Nyo and introduced the boy to his real source of luck; the spirit of Jedi Master Aryzah. Inviting Nyo to join them aboard Vo-Shay's ship, the three departed the moon to travel the galaxy and study the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}