{"url": "Nyrox", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Nyrox"}, {"tag": "p", "text": "Nyrox was a Human male who served in the Imperial Army during the Galactic Civil War. A product of the elite training program at Raithal Academy, Nyrox demonstrated his skill and ingenuity in the cockpit of the giant All Terrain Armored Transport. Having caught the attention of the walker line's main proponent, Maximilian Veers, Nyrox graduated from the Imperial Academy and was promptly promoted to the rank of lieutenant. Veers selected Nyrox to pilot the AT-AT walker Thunderer One, the lead walker of Thundering Herd, his personal AT-AT unit. In 3 ABY, Nyrox served under Veers at the Battle of Hoth, leading the invading walker squadron to victory over the Rebel defenders of Echo Base. He earned the rank of captain for his actions."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Nyrox was a graduate of the prestigious Raithal Academy, a training branch of the Imperial Academy, where he trained in the ground warfare tactics of the Imperial Army. Nyrox was instructed in all types of Imperial Army hardware, ranging from ground-based artillery to complex vehicles like the HAVw A5 Juggernaut, the HAVr A9 Floating Fortress, and PX-4 Mobile Command Bases. His weapon of choice, however, was the mammoth All Terrain Armored Transport. Nyrox relished the sense of power the walker afforded him."}, {"tag": "p", "text": "He demonstrated his ability in the cockpit of the AT-AT with such flair that it caught the attention of Maximilian Veers, the premiere supporter of walker technology. During an inspection tour of the Raithal Academy sometime during the formation of the Dark Lord Darth Vader's personal Star Destroyer fleet, the Imperial Death Squadron, Veers witnessed Nyrox's skill first-hand. Nyrox was running a full-immersion holo-simulation against a squadron of Rebel Alliance airspeeders supported by Ultra-Light Assault Vehicles and Freerunners. When a lucky hit crippled one of his AT-AT's legs, Nyrox resourcefully decided to take up a defensive crouching posture. Although the maneuver ground the walker's bearings to the very hub, he was able to destroy each Rebel craft by making them come to him."}, {"tag": "p", "text": "Most impressed with the trainee's simulation, Veers appointed Nyrox as pilot for his lead walker, Thunderer One, the point walker of Thundering Herd, an elite AT-AT force under his command. Nyrox's abilities earned him the rank of lieutenant straight out of the Academy. During his time at Raithal Academy, he filed a report at the Raithal Academy on understanding and preparing for enemy exploitation of the AT-AT's vulnerabilities, and it was later included in the Imperial Handbook guide for Imperial commanders."}, {"tag": "p", "text": "Nyrox served with Veers through action at the Battle of Hoth, the Imperial campaign to crush the Rebel Alliance headquarters of Echo Base in 3 ABY, during which he piloted the invasion's lead walker. For his actions during the Rebel defeat at Hoth, Nyrox was promoted to captain."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like many Imperial personnel, Nyrox enjoyed a sense of power and control over his opposition, which is what influenced his taste for the might of the AT-AT. He possessed a certain level of military tactical prowess and flair, opting to assume a defensive position with his AT-AT during a training exercise after the walker suffered damage to one of its legs, and allowing the enemy craft of his groundbreaking simulation to come to him rather than to seek them out. His skill was well employed during the Battle of Hoth, during which he led the invasion's lead walker in routing the Rebel defenders of Echo Base. Nyrox stood 1.7 meters in height."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As an Imperial Army pilot, Nyrox possessed mechanical ability in the operation of ground vehicles, repulsorlift craft, walkers, and AT-AT gunnery. He also had specific technical knowledge in AT-AT walker repair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Nyrox's equipment included a blaster pistol and battle armor, with an internal comlink, that covered his head and chest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Nyrox first appeared in the 1989 first edition of the West End Games sourcebook Galaxy Guide 3: The Empire Strikes Back as an example of a standard AT-AT pilot, which provided the character only with basic roleplaying stats. The July 1996 second edition of the sourcebook included a detailed biographical profile of Nyrox as part of a major expansion on the text by Pablo Hidalgo."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "The second edition of Galaxy Guide 3 explains that Nyrox piloted Thunderer One, the lead walker of Veers' elite Thundering Herd AT-AT squadron, the walker squadron assigned to the Battle of Hoth. This implies that Thundering Herd is the AT-AT unit seen in the film Star Wars: Episode V The Empire Strikes Back and that Thunderer One is the AT-AT seen commanded by Veers himself, which would also seem to imply that Nyrox is the pilot seen alongside Veers in the AT-AT cockpit in the film. However, the subsequent November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game identified Veers' lead walker as \"Blizzard 1,\" a part of Blizzard Force, Darth Vader's elite assault unit, whereas Galaxy Guide 3 did not necessarily place the AT-ATs of Thundering Herd as part of Blizzard Force. The Thundering Herd unit has never again been referenced in Star Wars canon following the 1996 Galaxy Guide 3 publication, whereas Blizzard Force has become the recognized name of the Imperial forces at Hoth. Nevertheless, until any further canonical connection is made, this article assumes that the Thunderer One and Blizzard 1 walkers are separate entities."}, {"tag": "p", "text": "Nyrox's tactic of assuming a defensive, kneeling posture with his AT-AT is strikingly similar to the tactic employed by a promising Imperial cadet named Davin Felth in the short story When the Desert Wind Turns: The Stormtrooper's Tale, as part of the 1995 anthology book Tales from the Mos Eisley Cantina. However, in the story, rather than rewarding Felth as he does Nyrox, Veers reassigns Felth to the Imperial Stormtrooper Corps to mask an exposed weakness pointed out by Felth regarding the AT-AT design. The Star Wars: Imperial Handbook: A Commander's Guide, released in 2014, includes a report filed by \"Captain\" Nyrox, but the book is said to have been published in 0 BBY, several years before Nyrox became a captain."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}