{"url": "Nysorly", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Hunters"], "nodes": [{"tag": "h1", "text": "Nysorly"}, {"tag": "p", "text": "Nysorly was a human female big game hunter who was active sometime after the end of the Galactic Civil War. At some point, Nysorly went to the planet Ithor to hunt a predatory molsume for its pelt. After killing a molsume that tried to ambush her, she met the Dowutin hunter Grummgar, who was also hunting molsumes. The two traded banter while at each other's mercy, with Nysorly under the impression that Grummgar was intent on stealing her prize. When Grummgar suddenly fired his rifle, Nysorly shot his speeder bike out from under him and sent him crashing into a tree. In actuality, Grummgar had shot at a second molsume that had snuck up behind Nysorly. Grummgar survived the crash, and the two hunters agreed to help each other process their molsume pelts."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The molsume hunter"}, {"tag": "p", "text": "A young, short human female, Nysorly was left to live on her own sometime after the Galactic Civil War when she was sixteen years of age. She pursued the life of a professional big game hunter and learned how to skin the pelts of molsumes, large predatory animals that lived on the planet Ithor. At some point, Nysorly went after the pelt of a molsume in order to sell it somewhere, although hunting in Ithor's jungles was considered illegal. After arriving in the jungle with a modified shortblaster and a backpack, she hunted molsumes for a week. Eventually, she found a clearing at the bottom of a hill and placed her backpack off to the side, hiding her gun underneath it. She proceeded to inspect the nearby fungi, while using herself as bait for the predator she sought."}, {"tag": "h3", "text": "Nysorly and the Dowutin"}, {"tag": "p", "text": "As Nysorly waited for her prey, she was spied upon by another game hunter. Sitting on speeder bike at the top of the hill, hidden by the foliage, was the Dowutin hunter Grummgar, who had been hired to bring in a molsume pelt. He went unnoticed by Nysorly. Eventually, a molsume neared the clearing, which both hunters noticed. Unaware of Nysorly's intentions, Grummgar decided to not warn the girl about the approaching animal and instead use her as bait. He rationalized that if he was fast enough, he could stop the beast from killing her. However, Nysorly was aware of the molsume, and when it sprang from behind her, the human hunter grabbed her shortblaster and shot the molsume in the face, killing it. Grummgar, surprised at the human's skill, decided to confront her and congratulate Nysorly on her kill. He did not make it far down the hill when Nysorly noticed the large alien and trained her blaster on him, under the impression that he intended to steal her kill."}, {"tag": "p", "text": "While Nysorly kept her weapon trained on the Dowutin, Grummgar pointed his gun slightly away from her as a sign of goodwill. Grummgar assumed that Nysorly's shortblaster was empty, as shortblasters typically carry a single round. However, Nysorly's blaster had been modified to carry two shots. When Grummgar insisted that she could miss, she claimed that she never missed, after which Grummgar claimed that they were at an impasse. Nysorly disagreed. Grummgar kept the conversation going, and they continued to banter, wondering out loud if one them had to kill the other over the molsume pelt. Without warning, Grummgar spat in Nysorly's direction. Fearing that the spittle was poisonous, Nysorly ducked aside and shot Grummgar's speeder as he fired his own weapon. The Dowutin's speeder careened into a carnivorous johinuu tree that tried to eat Grummgar, only to spit him out into a patch of fungi."}, {"tag": "p", "text": "Nysorly began to reload her weapon when she sensed a presence behind her: a second molsume with a fresh, fatal blaster wound to the head. Grummgar climbed from the fungi plants and Nysorly thanked him for saving her from the second molsume. Both hunters were content with the fact that they had trophies of their own, although Nysorly commented on that Grummgar's blast could have been for her if the second molsume had not appeared. Nysorly explained how long she had been on her own, and Grummgar revealed that he had had a similar, lonely upbringing. Grummgar offered to carry Nysorly's molsume for her, and in turn she offered to help him skin his molsume before prompting the possibility of a partnership. He withheld interest as he preferred to hunt alone, and claimed to have other business interests. When Nysorly pried for further explanation, Grummgar instead told her that he wanted compensation for his speeder."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Nysorly was a small, youthful-looking human with sharp, reactive reflexes. As a result of being on her own, Nysorly developed a cautious, unassuming demeanor that disallowed her from easily granting anyone too much trust. Nysorly kept a calm, level head throughout the entire standoff with Grummgar, and was only unnerved by his returned calmness. Nysorly was not knowledgeable of Dowutin spittle, and evaded Grummgar's spit blast in fear of it being toxic. In addition, she evaded the spittle and returned fire all in the amount of time it took Grummgar to fire his weapon at the molsume behind her. After realizing Grummgar had saved her, she offered him his thanks and a partnership."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When Nysorly hunted molsumes, she carried with her an expensive, powerful shortblaster that had been modified to carry two explosive shells as opposed to just one. When the first molsume attacked, she shot it under the jaw; the explosive shell shattered the animal's brain and nearly decapitated the creature. After firing the second shell at Grummgar's speeder, she had to reload the weapon. She also carried with her a large backpack that was able to conceal the weapon entirely by laying on it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nysorly was created for the short story \"Bait,\" which appeared in issue 162 of Star Wars Insider, which was written by Alan Dean Foster. Although the short story had several illustrations that were provided by Brian Rood, Nysorly does not appear in any of them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}