{"url": "Nyss_Nenn", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Assassins", "Category:Males", "Category:Sith minions", "Category:Umbarans"], "nodes": [{"tag": "h1", "text": "Nyss Nenn"}, {"tag": "p", "text": "Nyss Nenn was an agent of the One Sith around 41 ABY. He was assigned to capture the Force-sensitive clone Soldier, as well as Jaden Korr."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nyss Nenn was one of the first agents of the One Sith active in the galaxy and was performing missions before their existence had been revealed. In 41 ABY, he was involved by Darth Wyyrlok to hunt Jaden Korr in the Unknown Regions. Nyss was selected for the task because of his unique, inherent ability to cut off a Force-sensitive's connection to the Force. Nenn was assigned to capture Soldier, the only successful attempt at cloning a combination of Jedi and Sith DNA. He was also assigned to capture Jaden Korr and replace Korr with and Iteration, as the One Sith believed that Korr was falling to the dark side too soon."}, {"tag": "p", "text": "Nenn watched alongside Wyyrlok via a remote cybernetic eye the mission of the Anzat Kell Douro on the Frozen moon; when they discovered that he was killed, Nenn was ordered to take charge of the mission to track down Jaden Korr, in a plot to infiltrate the New Jedi Order. However, the clone was unstable, and the Sith needed more DNA of Jaden or of his Community clone Soldier. Nenn then departed from Korriban, alongside his twin sister Syll and the Iteration in stasis."}, {"tag": "p", "text": "He tracked them to Fhost, and searched the clone's ship, but found only the insane and nearly-dead clone Two-Blade, who he easily killed. He then sneaked aboard a medical supply ship that the clones planned to hijack. After the ship was hijacked, he made his way toward the cockpit, intending to capture Soldier. He then encountered the clone Runner and the captured spacer Khedryn Faal. Nenn attacked and killed Runner in a vicious battle, and captured Faal. He managed to ambush and kill the clone Hunter and then ambushed Soldier in the cockpit. With the element of surprise on his side, he was able to defeat and capture Soldier. He then contacted Jaden Korr and offered to release Faal, in exchange for Jaden giving himself up. Jaden agreed and exited into space in a hardsuit, but Khedryn and Soldier were able to regain control of the ship, forcing Nyss to flee in an escape pod. He called Syll in in their scout ship and ordered her to destroy Khedryn's escape pod. However, Jaden deflected the blasts back into the scout ship, killing Syll. When Nyss returned to the ship and discovered this, he became fixated on getting revenge on Jaden Korr. After some time, he tracked Jaden and the clone to a mysterious Rakatan space station, which turned out to be the entity that had called the clones to it. He then took the Iteration into the station, intending to replace Korr with it. He located Jaden and his apprentice, Marr Idi-Shael, and knocked Marr unconscious after cutting the Jedi off from the Force. He wounded Jaden with a vibroblade to the arm and fought with the Jedi, but he was killed when Korr strangled him to death. His plan ultimately failed, when the Iteration was implanted with Jaden's memories before it was ready to receive them, wiping out its personality."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Nenn was a skilled swordsman and a lethal killer. In addition to their stealth qualities of Umbarans, Nyss Nenn and his twin sister, Syll, had the unique talent to be able to attenuate the abilities of any user of the Force, although the twins weren't themselves Force-sensitive. Nyss considered himself to exist apart from the rest of the universe, with his sister as his only company. He and Syll preferred the dark, and often tried to avoid sunlight. Nyss's ability was challenged only by Soldier, who was partially resistant to it. Nyss was extremely close to his sister, and her death drove him to extreme rage. After her death, he found that his power was stronger, which surprised him, as he had always thought that Syll had made his power stronger. He was a master of hand-to-hand combat and was able to kill the clones Two-Blade, Runner, and Hunter. He also defeated Soldier in a hand-to-hand battle, although he was forced to retreat when Soldier recovered his lightsaber. Nenn was able to injure Jaden Korr in their fight but was defeated and killed by the Jedi."}, {"tag": "h2", "text": "Appearances"}]}