{"url": "O%27cerry", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of the Alchenaut sector", "Category:Creatures of unspecified biology", "Category:Herbivorous creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "O'cerry"}, {"tag": "p", "text": "The o'cerry was a non-sentient herbivore species native to the Expansion Region moon of Alchenaut. Discovered and named by Jedi biologist Bowspritz at some point prior to 990 BBY, the species was noted for its habit of acting as a predator alarm for other herbivores in the ecosystem. Bowspritz included o'cerry in the \"Galactic Bestiary\" section of The Jedi Path: A Manual for Students of the Force, which introduced the species to numerous generations of Jedi trainees."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A non-sentient herbivore species, o'cerrys were native to the moon of Alchenaut, which was located in the Expansion Region of the galaxy. Described as \"palm-sized\" by Jedi biologist Bowspritz, they were round in shape and mostly covered with thick fur of greenish gray color, except for their faces, which exposed the species' brownish skin. O'cerrys had two gray-blue eyes, which were large in proportion to their faces. Between the eyes, they had a flat nose with two nostrils and under them a wide mouth."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "The o'cerrys collaborated with thousands of other herbivores living in the same ecosystem by warning them of approaching predators."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime prior to the year 990 BBY, the species was discovered and named by Jedi biologist Bowspritz. O'cerrys' existence and other pertinent details about the species were subsequently recorded in the Jedi Archives. Considering the o'cerry an enlightening occurrence of cooperation between species, Bowspritz included it in the \"Galactic Bestiary\" section of the Jedi trainee instruction guidebook The Jedi Path: A Manual for Students of the Force, which exhibited animals the trainees might come across when roaming the galaxy. First printed as early as 990 BBY, the book introduced o'cerrys to generations of Jedi students, as it was still used centuries later during the Clone Wars, which began in 22 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "O'cerrys were first mentioned in The Jedi Path: A Manual for Students of the Force, a reference book written by Daniel Wallace and published in 2010. The o'cerry illustration in the book was drawn by Derek Thompson."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}