{"url": "O%27reenian", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with gameplay alternatives", "Category:Human and Near-Human species", "Category:O'reenians", "Category:Unknown Regions species"], "nodes": [{"tag": "h1", "text": "O'reenian"}, {"tag": "p", "text": "The O'reenians were the inhabitants of the planet O'reen in the Unknown Regions; although originally Humans, they eventually evolved into a distinct sentient species of near-Humans. The species appeared similar to Humans physically with the exception of orange-hued skin. Their society and culture, on the other hand, were unique in that the O'reenians were divided into several distinct castes based upon military service. O'reenians who served in the military for six or more years were granted the rights and privileges of citizenship, while those who did not were relegated to menial occupations of the sort generally carried out by droids on worlds more technologically advanced than O'reen. Only slaves occupied a social position below non-citizens. A military dictator known as the Magnus ruled the O'reenian government and commanded its military. The system made O'reenian society highly regimented and disciplined, with an emphasis on martial prowess. Indeed, even O'reenian scientists wore sidearms while at work."}, {"tag": "p", "text": "Although they were descended from colonists sent to O'reen by the Galactic Republic in the aftermath of the Great Hyperspace War, the location of their homeworld in the Unknown Regions kept the O'reenians isolated and self-sufficient for millennia. Through several chance encounters with offworlders, the O'reenians realized that their technology had fallen behind that of the rest of the galaxy, and the government implemented a policy of raiding nearby star systems to take weapons and devices that O'reenian researchers could then reverse-engineer. These missions, normally carried out by pilots in the O'reenian Star Corps, afforded the species a sense of protection against what they perceived as outside threats. Government policies of the Galactic Republic and the O'reenians alike regularly maintained that keeping the species isolated was the most beneficial course of action; nevertheless, during the Yuuzhan Vong War, the Magnus adopted a policy of potentially taking advantage of the conflict to expand O'reen's sphere of influence."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Although originally mainline Humans, the O'reenians evolved into near-Humans, with an anatomy that mimicked that of mainline Humans in most ways. That is, each O'reenian had a humanoid body, with two arms with five-fingered hands, two legs, and a head; likewise, their face featured two eyes, two eyebrows, a nose, two ears, and a mouth. The major distinctions between the two species were the O'reenians' orange-tinted skin and black eyes. O'reenians tended to have dark-brown hair. At least some males of the species kept their hair close-cropped, while others sported short goatees."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "O'reenian society was highly militarized and stratified. At the top of the social structure was the Magnus, who ruled the species's homeworld, O'reen, as a military dictator and supreme military commander. Below the ruler were the soldiers in the planet's militia, a group who were afforded all rights and privileges of citizenship after a period of service of at least six years. Near the bottom of the social ladder were civilians, who had few rights; such individuals had little choice but to work for the planetary government as indentured laborers. Another non-martial class of O'reenians were those who were officially enslaved to social superiors. The only group regarded even more dimly than civilians and slaves were soldiers who were dishonorably discharged from the army for shirking duty. The punishment for such dereliction was the loss of all rights and mandatory exile from any settlement on O'reen. The organization of O'reenian society into such clearly demarcated castes encouraged disgruntlement among the lower classes, and rebellions were common over the species's history—though rarely successful."}, {"tag": "p", "text": "Although non-O'reenians were exceedingly rare on O'reen, the species's society allowed offworlders to enjoy the privileges of citizenship through military service or by proving membership in the military of another group. Outsiders who had not done so were regarded as civilians, with rights equivalent to that class of O'reenians. Non-O'reenians who did not belong to a military organization suffered severely curtailed mobility on the world."}, {"tag": "p", "text": "Within the military class, O'reenians were further stratified according to rank. As supreme commander of the armed forces, the Magnus was elected by a council of his or her peers. The leader received a personal detail of four elite guards for protection and had the ability to rally the O'reenian military to action when necessary. Another military faction was the O'reen Star Corps, a unit of pilots who patrolled the O'reen system and protected it from outside threats. Unless outsiders received proper clearance, the Star Corps refused them access to the planet. A defensive fleet of starships remained in orbit around O'reen at all times."}, {"tag": "p", "text": "Life for the O'reenians was highly regulated and disciplined. O'reenians learned combat and military skills from an early age so that every O'reenian could act as a competent soldier when necessary. Even scientists were highly militarized; laboratory researchers carried small sidearms under their white lab coats. All O'reenians were more perceptive and fit than a comparable Human, but those O'reenians who were officially part of the planet's military had to show ideological commitment and keep themselves in peak physical condition. The soldier's life taught an O'reenian military protocol; indeed, lack of such knowledge brought contempt upon many civilian O'reenians. Criminals were exceedingly rare in O'reenian society and tended to remain within the fogs that marked the outskirts of civilization."}, {"tag": "p", "text": "Overall, the O'reenians had access only to relatively primitive technology; they lagged behind much of the rest of the galaxy. For instance, most of the tasks performed by droids in the rest of the galaxy fell to O'reenian civilians instead. Still, the species did have access to items such as datapads and cargo lifters. The exception was weaponry. By raiding nearby star systems, the military gained access to advanced weapons and armaments, which it then analyzed and adopted. Such bellicose invasions of nearby areas allowed for a robust and advanced array of armaments, which included blaster weapons, sublight drives, shield generators for starships, turbolasers, and ion drives. Security satellites filled the planet's orbit and provided advanced warning of attack, and orbital defense mines presented invisible, target-seeking obstacles to any outsiders with aggressive intent or who lacked the proper transponder codes."}, {"tag": "p", "text": "O'reenian settlements were situated atop towering, flat, natural mesas and plateaux. Their buildings were made of stone and often reached precipitous heights. Such cities tended to be relatively isolated from one another because thick fog that enshrouded O'reen made travel in the wilds dangerous. The planetary capital was Fort Maximus, the most heavily garrisoned city on the planet. The capital was designed to withstand a siege even for several years, and it housed arms factories protected in underground bunkers. The Magnus lived in an estate at the heart of the city, and most of the populace of Fort Maximus was made up of citizen-soldiers. Epsilon Garrison was similar in that it was more of a military base than a city, although it did support a large farming community that provided food for the nearby garrisons and for the soldiers stationed at Fort Maximus. The large number of civilians at Epsilon Garrison proved one of the more rebellious in O'reenian society, although the farmers tended to rebel through non-violent protest. Orbital Deployment Center was another city; its purpose was to operate and monitor the network of satellites that orbited O'reen to spot threats from afar and to spy on nearby areas of the galaxy to identify possible targets for raiding."}, {"tag": "p", "text": "Although O'reen was located just beyond the borders of the Outer Rim Territories within the Unknown Regions, the O'reenians were a tough and self-sufficient people with little concern for the broader galaxy. Their planet had no exports, although the people did import military weaponry. Indeed, the species was somewhat distrustful and even afraid of aliens. Still, O'reenian concept of military conduct included the notion that pre-emptive attacks on other groups were sometimes justified, so the species presented a threat to nearby systems; for instance, the Star Corps raided nearby systems from time to time."}, {"tag": "p", "text": "The language spoken by the species was derived from an old dialect of Bocce. Even after the two languages had diverged, they remained largely intelligible with one another. Some O'reenians also learned to speak Galactic Basic Standard and Minnisiat."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Colonization"}, {"tag": "p", "text": "After the conclusion of the Great Hyperspace War in 5000 BBY, the Galactic Republic initiated a program of military colonization whereby fortress worlds were established in areas of realspace beyond the borders of galactic civilization. The plans for the program called for such colonies to be fully supported with Republic matériel and troops and full two-way communication via the HoloNet. Nevertheless, the Galactic Senate rejected the original proposal as too expensive. The Republic scaled down the project to instead seed self-sufficient colonies that would still offer some degree of protection against future threats. The Republic asked for volunteers to colonize twelve identified worlds, but the number of volunteers was sufficient only for five, O'reen among them."}, {"tag": "p", "text": "Shortly after the Great Sith War, which concluded in 3996 BBY, the Human ancestors of the O'reenians thus traveled to O'reen under the auspices of the Republic's program. With its location in the southwestern quadrant of the galaxy, O'reen was chosen as a bulwark against an extragalactic force that was feared to threaten the galaxy at the time. A network of satellites was placed in the planet's orbit to allow the O'reenians to monitor nearby systems. However, the threat never materialized. Over time, four of the Republic's fortress colonies failed entirely, leaving only O'reen as a success. However, financial trouble eventually forced the Republic to completely cut ties to O'reen and its inhabitants."}, {"tag": "p", "text": "O'reens vast resources provided the raw materials for the O'reenians to survive on their own. During the rule of the son of a dandyish Republic functionary, a military officer and starship captain named Magnus took over the government of O'reen in a bloodless coup d'état. With widespread public support, Magnus and his advisors introduced a new lifestyle based on military discipline and widespread martial training. \"Magnus\" became more than a family name; it became the title of the supreme ruler of O'reen and its O'reenian people."}, {"tag": "p", "text": "With time, the O'reenians forgot their ties to the Galactic Republic and the circumstances that had led to the settling of their world. Their society stratified into castes, and laws were passed that granted citizenship only to those who served in the military for at least six years. Non-citizens were thus thrust into menial roles. The O'reenians eventually became a distinct species as well, resembling Humans except for their orange-hued skin and dark eyes. A language derived from an archaic form of Bocce became the species's main tongue."}, {"tag": "h3", "text": "Isolationism"}, {"tag": "p", "text": "Several centuries before the outbreak of the Clone Wars, the O'reenians made contact with the outside galaxy once again when a corporate exploration vessel found O'reen. The offworlders tried to claim the planet for their corporation through a display of technological superiority, but the O'reenians responded with force and took control of the strangers' starship. The encounter convinced the Magnus that O'reen was vulnerable to technologically superior and aggressive forces from afar. He ordered the planet's scientists to reverse-engineer the ship to improve the capabilities of the O'reenian military. The O'reenians then embarked on a program of sending soldiers and scouts on secret raids on nearby planets, during which further technological advances were sought. Over time, the O'reenians began to reach technological parity with the rest of the galaxy in military hardware. Nevertheless, O'reenian leaders were cautious to keep the location of O'reen completely secret from the targets of such raids."}, {"tag": "p", "text": "During the Clone Wars, a conflict fought between the Republic and the Confederacy of Independent Systems from 22 to 19 BBY, the O'reenians were faced with another threat when a Republic military exploration ship found the planet during a search for Confederate supply planets. The O'reenians took the crew captive and enslaved most of them. The Jedi General Morningfire later arrived, supported by the clone troopers of Vornskr Company, to rescue the exploration crew. The Magnus ordered the military to resist the invasion, but the ruler died during the assault. The subsequent Magnus advocated further isolation for the O'reenians to avoid further contact with the Republic. Meanwhile, the Galactic Senate voted to keep O'reen isolated from the galaxy to keep the O'reenians from aiding the Separatists and to curtail any expansionism on the part of the planet's people."}, {"tag": "p", "text": "The O'reenians remained isolationists until the Yuuzhan Vong War tore through the galaxy beginning in 25 ABY, when the reigning Magnus adopted a policy of watching the conflict between the New Republic and the Yuuzhan Vong from afar, but remaining vigilant against any aggressors, while also keeping an eye out for opportunities to expand O'reen's sphere of influence. After the Battle of Coruscant in 27 ABY, all records of O'reen were lost to the New Republic."}, {"tag": "p", "text": "At one point, a group of spacers arrived on O'reen seeking emergency aid. The offworlders evaded the orbital defenses and landed in the wilderness, but an O'reenian military patrol found and impounded the visitors' starship. The spacers infiltrated the city Orbital Deployment Center to recover the ship. When they finally reached the vessel, they made repairs to the ship, entered the vehicle, and lifted off to leave O'reen. However, some O'reenians had remained aboard and tried to force the offworlders to land back on the planet. The strangers overcame their stowaways and left the O'reen system."}, {"tag": "p", "text": "In another incident, an offworld O'reenian hired a group of spacers to bring a cargo of high-tech weapons and armor to O'reen. However, the agent told the group that the cargo consisted of nothing more than miscellaneous goods and luxury items. The patsies traveled to the O'reen system, evaded O'reenian system security, and landed. O'reenian officials boarded the ship, confiscated the cargo, and arrested the couriers for treason against the Magnus and for smuggling. Only after giving up their on-world contact were the offworlders allowed to leave the system—albeit under escort by O'reenian forces who then set out to arrest the O'reenian smuggler."}, {"tag": "p", "text": "On yet another occasion, O'reenian forces attacked a vessel in the Outer Rim Territories near the O'reen system. They confiscated a piece of military hardware and carried it back to O'reen for analysis at a research post near Orbital Deployment Center. There, scientists began efforts to decipher the codes embedded in the foreign devices, and an O'reenian military supervisor was assigned to protect the hardware until it could be analyzed. Eventually, he received orders to move the cargo to Fort Maximus."}, {"tag": "p", "text": "Later, a group of offworlders traveled to O'reen on the orders of a navy lieutenant named Amalia, who wanted the group to investigate the disappearance of the hardware—a prototype tactical computer and tactical data core for a capital ship—and recover it. The O'reenians attacked the interlopers upon their arrival in the O'reen system, but the strangers survived the encounter and evaded the rebuilt battle cruiser patrolling the system. The offworlders landed on O'reen and infiltrated the analysis center where the stolen Republic hardware was kept. The O'reenian military supervisor detected the intrusion, and in the ensuing skirmish, a dozen O'reenian researchers were bested by the offworlders, who also recovered the data core. The supervisor's datapad revealed the orders to move the items to Fort Maximus, so the offworlders pretended to do just that. However, they instead fled to their ship and escaped the planet and star system."}, {"tag": "p", "text": "The O'reenians remained isolated from the galaxy as late as 137 ABY."}, {"tag": "h2", "text": "O'reenians in the galaxy"}, {"tag": "p", "text": "With the exception of the Star Corps, which carried out periodic raids on systems near the O'reen system to steal weapons and technology, the O'reenians were an isolationist species whose members had little inkling to travel beyond the atmosphere of their homeworld. Nevertheless, a few O'reenian exiles abandoned their homeworld altogether and made their way into the greater galaxy. The majority of these expatriates found work as soldiers. At least one O'reenian smuggled weapons and technology to O'reen by enlisting pilots for hire. In the eyes of the O'reenian government, however, the agent was an outlaw whose activities constituted treason."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Unknown Regions, a sourcebook published by Wizards of the Coast in 2010, describes the O'reenians and their society as part of its entry on the planet O'reen. The book, written by Sterling Hershey, Rodney Thompson, and Daniel Wallace, includes three adventure outlines that allow player characters from the rest of the galaxy to visit O'reen and interact with the O'reenians. However, the sourcebook offers no timeline information to indicate when these adventures take place. The history above includes the events of these scenarios, but their placement within the broader narrative is completely arbitrary. Also in 2010, The Essential Atlas Online Companion, an online supplement to The Essential Atlas, placed the O'reen system and provided further context as to the O'reenians' relations with the greater galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}