{"url": "O%27reen", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Fortress worlds", "Category:Galactic Republic planets", "Category:O'reen locations", "Category:Terrestrial planets", "Category:Unknown Regions planets"], "nodes": [{"tag": "h1", "text": "O'reen"}, {"tag": "p", "text": "O'reen was an Unknown Regions planet with a surface featuring thick fog and tall mesas and plateaus. It was inhabited by the near-Human O'reenians. The planet was colonized after the Great Hyperspace War as a Galactic Republic advance warning outpost, based on a self-sufficient military garrison. Eventually, the colonists were stranded and isolated from the rest of the galaxy. Following a coup led by Magnus, the colony's military leader, O'reenian society transformed itself into a caste-based military dictatorship devoted to the planet's military buildup under the rule of a leader holding the title of Magnus. Only those who served with O'reen's military were granted full citizenship and rights."}, {"tag": "p", "text": "Millennia after O'reen's settlement, the natives captured a corporate exploration vessel that had discovered their world. The encounter made the O'reenians realize how backward their level of technology had become compared to that of the wider galaxy. In an attempt to counter that, the O'reen Star Corps performed raids on nearby star systems to capture modern military technology. Stolen equipment was then analyzed on O'reen in order to upgrade the planet's own armaments. During that time, the planet was visited by offworlders on several occasions."}, {"tag": "p", "text": "During the Clone Wars, O'reen's natives captured the crew of a Republic military exploration ship, resulting in a rescue operation on the planet, followed by the Republic Senate placing the hostile world under a quarantine that lasted for decades. At some point following the disestablishment of the Republic, the O'reenians stole a prototype tactical data core from a galactic-scale naval force, planning to install it aboard a refurbished battle cruiser. A group of individuals tasked to retrieve the tactical computer traveled to O'reen. There, the group infiltrated the Orbital Deployment Center garrison-city and stole the computer from an analysis station before escaping the planet. As the extragalactic Yuuzhan Vong invaded the galaxy, O'reen once again became virtually forgotten; however, the ruling Magnus continued to wait for an opportunity to expand the planet's influence."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "O'reen was a planet in the O'reen system, located just inside the Unknown Regions' border with the Outer Rim Territories. It had two moons and gravity equal to 1.1 standard. A year on O'reen lasted 355 local days while a day was thirty-four standard hours long."}, {"tag": "p", "text": "The climate on O'reen was temperate. A thick, perpetual fog covered much of the terrestrial planet's surface and was punctured by towering mesas and plateaus. A species of flying creatures lived on O'reen."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "A Republic origin"}, {"tag": "h4", "text": "Colonization of O'reen"}, {"tag": "p", "text": "O'reen was colonized shortly following the Great Hyperspace War in 5000 BBY, when the Galactic Republic founded several advance warning outposts past the boundaries of known space against a perceived extragalactic threat. The outposts would have served as military garrisons as well as self-sustaining colonies. The outpost on O'reen was led by the son of a Republic bureaucrat, while the colony's military was headed by Magnus, a former starship captain. During the colonization of O'reen, numerous satellites were put in the planet's orbit to serve as an early warning system."}, {"tag": "p", "text": "When the other outposts failed due to various reasons, the Republic scrapped the entire project, leaving O'reenian colonists stranded and isolated from the rest of the galaxy. Seeing the colony as doomed if strict discipline was not established, Magnus overthrew the unpopular leader of the colonists in a quick and bloodless coup."}, {"tag": "p", "text": "Within a year, a military dictatorship had been established on O'reen, with the colony becoming a self-sufficient and well-disciplined military outpost. Magnus's coup, as well as the abundance of natural resources on the planet, allowed the colony to flourish, and Magnus's surname eventually became honored as the title of the outpost's leader. Decades after O'reen's settlement, the original purpose of the Republic colony became nearly forgotten, and the society stratified into a caste system based on martial prowess and maintaining the military readiness of the outpost."}, {"tag": "h4", "text": "Renewed contact with the galaxy"}, {"tag": "p", "text": "Several centuries before the beginning of the Clone Wars in 22 BBY, a corporate exploration vessel accidentally discovered O'reen. The starship's captain attempted to display the technological superiority of his spacecraft in order to impress the O'reenians. The captain also intended to claim the world for his corporate employers; however, the O'reen military forces, underestimated by the scouts, defeated the vessel."}, {"tag": "p", "text": "The encounter served to inform the inhabitants of O'reen of how far their level of technology had fallen behind that of the wider galaxy. The ruling Magnus decreed that the scout starship be repaired and retrofitted. The O'reen Star Corps was also eventually established, which, for the following centuries, performed carefully planned raids on the nearby star systems in order to acquire new military technology, allowing the O'reen military to try and catch up to the galactic levels of combat technology."}, {"tag": "h4", "text": "Accidental visitors"}, {"tag": "p", "text": "At some point during that time, an error in trajectory calculations forced a traveling starship to revert out of hyperspace, causing the vessel to become sufficiently damaged to require a rough landing on the nearby O'reen. After learning via simple long-range scan that their starship was being tracked by numerous orbital emplacements, the ship's crew—through a mix of skill and luck—landed their craft away from the planet's larger garrison-cities."}, {"tag": "p", "text": "The crew avoided capture by a local patrol, but their damaged ship was taken to the settlement known as the Orbital Deployment Center. Subsequently, the individuals broke into the heavily guarded city, in the process avoiding getting involved in a shootout. The crew stole back their ship plus the necessary repair parts, fixed the vessel, and left O'reen. After jumping to lightspeed, the crew discovered that several O'reenians had sneaked aboard the ship. The stowaways then attempted to kill the crew and return the vessel to O'reen."}, {"tag": "h4", "text": "A traitor's shipment"}, {"tag": "p", "text": "On another occasion, an O'reenian hired the crew of a starship to transport a large cargo of undisclosed luxury goods to a contact on O'reen. While underway, the crew opened the storage containers, only to discover that the cargo was in reality a large amount of military-grade armor and weapons. The crew then decided to proceed with the delivery of the cargo anyway, despite not having the appropriate permits for transporting such equipment."}, {"tag": "p", "text": "Arriving near the planet, the starship was hailed by O'reen ground control, which threatened to have the vessel shot down unless it transmitted the proper identification codes. The ship's crew negotiated for the right to land on O'reen. On the planet, O'reenians boarded and inspected the starship, confiscating the military equipment as evidence of a traitorous plot against the ruling Magnus. The crew then had to lead the O'reenians to their contact before the group was allowed to leave the planet."}, {"tag": "h3", "text": "Return to obscurity"}, {"tag": "h4", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, a Republic military exploration ship was investigating nearby star systems in search of Separatist supply depots. The vessel discovered O'reen, but its captain's lack of training in protocol concerning first contact resulted in a misunderstanding that led to violence, and the majority of the ship's crew was captured and enslaved. Jedi General Morningfire led Vornskr Company of the Republic's clone troopers in a rescue of the crew, which resulted in the death of the reigning Magnus."}, {"tag": "p", "text": "The deceased Magnus's successor was unwilling to risk another military intervention by the Republic. Nevertheless, the Republic Senate decided to quarantine O'reen in order to both contain the inhabitants' hostility and prevent the Separatists from gaining resources and military knowledge from the planet."}, {"tag": "h4", "text": "O'reen and the Republic's successors"}, {"tag": "p", "text": "The quarantine of O'reen outlasted the Republic's transformation into the Galactic Empire in 19 BBY, as well as the Empire's own fragmentation in 4 ABY and eventual supplantation by the New Republic. When the extragalactic Yuuzhan Vong invaded the galaxy in 25 ABY, the Magnus decided to maintain a careful and observant attitude toward the invaders."}, {"tag": "p", "text": "Two years later, the Yuuzhan Vong captured the New Republic capital world of Coruscant, and, during the devastation that followed the battle, all the recorded information on O'reen stored on the planet was lost. Subsequently, the Magnus continued to observe the galactic events, seeking the right opportunity to expand his homeworld's influence in the surrounding region."}, {"tag": "h4", "text": "Aftermath of a raid"}, {"tag": "h5", "text": "Tracking down the thieves"}, {"tag": "p", "text": "As part of a supply acquisition raid at some point after the disestablishment of the Galactic Republic, the O'reen Star Corps attacked a transport starship affiliated with a galactic-scale navy in the Outer Rim Territories, near the region's border with the Unknown Regions. The Star Corps stole the ship's cargo, a prototype tactical data core of a command capital ship. The data core, along with other military equipment acquired in the raid, was brought back to O'reen and held in an analysis station in the Orbital Deployment Center. There, the tactical computer was studied by a group of O'reenian researchers, led by a military supervisor, for potential installation in a battle cruiser being refurbished in O'reen's orbit, and it was eventually scheduled to be transferred to Fort Maximus, the planet's capital."}, {"tag": "p", "text": "Lieutenant Amalia, an attendant of a high-ranking naval officer interested in retrieving the computer, hired a group of individuals to return the stolen equipment. Traveling to the provided coordinates where the transport was attacked, the group followed Amalia's suggestion and looked through both archived and recent astrogation charts of the area to find any indication of pirates establishing bases in the nearby systems. The individuals discovered evidence of the supposedly abandoned O'reen colony, although its exact location had been lost by that time."}, {"tag": "p", "text": "The sensors of the group's starship then detected an archaic transmission broadcast from one of nearby O'reen's early warning satellites. Several minutes later, a pair of old O'reenian Star Corps starfighters, resembling the vessels that had attacked the transport, arrived and demanded the crew's surrender. After defeating the fighters, the group determined the point of origin of the enemy starships and traveled there."}, {"tag": "h5", "text": "Retrieval from a garrison"}, {"tag": "p", "text": "Deciding to revert out of hyperspace near the edge of the O'reen system, the group approached O'reen at a slow cruise speed to avoid detection. Entering sensor range of the planet, the crew observed the orbiting O'reenian battle cruiser and the small assault group of numerous, antiquated battle frigates and repair barges surrounding it, guessing at the purpose of the formation."}, {"tag": "p", "text": "After landing on O'reen, the members of the ship's crew altered their appearance in order to blend in with the natives and eventually tracked the stolen cargo to the Orbital Deployment Center. The group successfully passed the city's guarded perimeter and bluffed its way past the guards posted at the entrance of the analysis center, where the individuals then located the tactical data core."}, {"tag": "p", "text": "However, before the group could enact its plan to steal the tactical computer, the station's military supervisor entered the room, immediately seeing through the group's disguise. In the resulting shootout, the supervisor and the researchers present were defeated. The individuals then loaded the data core onto a cargo speeder before leaving the Orbital Deployment Center for their starship under the guise of transporting the computer to Fort Maximus. Finally, after avoiding the patrol ships orbiting O'reen, the group left the system to return the computer to Amalia."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Ninety-eight percent of the O'reen population consisted of the O'reenians, a near-Human species that spoke a language derived from a very old dialect of Bocce. The O'reenian society was based on a system of castes and governed itself through a military dictatorship, headed by a single military leader, the Magnus."}, {"tag": "p", "text": "Only those O'reenians who served with the planet's military for at least six years were granted full citizenship. Those who did not serve with the armed forces were termed \"civilians,\" given few rights, and often forced to work in menial jobs commonly assigned to droids in the wider galaxy. Any visiting offworlders were automatically treated as civilians unless they proved they served with another's military or enlisted with that of O'reen."}, {"tag": "p", "text": "On several occasions, the civilians of O'reen staged uprisings against the reigning order, but such insurrections were always brutally put down. Criminals on O'reen were rare and few in number and frequently flew their vehicles through the fog blanketing the planet's surface, navigating by their sensors alone. Such method of travel allowed the lawbreakers to hide from the authorities but was also dangerous due to the high risk of collisions with the walls of O'reen's mesas and plateaus."}, {"tag": "p", "text": "As a result of the stringent social system, every citizen on O'reen was a capable combatant. Such discipline, combined with the continuous efforts of the planet's military to keep up with the combat technology level of the rest of the galaxy, allowed O'reen to become a fortress world comparable with those of the Galactic Empire in the Core Worlds."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Orbital Deployment Center"}, {"tag": "p", "text": "Most of the numerous O'reenian cities, known as garrison-cities, were built atop the planet's mesas and plateaus. One of the oldest such settlements was the Orbital Deployment Center, which also served as the closest thing the planet had to a spaceport. Any captured offworld military technology was stored and analyzed in the Orbital Deployment Center. An analysis station located just inside the outermost perimeter of the city was used for such studies."}, {"tag": "p", "text": "However, the primary purpose of the Orbital Deployment Center was to use the planet's orbital satellites to monitor activity throughout the O'reen system. Over time, the satellites gained another function, as they were used to evaluate any potential targets for supply acquisition raids in the nearby sectors. In addition to the surveillance satellites in O'reen's orbit, the entire planet was surrounded by a dense net of orbital defense mines that detected, approached, and detonated in the vicinity of any starships moving toward the planet without transmitting the appropriate transponder identifiers."}, {"tag": "h3", "text": "Other cities"}, {"tag": "p", "text": "Fort Maximus was both the capital of O'reen and its primary military headquarters. It was one of the most heavily fortified cities on the planet, with multiple defenses allowing the settlement to withstand a years-long siege. The estate of the ruling Magnus was located in the center of the city."}, {"tag": "p", "text": "The city of Epsilon Garrison had a strong agricultural industry, and it contributed a significant portion of the crops consumed by the neighboring garrisons. The agricultural output of Epsilon Garrison was also used to support the standing armed forces stationed at Fort Maximus. In addition, Epsilon Garrison had the appearance of a military base despite not being as heavily fortified as the planet's capital. Uniquely from the other O'reen cities, Epsilon Garrison housed a substantial population of O'reenian civilians contemplating a global revolution aimed at improving the lives of all civilians on the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Publication history"}, {"tag": "p", "text": "O'reen was introduced in The Unknown Regions, a sourcebook for the Star Wars Roleplaying Game that was published by Wizards of the Coast in 2010. In the book, the roleplaying mini-adventure \"A Fool's Charge\" erroneously states that the Republic outpost on O'reen was established after the Great Sith War, whereas the book's section detailing O'reen establishes it to have been colonized after the Great Hyperspace War instead. The Online Companion to the 2009 reference book The Essential Atlas later placed the O'reen system, and therefore the planet O'reen, in grid square H-13."}, {"tag": "h3", "text": "Roleplaying game options"}, {"tag": "p", "text": "Within The Unknown Regions, O'reen is mentioned in several adventure seeds for use with the Star Wars Roleplaying Game and also appears in the mini-adventure \"A Fool's Charge.\" This article assumes all of those scenarios play out as described. In \"A Fool's Charge,\" the player-characters are presented with several options for how to determine the exact coordinates of O'reen."}, {"tag": "p", "text": "Firstly, the characters can attempt to reverse-calculate the hyperspatial trajectories of the O'reenian starfighters, using their own astrogation charts to pinpoint the origin point of the craft. Secondly, an attempt can be made to salvage a flight computer from the fighter's wreckage, which can then be connected to either the characters' starship's onboard computer or a datapad, providing O'reen's location, clearance codes necessary for an approach to the planet, and evidence of O'reen having an active orbital patrol. Thirdly, if at least one of the enemy fighters was left intact, the characters can rescue one of the pilots and convince him to reveal the necessary information."}, {"tag": "p", "text": "Once the characters have discovered the location of O'reen, they are again provided with options for how to approach and land on the heavily guarded and militarized planet. The characters can emerge from hyperspace as close within the orbit of O'reen as possible, risking a dangerously close approach to the planet's mass shadow for a tactical advantage. If the characters approach O'reen from a further distance, they can avoid the orbiting patrol ships in one of three suggested ways: They can simply outmaneuver and outrun the patrol vessels, risking the entire planet becoming alerted to their presence; they can locate and inconspicuously use an approach vector not covered by the flight patterns and the sensors of the patrol ships; or, if the characters previously learned O'reenian clearance codes, they can simply transmit them and land on the planet unhindered."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}