{"url": "O-R10N", "categories": ["Category:Canon articles", "Category:Astromech droids", "Category:Black Squadron (Resistance) personnel", "Category:Resistance droids"], "nodes": [{"tag": "h1", "text": "O-R10N"}, {"tag": "p", "text": "O-R10N was a purple astromech droid who served as Jessika Pava's astromech in the Resistance. During Black Squadron's mission to Megalox, O-R10N assisted in Operation Upside alongside BB-8, R2-HA, and R4 in an attempt to free Grakkus the Hutt until it was destroyed by an unidentified droid."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "O-R10N served as the Resistance starfighter pilot Jessika Pava's astromech droid during the mission to Megalox prison. After the First Order Agent Terex complicated negotiations with Grakkus the Hutt, Poe ordered BB-8 and the other astromech droids in Black Squadron to proceed with Operation Upside. O-R10N along with R2-HA and R4 disembarked from their T-70 X-wings and headed to the space station's gravity field generator."}, {"tag": "p", "text": "On the way, BB-8 spotted three guards approaching and the droids activated their rocket boosters. However, one of R4's rocket boosters malfunctioned and he crashed on top of a guard. O-R10N was then forced to subdue the remaining guards. O-R10N electrocuted one guard with his electro-shock prod and knocked out the other guard with one of his ambulatory struts. O-R10N then helped R-4 to the ground, earning BB-8's praise. The droids then proceeded to the primary security field generator in Deck Twelve. Before they could disable the gravity field generator, they were discovered by a security droid."}, {"tag": "p", "text": "O-R10N spotted the security droid and tried to disable it with its electro-shock prod and an arc welder. However, the giant droid crushed O-R10N with one its massive fists and threw the droid down the bridge. Despite O-R10N's disintegration, BB-8 managed to electrocute the security droid, allowing the other droids to complete their mission. As a result, Black Squadron was able to rescue Grakkus. After reuniting with their pilots, BB-8 informed Jess that O-R10N did not make it."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "O-R10N was a blue-colored astromech droid who was equipped with various accessories including an electro-shock prod, a knife, an arc welder, and a spark projector. It was also equipped with rocket boosters which allowed it to fly. O-R10N was also a fighter and knocked out two prison guards. Despite his fearsome personality, O-R10N was no match for a security droid which threw it to its disintegration."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Despite the droid's name, O-R10N resembles the design of an R6 astromech."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}