{"url": "O-66", "categories": ["Category:Canon articles", "Category:Droids of the Galactic Empire", "Category:Pilot droids"], "nodes": [{"tag": "h1", "text": "O-66"}, {"tag": "p", "text": "O-66 was a pilot droid who served on the Scimitar, a Star Courier owned by Darth Sidious."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hunting the Imperialis"}, {"tag": "p", "text": "O-66 served as a caretaker and pilot to the Scimitar, a modified Star Courier owned by Darth Sidious, the Galactic Emperor. After Sidious' personal yacht, the Imperialis, was stolen, the bounty hunter Chanath Cha was hired to reclaim the ship, and Sidious lent her the Scimitar. Meeting at Imperial Facility 729-D in the Inner Rim, O-66 introduced Cha to the vessel, and the two began tracking the pleasure craft. Wary of O-66, Cha decapitated the droid prior to leaving the facility."}, {"tag": "p", "text": "The pair tracked the Imperialis to deep space, and Cha boarded the stolen yacht. In order to convince O-66 to give her the ship's control codes, Cha placed a pulse bomb in the droid's neck, and threatened to remotely detonate it. Persuaded to concede, O-66 transmitted the codes, allowing Cha to deactivate the escape pods and prevent the thief from eluding capture. However, Cha discovered the thief to be Lando Calrissian, a man with whom she was acquainted."}, {"tag": "p", "text": "Calrissian explained that the Imperialis was filled with Sith artifacts which were causing his team to turn on each other, and he convinced Cha to activate the yacht's auto-destruct sequence. Cha ordered O-66 to bring the Scimitar in to dock, but the droid's sensors indicated that the yacht was going to self-destruct, and refused. Cha reminded the droid about the bomb placed in its neck, but O-66 had partially reconstructed and revealed that the bomb was already deactivated. Bidding farewell to Cha, O-66 piloted the Scimitar away from the scene, leaving Cha to die."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "O-66 was programmed to protect and honor the Scimitar. He knew a lot about the ship's operating systems and history. Chanath Cha regarded O-66 as tedious and beheaded the droid. He was programmed to serve Emperor Palpatine and did not like to go against his master's orders. Despite being decapitated, O-66 was still capable of functioning and could even repair himself. O-66 appreciated Chanath's ruthlessness but allowed her to underestimate him. After learning that she had installed a pulse bomb on him, he removed it. O-66 exacted a sort of revenge against Cha when he left her stranded in space after she activated the Imperialis's self-destruct mechanism. Claiming that blowing up the Imperialis would endanger the Scimitar, he took the opportunity to abandon Cha."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "O-66 appeared as a secondary character in the 2015 Marvel Comics arc Star Wars: Lando. He was written by Charles Soule, drawn by Alex Maleev, and colored by Paul Mounts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}