{"url": "OLR-4", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:OOM command battle droids", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "OLR-4"}, {"tag": "p", "text": "OLR-4 was an OOM command battle droid stationed aboard the Trade Federation Lucrehulk-class freighter Revenue. In 32 BBY, over the Outer Rim planet of Dorvalla, he was tasked with patrolling the hangar of the freighter for any suspicious activity. He encountered a cargo pod with unusual sounds emanating from it. After OLR-4 observed the pod for a few moments, it disgorged mercenaries belonging to the Nebula Front criminal organization. In the following firefight, OLR-4 was destroyed, along with other B1-Series battle droids that had been assisting him. With their path unhindered, the mercenaries were able to seize the valuable aurodium ore being carried by Revenue."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Manufactured by Baktoid Combat Automata for the Trade Federation, OLR-4 was a commander droid variant of Baktoid's B1-Series battle droid, the OOM command battle droid. In 32 BBY, he was stationed aboard the Lucrehulk-class cargo freighter Revenue on security detail. In that year, the freighter was in the orbit of the Outer Rim planet Dorvalla, loading lommite ore that had been mined on the planet's surface. Once carried to Revenue, the ore was loaded into the ship's vast hangars by repulsorlift-powered cargo pods before being distributed between three zones in the each of the two hangars. It was in the second of these zones in the starboard hangar that OLR-4 was tasked by Revenue's central control computer to flag any event that was placed outside parameters set by the control computer."}, {"tag": "p", "text": "These parameters were triggered when the sound of pressure relief valves was heard from a cargo pod that was slowly opening its over-sized access hatch. Once the central computer had verified the anomaly through data from OLR-4's photoreceptors, additional B1 security droids converged on the pod and took combat stances. Five droids were destroyed by the forceful opening of the pod and two more were destroyed by blasterfire from inside the pod. The remaining droids, including OLR-4, returned fire on the intruders, mercenaries belonging to the criminal organization Nebula Front with intentions to steal the aurodium ore aboard Revenue."}, {"tag": "p", "text": "With three more of the droids falling, OLR-4 moved around the pod to get an advantage on the mercenaries but found that his blaster was overheating and near depletion. Despite this, the central computer still commanded that OLR-4 keep firing. Attempting to run toward the cargo pod, OLR-4 was shot in both shoulders and knocked to the floor. With the intruders believing all of the droids to be disabled, he was able to furtively glimpse the bipedal humanoids that had boarded the freighter. He then attempted to fire his blaster at one the mercenaries standing above him, a Human, but the overheated blaster shut down and OLR-4 unintentionally gave himself away by exclaiming at the useless weapon. Alerted to his presence, the Human spun around and shot the droid. As OLR-4's systems failed, he managed to relay his final view to the central computer to alert the crew before he finally shut down. However, despite the alert by the central computer, the crew of Revenue were unable to stop the Nebula Front from seizing the precious aurodium."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "OLR-4 was a standard OOM-command battle droid and so was equipped with a little more artificial intelligence than the regular B1-battle droid. Similarly, his chassis was painted with yellow markings that signified his commander status. Before taking action on the anomalous sounds from the Nebula Front's cargo pod, OLR-4 had to wait for Revenue's central computer to determine the nature of the anomaly for him. This proved to be a disdvantage to the droid when the mercenaries emerged from the pod before the computer could relay a suitable action to take. When he had been knocked down in the firefight, OLR-4 still attempted to attack the intruders with his depleted BlasTech-manufactured weapon, an action that led to his destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "OLR-4 first appeared in the first chapter of James Luceno's 2001 novel, Cloak of Deception."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}