{"url": "Athiss", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with unencyclopedic tone", "Category:Planet stubs", "Category:Athiss locations", "Category:Sith planets", "Category:Sith Worlds", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Athiss"}, {"tag": "p", "text": "Athiss was the second planet in the Loro Babis system of the Outer Rim Territories. It was located on the Descri Wris and was close to Korriz and Ziost. The planet was a Sith sanctuary that held the sanctuary of Vodal Kressh, a powerful Sith Lord and among the most renowned alchemists the Empire had ever known."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Athiss was the second planet of the Loro Babis system, a star system located in the territories of the Outer Rim. The planet orbited two suns, which caused it to have a hot climate. The terrain consisted mostly of desert like terrain, similar to that of Korriban, though forests and fields grew atop the sands. The planet was not considered to be of major significance. Small, unexplored ruins were scattered about the planet, which drew in investigators. The ruins on the planet were never properly studied, meaning that their purpose was unknown."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Athiss was once a Sith bastion that held the sanctuary of Vodal Kressh, a powerful Sith Lord and among the greatest alchemists the Empire had ever known. Vodal was a powerful and ambitious Sith, but he was also utterly mad. So much so that after his death the Emperor ordered Kressh's sanctum sealed, and the planet declared a forbidden zone. Eventually, something began to stir on the planet once again. A Republic archaeological team later discovered the planet on a survey mission and began an excavation of the ruins. While studying the ruins the team discovered something powerful, feeding on the Dark Side power that emanates from within the ruins."}, {"tag": "p", "text": "Responding to the distress signal of a Galactic Republic starship that had crashed on Athiss, a Jedi team came to the planet. Each member was attacked by a Sith devotee. One of them was slain by Chamma and the other two devotees fled. The Jedi Master Chamma was visiting Athiss early in his career and the devotee he clashed with was a powerful Dark Side entity. The duel, and the oppressive feeling of evil on Athiss's surface, drove Chamma close to the dark side of the Force. Shaken by the experience, he went into a self-imposed exile; it was almost a century before he came to terms with what he had seen and felt on Athiss, and was able to return to the order. A few records of Athiss survive in the libraries of the Citadel on Dromund Kaas, but contemporary Sith scholars are forbidden from studying them, on the personal order of the Emperor."}, {"tag": "p", "text": "During the Cold War, Athiss was the site of a mysterious cult devoted to Vodal Kressh, which had continued existing even after Kressh's death, and was involved in the dark powers on the planet, along with the attacks on the team of Jedi. After all the previous events, the Republic and the Empire each sent a team of operatives to the planet to investigate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}