{"url": "OOM_command_battle_droid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:OOM command battle droids", "Category:OOM-series battle droid models"], "nodes": [{"tag": "h1", "text": "OOM command battle droid"}, {"tag": "p", "text": "OOM command battle droids were a type of battle droid utilized by both the Trade Federation and the Separatist Alliance during conflicts such as the Invasion of Naboo and the Clone Wars to act as commanders and leaders of droid forces, though they were often subservient to their organic officers and the more advanced tactical droids. Some notable OOM command battle droids included OOM-9, who led the Battle of Naboo on the side of the Trade Federation, and B1-268, who was part of a surviving garrison on Agamar."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "OOM command battle droids were designated by their dull yellow markings on their bodies. The droids possessed enhanced cognitive and tactical modules, and were used to lead droid forces. However, the droids were often subservient to organic officers or tactical droids, but in the absence of their higher officer an OOM command battle droid was able to take control of military forces. OOM command units were part of the OOM-series battle droid line, which was a mark of the B1-series battle droid."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Invasion of Naboo"}, {"tag": "p", "text": "In 32 BBY, the galactic corporation known as the Trade Federation invaded the small Mid Rim planet of Naboo in protest of taxation it received from the Galactic Republic. To try to resolve the conflict, Supreme Chancellor Finis Valorum sent two Jedi, Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi, to the blockade of Federation ships. However, the Federation tried to kill the two, and a group of OOM-series security droids, under the command of an OOM command battle droid, arrived. The droid officer ordered for a security droid corporal to check on the Jedi, but the two quickly destroyed it, the OOM command droid, and the rest of the security droids."}, {"tag": "p", "text": "Not long after the Jedi's arrival, the Trade Federation Droid Army began to land on Naboo. OOM-9 served as the commander of droid forces on the planet, and the unit moved his troops into the planet's city of Theed and against the planet's Gungan villages. OOM-9 commanded battle droid forces in the Great Grass Plains against the Gungan Grand Army during the final phases of the occupation, but OOM-9 was defeated because of the destruction of the Droid Control Ship, which shut down the Federation droid forces."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "OOM Command battle droids became part of the Separatist Droid Army during the Clone Wars, and at least one saw action in the First Battle of Geonosis, and this droid was destroyed by Jedi Master Mace Windu. During the war, OOM command battle droids would see action against the Grand Army of the Republic on numerous battlefronts, including on the planet Christophsis, the planet Teth, the Rishi Moon, and the planet Anaxes. They saw action until the end of the war, and at least one was present with the Separatist Council on Mustafar. The droid, all of the council, their aides, and all guards were killed by Darth Vader when he arrived on the planet. Following the slaughter, Darth Sidious ordered Vader to send out a droid shutdown signal. This signal shut down all Separatist droid units in that received it including the OOM command battle droids."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Darth Sidious, publicly known as Supreme Chancellor Sheev Palpatine, transformed the Republic into the First Galactic Empire at the same time Vader slaughtered the Separatist Council. Under the Empire, battle droids were outlawed, and the Empire's stormtroopers were to shoot Separatist battle droids on sight. However, on the planet of Agamar, Kalani, a Separatist super tactical droid and general, prevented his droids from being shut down at the end of the war. Kalani had believed the signal was a Republic trick, and among Kalani's droids was the OOM command battle droid B1-268. Kalani and his droids continued to function for years, but their holdout was discovered by the Spectres and Rex, a former Republic Clone Captain, in 2 BBY. B1-268 and several B1-series battle droids surrounded these rebels while they were trapped in a ray shield."}, {"tag": "p", "text": "While the droids would have been able to open fire, Kalani ordered for the rebels to be taken to his command center, so B1-268 stunned the group. Kalani complemented B1-268's performance and told the rebels he wanted to have one last Clone Wars battle. This battle was to decide which side was superior; however, the rebels and Separatist ultimately allied against the Galactic Empire. However, before coming to their alliance, B1-268 and several B1 battle droids were sent to see whether the Imperial forces, which had landed on the planet due to the rebels, were a threat. B1-268 introduced himself to the stormtroopers, but he and these B1s were destroyed by the Empire. However, Kalani, several B1s, and the rebels eventually did escape, and they agreed that they had all won the Clone Wars."}, {"tag": "p", "text": "Doc was a monster droid on Lotho Minor who was created by the Duros Akar Duel. Doc had the head of an OOM command unit and the body of a KX-series security droid."}, {"tag": "h3", "text": "Reign of the First Order"}, {"tag": "p", "text": "By the mission to Kijimi in 35 ABY during the First Order/Resistance War, a deactivated OOM command droid was in droidsmith Babu Frik's workshop."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "OOM command battle droids used E-5 blaster rifles in the field, and some OOM command units wore comlink booster packs. They could also use an imagecaster or the comlink located at their head for communication. They also used macrobinoculars, and OOM command battle droids also served as the commander of an Armored Assault Tank."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "OOM command battle droids first appeared in the 1999 film Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}