{"url": "OOM-9/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:OOM command battle droids", "Category:Trade Federation military members"], "nodes": [{"tag": "h1", "text": "OOM-9"}, {"tag": "p", "text": "OOM-9 was a B1-Series battle droid created by Baktoid Combat Automata prior to the invasion of the planet Naboo in 32 BBY. OOM-9 was selected to serve as a command battle droid for the invasion, leading Trade Federation forces into battle and achieving great success during the early stages of the campaign. Under OOM-9, Trade Federation troops defeated the forces of the Naboo at Harte Secur and Spinnaker, before capturing the capital city of Theed. With news of a primitive species residing in the planet's swamps—the Gungans—reaching the Trade Federation, OOM-9 was charged with hunting them down, but had limited success. When the Sith Lord Darth Maul arrived to take control of the Federation forces, he personally recovered information which led to OOM-9 forcing the evacuation of the underwater city of Otoh Gunga."}, {"tag": "p", "text": "The invasion ultimately turned against the Trade Federation when the Gungan Grand Army rallied to the cause of Naboo Queen Padmé Amidala and moved to engage the Trade Federation Droid Army on the Great Grass Plains. OOM-9 was once again charged with leading the battle droids to victory and soon overwhelmed the Gungan forces. However, the concurrent space battle went against the Trade Federation, seeing the destruction of a Lucrehulk-class Droid Control Ship. With the loss of the control ship, OOM-9 and his troops powered down, halting on the verge of victory."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "Originally a standard fourth-degree B1-Series battle droid, OOM-9 was created by Baktoid Combat Automata for the Trade Federation no later than 32 BBY to serve in their Droid Army under the Neimoidian Viceroy Nute Gunray, along with his senior staff Rune Haako and Lott Dod. Since the B1 droids did not have a standard alphanumeric series designation, the name \"OOM-9\" was selected for the unit from a shortened version of the unique identification code assigned to the battle droid. In 32 BBY, Viceroy Gunray, having led the Trade Federation into a pact with the Dark Lord of the Sith Darth Sidious, initiated a blockade of the Mid Rim planet Naboo as a protest to the new taxation of trade routes. The Sith Lord, who was secretly Senator Palpatine of Naboo, had an ulterior motive—the blockade would serve to undermine the leadership of Galactic Republic Supreme Chancellor Finis Valorum and allow him to advance his own position. In anticipation of the imminent invasion of Naboo, OOM-9 was specially programmed to serve as one of several command droids leading Trade Federation forces against the Naboo and Gungan population. In order to ensure simple communication between the Neimoidians and their forces, OOM-9 was chosen to act as a single point of contact. His first assignment as a commander was to organize the Trade Federation forces for the invasion."}, {"tag": "p", "text": "Supreme Chancellor Valorum, hoping to resolve the crisis, sent two Jedi—Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi—to settle the dispute. This bold action had an adverse affect on Sidious's calculated timeline for his plan's execution, and he ordered Gunray to step up the invasion and begin landing his forces. However, the Jedi were able to stow away aboard one of the Federation's C-9979 landing craft and reach the surface of the planet. As OOM-9 oversaw the disembarkation of his forces from their landing craft, Gunray and Haako contacted him to inform him of the Jedi's escape. OOM-9 assured his superiors that, if the Jedi were on the planet, his forces would find them. The droid commander ordered that both the patrol grid for Single Trooper Aerial Platforms and the number of ground battle droids be doubled. While the Jedi were able to elude capture by OOM-9's forces, the Trade Federation remained unconcerned by this failure, and so continued its invasion."}, {"tag": "h4", "text": "Early battles"}, {"tag": "p", "text": "Fearing that the Naboo would try to contact the Republic capital world of Coruscant to plead for help, Gunray promptly ordered the destruction of Naboo's offworld communication capabilities. OOM-9 was selected to lead the mission. Gunray gave OOM-9 his orders personally: to occupy the Naboo settlements of Parrlay, New Centrif, and Vis, and raze their communications buildings to the ground. His small force of STAPs, beetle droids, battle droids, and his personal Armored Assault Tank was unprepared for a major fight and was told to avoid direct confrontations with the Naboo until reinforcements could arrive. Since the Trade Federation could not afford to alert the Naboo to their presence on the ground, they could not risk conducting long-range scans, leaving OOM-9's forces to locate the settlements without reconnaissance data."}, {"tag": "p", "text": "Federation forces soon came upon New Centrif, but the settlement was too heavily defended, and OOM-9 decided to continue on to the other towns and seek reinforcements before returning to attack it. Upon OOM-9 reaching the smaller settlement of Vis, Gunray contacted him to alert him to the arrival of the promised reinforcements led by EEK-176. OOM-9 led his unit into the town, converging upon it with the newly arrived forces, including droidekas. After destroying Vis's communication transmitter, OOM-9 took his combined forces back to New Centrif to subdue the settlement before moving toward his final goal, the larger town of Parrlay, encountering several Naboo patrols along the way. After locating Parrlay, OOM-9 was once more contacted by Gunray, who instructed him to destroy its transmitter before the inhabitants could contact their capital city, Theed. All Naboo resistance was to be eliminated. To assist OOM-9 in his task, Gunray dispatched further reinforcements, including pummels, and Parrlay was quickly subjugated."}, {"tag": "p", "text": "The victory at Parrlay was just the beginning of the Trade Federation's plans. The invasion, however, soon caught upon a snag. One of the five droid control programs sent to Naboo with the initial landing force was captured by Naboo troops from Harte Secur when another command droid, OOM-14, suffered a malfunction. The loss of the control program rendered OOM-14's forces useless. Furthermore, Gunray knew that, if the Naboo could replicate the technology, they could take control of the Trade Federation's own battle droids. With the control program in enemy hands, the Trade Federation could not risk a large force to retrieve it. Instead, Gunray contacted OOM-9 and told him to escort a Neimoidian technician to the research center near Harte Secur where the control program was being held, retrieve it and use it to reactivate OOM-14's forces and their command center. Once they were reactivated, he was to lead OOM-14's forces in the destruction of Harte Secur and the nearby Harte Secur Airbase. He was assigned a group of droidekas to assist in the attack, while Gunray ensured that Harte Secur's transmissions were blocked to prevent it summoning reinforcements."}, {"tag": "p", "text": "The attack on the research center proceeded quickly, and was successful: the technician soon reactivated OOM-14's forces. Despite the threat of the Harte Secur Airbase, along with a nearby Gungan settlement, OOM-9 was able to gather his forces and sweep into Harte Secur, destroying much of the city's architecture and obliterating its town center. Gunray complimented the droid on the impressive nature of the victory and announced that he had been selected to spearhead the attack on Spinnaker."}, {"tag": "p", "text": "Spinnaker was Naboo's chief supply center, and most goods being transported between Naboo and other worlds passed through the coastal town's spaceports. With the Trade Federation's blockade in place, the spaceports were fully loaded with valuable materials, including nova crystals, which could be used to fund the invasion. Gunray wanted to see direct evidence of Naboo's wealth and so ordered OOM-9 to lead an attack on Spinnaker, occupy the town, and collect its supplies of nova crystals to present to him. A small Trade Federation presence had already been established near Spinnaker, under the command of the battle droid officer YIN-762. OOM-9, however, led his forces into a lightly defended village outside the town. The pacifist villagers, following Queen Amidala's lead, offered little resistance, and the village quickly surrendered to the battle droids, relinquishing their resources and personnel to OOM-9's command. Despite counterattacks from the Royal Naboo Security Forces based in and around Spinnaker, OOM-9 was ultimately successful in pacifying the city and capturing its resources. The Trade Federation forces began preparing to take Theed and end the campaign, using Spinnaker as a launching point for the impending Fall of Theed."}, {"tag": "p", "text": "With the surrounding countryside occupied, Federation forces approached the capital city. Queen Amidala ordered Captain Quarsh Panaka and his Royal Naboo Security Forces to stand down, but a signal jammer in the city prevented the approach of the Federation's droid starfighters and transports. OOM-9 was ordered to lead a battalion of elite units into Theed to eliminate the jammer and allow reinforcements to be sent in. He was also instructed to eliminate any military facilities they encountered and to avoid civilian casualties, so as to prevent full-scale resistance. Despite Amidala's orders, the battle droids encountered scattered resistance from the Naboo military forces as they made their way through the city to the signal jammer. With OOM-9 leading the way from his AAT, the battle droids quickly eliminated their target. With their objective achieved, reinforcements were sent in and OOM-9 was given a new objective—to proceed to the Theed Royal Palace, capture it, and prepare for Gunray's arrival. The droid once again proved capable of the task and led his forces through the city and into the palace grounds, securing it despite heavy counterattacks from Naboo forces."}, {"tag": "h4", "text": "Occupation"}, {"tag": "p", "text": "By the time of Gunray's and Haako's arrival, the capital was firmly under Trade Federation control. OOM-9 remained in Theed, serving as personal guard to the viceroy. He was present in this capacity when Gunray met with Amidala and her senior aides. Gunray required Amidala to sign a treaty legitimizing the occupation but, when she proved uncooperative, he instructed OOM-9 to take her for processing. With rumors passing through Federation-controlled Theed about an amphibious species residing in the outer swamps, OOM-9 computed that finding and eliminating this threat should be his top priority. He therefore delegated to a squad of his troopers the task of escorting the queen to Camp Four. OOM-9 monitored the operation on a secure channel while remaining in the palace with the Neimoidians to remotely control the search for the Gungans. The escort operation to the detention camp, however, did not go as planned when Amidala was rescued by the two previously missing Jedi, who escorted her safely off Naboo."}, {"tag": "p", "text": "OOM-9 got a lead on the Gungans' location when a captured mariner from Harte Secur informed his captors of a Gungan city called Rellias, which was connected to the Gungan capital Otoh Gunga via the Rellias channel. Unaware of the city's exact location, the droid commander's forces established a forward observation base on the shore of a nearby marsh and had begun to scout the area when they were joined by Sidious's apprentice Darth Maul, who had recently arrived on Naboo. OOM-9 greeted the Sith Lord and showed him to a group of Gungan prisoners captured while meeting with Naboo traders outside the city of Moenia. Seeking to end the search for the Gungans quickly, Maul ordered OOM-9 to begin poisoning the marsh to force the Gungans to the surface, and to drain the water if that proved unsuccessful. When Maul departed soon after, OOM-9 did as instructed, but the droids discovered that the marsh was linked to vast reserves of underground water and had made little progress in draining it by the time Maul returned. However, while he was away, the Sith Lord had learned of Rellias's location from a Bothan surveyor named Leika, and the name of its governor, a Gungan named Boss Ganne. OOM-9 accompanied Maul aboard an S-DST and proceeded to Rellias, where his STAP patrols began to saturate the city with depth charges. During the ensuing battle, Maul captured Boss Ganne and used the Force to manipulate Ganne into opening the Gates of Rellias, the only obstacle preventing Federation forces from accessing the Rellias channel. After eliminating all resistance from the Gungan defenders, the troops proceeded to the channel."}, {"tag": "p", "text": "The Rellias channel led to Lake Paonga, location of Otoh Gunga. On the shore of the lake, the Trade Federation forces established an outpost, and OOM-9 sent patrols to locate any Gungan settlements on the mainland and the islands located in the lake. Resources collected on the land were being used to supply Otoh Gunga, so OOM-9's forces destroyed the settlements and secured the resources, cutting the supply lines to the underwater city. The Gungans retaliated by sending their naval forces to attack the Trade Federation outpost, but OOM-9 repelled the counterattack and his forces soon located Otoh Gunga itself. OOM-9 ordered his forces to deploy depth charges; when no Gungan bodies surfaced after the resulting explosions, the droid commander dispatched drone submersibles to scout the lake, confirming that the city had been virtually abandoned. OOM-9 proceeded to eliminate the remaining resistance and laid waste to much of the city. With the apparent defeat of the Gungans, Naboo was firmly under Trade Federation control. Even so, OOM-9 was soon contacted by Gunray, and the droid commander relayed news to Maul that Amidala and the Jedi were returning to the planet."}, {"tag": "h3", "text": "Battle of the Great Grass Plains"}, {"tag": "p", "text": "OOM-9 returned to Theed but was soon called into action once more. Amidala's J-type 327 Nubian royal starship was detected landing in the swamps, but a battle droid patrol found the ship abandoned and Gunray ordered OOM-9 to make the Queen's arrest his top priority. Having failed to secure help from the Galactic Senate, Amidala united the scattered Naboo forces with the Gungan Grand Army. The Gungans started recapturing city after city and were gathering at their sacred place in preparation for an assault on Theed. In response to the new threat, the battle droid commander increased security at the Naboo detention camps before preparing to meet the approaching Grand Army. However, the terrain thwarted his initial attempts to locate the Gungan forces, with long range battle droid patrols becoming mired in soft ground."}, {"tag": "p", "text": "OOM-9 led the Trade Federation forces that finally engaged the Grand Army on the Great Grass Plains. Upon receiving the command from the Lucrehulk-class Droid Control Ship in orbit, OOM-9 ordered his AATs to open fire on the Gungan forces, but the Gungans' deflector shield successfully absorbed the barrage. Seeing the ineffectiveness of the attack through his electrobinoculars, OOM-9 ordered his forces to at last cease fire and deployed his battle droids, sending them through the shield to engage the Gungans. As OOM-9 looked on, his forces proceeded to demolish the outgunned Gungans, sending them into a retreat after their shield finally fell to the onslaught. The commander reported the Gungan retreat to his command ship and received orders to send his AATs in pursuit. Before long, the surviving Gungans were forced to surrender to the advancing battle droids. Only the actions of Anakin Skywalker, in the space battle that was raging above, cost OOM-9 this final victory. Skywalker unintentionally managed to destroy the Trade Federation's droid control ship, deactivating OOM-9's army as well as the commander himself."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like all battle droids, OOM-9 was created solely to wage war. The droid's programming was based around collecting and compiling tactics and plans for battle, and his personality was limited. His metallic face bore no expression and there was no inflection in his voice. Starting out as a regular battle droid, OOM-9 was retrofitted following his promotion to commander. He wore markings painted a dull mustard yellow, designating him as a commander. His original back plating was removed and replaced with the standard command backpack, including an advanced power supply and several antennae to allow him to communicate with the Central Control Computer located in planetary orbit. OOM-9 would receive orders from the Central Control Computer and relay them to his forces on the ground. He could also respond to orders given directly by his Neimoidian superiors and had a limited degree of autonomy to allow him to react to changing situations while awaiting new orders from the Central Control Computer. The droid's legs were powered by high-torque motors and featured dried cartilage-shaped shin plates. OOM-9's feet could be replaced with claws or pads when required. In battle, OOM-9 coordinated the Trade Federation forces from his personal Armored Assault Tank, which was fitted with additional weaponry and enhanced armor. OOM-9 was armed with an E-5 blaster rifle and featured black optical sensors and a vocoder to allow him to communicate verbally with his superiors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "OOM-9 was created for George Lucas's 1999 film Star Wars: Episode I The Phantom Menace, in which he commands the battle droid army at the climactic Battle of the Great Grass Plains. He also appeared in the novel and comic adaptations of the movie. Terry Brooks's novelization mentions OOM-9's presence at a conversation between Darth Sidious, Darth Maul and the senior Neimoidians, during which the droid reports on his response to the threat of the Gungan Grand Army. However, he was omitted from the film's depiction of the scene."}, {"tag": "p", "text": "The character's background was expanded in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, in which he was voiced by Charles Martinet. The game presents a biography of the character, and the player controls OOM-9's forces in its first campaign, which depicts the early battles of the Trade Federation invasion of Naboo. The game also features a \"what if\" scenario in which Anakin Skywalker does not destroy the droid control ship. In the scenario, the player can lead OOM-9's forces to victory over the Gungans on the Great Grass Plains. OOM-9's involvement in the events of Galactic Battlegrounds was expanded in James Luceno's short story \"End Game,\" which was published in the 2012 re-release of The Phantom Menace novel."}, {"tag": "p", "text": "The 2002 young reader novel Jedi Quest: The Way of the Apprentice refers to \"a manual regarding the OOM-9 Battle Droid.\" It is unclear whether this refers to a manual regarding OOM-9 specifically or the OOM command battle droids in general."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}