{"url": "ORO_Mining_Station_LM0228", "categories": ["Category:Legends articles", "Category:Industrial facilities", "Category:Lamaredd locations", "Category:Mining stations"], "nodes": [{"tag": "h1", "text": "ORO Mining Station LM0228"}, {"tag": "p", "text": "ORO Mining Station LM0228 was a fully-automated mine built by the Outer Rim Oreworks company in the planet Lamaredd of the LM0228 system and managed by the local ORO Administrator, initially Hugo Bartyn. Centuries after its creation, the little-checked mine was secretly encrouched upon by the Menahuun, a local sentient species who used the Station, known in Menahu language as Hua'Bal, to prepare an open attack against Bartyn's inheritors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around five hundred years before the Battle of Naboo, Hugo Bartyn, an agent of Outer Rim Oreworks, claimed the planet Lamaredd in the LM0228 system, also known as Lamaro system, to be exploited for minerals. ORO named Bartyn the Administrator of their local interests and sent engineers and building droids to create their main mining installation, later known as ORO Mining Station LM0228. They also made living rooms and several waste pipes that later threw the refuses in the north-western ocean. ORO then gave Bartyn several mining droids to excave the planetary crust."}, {"tag": "p", "text": "During all the construction, Hugo Bartyn and his companions hunted the local sentient species, known as Menahuun, until their assumed extinction. The Menahuun had instead migrated to a north-western part of the planet to survive the strikes and to prepare a reprisal. During his campaign, Bartyn had installed his main headquarters in the underground command center of the Mining Station. Erroneusly believing that he had destroyed the species, Bartyn permanently locked the doors of the mine's command center to keep out any scavenger."}, {"tag": "p", "text": "Bartyn then used the droids to create his own city, Bartyn's Landing, near the mine. It was to become a coastal town of fishermen, not affiliated to the mines. Meanwhile, Bartyn made good use of his resources so that ORO Mining Station LM0228 gave profits in record time — even if Bartyn kept a part of the money from the mine. Bartyn remained as the Administrator for the rest of his life, and he was succeeded by his descendants for five centuries. One of these, in c. 229 BBY, built a secret tunnel from the Bartyn mansion to the Mining Station, and installed a MMV security droid to protect it. In these centuries, the Bartyn family became owners of most of the property in the planet, although only because of ORO continued support, which only happened because ORO still received benefits from the mine."}, {"tag": "p", "text": "It was ORO's policy to periodically send inspectors to check the mines; but the Bartyns had bribed several ORO officers to get rid of this neccessity. As such, the mine was fully automated with droids and nobody organic ever had the need to enter."}, {"tag": "p", "text": "C. 194 BBY, the Menahuun migrated south again because their new homeland had turned uninhabitable. While on the mountains, they coincidentially found a secret entrance to the mine and discovered the insides of the Mining Station. They also discovered that the mining droids were busy with their work and ignored the newcomers. The Menahuun then turned the mine into their new town, calling it \"Hua'Bal\", which meant \"Hidden Glory\" in Menahu. They also spent the time trying to learn about the alien technology."}, {"tag": "p", "text": "C. 36 BBY, Administrator Guther Bartyn, a descendant of Hugo, went close the mines while hunting in the mountains. The inhabitants of the mine reacted by shooting him with laser defenses. Bartyn escaped and erroneusly believed that a gang of outlaws was hiding in the mine."}, {"tag": "p", "text": "C. 29 BBY, the Menahuun revealed their existence to the inhabitants of Bartyn's Landing and achieved an amount of peace. Suddenly worried, Guther Bartyn closed the secret mine that connected the Mining Station with his home."}, {"tag": "h3", "text": "Layout"}, {"tag": "p", "text": "There were three entrances to the Mine, aoround a former holotheater, plus an underwater tunnel leading to the sea and several water stream too narrow for a Human to swim. The control platform allowed to overlook all the mine, and it including a mining laser."}, {"tag": "p", "text": "There were several areas not thought for the mine, such as the fighting pit, the weapons testing range, the warehouse —including too little food in times of the Menahuun— and the greenhouse. The Menahuun organized several living areas where they built huts, and re-converted storage areas into dungeons. They also forbade all entrance to the lower part of the mine."}, {"tag": "p", "text": "The reactor core control room managed all the energy for the mine, but it was a very dangerous area to stay, particularly in violent conditions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "ORO Mining Station LM0228 was created by writer Cory J. Herndon and featured in the article Bartyn's Landing and in the role-playing adventure Reckonings, both of them published in the magazine Star Wars Gamer #7 (2001)."}, {"tag": "h3", "text": "Alternate ending"}, {"tag": "p", "text": "The article assumes that the player characters of Reckonings achieve the best possible ending but, should they fail, the adventure offers an alternative path that takes place during an open war between the Menahuun and the citizens of Bartyn's Landing. In this situation, the Menahuun from Hua'Bal repeatedly raid Bartyn's Landing and, as an answer, Guther Bartyn asks ORO for corporate shock troops to cleanse Hua'Bal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}