{"url": "Oake", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone trooper medics", "Category:Mercenaries", "Category:Saleucamians", "Category:Veiled Sorority members"], "nodes": [{"tag": "h1", "text": "Oake"}, {"tag": "p", "text": "\"Oake\" was the nickname of a clone trooper who served the Galactic Republic as a clone medic in the Grand Army of the Republic during the Clone Wars. A member of the 1st Platoon, Oake became a mercenary operating on Saleucami during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Oake was one of the millions of clone troopers created on the aquatic planet of Kamino for the Grand Army of the Republic, being trained for years as a standard trooper. During the Clone Wars, Oake served as medic of the 1st Platoon before being retired by the Galactic Empire from active duty. Making off with caches of armor and weaponry, Oake and other platoon members fled to the Outer Rim where they operated as a mercenary group. Basing their operations on Saleucami within Blackwind Crater, Oake and the Platoon were hired as the long-term guards of the Veiled Sorority's base of operations in the crater. Because of the accelerated age of the clone army, Oake was physically closer to the age of seventy or eighty than to his chronological age of forty. When the last of the Platoon's gunners died, Oake was forced into the role to fill the vacancy. Tending to his ailing brothers using what little supplies the Sorority had given him, Oake was willing to reach out to other groups if it meant saving his brothers from going untreated. Carrying a light repeating blaster, blaster pistol, vibroknife, and worn armor, all standard issue from their time in the Grand Army, Oake's hearing had begun to diminish. By the time of the Sorority's conflict with the Zann Consortium, only four others were still alive out of the original twenty-seven troopers that survived the Clone Wars. Oake was joined by Zeke, Jayk, Rafe, and Tojo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}