{"url": "Obba", "categories": ["Category:Legends articles", "Category:Army of Light members", "Category:Ithorians", "Category:Jedi Council members", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Obba"}, {"tag": "p", "text": "Obba was a Jedi Master who lived during and immediately after the New Sith Wars. A contemporary of Masters Worror Dowmat and Valenthyne Farfalla, the three served together as Padawans in the Army of Light. After surviving the conflict, Obba was appointed to the Council of First Knowledge, and spent many years searching for and recovering Sith artifacts and talismans. In 990 BBY, he was a member of the team sent to capture the last Sith Lord on Ambria. Under the command of Master Tho'natu, the team traveled to Ambria, where they were attacked by a deranged Darovit, driven mad by the Sith sorcery of his cousin Darth Zannah. Assuming him to be the Sith Lord, Tho'natu struck down Darovit, and the Jedi returned to Coruscant, bringing with them the lightsaber hilts of the five Jedi recently killed in the confrontation with Zannah and Darth Bane on Tython."}, {"tag": "p", "text": "During his time with the Order Obba also trained two Padawans, Medd Tandar and Set Harth, who aided him in his duties for the Council of First Knowledge. However, Harth was corrupted by the Sith artifacts he discovered during his travels and rejected the ways of the Jedi Order, becoming a Dark Jedi. He kept many of the artifacts he found for himself before leaving the Jedi and continuing to search for additional, similar relics to add to his collection. Tandar, meanwhile, was later killed by the Huntress on Doan during her assassination of Gelba, the leader of the planet's mining caste during his search for a cache of long-buried Sith artifacts and talismans. After Tandar's death, Princess Serra of Doan met with Obba to assure him that the assassination had not been ordered by the Doan Royal House."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Originally a native of Ithor, Obba was at some point taken and trained as a Padawan by the Jedi Order. When war broke out with the Sith, he joined the ranks of the Army of Light under the command of Lord Hoth. Fighting alongside his companions, he survived the battles, returning to Coruscant with the army's dissolution with the Ruusan Reformation. Along with Master Tho'natu, Obba traveled to Ambria as part of a strike team tasked with eliminating the Sith. Upon their arrival at Caleb's camp, they found the hilts of five slain Jedi and a sickly individual they thought to be Darth Bane. In reality it was a deranged Darovit, driven mad by Darth Zannah. Master Tho'natu struck down the sick Human, causing the Jedi to believe that the Sith were extinct."}, {"tag": "p", "text": "In the wake of the costly battle with the Sith, the Order began to erase all memory from the galaxy of Sith lore. A member of the Council of First Knowledge, Master Obba trained many Jedi Knights the art of securing Sith artifacts for the Council. Taking Set Harth under his tutelage after the Padawan's first master's death, Harth eventually divorced himself from the Order, hoarding a secret stash of Sith artifacts for himself, and thus turned to the Dark Side. Another apprentice of Obba's, Medd Tandar completed the Jedi Trials and began work for the Council. On a mission to Doan to recover a cash of talisman, Tandar was killed by the Huntress, who was hired to kill a group of rebels plotting to overthrow the royal family of Doan."}, {"tag": "p", "text": "Upon his former apprentice's death, Obba planned to begin a formal investigation on Doan. Not wanting a conflict with the Order, the Doan Royal Family sent a representative, Princess Serra to ensure the Master that they would find and persecute the assassin. Meeting the diplomats in his private quarters in the Tower of First Knowledge, Master Obba agreed to the terms that Serra presented to him, promising to hold off an investigation if the Doanians provided concrete evidence absolving their involvement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}