{"url": "Obas", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Alliance to Restore the Republic planets", "Category:Andirma sector planets", "Category:High-gravity planets", "Category:Type II atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Obas"}, {"tag": "p", "text": "Obas was a superheated volcanic planet located in the Expansion Region's Andirma sector. During the Galactic Civil War, the Alliance to Restore the Republic operated a base on the planet, the environmental control systems of which at one point malfunctioned. As a result, the base faced imminent melt-down due to the extremely high temperatures of Obas. The personnel of the base tasked a group of Rebel agents that had arrived in the Obas system to retrieve critical replacement parts from an Imperial supply depot in the nearby Rainos Cluster."}, {"tag": "p", "text": "At the same time, an Imperial scouting force discovered the Obas base and dispatched a heavy assault starfighter and Imperial Army assault troopers to the planet. When the Rebel agents returned to the Obas system, they fought the Imperial starfighter and subsequently entered the base on the planet. After the group had located the power conduit at which the newly-brought parts needed to be installed, the Imperial troopers, who had also entered the complex, attacked the Rebels."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Obas was a terrestrial planet located in the Obas system, a part of the Expansion Region's Andirma sector. It was situated at a distance of only two hours' hyperspace travel from an Imperial supply depot in the Rainos Cluster. Obas occupied the second orbital position around its star, Oba, and a single moon circled it in turn. The local year on the planet consisted of 401 local days, each of which was 42 standard hours long."}, {"tag": "p", "text": "Obas was a high-gravity superheated world with high levels of radiation in its environment, a Type II atmosphere in which the use of a breath mask was recommended, and a searing hot climate that even had the potential to harm living beings in vacuum suits. Except for an arid hydrosphere, the planet was predominantly a volcanic wasteland, with such terrain features as mountains, rocky plains, and volcanoes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Crisis at a Rebel base"}, {"tag": "p", "text": "The smuggler Roark Garnet once stole several Elegance message drones from an Imperial depot near Obas. In 1 ABY, Garnet noted the fact in the scandoc known as Cynabar's Droid Datalog."}, {"tag": "p", "text": "During the Galactic Civil War, the Rebel Alliance established a base on Obas due to the planet's strategic location in the Expansion Region, which made it a perfect stopover point for Rebel spies bringing information from the Core Worlds to the Alliance High Command in the Outer Rim Territories. At some point during that conflict, the environmental control systems of the Obas base malfunctioned, putting the facility at risk of melting into slag and endangering the lives of the base's personnel. Several of the facility's systems shut down as a result of the planet's intense heat, and all personnel was sequestered in the base's control center, to which all the remaining power of the facility was rerouted."}, {"tag": "p", "text": "When a group of Rebel agents arrived at the edge of the Obas system in a starship, it received a message from the Obas base. The message informed the Rebels of the situation at the facility and instructed the group to obtain for the base thirty KL-45 coolant hydro-valves from the nearby Rainos Cluster Imperial supply depot. If the agents would not retrieve and install the replacement coolant hydro-valves in time, it was estimated that the Obas base would suffer a complete melt-down in less than nine hours."}, {"tag": "h3", "text": "A race against time"}, {"tag": "p", "text": "Shortly after receiving the message, the group of Rebels discovered the presence of an Imperial scouting vessel in the Obas system. The starship was a part of an Imperial scouting force that was searching Expansion Region planets for any signs of Rebel outposts, and it was slowly circling each of the system's worlds, beginning with the outermost and working inward. At that point, the Rebel agents departed for the Rainos Cluster supply depot, where they were ultimately successful in obtaining the coolant hydro-valves. While the Rebels were away, the Imperial scouting vessel visited the atmosphere of Obas and eventually, a modified probe droid notified Imperial authorities on anomalies detected in the system."}, {"tag": "p", "text": "In response, the Empire dispatched to the Obas system a TL-118 \"StarHammer\" Short-range Attack Ship and a civilian transport vessel carrying a squad of Imperial Army assault troopers as well as a group of Imperial saboteurs. The civilian transport landed at the Obas base, where the Imperials forced the main docking bay doors open, allowing the assault troopers to begin searching the complex. The heavy assault starfighter, however, remained in Obas's orbit, where it engaged the Rebel agents' starship in combat upon the latter's return from the Rainos Cluster."}, {"tag": "p", "text": "After defeating the fighter, the Rebels' ship descended into Obas's lower troposphere, which allowed the agents to make visual contact with the entrance of the Rebel base. The group entered the facility and eventually located its control center, whereupon one of the base's technicians instructed the agents to install the coolant hydro-valves at a power conduit in the facility's maintenance area. When the group finally located the power conduit, it was attacked by the Imperial assault troopers, who had also entered the domed chamber. At the same time, a stressed section of the chamber's ceiling began to crack due to the heat of the outside and eventually crashed down on the maintenance area's floor."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The superheated Obas had no native sentient species. Other than in the Rebel Alliance base on its surface, the planet had no form of government. The base's population numbered sixty-two individuals, and no goods of note were exported from the planet, since the base's primary value was in its strategic location. Conversely, agricultural products, high technology, and medical supplies were all imported on Obas in order for the base's existence to continue in the face of the adverse conditions of the planet."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Rebel Alliance constructed a base with limited docking facilities inside a cliff on Obas. The hostile conditions of the planet necessitated the use of several protective measures, such as massive doors that kept the heat out of the facility's main docking bay and the use of coolant throughout the base's systems. The docking area of the Obas base housed twelve X-wing starfighters, twenty-four BTL Y-wing starfighters, and fifteen Z-95 Headhunters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Obas served as a setting for  \"Meltdown,\" a roleplaying game adventure authored by George R. Strayton, illustrated by Mike Chen and included in the 1996 supplement Instant Adventures for use with West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Obas system, and therefore the planet Obas, in grid square L-15."}, {"tag": "p", "text": "\"Meltdown\" suggests that the player-characters can be temporarily reassigned to the Rebel Alliance base on Obas, or they can be permanently stationed there and at the beginning of the adventure can be returning from a delivery mission to the Outer Rim Territories, during which they have had no contact with the base. In addition, the adventure lists several possible outcomes for the characters' mission to install the replacement coolant hydro-valves at the base. If they fail the task, they have to help the base's personnel escape the destruction of the facility."}, {"tag": "p", "text": "If the player-characters manage to help restore full power to the Obas base, they can send a forged report to the Empire indicating that the base has been abandoned and then use the civilian transport used by the Imperial force as a distraction while the facility is evacuated. Alternatively, the characters can learn from the Imperial assault troopers they fought against that a picket patrol of two Carrack-class light cruisers is on its way to investigate the Rebel presence on Obas, and the base must be defended by its own starfighter complement. Instead of a threat of an immediate military response from the Empire, the gamemaster player can have the other players deal with the presence of hidden Imperial saboteurs in the base. Finally, if the player-characters save the Obas base from destruction and prevent its detection by the wider Empire, they can use it as a launching point for missions in further adventures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}