{"url": "Obi-Wan_Kenobi%27s_Delta-7_Aethersprite-class_light_interceptor/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Delta-7 Aethersprite-class light interceptors", "Category:Jedi starfighters", "Category:Unidentified starfighters"], "nodes": [{"tag": "h1", "text": "Obi-Wan Kenobi's Delta-7 Aethersprite-class light interceptor"}, {"tag": "p", "text": "Obi-Wan Kenobi flew a Delta-7 Aethersprite-class light interceptor just prior to the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Obi-Wan Kenobi's Delta-7 Aethersprite-class light interceptor began as an interceptor commissioned just before the outbreak of the Clone Wars in 22 BBY. Highly advanced and carrying sophisticated equipment, it was an expensive starfighter to produce. The ship was armed with four laser cannons (many of the fighters were upgraded to contain two extra cannons behind breakaway panels after recommendations based on the flight-test and subsequent modifications made by Jedi Master Saesee Tiin and Adi Gallia for increased performance), and an advanced communication and sensor array that kept the pilot of the ship well-prepared for any circumstance that might arise during space travel."}, {"tag": "p", "text": "After Anakin Skywalker found a damaged R4-P17 during his inspection of the customizations to the Delta-7 Aethersprite-class light interceptor, he rebuilt the ship that would then be assigned to Obi-Wan Kenobi with an R2-series astromech dome. R4 became the prototype for other integrated droid navigators in Jedi starfighters. As part of the Delta-7, the agromech had a truncated body, which was permanently attached to the ship. Jedi Knight Obi-Wan Kenobi was then assigned this Delta-7 in his service to the Jedi Council."}, {"tag": "p", "text": "One of the most famous encounters involving this ship was the tracking of bounty hunter Jango Fett by Obi-Wan through the asteroid fields of Geonosis. Jango noticed Kenobi in pursuit and attempted to finish off the Jedi once and for all by leading him through Geonosis' rings. Obi-Wan's Delta-7 was damaged and he was forced to hide on the back of an asteroid as Fett descended onto Geonosis. Kenobi then used the fighter to land near a gathering of Separatist ships. Upon discovering a plot of several systems scheming to secede from the Republic, Obi-Wan used the on-board holotransceiver to alert the Jedi Council. When he was captured while sending his message, the fighter was likely impounded by Separatist forces; however, it was apparently recovered after or during the battle that took place later on that planet, and saw further use by Kenobi during the advent of the Clone Wars."}, {"tag": "p", "text": "When the Jedi began to transition away from the Delta-7, R4-P17 was removed from the ship and given a full astromech body to make her compatible with Obi-Wan's new Delta-7B. It is unknown what became of the Delta-7 after this."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}