{"url": "Obi-Wan_Kenobi_impersonator", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Actors", "Category:Agents of the Galactic Empire", "Category:Jedi impostors", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Obi-Wan Kenobi impersonator"}, {"tag": "p", "text": "The impersonator of the Galactic Republic Jedi Master Obi-Wan Kenobi was an Imperial actor altered by plastic surgeons to resemble Obi-Wan Kenobi, under orders from Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The unknown actor, recruited by Lord Vader, underwent plastic surgery to resemble Kenobi. He also received technological gimmicks to approximate Force powers and make his resemblance to Kenobi more than physical."}, {"tag": "p", "text": "The impersonator appeared on the Expansion Region desert planet of Aridus, where he befriended the native reptilian Chubbits—whom Imperial forces had long mistreated—and took a leadership role in their rebellion against the local Imperial garrison. Hovertrains were ambushed while Imperial Military and mining posts were raided. In one particular skirmish, the fake Kenobi saved a Rebel Alliance agent from being apprehended by Imperial troops."}, {"tag": "p", "text": "The gunrunner spread news of his rescue to the Rebel base on the jungle moon of Yavin 4, which was under siege by an Imperial fleet. The young Rebel pilot Luke Skywalker—who had witnessed his mentor's death on the first Death Star during a fight with Darth Vader and was curious about this mysterious reappearance—departed for Aridus with C-3PO on his Rebel smuggling ship."}, {"tag": "p", "text": "On Aridus, they witnessed a group of poorly equipped Chubbits attacking a heavily armored Imperial hovertrain. Seeing his fellow Rebels in trouble, Luke and C-3PO threw two bags containing proton charges from their transport at the hovertrain, destroying it. However, flying debris knocked Skywalker unconscious, as they were too close to the train. Luckily, the Kenobi impostor—who had been leading the Chubbits—arrived on the scene and tended to Skywalker."}, {"tag": "p", "text": "Skywalker was fortunate to have only a slight concussion resulting from the flying debris. He soon recovered, and he and his droid joined forces with the Chubbits and Kenobi, whom he had not yet realized was an impostor. Later, they continued their journey through the deserts of Aridus on a locally built wind-runner."}, {"tag": "p", "text": "Continuing their insurgency against the Empire, the Chubbit rebels attacked an Imperial outpost and laid waste to it. Using technological gimmicks to substitute his lack of Force power, the Kenobi imposter won the admiration of the Chubbits and Luke Skywalker. Following the raid, the Kenobi impersonator contacted Lord Vader himself via a holoprojector. He informed his master that everything was going as planned and that Skywalker had joined him, not having realized that he was an impostor. As part of the plan, the impostor was to lead Luke to the Iron Tower where Vader would be waiting. Then, Skywalker would be a prisoner of the Sith Lord."}, {"tag": "p", "text": "However, the impersonator began to have doubts about his mission. The respect shown by the Chubbits and the awe in Skywalker's eyes indicated to him that Obi-Wan Kenobi had been a great Jedi Master and that he was little more than a cowardly actor willing to serve under an oppressive Sith-led Galactic Empire."}, {"tag": "p", "text": "Later, he and Skywalker departed for the Iron Tower alone with their Droffi steeds on a mission to destroy the automated power transformer and signal amplifier whose powerful ultra-strong frequency waves crippled the nervous systems of the Chubbits. On their way, their Chubbit allies defeated an Imperial patrol speeder."}, {"tag": "p", "text": "When they arrived at the Iron Tower, the pair split up as intended by Lord Vader. The Dark Lord of the Sith contacted the Kenobi impersonator and ordered him to lure Skywalker into his trap. However, having seen the Empire's true colors, he refused to obey Vader. In retaliation, the Sith Lord used the Force to hurled equipment at the impersonator with enough momentum to cause mortal wounds."}, {"tag": "p", "text": "This attack, the impersonator knew, caused Skywalker to feel Vader's presence in the Tower, putting the Dark Lord's trap in jeopardy. No sooner had Vader left to intercept Skywalker than the impersonator activated an emergency beacon, which notified C-3PO aboard the Rebel ship of Skywalker's location. He also pulled a control lever that started a power overload in the Tower's upper levels, destroying the structure, nearly killing Vader and effectively shutting down most of the Imperial operations on the planet."}, {"tag": "p", "text": "The impersonator knew that the explosion would not kill Skywalker, for the boy rushed over to where the former lay dying. Before he passed away, he confessed to Skywalker that he had merely been an impostor; he even mused about his hopes on how well he played the role."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}