{"url": "Obi-Wan_and_Anakin_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Obi-Wan and Anakin"], "nodes": [{"tag": "h1", "text": "Obi-Wan and Anakin 1"}, {"tag": "p", "text": "Obi-Wan and Anakin 1 is the first issue of the canon comic book miniseries Star Wars: Obi-Wan and Anakin. The issue was written by Charles Soule, illustrated by Marco Checchetto, and published on January 6, 2016 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Before their military heroism in the Clone Wars, before their tragic battle on Mustafar, and many decades before their final confrontation on the Death Star…they were Master Obi-Wan Kenobi and his Padawan learner, Anakin Skywalker. It's been a few years since Obi-Wan pledged to train the young \"chosen one,\" but even as they have grown closer through training, it has been a difficult road. Now, called to a remote planet for assistance, Master and Padawan may be pushed to the breaking point. Writer Charles Soule (Lando, She-Hulk, Daredevil) and artist Marco Checchetto (Star Wars: Shattered Empire, Avengers World, Punisher) bring us a tale of the Jedi at the height of their power…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A rough landing"}, {"tag": "p", "text": "A stricken T-6 shuttle crash-lands on the war-ravaged world of Carnelion IV, having taken serious damage in the debris field around the planet. Two ejection seats break out of the craft, landing on the planet's snow-clad peaks. Jedi Padawan Anakin Skywalker compliments his master Jedi Knight Obi-Wan Kenobi for his piloting skills, adding that even Jedi Master Plo Koon would have had difficulty flying the ship through the debris field."}, {"tag": "p", "text": "Kenobi agrees and says that the debris field must have been one of the two reasons why nobody comes to Carnelion IV. When Skywalker asks what is the other reason, Kenobi shows him the ruins of a city below the Celadon Sea, which is also littered with wrecked airships. Skywalker asks what happened. Kenobi responds that the people of the planet destroyed themselves in a war many generations ago."}, {"tag": "h3", "text": "A philosophical discussion"}, {"tag": "p", "text": "When Skywalker asks why the Galactic Republic allowed it, Kenobi responds that Carnelion IV was not a Republic member world because the Galactic Senate did not have any interests in it. Skywalker asks why the Jedi did not stop the war. Kenobi explains that the Jedi Order is under the jurisdiction of the Senate and that there are only ten thousand Jedi available to keep peace in the galaxy. While the Jedi can guide and teach people, Kenobi clarifies that the Order is not an army. If people are determined to wipe themselves out, Kenobi surmises that there is little the Jedi can do."}, {"tag": "p", "text": "When Skywalker blames the system for the destruction of its people, Kenobi admits the system is not perfect. Skywalker thinks that the system should change. Kenobi hopes the system will change. Skywalker asks what they should do since they cannot contact the Republic Diplomatic Fleet, Kenobi responds that their mission is to provide aid and not request it. He adds that the distress signal they picked up specifically requested Jedi intercession and that the only ally a Jedi needs is the Force."}, {"tag": "p", "text": "Kenobi is curious to meet the person who transmitted the distress signal. He notices that the broadcast loop began recently but that it used archaic phrasing. Noticing an explosion in the air, Skywalker notices that Carnelion IV is not as dead as it seems. Just then, a damaged airship flies past them and crashes on the ground."}, {"tag": "p", "text": "Skywalker wants to help but Kenobi tells him not to forget his lightsaber. Skywalker replies that he meant what he said when he wanted to leave his lightsaber. However, Kenobi responds that he prefers that Skywalker live to make that decision and insists that he take the lightsaber."}, {"tag": "h3", "text": "Skywalker's Jedi training"}, {"tag": "p", "text": "In a flashback scene, Skywalker spars with a training droid that has been programmed to simulate Darth Maul. Several Padawans watch while Jedi Master Mace Windu, Supreme Chancellor Palpatine, and Jedi Knight Kenobi gaze down from a balcony. Palpatine has taken an interest in lightsabers."}, {"tag": "p", "text": "When Windu asks why Skywalker is fighting a droid simulated to mimic Maul, Kenobi explains that Anakin has been asking about his fight with the Sith on Naboo and assumed that it was a natural curiosity. Palpatine is impressed that a young Skywalker has modified a training droid to impress his teachers. Skywalker ends the duel by cutting the droid in half."}, {"tag": "p", "text": "A human and a Duros Padawan quip that Skywalker is a slave to his emotions. Overhearing their conversation, Skywalker uses the Force to levitate their lightsabers and point it at them. Skywalker demands to know what emotions they are feeling now. Kenobi orders him to stop and Skywalker obliges. Skywalker apologizes to the two Padawans, who are visibly intimidated."}, {"tag": "p", "text": "When Palpatine remarks that Skywalker's training is far from complete, Windu explains that his education was complicated because he came as an older child. Windu says that Kenobi took on a difficult task of training Skywalker as his Padawan. Palpatine offers to help guide Anakin, saying that the boy was once his age and that he feels a special connection to Skywalker due to his assistance with the Naboo blockade years earlier. When Windu says that Skywalker is Kenobi's responsibility, Palpatine \"gently\" reminds him that the Jedi are under the Senate's jurisdiction and that he is the Chancellor of the Senate. Kenobi obliges."}, {"tag": "h3", "text": "Rescuing the locals"}, {"tag": "p", "text": "Back in the present, Skywalker takes his lightsaber. Through the Force, Skywalker hears a battle in the skies. The two trace to the peak where they see airships blasting at each other. When Skywalker asks what they are supposed to do, Kenobi replies what they can. The two focus on a crashing airship and pull it to the edge of the cliff. Two figures on the cliff sense that their airship is drifting inexplicably to the edge and decide to jump."}, {"tag": "p", "text": "They land near Skywalker and Kenobi just as their airship explodes. Anakin introduces himself and Kenobi to a young green–haired girl named Kolara. However, her mentor \"Mother\" Pran is initially hostile to her rescuers, asking whether they are Open or Closed while pointing blasters at them. Skywalker responds that they are Jedi responding to a distress call which specifically requested Jedi aid. Kolara and Mother Pran look at each other before the latter asks \"what in the green hells is a Jedi.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}