{"url": "Obi-Wan_and_Anakin_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Obi-Wan and Anakin"], "nodes": [{"tag": "h1", "text": "Obi-Wan and Anakin 2"}, {"tag": "p", "text": "Obi-Wan and Anakin 2 is the second issue of the canon comic book miniseries Star Wars: Obi-Wan and Anakin. The issue was written by Charles Soule, illustrated by Marco Checchetto, and published on February 3, 2016 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Master and Padawan find themselves stranded on an unfamiliar world…a world of strange, primitive technology and dangerous natives. But even if they can save themselves…why were they called to this world?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Peacemeakers in a war zone"}, {"tag": "p", "text": "Mother Pran demands that Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker identify whether they are Open or Closed. She doesn't believe that they are Jedi. Before the confrontation can escalate, a Closed airship strafes their cliff. The four narrowly avoid being killed."}, {"tag": "p", "text": "When Kolara asks Pran what they should do, Pran hopes that the Closed airship will kill the Jedi and leave them alone. Kenobi disagrees and can't believe that they are being targeted by the Closed. Pran responds that the Closed kill everything. When Skywalker asks if there is a chance the Closed will leave, Pran says not until they have seen their corpses. Through the Force, Skywalker sensed that the ship went up."}, {"tag": "p", "text": "To Pran and Kolara's shock, Kenobi jumps up onto the peak to confront the airship. Skywalker reassures the locals that Master Kenobi knows what he is doing. Kenobi uses his lightsaber to slash through the airship's gasbag, causing it go up in flames. One of the crew members jumps out of the ship and Skywalker pulls him to safety."}, {"tag": "h3", "text": "Brokering peace"}, {"tag": "p", "text": "Mother Pran is angry that Kenobi rescued a Closed warrior, pointing out that Grecker is one of their worse enemies. Pran wants to shoot Grecker dead but Anakin blocks their path. With Kenobi's consent, Skywalker uses his lightsaber to hack through their blasters, disarming the two enemies. Unwilling to give up, Pran and Grecker draw their daggers but Kenobi uses the Force to levitate their weapons."}, {"tag": "p", "text": "Kenobi introduces himself and Skywalker to Grecker, and demands to know why Grecker and Pran want to kill each other. Grecken blames the Open for poisoning their world with the Celadon Sea. Pran claims that the Closed started the war and that the Open are the only ones preventing the planet from falling into complete chaos. Kenobi wants to leave but Skywalker fears they will kill each other."}, {"tag": "p", "text": "Kenobi says that he hopes they will not kill each other and that disarming them would give them the opportunity to reconsider their actions. Since the Jedi cannot stay with them forever, Kenobi thinks that they should divert their energy towards problems they can solve. Grecker disagrees and points out that they would not be able to cross the Celadon Sea safely without their weapons. Kolara agrees with Grecker to the horror of Mother Pran. However, Pran realizes that Grecker is right. Kenobi agrees to accompany the Open and Closed belligerents to safety."}, {"tag": "h3", "text": "Into the Celadon Sea"}, {"tag": "p", "text": "Skywalker asks if it is possible for the wrecked airships to be repaired, reasoning that it will make their journey much easier. Grecker agrees but thinks that it is not possible. Skywalker disagrees and says that they have an intact gondola and airbag. He thinks he can use his mechanical skills to cobble up a ship. Grecker counters that an Open airbag and a Closed gondola do not mix because that would be an abomination."}, {"tag": "p", "text": "Anakin says that they will be safe. When Kolara asks about the distress call that the Jedi were responding to, Anakin explains that someone on Carnelion IV requested Jedi assistance. Kolara is amazed because she had believed that they had lost the technology for conducting offworld communications in the early days of the Open-Closed War. Mother Pran offers to help Anakin and Grecker assemble an airship."}, {"tag": "p", "text": "Despite disliking the idea, Grecker agrees to help due to the presence of a pack of winged corpse-leeches. Kenobi senses that the beasts are mindless and following their nature. Unwilling to kill them, Kenobi tells Skywalker to use the Force to send them on their way. Kenobi manages to calm three of the corpse-leeches but Skywalker ends up killing several that approach him."}, {"tag": "h3", "text": "Appointment with Palpatine"}, {"tag": "p", "text": "In a flashback scene, Skywalker struggles to calm a Mott during a training session at the Jedi Temple on Coruscant. Skywalker struggles to control his anger. Kenobi says that skill comes with patience. Skywalker wants to remain until he can calm the Mott but Kenobi tells him that he has been invited to an appointment with Supreme Chancellor Palpatine."}, {"tag": "p", "text": "The two meet with Chancellor Palpatine at his office. Palpatine is pleased that Skywalker is able to spare time from his Jedi training to meet him. Kenobi is proud of Anakin's progress and thinks that he will make an excellent Jedi. When Kenobi asks Palpatine if he has a mission for them, the Chancellor responds that he wants Anakin to accompany him on an errand. A concerned Kenobi wants to come in his place but Palpatine reassures Kenobi that he is capable of handling himself and that Skywalker will be in safe hands. In private, Palpatine tells Anakin that Kenobi \"still has much to learn.\""}, {"tag": "p", "text": "A cloaked Palpatine takes Skywalker to Coruscant's sub-surface Level 2685. Anakin asks why they are visiting such a dangerous place. Palpatine plays on Anakin's curiosity and desire to explore by telling him that he visits the Coruscant Underworld as a sense of duty. He remarks that it is rare for Padawans to visit the underworld and that it is even more unusual for their inhabitants to reach the surface. Palpatine tells them that the sun is a myth in the underworld."}, {"tag": "p", "text": "While his predecessor Chancellor Finis Valorum tried to ignore the underworld, Palpatine claims that it is the darkness that most requires light. As they walked past a bound man, Palpatine explains that when his duties permit him, he comes down to the underworld disguised in order to do some good. The two visit a seedy cantina called Club Kasakar."}, {"tag": "h3", "text": "Airborne"}, {"tag": "p", "text": "Aboard the airship, Kenobi tells Skywalker that the locals changed their minds about helping them the moment they told them why they were here. Kenobi is pleased that two bitter enemies are able to work together for a greater purpose and hopes that this momentary peace will lead to better understanding. Skywalker remarks that the locals are just like them. Kenobi disagrees and says that the two of them may have aggressive discussions but that they are still mater and student."}, {"tag": "p", "text": "When Skywalker raises the matter of the Sith, Kenobi responds that they will remain watchful and trust in the Force. He thinks that they are safe for the first time since arriving on Carnelion IV. The airship flies over a pack of menacing corpse-leeches."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}