{"url": "Obi-Wan_Kenobi/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Move protected articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Articles to be expanded", "Category:Articles with non-canon elements", "Category:AgriCorps members", "Category:Authors", "Category:Coruscanti", "Category:Force ghosts", "Category:Humans", "Category:Impersonators", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Jedi Generals", "Category:Jedi Purge survivors", "Category:Lightsaber combat instructors", "Category:Males", "Category:Outbound Flight residents", "Category:Pilots", "Category:Post-Ruusan Jedi High Council members", "Category:Post-Ruusan Jedi Masters", "Category:Republic Navy admirals", "Category:Slaves", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Obi-Wan Kenobi"}, {"tag": "p", "text": "Obi-Wan Kenobi, later known as Ben Kenobi during his exile, was a Force-sensitive Human male and a legendary Jedi Master who played a significant role in the fate of the galaxy during the waning days of the Galactic Republic. He was the mentor of both Anakin and Luke Skywalker, training both in the ways of the Force. He had a long and tumultuous career that helped shape the fate of the entire galaxy."}, {"tag": "p", "text": "Born in 57 BBY on Stewjon, Kenobi was taken as the Jedi apprentice of Qui-Gon Jinn and traveled on many missions with him. During the Invasion of Naboo in 32 BBY, Kenobi became the first Jedi in approximately 1,000 years to defeat a Sith Lord in combat when he defeated Darth Maul during the Battle of Naboo, yet lost his master in the same duel. He would suffer another loss In 22 BBY in the form of the death of fellow jedi Siri Tachi whom Kenobi had romantic feelings for. That same year, Kenobi found the Clone army on Kamino, and he was captured and almost executed in the Petranaki arena on Geonosis, along with Skywalker and Senator Padmé Amidala. The newly arrived clone troopers rescued them, but the following battle began the galaxy-wide Clone Wars."}, {"tag": "p", "text": "As a High Jedi General, Kenobi fought during many battles of the Clone Wars, and was one of the last members of the Jedi High Council. Even after his apprentice became a Jedi Knight, Kenobi and Skywalker fought together many times, becoming a widely renowned pair. Kenobi earned the sobriquet \"the Negotiator\" through his charm and calm demeanor as well as the quiet threat of his abilities with a lightsaber. During the war, an old enemy returned to haunt Kenobi: Darth Maul, the murderer of Qui-Gon Jinn. With aid of his brother, Savage Opress, the revived Sith Lord went to create a criminal empire, all the while plotting revenge on his most despised adversary. Kenobi clashed blades with Maul on occasion across the galaxy. He was devastated as Maul slew the Jedi's past love interest, Duchess Satine Kryze of Mandalore, in cold blood, yet remained strong throughout the conflict. Later in the war, Skywalker saved his life in a battle fought over Coruscant, after which Kenobi killed General Grievous on Utapau. However, he was soon betrayed, as Commander Cody, following Order 66, opened fire on him."}, {"tag": "p", "text": "Kenobi met up with his old mentor Grand Master Yoda, and the two realized that not many Jedi had survived the attacks. The two returned to the Jedi Temple, where they learned the agonizing truth: Skywalker, now lost to the dark side of the Force, had led an attack to kill all Jedi remaining in the Jedi Temple, following orders from Chancellor Palpatine, the ruler of the successor of the Republic, the Galactic Empire. Kenobi traveled to Mustafar in order to duel his former apprentice and friend, now the Sith Lord Darth Vader. Finally, Vader was taken in by a storm of lava, and Kenobi remorsefully left him to die. While Yoda, one of the few other Jedi to survive the Great Jedi Purge, went into exile, Kenobi took the son of Skywalker and Amidala, Luke Skywalker, to live with the Lars family on Tatooine. He became a friend of the young Skywalker as he grew up, but he did not tell Skywalker his actual identity."}, {"tag": "p", "text": "Kenobi re-emerged in 0 BBY, shortly before the Battle of Yavin. After Leia Organa, Vader's daughter and Luke Skywalker's twin sister, was captured by the Empire, she contacted him desperately. Kenobi gave Luke his father's lightsaber and traveled with him to Alderaan in Han Solo's Millennium Falcon, only to realize that the Death Star had destroyed the planet. Kenobi entered the Death Star with Luke, Han, Chewbacca, C-3PO, and R2-D2, in order to rescue Organa, but Darth Vader sensed his presence. In a duel with his former apprentice, Kenobi gave up his life to allow Luke to escape, vanishing into the Force the moment Vader struck him down with his weapon. Three years later, his spirit returned to Luke to lead him to Dagobah in order to learn from Master Yoda. He even carried out his role as a mentor to the younger Jedi beyond his natural life through use of the Force, remaining a significant influence on Luke Skywalker's foundation of the New Jedi Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (57 BBY–32 BBY)"}, {"tag": "p", "text": "Obi-Wan Kenobi was born in 57 BBY, the first son of a moderately wealthy family, and was taken to Coruscant to begin his Jedi training while still in his infancy. His homeworld was Stewjon, from which Kenobi himself believed that he had once visited, possessing vague, pleasant memories of playing with his brother, Owen. In reality, Kenobi would later conclude that these memories were visions from the Force of Owen Lars. The fraternity he felt between himself and Owen was true, from a certain point of view. As Kenobi felt a brotherly bond with his former student, Lars too would be his brother."}, {"tag": "h4", "text": "Youngling"}, {"tag": "p", "text": "As a Jedi Initiate, Kenobi trained under Grand Master Yoda alongside other Jedi hopefuls of his age; later he would be placed into a clan under the tutelage of Master Vant. Bant Eerin, Garen Muln and Quinlan Vos became Kenobi's friends, and he eventually fell in love with fellow Padawan, Siri Tachi. Others would become rivals, and even enemies, such as Bruck Chun and Aalto. His lightsaber instructors included Anoon Bondara and Cin Drallig."}, {"tag": "p", "text": "As a youngling, Kenobi had been fascinated by machines, building models of ships and even dreaming of becoming a pilot. Ironically, as he grew older, Kenobi came to despise flying. His ability to repair machinery and reprogram computers would serve him well in the future, but because of his ability to learn quickly, Kenobi became arrogant and was often impatient. Under the careful guidance of Master Yoda, however, Kenobi became more humble and reserved."}, {"tag": "h4", "text": "Becoming Qui-Gon's apprentice"}, {"tag": "p", "text": "Despite his rapid growth as a Jedi, by the time Kenobi reached the age of twelve, it seemed that his chances of becoming a Jedi Knight had all but passed him by; Younglings who weren't selected to be Padawans by the age of 13 would be shifted into one of the divisions of the Jedi Service Corps. One day, Jedi Master Qui-Gon Jinn visited the Jedi Temple to watch the matches. Kenobi dueled one of his competitors, Bruck Chun, to draw the attention of the maverick Jedi Knight. Kenobi fought valiantly to the point of exhaustion. The final offensive against Chun was carried out so fiercely that Jinn thought Kenobi too dangerous and declined training the boy. Kenobi was sent to the mining colony of Bandomeer to work as a ploughman for the AgriCorps. Strangely enough, Jinn happened to be sent on a mission to the same place. The youngling and the Jedi Knight had to work together if they wanted to survive the mission, which was a trap set for Jinn by his former Padawan, Xanatos. Kenobi showed Jinn that he was worthy to be taken as a Padawan learner en route, when they were attacked by members of Xanatos' criminal organization, the Offworld Mining Corporation. After putting an end to the tense situation, the two arrived on Bandomeer, where Jinn received a letter signed by Xanatos. It turned out that Bandomeer was not in need of Jedi assistance; it had all been organized by Xanatos, who was revealed to be the leader of Offworld, a company whose ruthless business practices and mining operations terrorized all of the citizens on the planet."}, {"tag": "p", "text": "Jinn sent Kenobi off to his AgriCorps duties while he planned to meet with Xanatos, not as old adversaries, but as ambassadors, working to find an agreement between Offworld and Bandomeer. Xanatos, however, planned all along to sabotage their meeting and kill Jinn. With the help of Kenobi, Jinn once more attempted to end Xanatos' acts of terror. Jinn dueled with his former apprentice, and though they ended Offworld's business on Bandomeer, Xanatos was able to escape. During their altercation with Xanatos, Jinn discovered Kenobi's true potential, and took him as his new Padawan learner. Their relationship got off to a bad start, as the pair's personalities were constantly at odds; Jinn was headstrong, while Kenobi was more practical. As time went on, however, their opposing natures blended them into an effective duo."}, {"tag": "p", "text": "For his thirteenth birthday, Kenobi received a river stone from Jinn, something that came from the River of Light on the Jedi Master's homeworld. The stone was later revealed to be Force-sensitive. It had helped Kenobi save his memories when he was almost erased by the Syndicat, a criminal organization on Phindar."}, {"tag": "p", "text": "Kenobi and his master were later called to monitor the elections on Gala. The two discovered that the leader of the hill people, Elan, was the actual heir to the throne. The Jedi also saw through the current Prince Beju's plan to secretly cut off the planet's bacta supply, wait for the people to suffer and then fix it again, making him look like a hero in the eyes of his people, however the two Jedi were able to expose this plan. After Beju withdrew from the elections, Obi-Wan and Qui-Gon attempted to convince Elan to run for queen, but she instead wanted Wila Prammi, who was far more experienced, to become queen. After the elections ended with Wila becoming queen, Elan returned to the hills with her people, now living more peacefully with the people of Gala."}, {"tag": "p", "text": "During his time with Jinn, Kenobi temporarily left the Jedi Order. Caught up in the civil war on Melida/Daan, Kenobi elected to stay and help the children, otherwise known as the Young, who were fighting against their tradition-obsessed elders. The planet's residents had been fighting a pointless war for generations, and had actually forgotten what had started the feud. Kenobi befriended a boy within the Young called Nield, and possibly developed an attraction for another of the Young named Cerasi. Soon after Kenobi's decision to stay, Cerasi was mortally wounded and died in Kenobi's arms. For a time, Kenobi remained on the planet to continue helping the war effort, but soon enough felt that his place was with the Jedi and was taken back by Jinn, though it took a long time for them to fully trust each other again."}, {"tag": "p", "text": "Jinn and Kenobi eventually caught up with Xanatos when the Dark Jedi was planning an attack on Master Yoda. The two were able to find and engage him before his plans went into effect, though. It would be while foiling Xanatos that Kenobi was forced to fight his long time rival, Bruck Chun. Chun had kidnapped Kenobi's friend Bant Eerin while working with Xanatos, and Kenobi engaged the misguided youth in a lightsaber duel. Kenobi won the duel when Chun fell off a ledge and died, though he would carry the guilt for many years. After he escaped, Xanatos returned to his homeworld of Telos. Kenobi and Jinn went after him. On Telos, however, they were not very welcomed. They were astonished to find out that Xanatos wielded significant financial and political power there. He was considered a hero to his people. What the people of the planet did not know is that while Xanatos and the government had been distracting them with a form of gambling called Katharsis, Offworld had been pillaging the planet's resources. The two Jedi were then framed and wanted for a crime they did not commit. Xanatos captured them, but the two Jedi managed to escape. Xanatos committed suicide by diving into a pool of acid after Jinn stopped his plans."}, {"tag": "p", "text": "It was during this time that Kenobi first spoke to Siri Tachi, whom he had met during lightsaber training at the Temple. They started off on rocky terms, as she was angry at him for leaving the Order, but would later forge a friendship that would last the rest of their lives, and even develop into something more. Kenobi and Tachi were together sent on a mission with their respective masters, Qui-Gon Jinn and Adi Gallia, to the planet Kegan. A simple mission to test a child for Force-sensitivity quickly devolved into a non-violent uprising to overthrow Kegan's Benevolent Guides after Kenobi and Tachi were mistakenly captured for truancy and sent to the planet's Learning Circle. Unable to slip away, the Padawans had to withstand brainwashing at the hands of the Teaching Guides, who sought to enforce The Learning curriculum upon them to teach the two the value of the General Good. After being reassigned to the Re-Learning Circle for lack of discipline, Kenobi and Tachi, having learned to work together and with a little help from their Masters, soon escaped with their new friend Davi and O-Lana, the child they had originally come to the planet for. The Keganites, upon discovering what really went on in the Re-Learning Circle, quickly voted out their leaders while Kenobi and his fellow Jedi were still on-planet."}, {"tag": "p", "text": "Soon after, Kenobi would travel with Jinn to Ilum to make his first lightsaber. While there, Jinn and Kenobi were sent to Ord Sigatt to investigate the disappearance of a Republic refinery ship. After noticing the low attitudes and that no one had any weapons (except for guards), Kenobi met the Besalisk Dexter Jettster, who was selling weapons to the people of Ord Sigatt. Jettster was told to wait for Kenobi as a fight had broken out between a boy who threw a rock at a guard. The Jedi jumped in and sliced the guards weapons before returning to Jettster, who commented on how a lightsaber could stand for danger and for hope. Jettster and Kenobi would soon become friends. Jinm soon came back with information that a senator from Denon, Denon-Ardru Mutual, had sent a small army to put a monopoly on the mining business there."}, {"tag": "p", "text": "Kenobi fought alongside his master in the Stark Hyperspace War, one of the last of the many small-scale conflicts that plagued the Galactic Republic in its final days. It was during the Fourth Battle of Qotile when Kenobi's enduring friendship with fellow Padawan Quinlan Vos truly began. Kenobi would later recall fondly a training mission the two Padawans undertook on Ragoon VI and missions the both of them would undertake with Dexter Jettster on the Outer Rim."}, {"tag": "p", "text": "When Kenobi was nearly fourteen years old, he and Jinn traveled to a planet once devastated by turmoil and currently under a temporary truce. The rulers of each planet temporarily exchanged children when they reached the age of seven and raised them in an effort to get the future leaders to appreciate each other. The plan backfired after hundreds of years of success, however, when the heir of Rutan decided he wanted to remain on Senali, forsaking his royal title and home planet. This infuriated his father, King Frane, who believed his son had been brainwashed by the Senali, and he threatened to declare war on Senali. Kenobi and Jinn arrived to mediate the dispute, and after meeting with King Frane, they went to the ocean world of Senali and attempted to convince Leed to return to Rutan, thus avoiding war."}, {"tag": "p", "text": "When Qui-Gon and Obi-Wan returned to Coruscant, they were asked for help by a man called Didi Oddo, who was being targeted by a bounty hunter called Ona Nobis. After a series of brief fights, all ending with Nobis escaping, Nobis was able to kidnap Qui-Gon. Obi-Wan, with the help of Jedi Adi Gallia and her Padawan, Siri Tachi, was able to find Nobis again on planet Belasco, where the four fought on a rooftop. Nobis had her whip lassoed around a drainpipe and their duel ended with Gallia cutting the whip in half, resulting in Nobis falling to her death. Obi-Wan figured out that a scientist who experimented on Force-sensitives named Jenna Zan Arbor was responsible for hiring Nobis. Together with his friend, Astri Oddo, Obi-Wan went to Jenna Zan Arbor's secret laboratory and rescued his master, however Arbor was able to escape. Obi-Wan joined his master, Adi Gallia and Siri Tachi in their search to find Arbor again, but they were unsuccessful."}, {"tag": "p", "text": "At some point between 44 and 32 BBY, Kenobi and Jinn were sent on an extended mission to Mandalore, which was engulfed in the Mandalorian Great Clan Wars. They were tasked with serving as bodyguards to the Duchess Satine, leader of the pacifist New Mandalorians, whom the Senate supported against the belligerent Mandalorian clans. Together, the two Jedi spent a year on Mandalore protecting the Duchess from the hostile insurgents threatening her world. Kenobi fell in love with Satine during his stay on Mandalore, but despite his feelings toward her, he continued with his training and was reassigned. Kenobi regretted leaving her, but ultimately followed the Jedi Code he had sworn to live by."}, {"tag": "p", "text": "In 41 BBY, Obi-Wan followed his master to New Apsolon, against the Jedi Council's orders not to, as Qui-Gon had had visions of Jedi Tahl being harmed. When they arrived, Qui-Gon's visions were revealed to be true, as they found out that Tahl had disappeared. The two Jedi spent days on figuring out that an organization called the Absolutes had kidnapped her, as they had seen her protect one of their enemies. Qui-Gon soon found Tahl again, however he found that it was too soon, as she had been drugged with paralytic drugs to the point of her death. Obi-Wan later reflected upon Tahl's death, remembering seeing the refusal to accept the fact in his Master's eyes: as a Padawan, he'd thought it impossible that a Jedi Knight could die, but he later came to believe that the first moment of his adulthood had come when he'd seen Qui-Gon's face register the fact that Tahl was dead. The death of his partner resulted in Qui-Gon becoming obsessed with finding the drugger, Balog, but as he was about to strike him down, he realized what he had become and stopped."}, {"tag": "p", "text": "One year later, Obi-Wan and his master were sent to Frego, where they had to protect Lena Cobral, a woman who wanted to testify her husband's death in front of the Galactic Senate, but was too afraid to go alone, as she believed that the murderers of her husband, who were also her family members, were out to kill her. While escorting her, the two Jedi were attacked by Zanita Cobral, the mother of Lena, but Obi-Wan easily stopped her. The three then safely traveled to Coruscant, where Lena testified, leading to the arrest of Lena's family."}, {"tag": "p", "text": "Two months later, the two Jedi were sent to Vorzyd IV, where they had to find the person responsible for sabotaging the planet's monitoring systems. They discovered that a group called the Freelies, who were angry at the adults of the planet for being so serious and angry all the time, were responsible. Obi-Wan and Qui-Gon helped the adults relax more, resulting in the Freelies stopping their sabotaging."}, {"tag": "p", "text": "During his training, Kenobi and a Jedi strike team were sent to Corellia to stop a group of Rodian terrorists from destroying a Spaceport outside of Coronet City."}, {"tag": "p", "text": "Sometime between 39 BBY and 36 BBY Jinn was appointed as an advisor to the Wookiee colonists of the moon Alaris Prime. When a Jedi Jedi holocron was found in one of the Wookiee camps Kenobi was sent to a newly built Jedi temple in another settlement run by the colonial leader; Chewbacca. Kenobi retrieved the holocron to keep it out of enemy hands, as only a Force-sensitive individual could handle it, walking between Chewbacca's camp and the settlement containing the holocron."}, {"tag": "p", "text": "In 33 BBY, Kenobi would assist his master in missions to Yinchorr and Dorvalla. After the Incident at Dorvalla, Kenobi and Jinn were also involved in the attempt to mediate relations between the Trade Federation and the Nebula Front, an attempt that would sadly fail with the disaster at the Eriadu Trade Summit."}, {"tag": "p", "text": "Kenobi would later investigate the mysterious disappearance of a fellow Padawan, Darsha Assant. He found a few tantalizing clues to her fate, but galactic events caught up with Kenobi before he could track down the missing Alderaanian. Shortly after being given the assignment, he and Jinn were dispatched by Supreme Chancellor Finis Valorum to resolve the Blockade of Naboo."}, {"tag": "h3", "text": "Capturing Lundi and Protecting"}, {"tag": "p", "text": "At one time, Kenobi and Jinn were assigned to search a Sith studying institution. They believed Murk Lundi to be searching for a Sith holocron. They followed Lundi to various planets on one of which, Kenobi got shot in the shoulder. Kenobi and Jinn eventually captured Murk Lundi on Kodai."}, {"tag": "p", "text": "Not long after the capture of Lundi, Kenobi and Jinn, along with Adi Gallia and Siri Tachi, traveled to planet Cirrus, where they had to protect Talesan Fry, a young boy who had revealed a group of bounty hunters' plan to massacre a large group of innocent people, and was now being hunted by them. During the time on Cirrus, Kenobi and Tachi grew romantic feelings for each others, but eventually agreed to end their relationship. After capturing – what they believed to be – every bounty hunter who was after Fry, the Jedi got ready to depart with Fry, but not before Fry's parents were killed by bounter hunter Magus. Magus escaped and Fry ended up living on Coruscant, under indirect protection from the Jedi."}, {"tag": "h3", "text": "The Aurorient Express"}, {"tag": "p", "text": "Kenobi and Jinn were then sent to investigate the Aurorient Express's condition when it failed to respond to signals and was sinking into the atmosphere at a alarming rate. As they boarded, they came under fire from the Express's defense and were then attacked by illegal security droids. Kenobi and Jinn were able to get inside the ship and were able to speak with the captain."}, {"tag": "p", "text": "Kenobi and Jinn informed of the droids on his hull. Kenobi and Jinn went to the rescue of Chief Bouyardy from the droids. Kenobi was able to lock and contain the security droids. Kenobi and Jinn then went to question the Chief Pursuer, Waverton and Saul Moegantz about the droids. They went to question Podlong Foahl, who tried to run away from them. Kenobi and Jinn then pursued him through the ship. They were then able to corner Foahl. Jinn tried to question but Foahl refused to answer and told them about a bomb. Foahl was then shot by Waverton."}, {"tag": "p", "text": "Kenobi and Jinn then questioned Buck and the rest of passengers and crew. Kenobi then went into the vents and caught Waverton talking with a pressure pirate. Kenobi then met with his master and Chief Bouyardy. Kenobi, Jinn and Bouyardy then took Waverton as prisoner, though he denied planting the bomb. They took him to the captain. Unfortunately, the ship was in collision course with Yorn Skot Mining Station."}, {"tag": "h3", "text": "The Jin'Ha and Black Heth (32 BBY)"}, {"tag": "p", "text": "Jinn sent Kenobi to Coruscant to patrol the mid-city when he first ran into Black Heth. After saving a woman and fighting his way to the bus, he went back to the Jedi Council, where he was directly sent on another mission to rescue an informant. With the information he gathered he went straight to the space port to stop Black Heth from escaping. He defeated Black Heth but the people, or Jin'ha, who were getting the shipment sprung from the ship and began to attack. Kenobi defeated most of them but was overpowered by their leader, who left him for dead; but before the ship took off Kenobi placed a tracker on the ship."}, {"tag": "p", "text": "The Jedi tracked the ship to the mining world of Obredaan. Masters Eeth Koth and Plo Koon went to investigate, but their ship crashed before they landed. Kenobi and Jinn were sent after them. They both landed and fought the Jin'ha in the swamp and got to the ship. When no one was in the ship, Jinn went on to investigate and Kenobi went on into the mine. Kenobi fought off the Jin'ha and found out their weapons were made of cortosis. He then fought his way out to the entrance where Masters Jinn, Koth, and Koon were already fighting. Together they defeated the Jin'ha and returned to the temple. Later Kenobi found out that Trade Federation assassin droids armed with cortosis swords were sold to the Trade Federation by the Jin'ha."}, {"tag": "h3", "text": "Blockade of Naboo (32 BBY)"}, {"tag": "h4", "text": "Rising tensions"}, {"tag": "p", "text": "In 32 BBY, twenty five year old Kenobi and his Master Qui-Gon Jinn headed for the planet Naboo onboard the Consular-class cruiser Radiant VII, on a mission to resolve a trade dispute. They arrived on the Trade Federation flagship Saak'ak and were greeted by the protocol droid TC-14, who brought the Jedi to a conference room. The Jedi were subsequently betrayed by Trade Federation Viceroy Nute Gunray. Secretly acting on the orders of the Dark Lord of the Sith, Darth Sidious, Gunray had the Radiant VII destroyed and attempted to assassinate the two Jedi by venting dioxis gas into the conference room, and then dispatched a small group of battle droids to dispose of their bodies."}, {"tag": "p", "text": "Before escaping from the conference room, Kenobi asked TC-14 what the gas was. The protocol droid apologized and claimed that it was excess steam from the ventilation system. When they escaped, they went down the corridor and Kenobi ducked into a service closet to work the controls to open the door at the end of the hallway. Going down the next hallway, Kenobi hit a control panel to open an alcove, this one guarded by a battle droid. Kenobi cut the droid down with his lightsaber and used the control panel to open the next door. Kenobi also met a protocol droid who was carrying out an order to release destroyer droids at \"Jedi intruders.\" Kenobi let it carry on its work. The two then tried to break onto the bridge of the battleship, but were disrupted by two destroyer droids. They ran off and went into the ventilation shafts. Kenobi fell through into an air vent and ran through. He saw the Radiant VII explode. Kenobi continued in the ship's underbelly and defended himself from several Trade Federation maintenance droids and used a control panel to open one door, which he went through to use another button to open a door nearby. He continued further into the air vent, and fell through the grating and into a corridor. Kenobi went into a generator room and took out several battle droids. There he met a Neimoidian technician who told him he needed to destroy a power generator to open the door to the hangar, which the young Jedi did before continuing to the hangar. In the corridor, he faced three droid starfighters. After that, he met back up with Jinn, who ordered him to stowaway on separate landing craft. Kenobi went along the upper catwalks, defending himself from the droids stationed there, and hit switches to maneuver himself over one of the landing craft and enter it. He took the elevator down and entered it."}, {"tag": "p", "text": "After escaping from the conference room, the Jedi fought through the next corridors and went into a command center, where they traveled along a conveyor and Force Jumped over the gaps, ending up in a hangar. There a pilot droid sent a Cargo Loader Droid after them. After taking several lightsaber strikes, the Cargo Loader Droid malfunctioned and crashed into the wall. The two Jedi traveled through the hole and went deeper into the ship near the static discharge chamber. The two Jedi then traveled through a corridor filled with electronodes by jumping on top of them, taking care not to fall onto the floor. They then came out on the upper catwalks in a large void space. They were engaged by a droid starfighter. After deflecting its blasts back at it, the Jedi destroyed the starfighter's thrust dampers, forcing it to chance to its walker mode. The starfighter continued to strafe them, eventually falling prey to its own deflected blasts, allowing the Jedi to continue their mission."}, {"tag": "p", "text": "The two Jedi fought their way through the flagship to reach the ship's bridge to discover why the Viceroy wanted them dead. Leaving the conference room, they moved through the hallways and to the hangar, where they came under fire from the hangar turret. Taking cover under the wreckage of the Radiant VII, Jinn ordered Kenobi to cover him while he disabled the turret. When the turret was disabled, the two Jedi continued to the bridge. Three droid starfighters harassed the Jedi from the side of the hangar. The two Jedi then moved into a cargo bay and went through a battle droid factory. In the factory, they faced two more droid starfighters and bomb droids. In the next hallway, they were trapped by force fields. Jinn ordered Kenobi to jump up into the ventilation shafts. The two fought through the shafts, traveling along by riding the updrafts at two points, and came out in a walkway, where they found the invasion fleet in the hangar. They ended up in in an observation deck before going to the bridge. Kenobi covered Jinn while the latter cut through the blast doors. Kenobi destroyed the battle droids and bomb droid interlocutors."}, {"tag": "p", "text": "The two Jedi were interrupted by the arrival of two P-series destroyer droids, P-59 and P-60. The two Jedi used Force speed to escape into the ventilation shafts and make their way to the hangar, where they discovered the Federation was preparing for invasion. Jinn decided they would stow aboard separate landing crafts."}, {"tag": "p", "text": "Kenobi boarded one of the invasion ships; during the voyage down to the planet he disrupted the ship's communications so as not to reveal his presence. The disruption attracted the attention of the rest of the ship, and Battle droid squad 8313 was sent to investigate, forcing Kenobi to eliminate the squad. Moving through to the Armored Assault Tank storage bay, he contacted Jinn, who ordered him to either the main control room or the turbine room in order to force the ship to crash-land. Kenobi fought his way through to the turbine room and disabled the turbines. He then went to the main control room and cut down all the present battle droids. He then disabled the holoprojector and went down the hole to the lower level and proceeded to the Multi-Troop Transport bay, where he fought and destroyed a new type of assassin droid armed with a cortosis blade. After the droid was destroyed, Jinn ordered Kenobi to hide until he landed."}, {"tag": "p", "text": "The Jedi had sneaked onto invasion craft and met up on the surface. When they landed on the surface, Kenobi and Jinn were separated. Kenobi hid in the swamps and swam to the shore, where he faced a squad of B1 battle droids. After dispatching them, he hid in the water again. He then met a Gungan named Jar Jar Binks. The two ran away from Federation Single Trooper Aerial Platforms, and Kenobi fell into the swamp water. Once back on land, he used a stump to climb on top of a log where Binks was perched. The Gungan ran off, and Kenobi followed. Kenobi destroyed the droids in his way. He then jumped into the water; when he got back on land, he faced more battle droids in his way around a stuck Multi-Troop Transport. He jumped around a series of small islands in the swamp to avoid the carnivorous fish. Kenobi found Binks again and asked if he had seen his master. Binks replied affirmatively and led the young Jedi away. Kenobi tried to follow the Gungan and got stuck in a pit. He got out by pushing a stump to where he could climb out and grabbed a vine to climb across to the other side. He followed Binks to a droid staging area, and took hold of a heavy repeating cannon to blast two destroyer droids. After that, Binks led him back to Jinn."}, {"tag": "p", "text": "Battling Trade Federation forces, they saved Binks, who offered to bring them to safety in Otoh Gunga. From there, they could reach the city of Theed and warn Naboo's queen about the invasion. They fought through 18 B1 battle droids and OOM security droids and avoided a stampede caused by a Multi-Troop Transport."}, {"tag": "p", "text": "The two Jedi escorted Binks past battle droids and a half-built droid camp. Binks panicked and ran off, leaving the Jedi to Force Jump up mushrooms to reach the top of the tree and the nearby plateaus, which they traversed before reaching solid ground again. Following the path, the two Jedi went through another droid command center."}, {"tag": "p", "text": "The Jedi crossed a bridge and Force pushed the battle droid guarding it before moving into a cave, where they faced a Slaatik hagworm. The hagworm tried to slam into the Jedi several times, and when that failed, released a poison gas from its mouth at them. The hagworm also sent kreetles to harass the Jedi, although the Jedi succeeded in hurting the hagworm and driving it off. They then rejoined Binks and continued their journey."}, {"tag": "p", "text": "By the time Kenobi reunited with Jinn, his lightsaber had shorted out. They were attacked by two Single Trooper Aerial Platforms, which Jinn dispatched by reflecting their laser blasts back at them. After traveling through the swamps, Binks led the two Jedi into the water of the swamps and into Otoh Gunga. There they were brought before Boss Rugor Nass and his advisers. Jinn used a mind trick to convince Nass to lend them a Tribubble bongo and a path to Theed. Nass agreed and told them to travel through the planet's core. Jinn was also able to free Binks, who was going to be punished for returning from his exile. Binks and the two Jedi were able to navigate through the porous core and end up near Theed, surfacing on the Solleu River. By that time, though, Theed had fallen to the Trade Federation. When they tried to gain entry to the secured city, the central bridge across the river was blasted apart by an Armored Assault Tank, cutting the city off from other regions."}, {"tag": "p", "text": "Kenobi later wrote an article about the bongo and their trip entitled \"Go Aboard the Bongo.\""}, {"tag": "h4", "text": "Rescuing the Queen"}, {"tag": "p", "text": "Once in Theed, Jinn told his Padawan that he would create a diversion while Kenobi found a way into the Royal Palace, and cautioned his Padawan to avoid entanglements. Kenobi went up the stairs near the bongo and engaged several B1 battle droids. That way did not lead to the Palace, so he returned to the Solleu and swam to the other side. He then climbed onto the streets and dispatched the two battle droids in his way, and started toward the Palace. He fought through the battle droids stationed in the streets and rescued three hostages. He also sliced his lightsaber through the alarm systems, disabling them. At one point, he climbed up the balcony and picked up a sniper rifle to reduce the number of enemies in his way. He then moved forward across a bridge over the river. Down the street, a shield blocked one street, so he went through a door and climbed the stairs to the upper balcony. There he found another hostage; he rescued the man, who led the Jedi to a balcony to spy on more prisoners. Kenobi then moved past the nearby statue."}, {"tag": "p", "text": "A droid starfighter destroyed the bridge to the Palace. Stuck on the wrong side, Kenobi met two Naboo soldiers and a grenadier. They helped him find another way around and told him about a secret entrance to the Palace. Kenobi went up the stairs to the next level and saved another hostage, who warned him about nearby battle droids. Moving along the cliff to the other side, the young Jedi faced more battle droids and one of the new assassin droid, defeating all the droids. He then took over a gun turret to destroy a Single Trooper Aerial Platform. He then jumped across the ledges, went up the stairs, and shut off the water flow to the pool. That revealed the secret stairs for him to go down into."}, {"tag": "p", "text": "During the Jedis' trek through the city, the central bridge across the river was blasted apart by an Armored Assault Tank, cutting the city off from other regions. Kenobi was separated from Jinn and Binks. The Jedi were forced to cross the city to find the Queen."}, {"tag": "p", "text": "Kenobi jumped into the river and swam away from the tank. He climbed onboard one of the islands a nearby plaza and went onto the walkway. He then Force pushed a lever to extend the walkway. Continuing onward, he then fought a group of battle droids. A force field generator blocked his path, but Kenobi used the Force to flick a switch and lowered the dam, shorting out the generator. Walking along the path and turning left, he found himself among a firefight with more droids and two Naboo guards. After a conversation with them, he told them he was going to enter the garden, and the soldier gave the Jedi a light repeating blaster. Two Multi-Troop Transports settled over the garden and disgorged droids. Kenobi met a wounded guard, who told Kenobi the passcode to enter the gates near the palace. Kenobi then moved forward, avoiding an Armored Assault Tank in the plaza and sneaking around a battle droids and a disabled Multi-Troop Transport. Kenobi gave the password to another Palace Guard. Once through the gates, the guard charged forward but was gunned down."}, {"tag": "p", "text": "Kenobi then moved through the door and into the plaza. He found the button to open the door out of the gardens, then went through it. Off in a small alley rested a droid starfighter, which self-destructed as Kenobi approached. Returning to the path, the Jedi then drained several water pools to reveal the controls to the bridge to access the plaza near the palace. He also destroyed the droids near the controls."}, {"tag": "p", "text": "Kenobi crossed the bridge and climbed the stairs at the end of the walkway, which had been mined, then neared the palace gates, where another Armored Assault Tank was stationed. The Jedi avoided the laser blasts long enough to Force push the lever to open the inner gates, then went back across the tank's path to throw the switch to open the inner gates, which was hidden behind a window. Kenobi then ran through the gates into the area near the palace."}, {"tag": "p", "text": "During the battle, Kenobi rejoined Jinn, infiltrated Theed and fought through a city littered with more than twenty battle droids and OOM security battle droids to make it to the Royal Palace. They passed the Theed Royal Library, which had been turned into a war room for the Droid Army. Just past the library, they faced a gauntlet of missile launcher-armed droids on the balcony and six destroyer droids on the road. At one point, the Jedi commandeered an Armored Assault Tank after taking out its three pilot droids and used it to travel through Theed, blasting other tanks and droids. They also rescued seven handmaidens who had been captured. They disembarked from the tank near the Palace grounds. As they moved onto the palace grounds, they faced more battle droids. In front of the palace they destroyed a T4 turret droid along with Flame battle droids."}, {"tag": "p", "text": "After entering the palace through the secret entrance, Kenobi found himself inside the palace kitchen, where he met the servant Asha. She told him the Palace was on lockdown, but she could crack the codes. Kenobi climbed up the fireplace to reach the next level and fought the droids in the dining room. He then hit the switch to raise the dining table up from the kitchen, which Asha rode up. She then sliced the doors for the Jedi, but held back as Kenobi fought off the battle and destroyer droids in the next room. Once all the droids were destroyed, Asha sliced the next door for him. In the next room, Kenobi was cut off by force fields. He destroyed the droids, including an assassin droid, and then shut down the force field for Asha. The codes had been changed, but she sliced the doors."}, {"tag": "p", "text": "Through the next doors, the Jedi entered a firefight with Panaka and other Naboo soldiers. Asha was locked out by force fields. Together, Kenobi and the Naboo soldiers destroyed the attacking battle droids and the destroyer droid. Kenobi then unlocked the force fields, and went into the next room with a double staircase and fought more droids. Asha then unlocked the throne room. The group entered and fought three assassin droids, which had burst through the windows. A Palace Guard informed them that the Queen had been taken to Camp Four to sign a treaty."}, {"tag": "p", "text": "Kenobi contacted his Master and informed him of the situation. Jinn ordered Kenobi to meet back up. Traveling back outside of the palace, Kenobi met a Naboo grenadier, who informed the Jedi about an Armored Assault Tank blocking the resistance. Kenobi jumped on the balcony and destroyed a grenade droid. He then took over a repeater cannon and destroyed two droids on a lower balcony which were manning more repeater cannons. Moving forward, the young Jedi disabled a force field blocking the street and then assisted several resistance members in fighting battle droids, then dropped an ion grenade on the tank, disabling it. The destruction of the tank cleared his way to the next street. Kenobi then deactivated the shield generator blocking his way, and stepped through."}, {"tag": "p", "text": "Alongside two more Naboo soldiers, Kenobi entered a firefight with a squad of battle droids, and an assassin droid. Kenobi dispatched the Federation troops before proceeding. Continuing on, he defeated another assassin droid and rescued another hostage. He then met back up with Jinn, who was fighting two more assassin droids."}, {"tag": "p", "text": "The two Jedi entered the palace and fought through more droids, including B1 grapple droids, destroyer droids, and OOM command battle droids. At one point they Force jumped on the outside of the walls, using the balconies to proceed to the next story. After that, they infiltrated the throne room with the help of one of the handmaidens they had rescued, who showed them a secret entrance."}, {"tag": "p", "text": "Theed's officials were liberated by the two Jedi and Binks as OOM security battle droids attempted to bring them to Camp Four. Bibble and several handmaidens decided to stay while the Queen went to Coruscant to plead for help in the Galactic Senate."}, {"tag": "p", "text": "On their way to enter the passage under the Palace, Kenobi and the decoy Sabé, disguised as the Queen, were separated from Jinn, Panaka and the others. Sabé led Kenobi away from a group of charging battle droids and into a Palace corridor. She informed him about a secret passage through the garden, and they headed that way. In the garden, Kenobi saved Sabé from a battle droid. He then pushed a statue out of the way so they could access the passage. They went up the stairs, with Kenobi dispatching another droid. The door to the passage was locked, so Kenobi Force-jumped across the broken balcony and accessed the door's control from the other side, and the two moved out into the streets."}, {"tag": "p", "text": "Kenobi went into an apartment and met a woman who was distraught after being separated from her son. Kenobi promised to rescue the boy. The boy had hid from battle droids in a nearby building and Kenobi brought him back to his mother. The woman gave the Jedi a medical kit in return. Kenobi also found a wounded Naboo guard nearby. In return for Kenobi fetching him water, the guard warned him about a nearby Armored Assault Tank. Kenobi then snuck around the balcony to flank the tank, and destroyed the battle droids in his way. The young Jedi then found a prisoner. After a brief dialogue, Kenobi freed the man, who gave the Jedi a thermal detonator."}, {"tag": "p", "text": "Kenobi destroyed the droids under the archway, prompting the tank to leave its position. He then returned to Sabé and led her past the tank. In the next street, they were ambushed by battle droids, three of which were up on a balcony. Kenobi then met an astromech droid, but told it he didn't need a droid following him, and the droid remained. Moving along, Sabé and her Jedi protector dueled more battle droids on the way to the hangar. Kenobi then went into the apartment of another woman by accident. The woman told him that the gate was locked. Kenobi then leapt onto the balcony, then crossed over the street on an overhanging vine, and opened the gate. During the battle, Kenobi had acquired a blaster, and he used it to destroy three mines on the street to allow Sabé to proceed to the river; he also destroyed more droids. Kenobi then met a fisherman, and used his boat as a stepping stone to the street. Once there, he Force-pushed a lever to lower the bridge for Sabé to pass over the river. Once across, the two were ambushed by more droids. Further down the street they faced a heavy repeating cannon. Past that, they joined a firefight with more Palace guards and faced several more groups of battle droids, along with a destroyer droid. Sabé and Kenobi then rejoined Jinn and the others in the Hangar."}, {"tag": "p", "text": "At the time, the Hangar was occupied by droids. Jinn approached an OOM command battle droid designated 2163 and tried to talk his way past it. When the droid ordered their arrest, Jinn pulled his lightsaber and disabled it, then turned on other droids, including 3B3-1204; meanwhile Kenobi rescued several Naboo pilots who were under guard. In the ensuing firefight, one of the Palace Guards was killed. With the droid threat gone, the Queen, Panaka, her handmaidens, and the two Jedi were able to flee aboard the Royal Naboo Starship and depart from Naboo. Governor Bibble stayed behind to watch over the people of Naboo. Ric Olié piloted the ship out of the atmosphere before facing the Federation blockade. One of the blockade battleships fired on the Royal Starship, disabling its shields. Astromech droids were sent to repair the damage, but several were destroyed before R2-D2 fixed the shields as the starship flew past the blockade and entered hyperspace. With the hyperdrive motivator damaged, Jinn convinced the Queen to divert to Tatooine for repairs."}, {"tag": "p", "text": "Upon landing on the desert planet, the Queen's handmaiden Padmé set out for Mos Espa, a nearby city, with Jinn, Jar Jar Binks, and R2-D2. While they were absent, Sabé (in the guise of the Queen Amidala) received a message from Governor Sio Bibble, pleading her to contact him on Naboo. Kenobi cautioned against this, a warning she heeded. At any rate, she could not act without Padmé Amidala's authority, but she still found the situation she was in to be highly taxing. While laying in wait, Sabé (still in the guise of Queen Amidala) was captured by Tusken Raiders. Obi-Wan, tracked the Raiders through their extensive canyon dwellings, among old scavenged shipwrecks, and was forced to journey through a communal Tusken burial site in search of the Queen. He located the Queen being held in a derelict craft that the Tuskens use for shelter and was forced into a confrontation with the Tusken war chief whom he subsequently defeated. In an odd move for the Tuskens, they solemnly and ceremoniously, conceded defeat after Obi-Wan demanded to be allowed to return to safety with the Queen. Obi-Wan, having slain the Tusken war chief and having successfully rescued the Queen, returned to the ship to await his companions return."}, {"tag": "h4", "text": "Meeting Anakin Skywalker"}, {"tag": "p", "text": "On Tatooine, Jinn stumbled upon Anakin Skywalker, a young slave boy who showed tremendous Force potential and an unprecedented midi-chlorian count of 27,700. Jinn decided that the boy should be trained, and while Kenobi was also amazed by Skywalker's strong Force potential, he initially disagreed with his master's decision; he believed, as the High Council would later concur, that the boy was already too old and had acquired too many emotional attachments, including his mother, Shmi, to become a Jedi. Jinn convinced Skywalker to podrace in the Boonta Eve Classic so they could acquire a replacement hyperdrive motivator. After Skywalker won, Jinn secured the parts and Skywalker's freedom from his master, Watto."}, {"tag": "p", "text": "After securing the parts they needed to return to Coruscant, the Queen and the Jedi left Tatooine with the freed Skywalker, but not before a cloaked assassin with a long-hilted lightsaber attacked Jinn. They two Jedi reported to the Jedi Council. Jinn believed that the man who attacked him was a Sith Lord, which bewildered the Council. He also requested that Skywalker be brought before the Council to be tested. Kenobi was sure that the boy was too old to be trained and tried to convince his Master of this, but Jinn was adamant."}, {"tag": "p", "text": "During his stay on Coruscant, Kenobi lightsaber-dueled Master Windu. In response to the Council's refusal to allow the boy to be trained, as Kenobi predicted, Jinn declared that he himself would take Skywalker as his Padawan learner. The Jedi Code forbade a master to have two apprentices, but according to Jinn, Kenobi was ready to face the trials of a Jedi Knight. Though Kenobi would continue to be an apprentice until after Jinn's death, he showed eagerness to face the trials and expressed thanks to his master for the praise given to him before the Jedi Council. The Council then ordered Jinn and Kenobi to escort Queen Amidala back to Naboo in the hopes of drawing out the mysterious warrior."}, {"tag": "h4", "text": "The Battle of Naboo and aftermath"}, {"tag": "p", "text": "The Jedi were walking along the deserted streets of Theed when they were attacked by an overzealous battle droid on a Single Trooper Aerial Platform. They reflected its laser bolts back at it, destroying the droid and causing the Platform to crash, intact. The two Jedi decided to ride it and another one they found through the streets of Theed, destroying numerous battle droids and destroyer droids before diverting onto an aqueduct and facing more battle droids. They had to destroy several gates blocking their path. The two Jedi eventually dismounted at the cliffs overlooking the waterfall."}, {"tag": "p", "text": "They then proceeded to Force Jump down the cliffs until reaching a balcony, then jumping back up the other side. At the top, six Naboo pilots were being held in separate rooms, guarded by three droids each. Each droid trio was a separate type of droid—OOM security battle droids, B1 grapple droids, Flame battle droids, Grapple droidekas, destroyer droids, and B1 battle droids armed with missile launchers. The Jedi rescued five of the pilots before proceeding."}, {"tag": "p", "text": "Around this time, Kenobi was contacted by Asha. The Resistance pilots were prevented from taking off by a Federation quad turbolaser cannon south of the hangar, and Kenobi was asked to help destroy the cannon. As Kenobi went to comply, he met one of the resistance fighters, who informed the Jedi that the Droid Army was hunting down Resistance members. Kenobi set off through the streets and disabled a force field in his way. He rescued three Naboo hostages from the droids; he also entered into a firefight between the Resistance and droids, destroying an E4 baron droid. Kenobi then entered a tunnel."}, {"tag": "p", "text": "When he emerged from the tunnel, he met another Resistance fighter, who informed him that they were pinned down by two repeater cannons. Kenobi fought his way through and destroyed the droids manning the cannons. The young Jedi then emerged into a garden outside the palace. He flanked a repeater cannon, destroyed the droid at the controls, and then turned the cannon onto other droids. As he moved to engage other droids, he was ambushed by a squad of OOM security droids and a destroyer droid, which he destroyed by taking another repeater cannon. Kenobi then went up the staircase to where the cannon was placed, facing four more destroyer droids. When the threat was gone, he destroyed the two power conduits on its side, causing the cannon to explode. Kenobi then jumped off the balcony and landed in the pool underneath. Asha contacted him again and told him the cannon had been destroyed. He swam off to rejoin the battle."}, {"tag": "p", "text": "The destruction of the AAT surprised Gunray, who had expected the final battle to take place elsewhere. Under cover of the confusion, Amidala led her team into the palace. The strike force sneaked into the area near the Palace and fought a squad of battle droids. After the droids were eliminated, Kenobi was asked to lead the strike force into the hangar."}, {"tag": "p", "text": "The battle raged on in the streets outside the palace, and eventually into the Theed Hangar, where the team was slowed down down by battle droids."}, {"tag": "p", "text": "The strike force was discovered, and with battle droid reinforcements on the way, Kenobi was asked to assist the resistance in securing the hangar by destroying the six power cells powering the doors. A Resistance soldier individually lowered the shields on the power cells, and Kenobi sliced through each one when its shield was down. The others provided covering fire, and in Jinn's case, lightsaber cover while Kenobi was disabling the power cells. They faced two E4 baron droids, regular battle droids, and bomb droids. Droid starfighters in walker mode rose up from below the hangar."}, {"tag": "p", "text": "The Naboo forces cleared out the hangar in short order, but the droids were able to alert the Federation's Command Officer. During the engagement, the pilots were able to to take off to attack the Droid Control Ship, although one was shot down by an AAT stationed outside of the hangar. Panaka ordered Red and Blue Groups to regroup, and the strike force moved toward the Palace. Then the doors opened, revealing the mysterious warrior from Tatooine: Darth Maul, Sith apprentice to Darth Sidious. The two Jedi moved to engage him in the inevitable clash. Amidala, Panaka, and their security forces left to take the long way through a different door, but were then pinned down by droidekas. Maul activated his lightsaber, revealing two blood red blades on each end. After the Jedi drew their weapons, the Zabrak moved for the attack. Anakin Skywalker, taking refuge in a N-1 starfighter, accidentally took off, destroyed the droids with the craft's far stronger laser cannon blasts, and joined the battle in space guided by the fighter's auto-pilot."}, {"tag": "p", "text": "As the duel waged on, Maul spun away and telekinetically threw the piece of a perished droideka to hit the controls for the door leading to the Plasma Refinery Complex. Kenobi caught up with Maul, followed by Jinn. The Jedi didn't know it, but Maul had scaled this area, making preparations for their duel. Maul kicked Kenobi right off the catwalk they were on, but the Padawan managed to hold on to the edge of a lower platform. When trying to return to the battle, Kenobi fell through the catwalk down to the next level."}, {"tag": "p", "text": "Kenobi took the elevator back up to the rings, then jumped to the next ring after dispatching a battle droid. Kenobi Force-jumped to the next ring, and took the ramp down to another area. Two droids waited for him in the corridor, but the Jedi dispatched them. Kenobi then hit the switch to open the panel to the next chamber. He advanced along the catwalk to turn on the lights. Further down the catwalk, he used the controls to disable the energy barriers in the chamber. He then extended the bridge part way from his side, then used the Force to push the opposite bridge control. He then Force jumped across the gap to the next catwalk. He then was able to continue back to the main chamber while Jinn and Maul continued to fight."}, {"tag": "p", "text": "He then took one of the elevators down to the next level, and Force jumped to the next ring. He went around that ring and Force jumped to the next one, after dispatching the droid guard. He took the elevator back up to the next level and Force-pushed a droid off the ring. he then entered another room. He descended to the lower level of that room and into the next one, which featured a laser maze. Kenobi returned to the first part of the room, where he went back up to the top level. Once there, he jumped across to the other side and hit the control panel there. Jumping back, he moved the box out of the hidden grating and pushed it onto the elevator so he could bring it down a level and push it into the room with the laser gates. He jumped onto the box and went into the control area for the laser gates, where he was able to manipulate the controls to form an opening. He then jumped down onto the box and went through the laser gates. He rode the elevator back up and re-entered the main chamber."}, {"tag": "p", "text": "Kenobi Force-jumped to an elevator and descended one level and crossed the walkway there. He then boarded another elevator to go up a level, then crossed the walkway to a position where he could jump back to the main catwalk and follow the other two combatants."}, {"tag": "p", "text": "Jinn, then fighting alone, did his best to fend off the Sith until Kenobi could catch up with them, but the older Jedi had been exhausted by the lengthy duel and, deprived of the space necessary to properly utilize his preferred form of lightsaber combat, he was mortally wounded when Maul slammed his lightsaber hilt onto his chin, and in the resulting stun, reversed his lightsaber to stab Jinn in the chest. Maul then taunted Kenobi about defeating his master."}, {"tag": "p", "text": "Kenobi was enraged at the murder of his master and once the laser gates opened, quickly charged at Maul. During an intense duel, Kenobi managed to cut Maul's lightsaber in two. However, Maul continued to fight the Padawan, and Force-pushed Kenobi into an energy pit. Kenobi managed to survive by grabbing onto an input nozzle on the pit wall at the last moment, but Maul kicked the Padawan's lightsaber down the long shaft and then proceeded to slash the rim of the pit, showering sparks upon Kenobi in an attempt to make him lose his grip. Kenobi managed to calm himself, reaching into the Force. Then, using the Force, he pulled himself up hard, leaping into the air and flipping above Maul, calling his fallen master's lightsaber to his hand as he did so. Landing in front of Maul, Kenobi slashed him through the waist, causing the Sith Lord to flinch in shock and pain as he was cut in two. Maul fell into the pit, his halves separating, and Kenobi then rushed to his master's side."}, {"tag": "p", "text": "Jinn's dying request to his apprentice was to train Anakin Skywalker. Kenobi felt that he could not refuse, and took it upon himself to train the boy. Later, in the aftermath of the battle, the Jedi Council arrived to receive Kenobi's report. The Jedi Council was similarly moved by the plea, and fatefully reversed its decision, albeit still with doubts and misgivings. The Council had been impressed that Kenobi bested a Sith, an enemy that had not surfaced in a millennium. Kenobi was made a full Jedi Knight, with his duel with Darth Maul serving as his Jedi Trials. Skywalker was formally placed under the tutelage of Kenobi as his Padawan."}, {"tag": "h3", "text": "Knighthood (32 BBY–22 BBY)"}, {"tag": "p", "text": "During Skywalker's first year at the Temple he met the Tusken Jedi apprentice A'sharad Hett as the masked Padawan attempted to meditate on a balcony in the cool night air. The Tusken's Master, the venerable Cerean Ki-Adi-Mundi, came out to scold Hett because of the late hour, for his new Padawan needed his rest for a mission they would begin the next day. But Mundi thought better of it, when he saw that Anakin Skywalker might actually be striking up a friendship, something that both he and the boy's Master, Obi-Wan Kenobi, knew to have been a difficult thing to do, it seemed, for the young Jedi from Tatooine."}, {"tag": "h4", "text": "First mission with Skywalker"}, {"tag": "p", "text": "About three years into Skywalker's training, when the boy was 12, the new master-and-apprentice duo were sent on their first mission together. They were sent to investigate the cult leader, Kad Chun, younger brother of Bruck Chun. Kad Chun still blamed Kenobi for his brother's death, and it was only after Kenobi and Skywalker uncovered an insidious plot against Chun by his own father (who had allied with the corrupt mining cartel UniFy against Chun's nomadic ship, the BioCruiser) that he finally forgave the Jedi Knight."}, {"tag": "h4", "text": "Mission to Zonama Sekot"}, {"tag": "p", "text": "The next mission they were assigned took them to the living planet of Zonama Sekot in an attempt to find a Jedi Knight, Vergere, who had recently vanished during a mission there. Unbeknownst to them, Wilhuff Tarkin and Raith Sienar had followed them to exploit Zonama Sekot's ability to quickly fuse organic and manufactured technology into starfighters. On the planet, the colonists sold \"seed-partners,\" which bonded with their hosts and allowed the planet to customize a starship for the individual. Skywalker attracted many more seed-partners than anyone previously had, and he named his new ship the Jabitha. When Tarkin and Sienar arrived, the planet revealed its sentient consciousness to the Jedi, explaining that Vergere had left with the mysterious \"Far Outsiders\" in order to protect Zonama Sekot. Although Kenobi and Skywalker could not rescue her, they could stop Tarkin's attack."}, {"tag": "p", "text": "During the ensuing battle, Skywalker telekinetically burned Tarkin's Blood Carver bodyguard, Ke Daiv, from the inside out in a fit of rage. This display of dark power worried Kenobi greatly. Skywalker was captured and brought before Tarkin, but Kenobi destroyed Tarkin's flagship, and Zonama Sekot activated its planetary hyperdrive, vanishing for the unknown regions. Sienar and Tarkin returned to the Republic, but the Jabitha died on the abandoned Jedi-outpost planet Seline, due to hull damage and her separation from her home planet. As they returned to the galactic capital of Coruscant, the Jedi master-apprentice duo had a discussion about Skywalker's actions and his display of dark power."}, {"tag": "h4", "text": "Other missions"}, {"tag": "p", "text": "Kenobi next traveled with Skywalker, who was now 13, on a mission to recover from the planet Kodai the ancient Sith holocron of King Adas, which the mad Sith historian, Murk Lundi, once tried to claim. With Lundi accompanying them, the three found that Lundi's pupil, Norval, a dark side fanatic, had found and taken the holocron for himself. Kenobi, after facing and killing the deranged student, was able to recover the holocron, only to learn that their quest to reclaim it had exacted a heavy toll on Lundi's body. Skywalker and Kenobi spent the last moments of Lundi's life at his side, as the old Quermian professor expressed regret for his fanatical pursuit of the holocron a decade before. With the dangerous artifact at last secured, Kenobi and Skywalker returned the holocron to the Jedi High Council for safekeeping within the vaults of the Jedi Temple at Coruscant."}, {"tag": "p", "text": "On a Colicoid escort mission that unexpectedly turned into a joint mission with undercover Jedi Siri Tachi to Nar Shaddaa, in 29-28 BBY, Kenobi's young apprentice killed the T'surr slave raider and crime-lord Krayn by impaling him with his new lightsaber. Before Krayn's death, the notorious slaver had not only kidnapped and enslaved Anakin, but also imprisoned him with Tachi, Obi-Wan's childhood comrade and friend. Kenobi, too, then went undercover as an advisor and slave-operations inspector for the Colicoids in an attempt to rescue Tachi and his Padawan. The death of Krayn by Skywalker effectively freed all the moon's slaves, and brought an end to the undercover mission of Tachi, who was soon thereafter Knighted."}, {"tag": "p", "text": "In 27 BBY, Kenobi and Skywalker, who had turned fourteen, were called upon―along with Tachi (now a Jedi Knight), Soara Antana, Ry-Gaul, and their Padawans, Ferus Olin, Darra Thel-Tanis, and Tru Veld, respectively―to embark on a mission to Radnor to help with the evacuation of the planet, known for its development of high-tech weaponry. The evacuation was due to a deadly toxin that had spread because of a bio-weapons leak. The Jedi later discovered that the toxic leak was connected with Radnoran raiders and their sponsors, the imminent Avoni invaders from a neighboring world. The path of guilt led to Galen, a traitorous Radnoran, who was taken into custody for his treachery on behalf of Avon and its ambassador, Dol Heep. However, ultimately, the Avoni did not pay for their genocidal crimes, were never thereafter forced by the Galactic Senate to make amends."}, {"tag": "h4", "text": "Outbound Flight"}, {"tag": "p", "text": "In 27 BBY, Master Windu sent Kenobi and Skywalker on a secret mission to Barlok to monitor the overbearing Jedi Master, Jorus C'baoth, and his Padawan, Lorana Jinzler. Unbeknownst to them, Kinman Doriana, on behalf of Darth Sidious, had planned the negotiations to work splendidly in C'baoth's favor, gaining him enough prestige to go ahead with his Outbound Flight Project. Kenobi and Skywalker did rescue Jinzler after she was captured by malcontents, but their opponents were able to acquire the components they needed to create a missile and attack the negotiations. Kenobi tried to stop the missile, but was unsuccessful. However, C'baoth used the Force to crush the missile and that gave him the impetus he needed to quickly conclude the negotiations, as well as receive support for Outbound Flight. Unknown to C'Baoth, Doriana sabotaged the missile. Following the go-ahead for the project by the Senate, Master Windu tasked Kenobi with accompanying the mission at least part of the way out to keep an eye on the headstrong, arrogant C'baoth."}, {"tag": "p", "text": "While they were on the expedition, Kenobi often butted heads with C'baoth over C'baoth's running of the Outbound Flight, especially when the Jedi Master began taking prospective Jedi children away from their parents in the middle of the night. It was only when Supreme Chancellor Palpatine himself asked Kenobi and Skywalker to settle a dispute on a world near Outbound Flight's final stop in Republic territory that the two would leave the expedition."}, {"tag": "h4", "text": "Dangerous games with Omega"}, {"tag": "p", "text": "A Jedi mission to Ragoon VI saw Kenobi and Skywalker tangled up with a mysterious man—one who had the ability somehow to hide himself from detection in the Force by Force-sensitives—who was believed to be the son of Xanatos. Further research revealed him to be Granta Omega of Nierport VII, a collector of Sith artifacts, who was extremely wealthy for no apparent reason. After a podracing escapade, further information was uncovered regarding Omega, who was trying to take over the marketing of bacta through a titanite mining venture. Kenobi and Skywalker further discovered that the man was trying to impress a Sith Lord, and was planning to kill Skywalker. Master and apprentice were able to escape and, in the process, stop Omega's mining of titanite."}, {"tag": "h4", "text": "The School of Fear"}, {"tag": "p", "text": "Not long after, Kenobi and his Padawan, along with Siri Tachi and her apprentice, Ferus Olin, were given another mission to investigate the disappearance of a Senator's, Berm Tarturi, son, Gillam Tarturi. In order to infiltrate a band of renegade students at an Elite Leadership School on Andara, Skywalker proposed that he and Ferus Olin would penetrate the school by posing to be Senators' sons. Kenobi and Tachi's part of the mission involved posing as parents who were enrolling their children in the school."}, {"tag": "p", "text": "Skywalker, having infiltrated the renegade squad of students, had agreed to participate in a mission that would logically start a war. Soon after Anakin hold told Ferus about this and he was astonished that he had not contacted Kenobi before making a decision. He agreed to meet Ferus later that day to contact Kenobi. When Olin was captured, Skywalker decided not to tell Kenobi, instead hoping that he would find him if he continued with the mission. When Kenobi learned of his Padawan's actions, he and the High Council were furious. Soon after they escaped, Kenobi told his apprentice that it was not easy being a Master and said: \"If you do that every time we go on a mission we won't last.\""}, {"tag": "h4", "text": "Yaddle's sacrifice"}, {"tag": "p", "text": "Soon after, Kenobi, Skywalker, and Masters Yoda and Yaddle were sent on a negotiation mission to Mawan to settle a devastating civil war between three crime gangs. These gangs, led by Decca the Hutt, Feena Shaan, and a man called Striker (who was actually Granta Omega in disguise), caused the rest of the population to take refuge underground. Unbeknownst to them, the chaotic planet was a trap set by Omega. He released a fatal chemical weapon that killed Yaddle when she absorbed it through the Force, saving the city of Naatan in the process. The weapon was intended by its vengeful maker to kill Kenobi and his apprentice, but it failed thanks to Yaddle's sacrifice. Together Kenobi and Skywalker brought peace to Mawan, but Skywalker felt responsible for the death of the High Council member."}, {"tag": "p", "text": "Skywalker's guilt about Yaddle's death caused friction between him and Kenobi, who felt that he was less than capable of teaching the mischievous boy properly. When sent on a rescue to the Uziel system to a planet called Vanqor, the two were forced to try and reconcile their differences, first fighting their way out of a nest of gundarks, then, under the influence of a drug called the Zone of Self-Containment, Skywalker was taken prisoner by the scientist Jenna Zan Arbor. Siri Tachi, Ferus Olin, Garen Muln, and Clee Rhara, who were sent on a mission but received the distress signal while en route, picked up Kenobi together with Skywalker on Vanqor. Then all Jedi went to Typha-Dor to warn them against incoming Vanqor invasion. After successfully thwarting the invasion, they all went back to Vanqor after Jenna Zan Arbor and realized she was gone."}, {"tag": "h4", "text": "Trailing Jenna Arbor and Roy Teda"}, {"tag": "p", "text": "Zan Arbor escaped, however, and did not resurface again until Skywalker was sixteen. From information given to them by Tyro Caladian, they found out that she'd appeared on Romin, a focus of corruption and villainy and a shelter for criminals. In order to infiltrate the planet, he, his apprentice, Siri Tachi, and Ferus Olin disguised themselves as the Slams looking for refuge on the planet. They found that Zan Arbor had allied herself with Roy Teda, the ruler of Romin, and Granta Omega, who also was at qualms with the Jedi. Soon after this discovery, civil war erupted. The underworld was trying to overthrow Teda. In the midst of it, Teda and Zan Arbor attempted to flee offworld, unintentionally contacting the Jedi, thinking they were really criminals. However, Zan Arbor recognized Skywalker from their previous encounter, and Teda ordered his men to seize the Jedi. Before they could do so, Master Mace Windu and a team of Jedi arrived and arrested Teda and Zan Arbor. Since they were trying to get to Omega, and they knew the two would lead them to him, they set the two captives free."}, {"tag": "p", "text": "Only a few weeks later, Kenobi and his apprentice trailed Teda and Zan arbor to Falleen, where they had managed to set up the Blackwater Systems facility to mass-produce her drug, the Zone of Self-Containment. When they were found, Zan Arbor was forced to destroy the facility and Roy Teda fled."}, {"tag": "p", "text": "Not long after, Senator Sano Sauro, who was a friend of Granta Omega, and Bog Divinian, started to make anti-Jedi accusations in order to convince the Galactic Senate to lessen or completely dissolve its support of the Order. The vote was about whether the Jedi should be involved in the Senate's activities. It was all a part of Sauro and Omega's plan to leak the Zone of Self-Containment into the Senate's vents and assassinate Chancellor Palpatine. Skywalker and Olin, who were learning to forget their rivalry and understand each other, managed to prevent the assassination attempt on the Supreme Chancellor."}, {"tag": "p", "text": "Omega's plan was uncovered, but not in time to save twenty-one Senators and several other Senate employees from being killed by seeker droids programmed by Teda. Unbeknownst to him, since Zan Arbor and Omega had no more use for him, a seeker droid killed him, as well. Kenobi, Tachi, and Skywalker set off to find Omega, leaving Olin to protect the Senators and Palpatine."}, {"tag": "p", "text": "Tracking Omega and Jenna Zan Arbor to Korriban, four Jedi pairs—Kenobi and Skywalker, Tachi and Olin, Ry-Gaul and Tru Veld, and Soara Antana and Darra Thel-Tanis—traveled there to confront and stop them. The apprentices were split up from the Masters to better accomplish the mission. The investigation of Dreshdae led them to the Valley of the Dark Lords. During the confrontation with Omega, Kenobi had no choice but kill him, as he felt Omega was too dangerous to be kept alive."}, {"tag": "h4", "text": "Keeping the peace"}, {"tag": "p", "text": "Sometime later, Master and apprentice were sent on a diplomatic mission to a planet wishing to join the Galactic Republic. They soon found out, however, that the planet's indigenous population considered thievery an important social asset. During their stay, Skywalker's lightsaber was stolen. He searched for it, ashamed to tell Kenobi that he lost it, and soon had to admit defeat. Asking Kenobi for help, he found that the Jedi Knight knew the lightsaber had been stolen, and, using a trick of the Force, \"acquired\" it from the thief. Kenobi had merely been waiting for Skywalker to admit that he'd lost it."}, {"tag": "p", "text": "Kenobi and his apprentice were then assigned to the task of protecting Senator Simon Greyshade from assassination. Greyshade had recently filled the station of senator of the Commonality that his assassinated cousin had left. Greyshade's cousin, Jheramahd Greyshade, was thrown off the roof of 500 Republica in an attempt to stall the passage of the Financial Reform Act, which the Senator supported. The Financial Reform Act was a bill that addressed and was meant to reduce the amount of corruption that was causing the Senate, and, through them, the Republic, to disintegrate. Kenobi and Skywalker managed to save Greyshade from certain death."}, {"tag": "p", "text": "Because it was found that the assassination and assassination attempt was because of the Financial Reform Act, it never got a vote. Some say that this was the cause of a good portion of the seceding planets that would soon make the Confederacy of Independent Systems, and could have prevented the Clone Wars had it been passed.[source?]"}, {"tag": "h4", "text": "Mission to Ansion"}, {"tag": "p", "text": "In 22 BBY Kenobi and Skywalker, along with Luminara Unduli and her apprentice, Barriss Offee, were sent to Ansion to settle a border dispute that could have caused the extremely strategic planet to secede to the Confederacy. If Ansion fell, so would countless other worlds. The Jedi negotiated a settlement with city dwellers to remain in the Republic, provided they also convinced the nomadic Alwari to allow expansion into the grasslands. Little did they know that Presidente Shu Mai of the Commerce Guild was pulling the strings to cause Ansion to secede. Arriving early, Kenobi and Skywalker were just in time to rescue Unduli and Offee from a mob of killers. Thanks again to Presidente Mai and her minion Soergg the Hutt, the Jedi were in constant danger from attack by hired killers, including a successful kidnapping of Offee by two Ansionians, Kyakhta and Bulgan. Offee healed the two killers of injuries though, and they became guides for the Jedi to find the nomadic clans, particularly the Borokii overclan."}, {"tag": "p", "text": "Traveling on suubatars, the Jedi braved hazards such as flying chawix, kyren hordes, capture by the Yiwa clan and shanhs. On one occasion, the Jedi were required to entertain their hosts, each in their own way. Kenobi chose to use a story, weaving a masterful tale that thoroughly impressed the Ansionians. The Jedi eventually made contact with the Borokii overclan, who, after requiring the Jedi to retrieve a tuft of rare albino surepp wool, agreed to the Jedi's settlement—provided they helped wage war against their rivals, the Januul clan. Kenobi shocked his companions when he agreed, but he had a plan. When the battle lines were drawn, the Jedi marched out into the middle and refused to fight either side, calling on both clans to negotiate a settlement. Kenobi, Unduli, Skywalker, and Offee were subsequently attacked by both sides, but they deflected the assaults, and amazingly parried only the weapons, defeating both armies with no loss of life."}, {"tag": "p", "text": "In the wake of the following peace between the tribes, the Jedi journeyed back to the capital of Cuipernam to inform the Unity Council controlling the planet's fate of their success. While they were attacked again by thugs, the two clans sent an honor guard to help the Jedi, and Ansion remained in the Republic thanks to the efforts of Kenobi and his companions. Because of her status as President, Shu Mai was not discovered to be a part of the matter."}, {"tag": "h3", "text": "Beginning of the Clone Wars"}, {"tag": "p", "text": "Ten years after the Invasion of Naboo, shortly after returning from the border dispute on Ansion, Obi-Wan and Skywalker were tasked with protecting Padmé Amidala after an attempt on her life. Through a ruse organized by Skywalker, the assassin, a Clawdite named Zam Wesell, was soon uncovered and Kenobi pursued her through the streets of Coruscant, finally cornering her inside the Outlander Club. Unfortunately for the Jedi and for Wesell, the Clawdite soon became a victim herself, falling to the poisoned dart of a mysterious hunter garbed in Mandalorian armor. The only clue to his identity was the very dart that killed Wesell—a weapon of Kaminoan design."}, {"tag": "p", "text": "Kenobi contacted his old friend Dexter Jettster, who informed him of Kamino, a planet which was strangely absent from the Jedi Archives. Arriving on Kamino, he was informed that a huge unauthorized clone army was being bred for the Republic, supposedly on the orders of the deceased Jedi Master Sifo-Dyas. Kenobi was introduced to the clones' template, a bounty hunter named Jango Fett. Kenobi contacted the High Council and was told to apprehend the bounty hunter for questioning. Kenobi did as ordered and attempted to apprehend the bounty hunter, leading to a fierce fight between Kenobi and Fett, in which Fett's son Boba fired on Kenobi from Fett's ship. Despite Kenobi's efforts, Fett escaped to Geonosis with his son. Kenobi followed them by attaching a homing beacon onto the hull or their ship."}, {"tag": "p", "text": "Fett noticed Kenobi in pursuit and attempted to finish off the Jedi once and for all by leading him through Geonosis' rings. Kenobi's Jedi starfighter was damaged and he was forced to hide on the back of an asteroid as Fett descended onto Geonosis. After landing on the planet, Kenobi uncovered a conspiracy of star systems that wanted to secede from the Republic, led by Count Dooku. Kenobi was arrested by Geonosian troops shortly after sending a message to Skywalker and the High Council informing them of the latest development. The Geonosians placed Kenobi in a containment field to immobilize him and disrupt his access to the Force."}, {"tag": "p", "text": "Dooku attempted to persuade Kenobi to join the Confederacy of Independent Systems, invoking Kenobi's memory of Qui-Gon Jinn (Dooku's former Padawan), and telling him that a Sith Lord was now in control of the Galactic Senate. Dooku invited Kenobi to join with him to eliminate the Sith menace once and for all. Much to Dooku's disappointment, Kenobi simply responded that Jinn would never have joined Dooku, and that if the Sith did control the Senate that the Jedi would have sensed it. Dooku left, musing that it would be difficult to secure Kenobi's release."}, {"tag": "h4", "text": "Battle of Geonosis (22 BBY)"}, {"tag": "p", "text": "Having received his message, Skywalker and Senator Amidala traveled to Geonosis in an attempt to rescue Kenobi before the other Jedi could make the journey from Coruscant, but they too were captured, and all three were sentenced to death by the Geonosians in the Petranaki arena, where three savage beasts (a nexu, a reek and an acklay) would be their executioners. In the arena, Kenobi was able to break free of his chains and eventually ripped a static pike away from an orray-mounted Geonosian wielder. He used this weapon to fend off the vicious acklay, and eventually threw it at the beast, striking it in the chest. However, to Obi-Wan's surprise, the creature used its jaws to rip out the pike that was protruding from its own chest and snapped it in half, thus forcing Obi-Wan to make a hasty retreat. Kenobi, Skywalker, and Amidala eventually managed to fight off the wild beasts sent to kill them and turn the field to their advantage. Dooku then sent droidekas to finish them off."}, {"tag": "p", "text": "It was the timely arrival of Master Mace Windu and a strike team of 200 Jedi that prevented their deaths. However, Dooku revealed that he had actually been expecting the rescue all along, and unveiled a devastating army of Separatist droids (including B1-Series battle droids, B2 super battle droids and droidekas). The Jedi fought bravely despite being greatly outnumbered by droids, and suffered many casualties. Master Yoda arrived just in time with a massive clone army from Kamino to save the remaining Jedi. This was the beginning of the Battle of Geonosis, and the Clone Wars."}, {"tag": "p", "text": "Kenobi, Skywalker, and Amidala all jumped onto a Republic gunship and proceeded to join the main battle. The Jedi then spotted Count Dooku fleeing from the battle, flanked by two Nantex-class starfighters. Kenobi ordered the gunship's pilot to chase him. When Amidala was knocked out of the gunship by a laser blast from one of the starfighters, Kenobi was forced to restrain his Padawan from going back after the senator."}, {"tag": "p", "text": "The two Jedi finally caught up to the Sith Lord and engaged him in a duel. Skywalker, ignoring Kenobi's instruction that they should take him together, rushed in quickly and was incapacitated by Dooku's Force lightning. Kenobi was then left alone to face the masterful Sith Lord and, for a time, was able to deflect with his lightsaber Dooku's masterful attacks, which included the use of Force lightning. Indeed, never had Kenobi met such power in battle before; never had he come up against something that had completely overpowered him. Kenobi was ultimately brought down when the Sith slashed his leg and shoulder. Skywalker, however, had recovered by this point and, at the last moment, was able to block what would have been Dooku's death blow to Kenobi."}, {"tag": "p", "text": "While Skywalker and Dooku briefly parried words, Kenobi summoned his own dropped lightsaber. Tossing the weapon to Skywalker, Kenobi could only watch as his apprentice engaged the Sith Lord. Initially, Skywalker was able to catch Dooku off guard, but since Jar'Kai was neither his preferred nor strongest form, Dooku was quickly able to sever one of the sabers. Forced to switch back to his preferred style of Form V, Skywalker and Dooku engaged in a brutal display of swordplay as Kenobi looked on. Despite Skywalker's efforts, Dooku's experience and economy of movement triumphed over youth and brute force, and Kenobi watched as the Sith severed Skywalker's arm. At this critical juncture, Yoda arrived just in time to prevent Dooku from killing an incapacitated Kenobi and Skywalker. Engaging Dooku in a vicious battle, Yoda gained the upper hand and was on the verge of victory, but Dooku caused a massive column to fall over Kenobi and Skywalker, giving himself time to escape while Yoda devoted his full power to holding up the column, saving his fellow Jedi."}, {"tag": "h4", "text": "The Halls of Healing"}, {"tag": "p", "text": "Returning to Coruscant, Kenobi was sent to the Halls of Healing and taken under the care of Chief Healer Vokara Che. After he was fully recovered, Master Yoda sent him to Senator Amidala's apartment with a stern directive that she end her romantic relationship with the Chosen One. After receiving her word of agreement, Kenobi returned to the Temple to prepare for his new assignment."}, {"tag": "h3", "text": "Clone Wars (22 BBY–19 BBY)"}, {"tag": "p", "text": "Kenobi became a General in the Grand Army of the Republic during the Clone Wars as he lead the Republic to many famous victories, beginning with the countering of the Dark Reaper Project alongside Skywalker and Mace Windu on planets such as Thule, Rhen Var, Jabiim, and Raxus Prime. In these battles, Kenobi usually participated from the cockpit of his fighter tank, but also led from a LAAT/i while covering the evacuation of Rhen Var and scouted from a speeder bike on Raxus Prime before a battle there. While Skywalker was ultimately successful in countering the threat, Kenobi was disturbed at Skywalker's cockiness over his victory. This was followed soon after by his brilliant leadership at the First Battle of Kamino in which he led the Republic to victory. As his reputation increased Kenobi earned the moniker \"the Negotiator\" for his brilliant diplomatic solutions as an alternative to fighting. Another testimonial to Kenobi 's importance in the Clone Wars was that his likeness was used, along with that of his apprentice, in a hologram deployed on Republic shooting ranges to train clone sharpshooters in distinguishing between friendly and hostile targets. Kenobi would come to be a part of what many Jedi referred to as the Old Guard, Jedi considered likely to be put on the High Council."}, {"tag": "h4", "text": "The swamp gas of Ohma-D'un"}, {"tag": "h5", "text": "Battle of Ohma-D'un"}, {"tag": "p", "text": "Kenobi was eventually dispatched with Skywalker, ARC Trooper Alpha-17 and another Jedi named Glaive and his Padawan Zule Xiss to investigate the new chemical weapon known as 'swamp gas' used on Ohma-D'un. Kenobi and Glaive would often be at odds with each other during the mission. During the mission the group was attacked by Asajj Ventress and the dreaded bounty hunter Durge. The ensuing skirmish saw Kenobi rescue Glaive from Durge but nonetheless Glaive was beheaded by Ventress who also cut off Xiss' arm. Kenobi and Xiss nevertheless managed to resist against Ventress, even while being poisoned by the gas, until the timely arrival of Skywalker and Alpha-17. Kenobi and Skywalker eventually drove off the two assassins saving Zule Xiss, but were unable to keep them from escaping or retrieve the antidote from them."}, {"tag": "h5", "text": "Mission to Queyta"}, {"tag": "p", "text": "After the incident on Ohma-D'un Kenobi, accompanied by four nomadic Jedi Masters, Nico Diath, Jon Antilles, Knol Ven'nari and Master Fay, were dispatched to recover the antidote to the swamp gas used by the Confederacy on Ohma-D'un. Kenobi often felt he was out of his league with these four legendary Masters, but Fay assured him that his knowledge of the toxin to the mission would be invaluable."}, {"tag": "p", "text": "Once they arrived on Queyta where the antidote was believed to be the group was ambushed by Durge and Asajj Ventress. Ven'nari was the first to fall when Durge fired upon the native worker's causing their pressure suits to explode. Ven'nari's power kept the explosion from harming the group but the strain was too much. Antilles went for Ventress but fell when Durge destroyed the bridge he was standing on, but Antilles survived. Diath was killed when Ventress collapsed the ceiling on him and had molten lava rain down onto him. Antilles was finally killed while grappling with Durge when the mercenary thrust him into a lava pit, but not before the Gen'Dai's regenerative arms were melted off. Fay and Kenobi survived long enough to confront Ventress, who was in control of the antidote and trying to escape with it to Separatist-friendly space. Using the Force, Master Fay hurled shards of glass and metal at Ventress, catching the Dark Jedi in the throat with a large piece of debris. Believing Ventress to be dead, Kenobi and Fay set off to return to Coruscant. Ventress was far from dead, however, and rose up to spear Master Fay in the back with a lightsaber."}, {"tag": "p", "text": "Mortally wounded, Fay survived long enough to ensure Kenobi escaped from Queyta with the antidote, then died in his arms. Unfortunately the 'swamp gas' would be modified to become a deadly chemical weapon called Trihexalophine1138 that would later decimate the forest of the planet Honoghr."}, {"tag": "h4", "text": "Battle of Muunilinst and the Introduction of Grievous"}, {"tag": "p", "text": "It was Kenobi who fought courageously against battle droids and crushed the forces of San Hill and the Confederacy in the Battle of Muunilinst—an early victory that would do much to build the warrior's reputation. His forces on Muunilinst included the Muunilinst 10 and a Lancer Battalion, the latter which Kenobi led into battle on 105-K lancer bikes. During the battle, Kenobi also managed to defeat Durge in single combat twice: first after leading his squadron of speeder bikes into battle and then in the very command center of the Separatist leaders."}, {"tag": "p", "text": "Soon after the Battle of Muunilinst was over Kenobi was contacted by Jedi Master Daakman Barrek who called for his assistance in the disastrous Battle of Hypori. Kenobi sent the Muunilinst 10 led by Captain Fordo to rescue the remaining Jedi task force from the newly revealed General Grievous. In the end, they were only able to rescue three of the six Jedi. Ki-Adi-Mundi, Shaak Ti, and Aayla Secura survived, but Tarr Seirr and Sha'a Gi were killed by Grievous. K'Kruhk was assumed dead. However, he had simply entered a state of hibernation to recuperate from his otherwise fatal wounds."}, {"tag": "h4", "text": "Battle of Skye"}, {"tag": "p", "text": "In 21 BBY, Kenobi temporarily took Halagad Ventor as a Padawan in addition to Skywalker, following the demise of Ventor's former master. They traveled to the planet of Skye, where they fought against Zeta Magnus, a genetic terrorist. They foiled the terrorist's plot that threatened the planet with total destruction. Following the battle, Skywalker discovered the 13 year old S'kytri Kharys, who proved to be strong in the Force. He wished to take her back with them for training, but Kenobi and Ventor believed she was too old to start on the path of a Jedi and refused to take her. However, Skywalker promised Kharys that he would return one day to train her."}, {"tag": "h4", "text": "The Bio-Droid Threat"}, {"tag": "p", "text": "Kenobi was later partnered with fellow Jedi Kit Fisto on his mission to Ord Cestus to end the production of JK-13 security droids on the planet, in addition to preventing the planet from falling to the Confederacy. Traveling with the barrister Doolb Snoil while Fisto worked in the desert with four ARCs, Kenobi made contact with both the Five Ruling Families of Ord Cestus and the Desert Wind irregulars, trained and led by Fisto and the clones. While Kenobi and Snoil tried to find a peaceful resolution to the problem, Fisto and the ARCs were preparing the Desert Wind troops for a guerrilla war, if necessary. In addition to his delicate negotiations with the ruling council, Kenobi helped preserve the position of G'Mai Duris and worked to pierce the veil of intrigue surrounding the government's workings. Deciding that the time had come for more drastic measures, Kenobi and Fisto staged an attack on members of the Five Ruling Families, with Fisto pretending to be a Dark Acolyte from Count Dooku and Kenobi repelling him. While the ruse was successful, their theatrics were secretly revealed to the Five Ruling Families by Asajj Ventress via an emissary. Expelled from the planet, Kenobi and Snoil left, but Kenobi jettisoned in an escape pod to rendezvous with Fisto, though Snoil later rejoined them after the ship was attacked and he took flight in an escape pod also. While working with the clones, Kenobi and Fisto began to understand them more, and even taught them elements of the Jedi Flow exercise."}, {"tag": "p", "text": "Conducting a hit-and-run campaign against Cestian manufacturing and infrastructure facilities, Kenobi tried to prevent loss of life. However, after an ambush on his troops in which many Desert Wind fighters and Snoil were killed, and with increasing pressure from the Supreme Chancellor to resolve the conflict or bombard Ord Cestus, Kenobi and Fisto planned a mission to knock out Cestian manufacturing. During the mission, Fisto was almost killed by Asajj Ventress but was saved by Kenobi, who defeated the Dark Acolyte. Kenobi also constructed a rare lightwhip which was used by Fisto during the mission. Upon returning from defeating Ventress, Kenobi received a message from one of the ARCs—Jangotat—reporting that he had called in the orbital bombardment, which would have targeted the population centers due to Ventress's sabotage, onto his location, which was also the hideaway for the Five Ruling Families. With them dead, and with the Separatist plan revealed to be a fraud by both Jangotat and Ventress, Ord Cestus was able to negotiate a settlement."}, {"tag": "h4", "text": "Battle of Jabiim and Aftermath"}, {"tag": "p", "text": "Kenobi also led troops during the infamous Battle of Jabiim. The Republic suffered heavy casualties and weren't prepared for the atrocious conditions on the planet. The Republic forces made great gains in the first weeks of the fighting until the commander, General Norcuna, was killed. Soon after, Kenobi himself was believed dead after being caught inside an exploding walker. In reality, Kenobi and Alpha-17 had been captured by Asajj Ventress and taken to her fortress on Rattatak. There Kenobi was tortured using a Sith torture mask that obscured his connection to the Force in an attempt to break the Jedi and show his uselessness to Count Dooku. Kenobi's ingenuity, however, eventually led to the pair's escape."}, {"tag": "p", "text": "Throughout their captivity, Kenobi had used what little Force power he had to bend the pipes in the wall of his and Alpha's cell until they eventually burst. In the confusion, they liberated many of the prisoners before running into Ventress."}, {"tag": "p", "text": "After a brief lightsaber fight in which Kenobi made use of Ky Narec's lightsaber, he and Alpha escaped the planet in a stolen Fanblade fighter. Flying to Riflor, they were briefly forced to hold off an army of bounty hunters hired by Ventress before being rescued by Anakin Skywalker and Ki-Adi-Mundi. Mundi had been assigned as Skywalker's master after Kenobi's presumed death. After the skirmish, Skywalker was given back over to Kenobi, with Master Mundi relieved to no longer have to train such a headstrong student. Kenobi never forgot his captor, the deadly Asajj Ventress."}, {"tag": "h4", "text": "The tale of Kenobi and the Merson Pirates"}, {"tag": "p", "text": "According to a story told by Leia Organa in 0 ABY (which she had been told by her father, who in turn had heard it from the droid 68-RKO who was an eye witness), Kenobi helped Captain Quasar defend his pleasure cruiser bound for Alderaan in 21 BBY. When approached by a group of hostile Merson pirates in the Merson asteroid belt, Captain Quasar asked Kenobi, who was a passenger aboard the cruiser, for his assistance. Kenobi quickly discovered that someone aboard the pleasure cruiser had installed a signaling beacon aboard the ship that informed the pirates of its whereabouts."}, {"tag": "p", "text": "Using the Force as his guide, Kenobi moved the ship into the asteroid field, in order to outmaneuver the Merson Pirates. The strategy was a success, and Kenobi and the ship's crew managed to destroy the pirate vessels, using the pleasure cruiser's two standard energy cannons."}, {"tag": "p", "text": "In the meantime, the beacon had been located in the ship's lounge, and an angry mob of passengers suspected the shady character, Augustus Tryll—a criminal that Kenobi had conversed with prior to the Merson attack. Tryll had been impressed by the Jedi's handling of an aggressive drunk and had offered him some Deltron spice. The mob suspected Tryll because it turned out that his spice fermentation device radiated microwaves that were detected by the pirates. As the mob approached Tryll, Kenobi objected to their accusations, arguing that they had no evidence that Tryll was aware that the device worked as a sort of beacon for the pirates. This caused the mob to accuse Kenobi of conspiring with Tryll and the Merson Pirates. Faced with an angry mob, threatening to kill him and Tryll, Kenobi drew his lightsaber. Tryll tried in vain to goad Kenobi into cutting down the angry mob, but Kenobi refused and used it to destroy the fermentation device instead. This caused the mob to back down and leave Tryll and the Jedi alone."}, {"tag": "p", "text": "As Tryll fell to his knees and offered his thanks, Kenobi declined his gratitude and retired to his cabin, arguing that he wanted to finish the journey in peace."}, {"tag": "h4", "text": "Loss of an old friend"}, {"tag": "p", "text": "Later Kenobi was reunited with Siri Tachi when they teamed up with Skywalker and Padmé Amidala to acquire a special codebreaker on the planet Genian. The Separatists were also after the important codebreaking mechanism invented by Talesan Fry, whom Tachi and Kenobi had met twenty years earlier in a mission to protect him from bounty hunters. Fry was now the founder of a very wealthy business on Genian, a world that remained neutral during the war. Reuniting with Fry brought back old memories to Kenobi and Tachi of the feelings that they once had for each other. After convincing Fry to give the device to the Republic, they were attacked by someone else from the past, the bounty hunter Magus, who had killed Fry's parents."}, {"tag": "p", "text": "Fry accompanied the Jedi and Senator Amidala to Azure, where the Republic was fighting off more Separatists. While Kenobi, Skywalker, and Fry fought off the attack led by Magus (who was working for the Corporate Alliance), Tachi and Amidala took a starfighter of their own to go after Magus himself. Upon reaching Magus' starfighter, Tachi made a desperate leap and landed on it. She was able to break into his ship and fight him off, which resulted in the ship's crash landing, but in the process she was shot by Magus."}, {"tag": "p", "text": "Kenobi found Tachi and tried to save her, but she stopped him knowing she was dying. Tachi handed him the blue warming crystal she had from that earlier mission together, telling Kenobi that she would always be with him, and then passed on. Her death devastated Kenobi, bringing him close to the dark side as he held his lightsaber blade to Magus' throat. However, he regained control, sparing the merciless bounty hunter. Skywalker thought this indicated that Kenobi did not truly love Tachi, because he couldn't imagine not avenging Amidala's death, had she died. Kenobi later realized he had learned to love with an open heart, a lesson Jinn had long tried to teach him. He could live with losing Tachi."}, {"tag": "h4", "text": "Promotions"}, {"tag": "p", "text": "As a High General, Kenobi took command of the Open Circle Fleet and the Third Systems Army, which included Clone Commander Cody's 7th Sky Corps. Towards the end of the Clone Wars, Kenobi, Skywalker and Commander Cody took part in a number of successful and high profile missions, including the Battle of Cato Neimoidia.\nKenobi was also known to wear parts of Phase I clone trooper armor along with a Jetpack and a Clone Trooper Helmet similar to Commander Cody's.[source?]"}, {"tag": "p", "text": "During this time of war, Obi-Wan's reputation and talent on the battlefield and his legendary diplomacy skills had him promoted to Jedi Master, and he was granted a seat on the Jedi High Council to replace Depa Billaba,[source?] who had fallen to the dark side and was in a coma after a mission to Haruun Kal. From this exalted position, Kenobi helped to develop the tactics of the Grand Army of the Republic and became one of the leading members of the Jedi High Council. Jedi Master Kenobi was able to witness the growing strain between the Chancellor's office and the Jedi firsthand. His position on the council also allowed him to advocate the promotion of his Padawan Anakin Skywalker to Jedi Knight. After a tense debate with the rest of the council, Kenobi finally convinced them to grant Skywalker his knighthood, but with this Kenobi took the responsibility of covering for Skywalker's unorthodox actions that were frowned upon by the rest of the council."}, {"tag": "p", "text": "During the initial stages of the Battle of Rendili, Kenobi discovered the renegade Quinlan Vos aboard the exploration vessel Titavian IV. Vos had betrayed Dooku's trust, and the Count had sent Asajj Ventress and Tol Skorr to eliminate him. Ventress and Kenobi battled yet again, though this time the Dark Acolyte felt assured of victory, riding a ferocious rancor in pursuit of her nemesis. Kenobi and Vos escaped, but Ventress followed Kenobi back to Coruscant. Kenobi helped convince the Council of Reconciliation to re-accept Vos back into the Jedi Order. Kenobi also questioned the council on why it had to keep the Prism a secret from Skywalker and the Senate."}, {"tag": "h4", "text": "Battle of Christophsis"}, {"tag": "p", "text": "In 22 BBY, after the Jedi Council received a plea from the planet of Christophsis for help against the invading Separatists and to aid Senator Organa's relief effort, Kenobi and Skywalker were dispatched to save the planet, along with Commander Cody and Captain Rex. After Anakin defeated the separatist blockade commanded by Admiral Trench with a prototype cloaked ship, Obi-wan and Anakin took command of the situation. However, when evidence was revealed that a traitor was giving inside information to the Separatists, Kenobi and Skywalker left to secretly scout behind enemy lines, leaving Cody and Rex to find the traitor. Upon arriving at the Separatist base, they met and dueled Asajj Ventress. After she escaped, the two Jedi followed her and discovered an entire army amassing to march on the city. Returning to their base, they discovered that Sergeant Slick was the traitor, and he was taken to lockup. Unfortunately, he had managed to sabotage most of their weapons except the heavy cannons, and forced to defend the planet against an entire Separatist army, the Jedi requested reinforcements."}, {"tag": "p", "text": "Kenobi and his former apprentice led Torrent Company and Ghost Squadron with Rex and Cody. They managed to defeat the first wave of droids, but their opponents soon returned. Skywalker wiped out the tri-droids with Rex, and the cannons took charge of the rest of the droid troops. The Separatist army retreated under General Whorm Loathsom's order. Following this, a shuttle arrived, carrying what was assumed to be Kenobi's next apprentice. The Padawan introduced herself as Ahsoka Tano, but she revealed that she was assigned to be Skywalker's Padawan, not Kenobi's, much to Skywalker's dismay. Skywalker later commented that he thought that it had been Kenobi's idea for him to train an apprentice."}, {"tag": "p", "text": "Soon after this, Rex and Tano discovered that the Separatists had activated a deflector shield and the battle was reignited. While Skywalker and Tano set off to deactivate the shield, the clone troopers were outnumbered easily, and their cannons could not get through the shield, even at full power. Within minutes there were only a limited amount of clones left, and Kenobi was surrounded by Whorm and his battle droids. He surrendered, but was able to stall Whorm and eventually ring him by the neck."}, {"tag": "p", "text": "Skywalker and Tano were able to deactivate the shield and the battle became a Republic victory. Afterward, Master Yoda informed the Jedi that the Republic had been contacted by Jabba the Hutt, as he was willing to ally himself with them, should they locate and rescue his kidnapped son, Rotta."}, {"tag": "h4", "text": "Helping a Hutt"}, {"tag": "p", "text": "Yoda ordered Kenobi to Tatooine, so as to negotiate a treaty with Jabba for safe travel for Republic ships through Hutt Space, while Skywalker and Tano sought out Jabba's son. Kenobi reluctantly began negotiations with the crime lord and was present when Jabba learned that the bounty hunters he had sent to search for his son had returned without their bodies, only their heads; Jabba then promised hyperspace routes in his territories for the Republic in exchange for his retrieved son and the slime that took him.\nKenobi reported this information to Skywalker, who was on his way to Teth where Jabba's son had been located, before informing Yoda and Chancellor Palpatine. It was suspected that the kidnapping was a Separatist plot, which aimed to turn Jabba against the Republic."}, {"tag": "h4", "text": "Battle of Teth"}, {"tag": "p", "text": "Kenobi arrived on Teth immediately, and found Rex and the army heavily outnumbered by battle droids. With his reinforcements, the battle was then even again while he went to search for Skywalker, R2-D2 and Tano. Unfortunately, he ran into Asajj Ventress whom he battled through the B'omarr Monastery. Eventually slicing through her saberstaff, throwing away one half, and offered her the chance to surrender. Ventress gave up the fight and called for a Vulture droid to rescue her."}, {"tag": "p", "text": "Returning to his troops, he later learned that Skywalker had taken a B-Wing-like ship called the Twilight and had flown to Tatooine where he and Tano had battled Dooku and IG-100 MagnaGuards, before giving Jabba's son back to him. After fending off the droids, he and Yoda took gunships to pick up the Jedi team, and Jabba confirmed passage through his routes."}, {"tag": "h4", "text": "Battle of Gwori"}, {"tag": "p", "text": "After Master Windu briefed a gathering of Jedi and highlighted a key issue in the war; that the Separatists vastly outnumbered the Republic in terms of ships, Master Kenobi suggested a surgical strike on the InterGalactic Banking Clan warship building factories. It soon became clear that the Gwori System was the prime target, yet due to the Republic forces being too splintered, it would be impossible to launch an all-out attack."}, {"tag": "p", "text": "Further complicating a possible strike team's sabotage attempt was a gigantic bio-scan-irradiator-incinerator that would kill any organics on ships that pass through it. Skywalker then concocted a plan that would successfully bypass this complication; the strike team would freeze themselves in carbonite, which would resist the radiation produced by the incinerator."}, {"tag": "p", "text": "Skywalker ordered Tano to not participate in the mission, however, after he, Kenobi and the strike team were frozen, she manipulated Admiral Yularen into believing that Skywalker had decided to reverse his order and allow Tano to be frozen and accompany the team on world. As R2-D2 piloted the frozen team's shuttle on world, a Separatist commander noticed an irregularity and orders the ship fired upon. Artoo had the carbonite slabs strewn from the ship, and moments before it was destroyed, escaped it himself."}, {"tag": "p", "text": "Artoo freed Tano from her carbonite slab, who in turn freed the rest of the strike team; her Master being less than impressed to discover that she had disobeyed his commands. While the team located the Separatist shipyards, they were unable to contact Republic bombers, due to the Separatists having jammed all communications. However, Tano noticed a communications tower nearby and after fighting their way in, the team commed Masters Plo Koon and Saesee Tiin and it was organized that the bombers would strike at dawn."}, {"tag": "p", "text": "Unfortunately, the overseer of the shipyards, Juhm, noticed the unauthorized transmission and attempted to destroy the comm tower, though the team escaped and split up. B2 super battle droids equipped with jetpacks trailed Tano and her faction of the strike team into a cave, where she was forced to kill a large reptilian carnivore. Kenobi and Skywalker soon learned that the Separatists were using organic slaves to build warships; quite surprising due to it being far less productive than the use of droids. Later, the remnants of the strike team, Tano, Skywalker, Kenobi and Rex, are captured, though they proceeded to escape."}, {"tag": "p", "text": "In addition, the Separatist slaves revolted and joined the Jedi strike team. However, upon the arrival of the Republic forces, and the destruction of half of the shipyards, the escape craft of the Jedi and slaves was nearly destroyed by friendly fire; though after coming the forces, the situation was resolved. The freed Separatist slaves were made Republic citizens and then began the work of building warships for the Republic."}, {"tag": "h4", "text": "The Malevolence"}, {"tag": "p", "text": "Later, when information arose regarding a mysterious Separatist superweapon, the Malevolence, that systematically destroyed several Republic fleets, the Council sent one of its members, Master Plo Koon, to track it down. However, upon Master Koon coming Skywalker with information regarding the unknown weapon, his communications systems became jammed and he was unable to be contacted. As such, Skywalker reported these events to Chancellor Palpatine, and Masters Yoda, Windu and Kenobi."}, {"tag": "p", "text": "The Council, in conjunction with the Supreme Chancellor, decided against mounting a task force to ascertain the situation that Master Koon had found himself in, feeling that his forces were most likely entirely wiped out much like previous fleets. However, Skywalker's Padawan, Tano, having a special connection to Master Koon, refused to believe that he had been killed, and as such, she and Skywalker disregarded the Council's orders and journeyed to the Abregado system."}, {"tag": "p", "text": "Master Kenobi soon discovered his former Padawan's actions and was forced to report them to the Council. However, Skywalker's recklessness soon proved fortunate, after he successfully rescued Plo Koon and a handful of troops. In addition, Master Koon was able to reveal the nature of the Separatist superweapon; it was a giant ship, known as the Malevolence, with ion cannons capable of disabling entire fleets."}, {"tag": "p", "text": "With this information, Skywalker formulated a daring plan to engage and destroy the Malevolence's ion cannons using Y-wing bombers, to prevent the destruction of an Outer Rim medical center. It would then fall to Kenobi to enter the system and destroy the massive warship using the combined fire power of his fleet. Kenobi helped organize the evacuation of the medical center, dispatching medical frigates for the evacuation. While Skywalker's task force proved successful in destroying the ion cannons, the Malevolence was so large that it could withstand the fire of Kenobi's fleet."}, {"tag": "p", "text": "Indeed, the situation became confounded when an old friend, Senator Padmé Amidala of Naboo, appeared in system during the battle, having been given false information regarding a diplomatic mission to the system. Kenobi and Skywalker were horrified as they watched Amidala become pulled aboard the Malevolence by a tractor beam. The pair quickly mounted a mission to rescue her, which ultimately proved successful, though Kenobi was forced to engage in a brief duel with General Grievous while attempting to sabotage the warship's hyperdrive. In addition, Skywalker and Amidala rigged the warship's navacomputer to pilot it into the nearby Dead Moon of Antar, destroying the deadly superweapon, before which the group escaped."}, {"tag": "p", "text": "Some weeks later, while searching for General Grievous and his fleet, Kenobi and Skywalker came to the aid of Commander Cody and Captain Rex, after the pair of clones engaged Separatist forces on the Rishi moon. The Jedi's fleet arrived just in time to force Grievous' ships out of the system, foiling the cyborg's plot to launch a surprise attack on Kamino."}, {"tag": "h4", "text": "Mission to Zigoola"}, {"tag": "p", "text": "After Kenobi received valuable information from his friend Dexter Jettster on an attack on the planet Bothawui by General Grievous, he was injured in a sneak attack by the Separatists on Coruscant. His injuries were not fatal, so he lived, albeit barely."}, {"tag": "p", "text": "As Skywalker took his Padawan Tano and a good sized portion of the Grand Army of the Republic to counter Grievous's forces at Bothawui, Senator Bail Organa got a message from a shadowy ally of his hinting that there was a source of Sith power on a planet in Wild Space. Kenobi, who had recovered in the meantime, agreed to go with the Senator in order to find what information laid on it. The Jedi and the Senator rendezvoused with Organa's contact Alinta in Wild Space but the three of them were attacked by space pirates. Alinta was killed, but she managed to give the coordinates to Zigoola where a Sith Temple was located and the pair continued their journey. When they arrived on the planet, they crash-landed several miles away from the temple and were forced to walk there in order to explore it. During the trek, however, Kenobi suffered from illusions and hysteria due to the planet's dark side nature. Through pounding rain and lightning storms, Kenobi and Organa clambered through to the temple. Although they reached it in more or less one piece, Kenobi collapsed just outside and Organa was forced to go in on his own, despite having absolutely no clue what any of the artifacts did. Realizing this fact, the Senator crawled outside and forced Kenobi to accompany him, tortuously finding a crystal that enhanced long-distance Force communication."}, {"tag": "p", "text": "Kenobi was finally able to contact Grand Master Yoda on Coruscant who asked Padmé Amidala to rescue Kenobi and Organa on the Sith world. She hurried to Zigoola with some clones troopers including Captain Korbel and found the injured duo stranded near the temple ruins. Due to Kenobi's tampering with the artifacts and triggering security measures in the Sith temple, the building collapsed in on itself, destroying its dark power and all of the dark side weapons within. Although both Kenobi and Organa were gravely injured and exhausted from the mission, they were able to complete their objective and form a lasting friendship."}, {"tag": "h4", "text": "Battle of Bothawui and aftermath"}, {"tag": "p", "text": "Since Grievous had been ambushing fleets, Kenobi advised Skywalker to retreat, but Skywalker planned on ambushing the cyborg. To his surprise, Skywalker managed to destroy the Confederate flotilla, but Skywalker's fighter was damaged while he chased the general, and although he was rescued, R2-D2 went missing. Worse, Skywalker hadn't wipe the astromech's memory, which included dangerous tactical files belonging to the Republic. Skywalker risked everything to retrieve the droid, but also managed to take out Skytop Station, where Artoo was being held. After Skywalker risked his troopers and even his Padawan Tano to save Artoo, an exasperated Kenobi grudgingly accepted what had happened without severely rebuking Skywalker."}, {"tag": "h4", "text": "Dealing with pirates"}, {"tag": "p", "text": "Kenobi and Skywalker later spearheaded an attempt to capture the head of the Confederacy, Count Dooku himself. While the Jedi's attempts to capture the Count aboard his flagship proved unsuccessful, Tano successfully commanded a Republic force against it, forcing Dooku to crash land on Vanqor during his escape from the doomed vessel. While Kenobi and Skywalker searched for the Count in a cave nearby to the wreckage of his personal craft, Dooku used the Force to cause a roof collapse, trapping the Jedi and securing his escape."}, {"tag": "p", "text": "After making contact with a nearby group of pirates Dooku secured himself a route offworld; only to find himself captured by the wily gang of pirates who hoped to trade him for a hefty ransom from the Republic. After being rescued by Tano, Kenobi and Skywalker were sent to the pirates' stronghold to ensure they had indeed captured Dooku, and after he received confirmation from him, Chancellor Palpatine had Representative Binks and Senator Kharrus lead a diplomatic mission to trade a ransom for the Count."}, {"tag": "p", "text": "Hondo Ohnaka, the leader of the pirates, however, proved treacherous and captured Skywalker and Kenobi, hoping to gain an additional ransom for them. Fortunately, Representative Binks was able to rescue them, though the mission did come at the cost of Senator Kharrus' life, and Dooku managed to yet again evade the clutches of the Republic."}, {"tag": "h4", "text": "Battle of Orto Plutonia"}, {"tag": "p", "text": "A short time later, Kenobi and Skywalker were called to Orto Plutonia to ascertain why the Republic had lost contact with a clone outpost there. The Jedi and clones were accompanied by Chairman Chi Cho of Pantora and Senator Riyo Chuchi, who had been recalled to the Pantoran system by Cho so that he could use her Senatorial authority to command the Jedi. Orto Plutonia was technically under the control of the Pantoran Assembly, and as such, Cho felt that he should be directly involved in the Jedi's investigation."}, {"tag": "p", "text": "With Rex, Kenobi found the Republic base to be devoid of life, all clones stationed there having been killed. Similarly, they found a nearby Separatist base to be likewise affected and found clues of a third party being involved in the demise of both forces. Skywalker and Kenobi then followed the clues to a nearby canyon, where they spotted light reflections. Shortly afterwards they met primitive, but sentient, inhabitants : the Talz. Despite the language barrier, Kenobi and Skywalker managed to make it clear that their mission was one of peace, and they arranged a diplomatic meeting between the Pantorans and the Talz."}, {"tag": "p", "text": "When they delivered the news, Chairman Chi Cho arrogantly refused to believe that the Talz could be considered a sentient race and called them trespassers and animals, stating that Pantora hadn't evidence of life on the planet in all their history. Riyo Chuchi tried to mediate, feeling that it was for the Senate to decide the matter, but to no avail."}, {"tag": "p", "text": "Upon arrival at the meeting place, the Talz leader, Thi-Sen, politely asked that the Republic and Pantora leave them in peace and withdraw their presence from Orto Plutonia. However, Chi Cho still refused to accept the Talz as sentients and arrogantly declared Plutonia as sovereign Pantoran property, deliberately provoking a war. In order to gain sanctity for his actions, he declared this to be an internal affair of Pantora so as to remove the Jedi from the equation. Skywalker and Kenobi appealed to Riyo Chuchi, to find a way to resolve the political matter diplomatically. In response she contacted the Speaker of the Pantoran Assembly, who granted her the authority to negotiate peace and declared the Chairman out of order."}, {"tag": "p", "text": "However, this solution came too late: while returning to their base, Chi Cho and his escort were ambushed by a Talz war party, forcing them to fight back, and Chairman Cho was felled by a spear in his back. Skywalker, Kenobi and Senator Chuchi arrived in time to save Cho, Rex and the remaining escort from being overrun, but even with his last breath, Cho insisted on killing the Talz for the 'good' of his people as his final command. Chuchi politely declined, informing him of the Assembly's decision. Dumbfounded that he was overruled and that his people preferred peace to war, Chi Cho expired. Senator Chuchi pursued a peaceful approach and managed to cease hostilities, conceding sovereignty of Plutonia to the Talz. As she and the Jedi boarded a gunship offworld, Kenobi congratulated the Senator in creating peace and urged her to make it last and act as an example to others."}, {"tag": "h4", "text": "The Blue Shadow Virus"}, {"tag": "h5", "text": "Stopping Dr. Vindi"}, {"tag": "p", "text": "The Jedi Council later sent Kenobi, Skywalker and Tano, to Naboo in response to intelligence that suggested that a Separatist bio-lab had been set up on the planet. Senator Amidala and Representative Jar Jar Binks sent off to search for the lab, but contact was lost, and Skywalker sent Tano along with the Gungan native Peppi Bow to locate them. Meanwhile, Skywalker and Kenobi learned from new information discovered by Captain Gregar Typho that Separatist scientist Nuvo Vindi was using the lab to perfect the deadly Blue Shadow Virus so as to release it into key Republic star systems."}, {"tag": "p", "text": "When Tano and Bow searched the swamp where Amidala and Binks disappeared, they accidentally found a spy cam. While hiding from the spy cam, Tano contacted Skywalker and Kenobi who told her to detonate a bomb in the south bunker to create a distraction. After this, Kenobi entered the lab and aided Tano, before beginning a search for Vindi's virus bomba. Though Vindi attempted to release the virus, the Jedi were able to apprehend him and rescue Amidala and Binks."}, {"tag": "h5", "text": "Finding a cure"}, {"tag": "p", "text": "When Kenobi and Skywalker prepared to transfer Vindi for trial, Tano, Amidala and several clones discovered that a vial of the virus was missing. Though they were able to sound the alarm, it was not in time, and Vindi's still-at-large servant droid LEP-86C8 was able to detonate a bomb, releasing the virus throughout the lab. The Jedi were then forced to make their way to the planet of Iego to search for the antidote to the virus, so as to save Amidala and Tano."}, {"tag": "p", "text": "While on Iego, the Jedi were able to free the people there from an insidious Separatist security system designed to prevent the inhabitants from leaving the planet, with the help of young Jaybo Hood. Fortunately, they were also able to locate the antidote and returned in time to save Tano, Amidala and most of the clones."}, {"tag": "h4", "text": "Battle of Ryloth"}, {"tag": "h5", "text": "Destroying the blockade"}, {"tag": "p", "text": "After Techno Union leader Wat Tambor seized control of Ryloth and its inhabitants, the Jedi Council devised a plan for Kenobi and Mace Windu to lead a ground assault to invade and liberate the planet. Skywalker and Tano were dispatched to destroy the Separatist blockade surrounding the planet and clear the way for the invasion forces, but their first attack failed horribly. During a report, Skywalker reported that they had lost a cruiser and an entire squadron of fighters, and that Tano was shaken from loosing so many men. Kenobi acknowledged Tano's need for support and time to get over the ordeal, but told Skywalker that he would need her to succeed. Even with only half his forces remaining, Skywalker was given only one planetary rotation to destroy the blockade. He piloted the Defender into the lead control ship, forcing its commander, Captain Mar Tuuk, to flee, leaving only droids in charge of the blockade. Fortunately, with the support of a recovered Admiral Yularen, Tano was able to lead a successful attack on the blockade. Later, after the invasion forces arrived out of hyperspace, Tano told Kenobi that the way was clear, but Kenobi didn't even want to know how Skywalker had devised a plan to end up in an escape pod instead of commanding his fleet."}, {"tag": "h5", "text": "Landing on the planet"}, {"tag": "p", "text": "As Kenobi and Ghost Company left the Acclamator assault ships aboard the Crumb Bomber and other gunships to land on Nabat, proton cannons from below attacked the Acclamator ships. Mace Windu tasked Kenobi with destroying the cannons and allowing the transports to land. To prevent the destruction of the Twileks' home, the clone forces were forced to only utilize blasters and EMP grenades. After taking out the droids in a bunker on the outskirts of the village, Kenobi and the clones entered the city and set up a temporary camp. Kenobi sent Commander Cody, Wooley, Waxer and Boil to scout ahead. Cody and Wooley came back and reported that the droids had taken the Twi'leks hostage. During a following conference with Windu, Kenobi stated that the prisoners would make the mission harder but not impossible. Unfortunately, a recon droid sent by tactical droid commander TX-20 spied on them. After Cody realized that Waxer and Boil still had not returned, Cody sent a transmission out before the Republic forces moved on. Upon entering the village, Kenobi and the clones encountered starved gutkurrs, who began to attack them. Kenobi lured the creatures into an alley with the Force, and Cody and the clones shot at a bridge above its entrance, trapping the creatures."}, {"tag": "p", "text": "Waxer and Boil then emerged out of an underground tunnel with the young Twi'lek girl Numa, and Kenobi understood why they had been \"sidetracked.\" Kenobi conversed to Numa in Twi'leki and learned that she could lead them to the prisoners. He tasked Cody with creating a diversion for the droids, while he went with Waxer, Boil and Numa to the underground passages. As Cody and his men distracted the droids, Kenobi managed to free the Twi'lek hostages, and they fled into the tunnels. Kenobi then took control of a proton cannon, and with the help of Waxer and Boil, he managed to take out the other cannons. However, a shot from TX-20's tank blasted the three aside. Numa first ran over to the clones and then to Kenobi, but as TX-20 targeted the two, the former Twi'lek hostages overran the tank and destroyed the droid, and Kenobi attempted to shield Numa's eyes from the violence. After the Acclamator transports landed, Mace Windu commended Kenobi on his victory, but stated that the next mission was much harder: to retake the capital city of Lessu and free the planet. As the Republic forces departed for the capital, Numa called \"Nerra!\" out to Waxer and Boil one last time, and Kenobi translated for them: \"Nerra\" meant \"brother\"."}, {"tag": "h5", "text": "Capturing the southern hemisphere"}, {"tag": "p", "text": "After Windu and his forces had headed for Lessu, Kenobi went with his forces to capture the southern hemisphere of Ryloth. Kenobi was able to successfully take the Jixuan desert. After Windu enlisted the help of the Twi'lek freedom fighters, Windu was able to take Lessu and capture Wat Tambor, freeing the planet from Separatist rule."}, {"tag": "h4", "text": "Battle of Felucia"}, {"tag": "p", "text": "Later, Master Kenobi was sent along with Skywalker and Tano to Felucia which had been invaded by the separatists. While Obi-Wan, Skywalker, Commander Cody and Captain Rex stayed with the main body of troops to defend their clearing-based emplacement of AT-TE walkers, Tano led two AT-TE walkers and a Juggernaut tank on a patrol of the dense jungle."}, {"tag": "p", "text": "Kenobi realized that they were losing and ordered the retreat as soon as Master Plo Koon arrived to help them. Kenobi contacted Tano who refused to retreat. Even when Skywalker and Kenobi arrived to pick her up she at first refused to pull back before Skywalker convinced her that they were not going to win this battle. Kenobi later reported to the rest of the Jedi Council about Tano's actions during the battle."}, {"tag": "h4", "text": "Stolen holocron"}, {"tag": "p", "text": "Kenobi was present in the Jedi Temple when Cad Bane and Cato Parasitti infiltrated the Temple in order to steal a Jedi holocron. Kenobi teamed up with Skywalker to find Bane while Tano succeeded in capturing Parasitti. Despite the Jedi's attempts to find him, Bane managed to smuggle the holocron out of the Temple."}, {"tag": "p", "text": "Later Kenobi went to Rodia in an attempt to capture Bane and protect an infant Rodian named Wee Dunn. His attempt failed and Bane escaped."}, {"tag": "p", "text": "After Bane was captured by Skywalker and Tano on Naboo, Kenobi and Mace Windu interrogated the bounty hunter in an attempt to get him to tell them where he'd taken the kidnapped children. When Bane refused to answer Kenobi, Skywalker and Windu all used a mind trick on him at the same time. Bane resisted but the Jedi's combined efforts forced him to agree to take them to the children and the holocron."}, {"tag": "p", "text": "Kenobi and Windu went with the bounty hunter to his hideout in the Rogue Antar system. Bane took them to the holocron but then Windu accidentally triggered the intruder alert system, causing lasers to fire on the two Jedi Masters. While Kenobi and Windu were occupied, Bane fled. However Kenobi and Windu still managed to retrieve the holocron and escape the base just before it was destroyed. Meanwhile Skywalker and Tano had rescued the kidnapped children from Mustafar."}, {"tag": "h4", "text": "Skirmish on Felucia"}, {"tag": "p", "text": "In 21 BBY the medical station orbiting over the fungi-world of Felucia disappearance prompted the Jedi Council to send Kenobi, Anakin Skywalker and Ahsoka Tano to investigate the issue. They were immediately attacked and forced to crash-land by vulture droids from a Separatist deployment station. The Jedi were able to eject before the complete destruction of there shuttle and set out to find help. They discovered a nysillin farm village but it was apparently deserted though Kenobi noted that the tools were scattered everywhere and the crops ready to be harvested. Soon after Skywalker and Tano encountered farmers hiding in their house's cellar, the master-apprentice duo was immediately surrounded by four bounty hunters: the gang leader Sugi, Embo, Rumi Paramita and Seripas. The tension rose when Obi-Wan entered the house but Casiss, the village elder, was able to persuade everybody to stand down."}, {"tag": "p", "text": "Casiss explained that the villagers hired the bounty hunters to protect themselves against pirates who regularly raided their settlement and demanded a tribute. The elder then asked the Jedi for help in repelling the pirates but Kenobi refused, saying that it would only attract General Grievous attention which would be far worse. Soon after the pirates came to the village to make their tribute demand, Obi-Wan and Anakin were surprised to meet the Weequay Hondo Ohnaka, whom they previously came across on Florrum. Ohnaka then acted friendly with the Jedi and tried to buy off the bounty hunters, who refused, stating they don't break deals. Kenobi offered to buy transportation to a Republic outpost from the pirate, but Hondo refused, not being interested in Republic credits. The pirates then departed after threatening the villagers. The Jedi took on the preparations for the coming battle, training the farmers for combat and organizing the defenses of the village. After the elimination of a pirate scout by Embo, Ohnaka decided to attack. The bounty hunters and Jedi managed to hold back the onslaught until the chief pirate used his tank. Skywalker jumped onto the bluff from where Ohnaka was firing and managed to defeat the pirate captain, forcing the gang to retreat. The battle being over, Sugi offered Kenobi and the others a ride to a Republic outpost."}, {"tag": "h4", "text": "The Zillo Beast"}, {"tag": "p", "text": "As fuel was vital during the Clone Wars, worlds offering such resources were obvious targets for the opponents. That is why the Confederacy of Independent Systems attacked the world Malastare and its vital Dug fuel resources. The Galactic Republic stopped the invading Separatist Droid Army with a new superweapon called the electro-proton bomb. The battle was a Republic victory but the superweapon unleashed a Zillo Beast on Malastare. Eventually, the monster was knocked out and taken to Coruscant for study on the order of Supreme Chancellor Palpatine. Mace Windu was skeptical and feared that the creature were too dangerous to be brought to the planet, he shared his concerns with Kenobi who agreed with him and suggested to let Anakin Skywalker convince the Chancellor to send back the beast. Kenobi talked to Padmé Amidala and together they convinced Anakin to reason with Palpatine. Unfortunately the Chancellor had ordered the scientist studying the Zillo Beast to kill it in order to extract its scales and make armors out of it. However when a small amount of poison was applied, the creature became agitated and aggressive, broke free of its bonds, smashed its way out of the laboratory and started rampaging across Coruscant, unhindered by all efforts to stop it. The Zillo Beast targeted specifically Palpatine, capturing its shuttle mid-flight and breaking it in two parts with its huge hands. Kenobi and Windu managed to save the Chancellor using Force-grip on the front half of the ship. Then Gunships arrived and killed the creature by firing poison gas bombs into into its mouth. As Kenobi and the others look on in regret, the Zillo Beast, confused, in pain and dying, finally succumbs to the poison and falls from the roof of the Senate to its death below."}, {"tag": "h4", "text": "The honorable enemy"}, {"tag": "p", "text": "Around 21 BBY, the people of the neutral planet Valahari began trade relations with the Confederacy of Independent Systems. The Valahari were prolific starship builders, and the Confederate leader, Count Dooku, was an old friend of Harko Vane, the Viscount of the planet's royal House of Vane. Hoping to persuade the Valahari to stop selling fighter engines to the Separatists, Kenobi along with Anakin Skywalker went to Valahari on a diplomatic mission. However, the Valahari refused to comply, and the Republic established a blockade of the world."}, {"tag": "p", "text": "Refusing to acknowledge the blockade, Viscount Harko Vane tried to break through with a convoy of freighters. Kenobi did not want to resort to using the force, but Vane's freighter exploded in what looked like a Republic attack. In reality, his ship had been sabotaged by Dooku's Dark Acolyte Asajj Ventress. Vane's death prompted his escort to open fire on the Republic forces, and after a brief fight, the battle ended. The Republic then retained the blockade therefore the Valahari, believing the Republic responsible for their leader's death, joined the Confederacy. Days later the Valahari forces led by Harko's son, Tofen, destroyed the Republic blockade of the planet. Tofen then proved highly successful and relentless in his pursuit of the Republican forces. He was even able to defeat Skywalker, a renowned Republican ace, in single combat during the Battle of the Hexus system though his forces were forced to retreat after the timely arrival of reinforcement."}, {"tag": "p", "text": "Meanwhile on Valahari, Kenobi discovered that Ventress was responsible for the sabotage of Harko Vane's ship. He informed Vane's widow, Elodore Vane, of that fact. When his mother confronted Tofen with concrete evidence that Dooku was responsible for his father's death, the young pilot refused to give up his determination to fight the Republic. Some time later the Republic found Vane's base in the Veil Nebula thanks to a homing beacon attached to his Tempest Zero starfighter by Skywalker during the previous battle. A large task force was sent to destroy the base, with Jedi Master Plo Koon and Saesee Tiin as well as Jedi Knight Anakin Skywalker. The Republic fleet managed to destroy the station and Tofen Vane was killed in a dogfight against Skywalker."}, {"tag": "h4", "text": "Second Battle of Geonosis"}, {"tag": "h5", "text": "Recapturing the planet"}, {"tag": "p", "text": "In 21 BBY, after receiving a report from Clone Captain Rex, the Jedi Council decided to send Generals Obi-Wan Kenobi, Ki-Adi-Mundi, and Luminara Unduli to lead the Grand Army's attack on the droid foundries of Geonosis, as they were considered to be a significant threat to the Republic's safety. After the Republic fleet had arrived in Geonosian space and entered the planet's orbit, Skywalker, Tano, and Yularen—who had successfully repelled a diversionary attack from Grievous on Dorin—rendezvoused with the fleet. The Jedi then conferred with Supreme Chancellor Palpatinecand Jedi Generals Unduli, Yoda, and Mace Windu. Based on intelligence they had received, Mundi and Kenobi concluded that Poggle the Lesser was holed up within his primary droid factory, which was being protected by a massive ray shield."}, {"tag": "p", "text": "With their primary target being the shield generator at the Ray Shield Fortress, the Jedi mounted a three-pronged attack on the Geonosian defenses. Kenobi and Clone Commander Cody commenced the central push while Mundi and Skywalker lead the northern and southern assaults, respectively. The troops finally rendezvoused at Point Rain, a site that was just a short distance away from the Ray Shield Fortress; there, they established a staging area before destroying the generator and disabling the factories' ray shield, making way for the rest of the clone trooper forces to safely land. All of the Geonosians at the Ray Shield Fortress were forced to surrender, and the injured Kenobi and Mundi returned to the fleet with the rest of the wounded for treatment. Left in charge of the Republic forces, Skywalker combined his team with Mundi's remaining troops and set out for Poggle the Lesser's primary droid foundry. Finally, Luminara Unduli's Padawan Barriss Offee and Skywalker's Ahsoka Tano managed to destroy the foundry reactor thus causing the factory to collapse."}, {"tag": "h5", "text": "The Geonosian Queen"}, {"tag": "p", "text": "With several key droid factories destroyed the Jedi began a cleanup of Geonosis and also mounted an intense campaign to find Poggle the Lesser, who had escaped his primary foundry's destruction and was evading the Republic's efforts to locate and apprehend him. Unduli spearheaded the search and followed Poggle to the abandoned Progate Temple, where she was captured by the Archduke and taken to the lair of Geonosian Queen Karina the Great in the catacombs below. Tracking Unduli's last known location, Kenobi and Skywalker set out with a clone platoon to rescue her. Battling hordes of \"undead\" Geonosian warriors who were being reanimated by the Queen's brain worm parasites, the Jedi and their troops finally located Unduli in Karina's throne room. Skywalker was set to mount a full-on attack on the Geonosians, but Kenobi, who was after the reasons behind the Queen's abduction of Unduli, devised a different plan. While commander Cody stealthily moved the men into place, Kenobi and Skywalker marched straight into the throne room and through the lines of Geonosians zombies to speak with Karina. Kenobi told her that her rule was at an end, but the shrieking Queen refused to recognize the Jedi's authority."}, {"tag": "p", "text": "Karina then revealed her intentions: instead of seeking the Jedi's elimination, she wished to possess them using her brain worms, as the Jedi would make valuable additions to her army of warriors. As Poggle placed one of the parasites on Unduli so that the worms' power could be demonstrated, Kenobi signaled Cody and the clones to attack. The troopers blasted their headlamps on the Geonosians and temporarily blinded them, allowing Kenobi and Skywalker to retrieve their lightsabers from the drones with the Force. While Kenobi himself took Unduli's brain worm as a sample for study, Skywalker freed Unduli and returned her lightsaber to her. The Jedi then confronted Poggle, and Skywalker shackled the Geonosian Archduke in a pair of binders and brought him along with them before knocking Kenobi's worm sample out of his hand and crushing it beneath his boot. The Jedi and their troops destroyed much of the Queen's lair during their escape, burying Karina the Great and her warriors beneath the temple, and the Republic's recapture of Geonosis was secured."}, {"tag": "h4", "text": "Battle of Saleucami"}, {"tag": "p", "text": "Soon after, General Grievous captured Jedi Master and Council member Eeth Koth, he then sent a transmission to the remainder of the Council on Coruscant in which he brutally tortured Koth to express his hatred for the Jedi Order. Unbeknownst to the cyborg General, Koth used discreet hand signals to inform the Council of his location. Using the information provided by Koth, Kenobi, Adi Gallia and Anakin Skywalker, organized an assault force to engage the Confederacy at Saleucami, rescue Koth, and capture General Grievous."}, {"tag": "p", "text": "Kenobi was the first of the Jedi to arrive at Saleucami and engaged Grievous's forces with a fleet of Star Destroyers and nimble Consular-class frigates under the command of Admiral Wullf Yularen. Early in the battle, Kenobi's light cruiser was caught in a tractor beam from Grievous's Separatist destroyer and was boarded by battle droid forces and the cyborg General himself. While Grievous was dueling Kenobi aboard the cruiser, Skywalker and Gallia entered the battle and infiltrated the General's destroyer to rescue Eeth Koth. Despite Grievous's preparations for such an occurrence, the two Jedi were successful in freeing the captive Master and getting him off the ship. Meanwhile, Grievous, understanding that Kenobi had the upper hand in their duel, retreated to his destroyer and led his battle droids onto a landing craft bound for Saleucami's surface. During the descent, the craft collided with debris from the battle, forcing Grievous to flee the doomed vessel in an escape pod."}, {"tag": "p", "text": "While Skywalker continued the battle in orbit, Kenobi led a force of clone troopers to the planet's surface to hunt down Grievous. The cyborg General evaded and fled from the Republic forces, hoping to reach an escape pod with a functioning transmitter in order to call for an evacuation transport. During the search for Grievous, Clone Captain CT-7567 was seriously injured, necessitating aid from local farmer Cut Lawquane, a clone who had deserted the Grand Army of the Republic. During the Captain's stay at Lawquane's farm, droid commandos that had previously escaped the doomed landing craft attacked the farm homestead and were repelled by CT-7567 and the former trooper. Meanwhile, Kenobi caught up with and engaged Grievous, who fled the battle once a Sheathipede-class shuttle arrived to ferry him away."}, {"tag": "h4", "text": "Battle of Kamino"}, {"tag": "p", "text": "After the destruction of the Rishi moon tracking station, Kenobi and Skywalker intercepted a coded message between Ventress and Grievous. Generals Kenobi and Skywalker, Commander Cody, Captain Rex and troopers of the 501st went to Kamino to aid in its defense. As Skywalker fought in the space above Kamino, Kenobi took a Kamino submarine and discovered Ventress's forces readying their assault crafts under water. Aqua droids attacked his submarine, but he escaped thanks to a passing aiwha. The Jedi General managed to get back and recalled Skywalker to the city as the Separatists commanders Grievous and Ventress attacked; while Kenobi faced off against Grievous, Skywalker engaged Ventress in combat. The two generals dueled until an assault craft destroyed the platform they were dueling on. Grievous thought he had defeated Kenobi, but an aiwha saved the Jedi again. Unfortunately, Grievous and Ventress were able to escape once again."}, {"tag": "h4", "text": "The Death Watch threat"}, {"tag": "h5", "text": "Terrorism on Mandalore"}, {"tag": "p", "text": "Later in the war, the Jedi Council sent Kenobi to investigate rumors stating that Mandalore was forming an army to help the Separatists. Arriving at Sundari on Mandalore he was reunited with the Duchess Satine, whom he and Master Qui-Gon Jinn protected many years ago during the Mandalorian Civil War. Kenobi showed Duchess Kryze, Prime Minister Almec and Senator Merrik of Kalevala the hologram of a Mandalorian warrior sabotaging a Republic cruiser. Almec and Satine assured the Jedi that Mandalore was not involved in this attack and only wanted to stay out of the devastating conflict. On a walk through Peace Park, Kryze told Kenobi of a rogue Mandalorian group of hooligans, known as Death Watch, which were opposed to her peaceful ways. She claimed she has worked to root out these criminals; at that moment a terrorist bomber blew up the memorial shrine where Satine and Obi-Wan were walking. As they rushed in to rescue the injured, Obi-Wan then had the guards round up everyone at the scene of the bombing. Then a man fled from from the scene and Kenobi pursued the bomber and cornered him with his lightsaber. After a brief firefight and struggle, the man jumped off a balcony, preferring suicide to interrogation by the Jedi. However, Satine and Obi-Wan managed to reach the dying man on the lower floor, where the Mandalorian whispered his last words to the Duchess in Concordian, the dialect of Mandalore's moon."}, {"tag": "p", "text": "Kenobi and Kryze then traveled to the moon, Concordia, to find more about the terrorists. There they met Governor Vizsla who had been trying to hunt down the members of Death Watch; the Jedi then went out to investigate the Concordian mines. Unfortunately, he was captured by Death Watch warriors and almost killed as they put him on a conveyor belt that led to a rock crushing machine. Luckily Kenobi managed to contact Kryze back at the local governmental complex and was saved by her. The two then escaped the mine but were confronted by the Death Watch warriors and their commander. The commander removed his helmet and revealed himself to be Pre Vizsla, which completely shocked the Duchess; Vizsla, using a Darksaber, dueled against Obi-Wan briefly but as the Jedi gained the upper hand, Vizsla ordered his men to fire missiles on him. However Kenobi and Kryze managed to escape and returned to Sundari. When Obi-Wan tried to convince her that Death Watch was being backed by the Separatists, she vehemently disagreed. She also restated her neutral stance in the war, even though Kenobi stated that it may not be possible to stay neutral, which slightly angered her. Satine, along with her Jedi escort, then left for Coruscant."}, {"tag": "h5", "text": "Protecting Duchess Satine"}, {"tag": "p", "text": "Kenobi, along with Anakin Skywalker, Captain Rex, Commander Cody and several clone troopers, protected Duchess Satine from Death Watch and the Separatists on board the Coronet as she traveled to Coruscant and the Galactic Senate. Obi-Wan and Anakin met up with Satine's entourage: Senators Kin Robb, Tal Merrik, Orn Free Taa and Onaconda Farr. There Kenobi and Kryze argued on the nature of the Clone Wars: while Satine wished to remain neutral and promote diplomacy despite potential Separatist involvement, Obi-Wan warned her that may not be possible. Kenobi later told Skywalker of his mission to Mandalore with Qui-Gon Jinn to protect the Duchess, he explained how they lived hand to mouth, not knowing what to expect the next day, which Anakin found romantic. Obi-wan expressed regrets for abandoning the Duchess at the end of the mission, but said that he lives by the Jedi Code, which forbids attachments. During the following dinner an assassin probe burst into the room and began to attack the guards. Obi-Wan quickly disabled the droid but it released smaller assassin droids. Satine then pulled out a small droid deactivator and blasted the tiny droids, destroying all but one of them. When Skywalker reported to Kenobi that the container from which the droid emerged was marked with a Senate stamp, they knew that one of the Senators was a traitor."}, {"tag": "p", "text": "Kenobi hatched a plan to expose who activated the assassin probes: he put the remaining droid under a lid and began to walk around the table. The droid jumped at the Duchess and the Senators in the room but stood still for its master Senator Tal Merrik. Merrik then drew a blaster and held up Satine as a hostage before going to the bridge of the Coronet and killing all of the crew. He then contacted Death Watch command, who sent three boarding ships loaded with super battle droids. Anakin took charge with Cody and Rex to repel the boarders, while Obi-Wan went to save his girlfriend. As Kenobi tried to rescue Kryze, Merrik countered him by threatening to blow up the ship. The Jedi Master followed the Senator as he made his way to the boarding ships. Just as Satine was about to be taken she confessed her love for Obi-Wan despite what was happening. The Jedi stated that he would have left the Jedi Order had she said so before. Merrik let his guard down at the statements of love which Satine used to her advantage and slammed her heel into his foot. Merrik warned this turn of events made no difference, as he could destroy the Coronet once he was away. Satine said she wouldn't allow that, but Merrik retorted that if she killed him, she would be a hypocrite and undermine her pacifist ideals. He then turned to Obi-Wan and said that if he killed him, he would be a cold-blooded killer in the eyes of the woman he loves. Merrik then was killed by a stab from the back by Skywalker who stated that he killed a bomber set to destroy the ship. The Coronet then landed on Coruscant and the Senators, along with the Duchess, met with Supreme Chancellor Palpatine. Satine approached Obi-Wan and casually flirted with him, remarking with skepticism on his beard, which she says hides too much of his handsome face."}, {"tag": "h5", "text": "Defending a friend's honor"}, {"tag": "p", "text": "After Duchess Kryze arrived on Coruscant, she defended the case of Mandalore neutrality against a Senate afraid of the Death Watch menace. Chancellor Palpatine himself deemed the Death Watch to be a military threat and that the Republic must intervene. Satine dismissed their fears and insisted to keep the affair internal to Mandalorian interests. Palpatine then surprised her with a holographic message of Deputy Prime Minister Jerec begging of Republic assistance. The Duchess did not believe such untruths from Jerec but she could not protest because he was killed in a terror bombing on Kalevala earlier that day. Palpatine found the hologram to be enough evidence to proceed on a mission to liberate Mandalore. The Duchess was appalled by the occupation, seeing it as the Republic trampling Mandalore's right to self-determination, and making the planet a military target. Satine stormed out of the Senate building onto the landing platforms outside. Obi-Wan was there to meet her but she was too angry to listen to the advice he had. She and her guards boarded an airspeeder and set off only to crash shortly after due to explosives rigged to the speeder by a Death Watch assassin, fortunately she managed to jump to safety before the crash. Kenobi met her again after a distressing meeting with Palpatine; he expressed his concern that Satine was an obvious target to the Death Watch. Not caring about her own safety, Satine found the attempt on her life as proof that she was right: someone was pushing Mandalore towards war. As the two walked they were met with Senator Padmé Amidala who had more bad news. She informed Satine that the Senate voted for the occupation of Mandalore because of her recent assassination attempt and that the invasion was set to begin the next day."}, {"tag": "p", "text": "Wanting to know the truth, the Duchess went to the Ministry of Intelligence to meet her contact, Davu Golec. After he told her the recording of Deputy Minister Jerec viewed by the Senate was a forgery, he gave her a disc containing the undoctored data. Unfortunately Davu was shot through the heart by a Death Watch assassin. Satine instinctively pulled out her weapon but that made her suspicious to arriving Republic authority. She began to run from the scene and was chased by police droids and two clone troopers. She soon lost her pursuers in an alleyway with a departing speeder and contacted Kenobi to meet her at Coruscant Park. The Jedi met her in the park and Kryze gave him the real recording of Jerec. Unfortunately, the Death Watch assassin was still on her tail; Kenobi fought him but he managed to escape. While the Duchess turned herself in, Kenobi gave Padmé the recording. She then rushed into the session and showed everyone the real message from Deputy Minister Jerec. With the true light shed, the occupation of Mandalore was abolished. The next morning in his office, Palpatine expressed his gratitude and apologies to Duchess Satine Kryze for uncovering the real truth. Satine then expressed her thanks towards Obi-Wan Kenobi for his undying friendship in these most uncertain times."}, {"tag": "h4", "text": "Tracking down a Hutt"}, {"tag": "p", "text": "After the Senate hostage crisis, Obi-Wan was assigned to track down Ziro the Hutt and Cad Bane with his old friend, Jedi Master Quinlan Vos. Though Obi-Wan believed that Jabba the Hutt wanted to get even with Ziro for what he almost did to his son, Vos' sources told him that Ziro had damaging evidence against the Hutt Ruling Council."}, {"tag": "p", "text": "The two of them then headed to the Hutt home world of Nal Hutta, where they informed Gardulla the Hutt and the rest of the council of Ziro's escape and of Bane's help in this act. Though the Hutt Council denied involvement in this, Vos was able to psychometrically scan a cup, telling him and Kenobi that Ziro had been there. When they got to the prison level, however, Ziro had already escaped due to help from his lover, Sy Snootles. Kenobi and Vos then tracked Ziro down in the swamp. Kenobi criticized Vos's tracking techniques, saying it would have been easier if they brought a droid. Along the way, Kenobi was attacked by a Dragonsnake, but was able to kill it. When the two saw that Bane and Todo 360 were following them, the Jedi stayed right behind them. When they got to the swamp shack, Vos cut his way through the door. When Vos and Kenobi confronted Ziro's Mother, Kenobi apologized to her about Vos's impulsive behavior. Ziro's mother told them that Bane was going after Ziro, who was en route to Teth."}, {"tag": "p", "text": "Kenobi and Vos then proceeded to Teth, where they found Ziro shot and dead at his Father's grave. The two Jedi were then confronted by Bane, who claimed that he did not kill Ziro. Though Bane tried to leave, Kenobi attempted to arrest Bane for taking the Senate hostage. Kenobi and Vos then chased Bane. When Bane knocked out vos, Bane picked up his lightsaber and fought Kenobi. When Kenobi and Vos ganged up on Bane, Bane used his flame throwers to throw them off the cliff. Bane then left the two Jedi hanging on a cliff."}, {"tag": "h4", "text": "A special meal"}, {"tag": "p", "text": "Sometime during the Clone Wars the Besalisk chef Dexter Jettster went on a dangerous mission to the planet Dractu to retrieve Dractuvian cave slugs. Back to his diner on the planet Coruscant, Jettster prepared one of the cave slugs for a meal, boiling and chopping up it. Jettster walked out of the kitchen towards his good friend Kenobi, saying he had made a special dinner for him today. Kenobi was surprised to see that Jettster made Dractuvian cave slug, and after taking a bite of the dish, pronounced with a smile that it was still as disgusting as he remembered. Jettster was confused, reminding Kenobi that he previously said that cave slug was the best thing he ate on Dractu. Kenobi only replied that Dractu has the worst food in the galaxy, meaning that Jettster went on a dangerous, foolhardy, adventure just to make a meal his friend hates."}, {"tag": "h4", "text": "Death Canyon"}, {"tag": "p", "text": "Once, chased by a squad of bounty hunters in Death Canyon, Kenobi and Skywalker used a VXL speeder patched up by the young Jedi Knight. There was only one way out of the canyon, a path that the hunters had closed off. Skywalker zoomed the speeder out of the garage and Kenobi hopped on, skeptical of his former Padawan's modifications but soon hanging on for his life as the VXL blasted off. Unfortunately, Skywalker informed him that they could not slow down even if they wanted to, and this proved troublesome when a harpoon was stuck into the speeder. Rather than stop it, the harpoon gun itself was pulled out of the ground, forcing Kenobi to jump onto the top of the speeder and dispatch the bounty hunter trailing behind it. The two Jedi next faced two rows of bounty hunters on each side of them, some with rocket launchers and some with blasters. As Kenobi deflected the bolts, Skywalker took both lightsabers and hooked them up to the power core, giving the speeder a moment of sonic speed and allowing it to jet to safety, the Republic headquarters where Grand Master Yoda awaited. The old Master remarked on how good the speeder looked, and Kenobi groaned as Skywalker quipped \"once a classic, always a classic\"."}, {"tag": "h4", "text": "Battle of Sullust"}, {"tag": "p", "text": "During this battle, Kenobi was chased by Asajj Ventress in her fanblade fighter. Skywalker managed to dispatch the Droid tri-fighter that the Dark Acolyte had sent for him and came to the aid of his former master. He then crippled Ventress's vessel, but not before she managed to shoot down the Jedi Master. The two opposing commanders crash-landed in the hangar of the Separatist command ship, Kenobi and Skywalker quickly engaged Ventress in lightsaber combat. Count Dooku, upon orders from his own master, interrupted the duel by ordering the destruction of the Separatist command ship to ensure his Acolyte's death. The two Jedi fled in their interceptors, presuming Ventress to be doomed but she escaped and Dooku retreated, thinking she was dead."}, {"tag": "h4", "text": "Hunt for Savage Opress"}, {"tag": "p", "text": "After the massacre on Devaron where Master Halsey and his Padawan Knox were killed, Kenobi, along with fellow Jedi Council members Plo Koon, Saesee Tiin, and Adi Gallia, examined the remains of the Jedi pair that Delta Squad had brought back to the Jedi Temple. The savageness with which the killings had been performed mystified them. Later Kenobi was shown footage of the massacre by Masters Yoda and Windu|Windu. At first he thought the assailant was Darth Maul, but Windu stated this one was of a species of Zabrak that came from Dathomir, the place where Maul was raised. They sent Kenobi and Skywalker to hunt down this killer before he could strike again. On Dathomir, they made their way to Maul's Home village, where they were ambushed by the Nightbrothers. Luckily Skywalker was able to take their leader hostage; the Zabrak said that a Nightsister took one of them to their village. Kenobi and Skywalker went there and questioned Mother Talzin about this captive. Although Talzin had initially tried to avoid giving them direct answer, she told them his name, Savage Opress, and whereabouts. The two Jedi then headed to Toydaria where they confronted Opress, but failed to stop him from killing King Katuunko. After Savage Opress had destroyed their ship, they borrowed the king's ship. In space above Toydaria, Skywalker and Kenobi caught up with their target on Dooku's Separatist flagship, however he managed to overpower them and escaped. Skywalker and Kenobi then retreated and left the ship."}, {"tag": "h4", "text": "Strange events on Mortis"}, {"tag": "p", "text": "When the Jedi Council received a 2,000 year old Jedi distress code, Kenobi along with Anakin Skywalker and his Padawan Ahsoka Tano were sent to the Chrelythiumn system, where they were supposed to meet up with Clone Captain Rex and an armed cruiser. Though they both made to the rendezvous point, neither Rex's nor the Jedi's ship could see each other. The Jedi's ship then lost contact with Rex, when a crystal-shaped structure pulled them toward itself. All three of them lost consciousness and found themselves on a strange world that was strong with the Force. There they were approached by a young woman, who asked Skywalker if he was the One, and told them that she would take them to Him. However, Kenobi, along with Tano were soon separated from Skywalker and Daughter by a rockslide. Since they couldn't find a way to follow them, Kenobi and Tano decided to head back to their ship, which they found missing. The Son then appeared in front of them, asking about the Chosen One. Kenobi and Tano drew their lightsabers, and asked if he was a Sith. The Son claimed to be himself, and not at the same time, before he transformed into a gargoyle and left. Just after that, Jedi Master and Padawan were forced to seek shelter in cave because of the lethal weather. As the two rested, Kenobi saw a vision (possibly the Force ghost) of his late master, Qui-Gon Jinn, who asked if he had trained Skywalker, as he had asked many years ago upon his death. Kenobi questioned him about how was he there, to which Jinn informed him that the planet was both a conduit and a magnet for Force, and there were three here who believed, like him, that Skywalker was the Chosen One. He also warned him that if Skywalker wasn't the Chosen One, this place could be dangerous for him. In the morning, Kenobi and Tano were kidnapped by The Daughter and The Son at the orders of their father to test whether Skywalker was The Chosen One or not. Skywalker proved himself to be, by taming both Children, but refused to stay and replace the Father. They then tried to leave Mortis."}, {"tag": "p", "text": "However, before their ship could exit the planet's atmosphere Son abducted Tano, assuming correctly that the Jedi would not leave her behind. After a lengthy pursuit, Skywalker lost track of Son, and almost crashed into a giant tower. After a not-too-elegant landing, Skywalker decided to go and rescue his Padawan despite Kenobi's concern about disturbing the balance of the Force in their own universe as well. Because he wanted to ask the Father's help against Son, Kenobi remained by the ship. Just when he realized he had no idea where to find the Father, his sanctuary appeared in front of the Jedi Master. Unfortunately, by the time he climbed up to the door, Son already had turned against his father and severely injured him with Force lightning. After Son left, Kenobi helped Daughter to take Father inside where he could rest. At Kenobi's request to help Skywalker stop Son, Daughter led him to a cave where the Altar of Mortis and the Dagger of Mortis were hidden. There Kenobi took the dagger, and then the two left to confront the Son. When they arrived at his tower, Son informed Kenobi that Skywalker had been \"a bit preoccupied\" to stop him. Kenobi left the throne room, joining Skywalker in his fight with \"Dark Ahsoka\", while Daughter and Son started their own combat: a duel way beyond the standards of both the Jedi and the Sith. However Father interrupted the battle but he had grown weak and couldn't fend off Son's Force Lightning. Kenobi, in hope of defeating Son, threw the dagger to Skywalker, but Tano was quicker: she took it and handed it over to Son, who then seemingly killed her with a touch on her forehead. Then he attempted to murder his father with the dagger; to his great dismay his sister took the blow, which caused him to flee in rage. Skywalker asked Father to help Ahsoka, but he answered without Light, there was no hope for her either. To this Skywalker replied, crying, that there is always hope. Hearing his pain, Daughter required the help of her father to give her remaining life-energy to Tano. Since he didn't want to deny the dying wish of his child, Father showed Skywalker how to transfer Daughter's life into his Padawan, who after a few frightening seconds came back to life while the glowing of Daughter's body faded away. After this, Father ordered the Jedi to leave immediately so Son would not be able to leave Mortis with their ship."}, {"tag": "p", "text": "However the ship was damaged quite badly when Skywalker crashlanded it. While Tano did the repairs, Skywalker left to talk with Father as he wasn't convinced that the old man could contain his son. After his discussion with Skywalker Father went to Kenobi to inform him that Skywalker had gone to confront the Son at a place where all that is dark is channeled; Kenobi then left to search for him. Unfortunately he found the young Jedi too late: the Son had already subdued him to the Dark Side of the Force by showing him a vision of his future. Skywalker -in order to stop Kenobi from interfering- threw his speeder into the lava and left on his own speeder to let the Son off the planet in his ship. Meanwhile, Kenobi contacted Tano telling her to disable the ship. Despite her complaints she obeyed and disabled the ship and left to pick up him. After Skywalker told the Son of this, the Son left to take the Dagger of Mortis from the grave of his deceased sister. The Father took this opportunity to show himself to Skywalker and wiped his memory of his future vision, bringing him back to the Light Side of the Force. After Tano returned, the four of them faced off against the Son. The Son quickly threw Skywalker aside and stunned Kenobi and Tano. When he turned to the Father, the Father pulled the dagger into his hands and impaled himself, revealing that by destroying his own powers, he would be taking away the Son's power as well. The Son went to tend to his father, allowing Skywalker the perfect chance to kill him. After impaling the Son from behind, he died, and after a few short moments, so did the Father, restoring the balance of the Force. Kenobi, and the others were then transported back to their miraculously fully functional ship at the coordinates Rex and the Jedi were supposed meet, only this time Rex's cruiser was visible."}, {"tag": "h4", "text": "Rescuing Master Piell"}, {"tag": "p", "text": "When Jedi Master Even Piell was captured by Separatist forces after he discovered the coordinates of a strategically important hyperspace lane, the Jedi Council organized a rescue mission to the dreadful prison where he was being held. It was decided that the team that would infiltrate the prison would include Anakin Skywalker, Obi-Wan Kenobi, Commander Cody, Captain Rex, and two ARC Troopers from the 501st, Fives and Echo. After the briefing, Master Plo, Kenobi, and Skywalker met up with Ahsoka Tano, who showed enthusiasm about the mission. However, her Master told her that he had decided to leave her behind on Coruscant, as he knew the prison would be fraught with danger and didn't want to put her life at such risk."}, {"tag": "p", "text": "The first thing that concerned Kenobi was getting past the droids' Life-form sensor. Fortunately, Skywalker came up with idea of being frozen in carbonite to avoid being detected by them. Anakin's part of the plan worked and they were able to get past them. When they were was thawed out, Kenobi was shocked to find out that Tano had come along, despite the fact Skywalker had given her direct orders to stay on Coruscant. When Skywalker was angered by his Padawan's disobedience, Kenobi cooled him down by pointing out Skywalker's humorous new teaching method of \"Do as I say, not do as I do.\" Later Tano's presence proved to be vital in the success of the infiltration, as the entrance point of the prison had been blocked and she was the only one in the group who could squeeze herself through the ventilation docks, and turn off the ray shields. Unfortunately, one of the troopers fell onto the one of the mines that were placed on the cliff side, alerting the Citadel's warden, Osi Sobeck, to their presence."}, {"tag": "p", "text": "Despite this setback, Obi-Wan and the rest of his team were successful in freeing Master Piell. Then Master Piell told Kenobi that the other half of the coordinates of the Nexus Route was with his captain, Wilhuff Tarkin, and Obi-Wan decided that they must rescue him as well. On their way to the officer's cell, they were attacked by a squad of commando droids. Then Sobeck activated magnets in the ceiling, and Obi-Wan's lightsaber, along with everyone else's weapon and Anakin (due to his cybernetic right hand), were stuck to the ceiling when the second squad of commando droids appeared. Kenobi and his team were successful in defeating them, greatly thanks to Skywalker's will power, as he was able to destroy the electromagnets despite being electrocuted. After they managed to rescue Master Piell's captain and the other officers, they split up: Skywalker and Tano escorted Tarkin and most of his officers to the escape spot, while Kenobi's and Piell's group created a diversion. Kenobi's and Piell's team were successful in creating a diversion, setting off a series of explosives in the prison, as Anakin escaped into one of the old tunnels."}, {"tag": "p", "text": "Kenobi and his team then went into the ventilation system, where they encountered a recon droid. Fortunately, Piell was able to destroy it, but then security doors in the shaft were closed, killing one of their troopers. When Obi-Wan noticed the shuttle seemingly abandoned, he smelled a trap and attempted to approach it via a detour route, but found that Sobeck has anticipated this tactic and prepared a welcoming party consisting of a squad of heavily armed crab droids and battle droids. His team was then brought before Sobeck as prisoners. In an attempt to get the information they had, Sobeck executed one of their clone troopers before ordering the security droids to have them interrogated. R2 learned of this, however, and his battle droid squad took them as prisoners back to the ship. Unfortunately for Kenobi, the droids learned of this deception and engaged his team at the prison airfield. Anakin's team joined up with them during the battle to try and get the ship, but despite their attempts, the ship was destroyed and both Kenobi's and Skywalker's team fell back together to caves near the Citadel. With their ship gone, Kenobi contacted the Jedi Temple, requesting a rescue operation."}, {"tag": "p", "text": "After Piell contacted the Jedi Temple and was given a rendezvous point, Kenobi's and Skywalker's team were attacked by commando droids, forcing their team to move on to the rendezvous point. As they moved on, Obi-Wan discussed with Anakin and Ahsoka about Tarkin's attitude to the Jedi's inability to stem the tide of war due to their strict code before they noticed the anoobas trailing them, along with a squad of STAPs behind them. Anakin and Obi-Wan then lured the creatures into an ambush. When they rejoined the rest of their group, Kenobi and Skywalker wondered where Piell and Ahsoka were. Ahsoka then came, carrying Piell's body after Piell gave her his half of the coordinates to the Nexus route. Kenobi, Skywalker and the team then took a brief moment to consign Piell's body to the lava before moving on. Kenobi's and Skywalker's team then reached the rendezvous point, but were then attacked by Sobeck. After defeating Sobeck's droids, Master Plo came down in his gunship and rescued them. Plo Koon took Kenobi, Skywalker and their team back to the Temple to be debriefed."}, {"tag": "h4", "text": "The Starcrusher trap"}, {"tag": "p", "text": "Shortly after"}, {"tag": "p", "text": ", Kenobi and Skywalker infiltrated a Separatist munitions factory on an asteroid. Skywalker joked that he had forgotten the explosives as Kenobi used his lightsaber to cut into the factory. Once inside they were surrounded by battle droids, but the two Jedi destroyed them and ventured deeper into the factory. Skywalker threw the explosives into the station's reactor, and the resulting explosion brought down the shields."}, {"tag": "p", "text": "Three Republic Venator-class star destroyers led by Captain Trask moved into position to destroy the factory, but the Separatist battleship Starcrusher ambushed the destroyers. The two Jedi were unaware of the destruction of the Republic fleet, and Skywalker called for extraction. The Jedi Knight Jyl Somtay, piloting a T-6 shuttle, arrived to pick them up. The three Jedi were able to fly past the Starcrusher and return to Coruscant, where the Jedi Council decided to send a team to hunt down the dangerous Separatist vessel, which included Kenobi, Somtay, Master Windu, Master Mundi, and Skywalker's Padawan. Chancellor Palpatine contacted Grand Master Yoda, and asked for the services of Skywalker."}, {"tag": "p", "text": "Skywalker met the Chancellor in his private office, where Palpatine presented a collection of seeds for Skywalker to take to the Daltarri inhabitants as a gesture of goodwill. Skywalker took R2 and his starfighter to the planet Daltarri and met the inhabitants, who agreed to aid the Republic. During his mission, Skywalker received a premonition of danger, and cut short his mission to Daltarri by two days."}, {"tag": "p", "text": "The Jedi assault team had gotten trapped on a decoy Starcrusher and were on the verge of crashing into a star when Skywalker arrived. At that time, the real Starcrusher arrived. Kenobi came up with a plan, and had Skywalker fly his fighter into the battleship's main hold, where he caused damage to the inside of the vessel. Skywalker proceeded to the vessel's power generator and destroyed it. Kenobi's plan involved magnetizing the hull of the decoy to cause the real Starcrusher to crash into it. The team then escaped using spacesuits, and Skywalker used a tow cable to pick up the team as the Separatist vessels disintegrated in the sun."}, {"tag": "p", "text": "The strike team then returned to Coruscant, and Skywalker met with Palpatine, who was not upset that he had cut his mission to Daltarri short. Upon his return to the Jedi Temple, he saw Tano and Somtay, who were going for caf and to discuss Skywalker."}, {"tag": "h4", "text": "Battle of Umbara"}, {"tag": "p", "text": "Kenobi, along with fellow Jedi Council member Saesee Tiin, Anakin Skywalker, and Pong Krell took Commander Cody's 212th Battalion and Capt. Rex's 501st Battalion to retake the shadowy world of Umbara, which had allied itself with the Separatists. Kenobi's battalion's mission was to take the capital. Kenobi and his battalion met fierce resistance from the Umbaran militia. Kenobi then contacted the 501st, which had come under the command of Krell. Kenobi told Krell the capital was too well fortified. Kenobi then told Krell that Umbaran airbase was resupplying the capital, so he told Krell to take his battalion and secure the airbase for their side. After Krell took the airbase, Kenobi congratulated Krell on his success. Kenobi then told him how long range missiles had pushed his battalion away from the capital. Kenobi also told Krell that the capital was still receiving supplies, this time from a enemy supply ship in the atmosphere. Kenobi told Krell that their space forces were trying to destroy it, but the Separatist space force still outnumbered theirs. Kenobi said that reinforcements were coming, but were delayed. Krell told Kenobi that he would take his battalion regardless of the capital's defenses. Kenobi's transmission was then jammed by the Umbarans. Krell decided to continue advancing his forces toward the capital, but three clones in the 501st disobeyed his orders, sneaked onto the supply ship in Umbaran starfighters, and destroyed it. Kenobi's battalion was successful in taking the capital, despite Krell, who secretly sabotaged the Republic effort by tricking the 501st and Kenobi's forces, the 212th Battalion, into attacking each other. Kenobi's battalion routed the remaining Umbaran forces, and secure all sectors of the planet for the Republic."}, {"tag": "h4", "text": "Battle of Kiros"}, {"tag": "p", "text": "Ten rotations after Master Yoda's last contact with the Togruta colony of Kiros, Kenobi, along with Anakin Skywalker, his apprentice Ahsoka Tano, Captain Rex, and Commander Cody then landed on the surface. Kenobi, with Rex as his gunner, rode a BARC speeder through the colony. Kenobi found it odd that there were no colonists, but was sure that they were just hiding. As they flew toward the governor's tower, they were attacked by Commando Droids and AATs. The Jedi and clones quickly dispatched the attackers, and Kenobi's and Skywalker's forces then surrounded the Separatist headquarters at the governor's tower. Cody then showed Kenobi a message from the Separatist commander, Darts D'Nar, asking him to come to the tower to negotiate terms of \"surrender\". Skywalker became angry when he recognized D'Nar as a Zygerrian slaver, and Kenobi explained Skywalker's history with slavery to Tano and told them to look for the colonists while he negotiated with D'Nar."}, {"tag": "p", "text": "Kenobi then went into the tower where he interrupted D'Nar's meeting with Dooku and Zygerrian Prime Minister Atai Molec. After Dooku ended his meeting with D'Nar, Kenobi started to negotiate terms of surrender. D'Nar, however, told him that it was Kenobi who going to surrender to him. Kenobi then turned on his comlink to Skywalker and Ahsoka to alert them to his progress. Kenobi tried to assure D'Nar that he would be given fair treatment, but D'Nar refused to surrender. D'Nar then offered Kenobi a counter proposal: surrender or D'Nar would blow up the buildings with bombs that were placed around the city. After D'Nar's tactical droid sets one the bombs off, Kenobi then conceded to his threat. Though D'Nar was ordered by Dooku to bring Kenobi to him on his knee, D'Nar wanted to punish Kenobi for what the Jedi did to the Zygerrians. Kenobi took advantage of this by agreeing to fight D'Nar in the Zygerrian way with no weapon. Kenobi then made a deal with D'Nar. If Kenobi should win, D'Nar would tell him where the bombs and the colonists were, but should D'Nar win, Kenobi would be brought to Dooku in a cage."}, {"tag": "p", "text": "Kenobi and D'Nar then started to fight with each other while Skywalker and Ahsoka found and diffused bombs. Though D'Nar had the upper hand in the fight, Kenobi was able to distract him from learning of the bombs. Just D'Nar was able to beat Kenobi, D'Nar was informed that his bombs had been diffused. While D'Nar tried to trigger the bombs, Kenobi subdued D'Nar's commando droids and retrieved his lightsaber. Kenobi then offered D'Nar another chance to surrender. Unfortunately D'Nar set off his last bomb, which was on his tactical droid. He pushed the droid towards Kenobi and then escaped. Kenobi was able to throw the droid out of the window before it exploded. Kenobi then informed Skywalker that D'Nar was escaping, and Skywalker and Tano chased him. After Skywalker captured D'Nar and his ship, Kenobi, Skywalker and Ahsoka then contacted the Jedi Council, informing them of the Zygerrians' abduction of the colonists."}, {"tag": "h4", "text": "Mission on Zygerria"}, {"tag": "p", "text": "Kenobi, along with Anakin, Ahsoka, Captain Rex and R2-D2 travelled to Zygerria using the Zygerrian slave ship Tecora, obtained from captured Zygerrian Commander, Darts D'Nar. Upon arrival they formed two teams; Skywalker and Tano went to talk to Queen Miraj Scintel disguised as master and slave, respectively, while Kenobi and Rex, disguised as Zygerrian traders, tried to locate the kidnapped colonists from Kiros."}, {"tag": "p", "text": "While Anakin and Ahsoka met with the Queen, Obi-Wan and Captain Rex proceeded to the Royal palace's slave pits where they found the Togrutan Governor of Kiros, Roshti, weak and broken from his ordeal. Unable to learn from him where the other colonists had gone, Obi-Wan and Rex decide to spring him first, and tried to make their getaway on a brezak. Kenobi was shot in the shoulder by one of the alerted guards, however, and Kenobi and Roskti fell off the brezak and were captured. Rex was able to escape. Obi-Wan was then chained to a wall and tortured for information before Prime Minister Atai Molec recognized the Jedi and prepared to sell him at that night's auction block."}, {"tag": "p", "text": "At the auction, Roshti was the first slave to be put on offer, followed by Obi-Wan. In order to break him, Queen Scintel ordered Anakin to torture him with a shock whip before the eyes of the assembled bidders. Once Skywalker entered the arena however, he signaled to R2-D2, who launched Kenobi's, Skywalker's, and Tano's lightsabers to their owners. Skywalker disarmed the nearby guards with his shock whip. Quickly, however, more guards rushed into the arena and captured Kenobi, Skywalker, and Rex. Tano, who had tried to force Scintel's surrender, was disabled with her slave shock collar. Ahsoka and Anakin were kept on Zygerria, but Obi-Wan, along with Captain Rex and Governor Roshti, were brought to the Zygerrian \"education center\" on Kadavo, where they discovered that the other Togrutans were also being held. Kenobi was forced into submission by the center's warden, Agruss, who emphasized his point by dropping several Togrutan prisoners to their deaths and threatening to do worse to the others, should Obi-Wan ever think of rebellion."}, {"tag": "h4", "text": "Battle of Kadavo"}, {"tag": "p", "text": "Soon after, Obi-Wan was forced to slave away in the mines alongside Rex and the Togrutan colonists. Taunted by the facility's cruel warden and his guards, Obi-Wan had a hard time scrounging up any spark of hope for himself or the unfortunate prisoners, since every time he did so, one of the Togrutans was punished in his place in order to heighten his despair. This caused the Togruta to became distrustful of Kenobi and hesitant to help him."}, {"tag": "p", "text": "While Kenobi and Rex were on Kadavo, Count Dooku tried to negotiate with Miraj Scintel for the Togruta slaves but killed her when she would not cooperate with him. Dooku then gave orders to Agruss that Rex and Kenobi be killed, and they were brought to the facility control room. Before they could be executed, however, Skywalker and Tano, who had escaped from Zygerria, arrived at the facility, along with reinforcements led by Plo Koon and Admiral Coburn. In the confusion of the attack, Kenobi and Rex broke free of their restraints and began disabling their guards. Agruss panicked, and initiated the procedure for the execution of the Togruta before he could be stopped. He then taunted Kenobi, because he knew the Jedi would not kill an unarmed man, but Rex, not feeling bound by such moral obligations, threw a spear at the warden. The Republic forces rescued many of the Togruta and then destroyed the labor facility."}, {"tag": "h4", "text": "Plot to kidnap Chancellor Palpatine"}, {"tag": "h5", "text": "Becoming a bounty hunter"}, {"tag": "p", "text": "Later in the War, Obi-Wan, along with Anakin and Ahsoka were walking through the nightly streets of Coruscant when a sniper opened fire on them. The Jedi dodged the shots, and Obi-Wan, along with Anakin, chased after the sniper. They lost him, and Obi-Wan moved out onto the open to look for him, when the sniper fired and hit him dead on. Anakin chased after the sniper, who escaped on a speeder, and when he returned to Obi-Wan, he found out that his old master and best friend was dead."}, {"tag": "p", "text": "In reality, Obi-Wan, with the help of Masters Yoda and Windu, had faked his death in order to assume the identity of his would-be killer in order to get close to Moralo Eval and find out his plans to kidnap the Chancellor. After Obi-Wan had his appearance altered, he and Windu then went to Trueping's to arrest the real Rako Hardeen. They recorded a sample of his voice, and then Kenobi swallowed a vocal emulator to perfectly disguise his voice as Hardeen's."}, {"tag": "p", "text": "Kenobi was then sent to the Republic Judiciary Central Detention Center, where he formed a partnership with Eval, who trusted Kenobi and thought he could be useful, and Cad Bane, who did not. When a prison riot started, the trio was able to break out and leave Coruscant for Nal Hutta."}, {"tag": "p", "text": "When they arrived at Nal Hutta, Kenobi crashed their ship in order to cover their trail. The trio then proceeded to try to find supplies and a new ship in Bilbousa, and Bane grew even more distrustful of Kenobi after Kenobi's kind treatment of Pablo, the owner of the pawnshop that the trio went to. Kenobi, suspecting betrayal, planted a tracking device on the new ship he bought. As Kenobi had suspected, Bane sprayed Kenobi with knockout gas as they were departing, leaving Kenobi to be arrested by the local authorities. However, Kenobi turned the frequency of the tracking device over to his captors, who shot Bane and Eval's ship down. Kenobi, meanwhile, escaped from captivity and purchased another ship, and when Bane and Eval found him smugly waiting for them, they agreed to make him a partner in their scheme."}, {"tag": "p", "text": "Anakin Skywalker, meanwhile, had not been informed of the truth of Kenobi's survival, and, at Palpatine's encouragement, Skywalker and Ahsoka Tano went to Nal Hutta after Kenobi's \"killer\". They then followed Kenobi, Bane, and Eval to Orondia, where the trio had stopped to refuel their ship. When Kenobi's ship took off, Skywalker gave chase in his ship, and both ships crashed near a fuel-processing facility. Kenobi tried to find Skywalker to make sure he was all right without blowing his cover, but when Skywalker saw Kenobi, he attacked him in a rage. Kenobi gained the upper hand, and just before knocking Skywalker unconscious, he whispered to Skywalker that he should not keep following him. Kenobi, Bane, and Eval then escaped, leaving Tano at the side of her master. Afterward, when Skywalker returned to Coruscant, Yoda and Mace Windu informed him of the ruse so that he would not interfere farther."}, {"tag": "h5", "text": "The Box"}, {"tag": "p", "text": "Eval, Bane, and Kenobi then traveled to Serenno to meet with Count Dooku, and Bane and Kenobi accepted an invitation to participate in a test of skill designed by Eval called the Box with eleven other notorious bounty hunters. Those who were successful would be rewarded. In the first challenge the twelve participants (Bane shot one before the contest began) faced, they were raised on small platforms above clouds of dioxis. Kenobi discovered that there was a tunnel below the cloud of gas, and the bounty hunters were able to escape from the room. The second challenge featured panels extending from the walls at seemingly random intervals with energy blades on their ends. Two of the bounty hunters were impaled, but Kenobi observed a pattern in the panels extentions, and he was able to lead the rest of the contestants to another tunnel in the ceiling. When the bounty hunters entered the next room, they were surrounded by energy shields slowly closing in on them. In the center of the room was a serum that would allow the user to pass through the shields and turn them off using a switch on the other side; however, Eval informed them that it was toxic to all but one of the contestants. Kenobi guessed correctly that one of the bounty hunters, Derrown, a Parwan, might be able to to pass through the shields, and the bounty hunters moved on to the next room, while Eval grew angry at \"Hardeen\" for his continued success."}, {"tag": "p", "text": "In the fourth room, the bounty hunters stood on a platform above a floor of flame emitters. A target moved across the opposite wall that must be hit three times with a sniper rifle. Sixtat stepped up to shoot, but he missed on his third shot and fell into the flames below. Kenobi shot next, hitting all three times. The platform of the four other remaining bounty hunters elevated, while Kenobi's stayed on the same level. Eval told him to hit the target five more times. Kenobi hit four times, but then the rifle ran out of shots, and Kenobi realized he had been set up to fail. The platform dropped beneath him, but Bane, disliking Eval's unfair tactics, shot Kenobi a rope and pulled him up. Dooku decided that Eval should not be exempted from the contest and dropped him to the now extinguished floor to fight with Kenobi. Kenobi gained the upper hand, but when Dooku told him to kill Eval, he declined, saying that he just wanted to do his job. Dooku was disappointed and chose to put Bane in charge of the operation to kidnap the Chancellor instead of Kenobi, as he had planned."}, {"tag": "h5", "text": "Stopping the kidnapping"}, {"tag": "p", "text": "The team decided to kidnap Palpatine at the Festival of Light on Naboo. They commandeered a warehouse in Theed and each member of the team was assigned a role, with Kenobi being given the job of the sniper who would fire stun blasts at the Chancellor. Kenobi contacted Mace Windu from his position above the plaza were the Chancellor would speak and informed him of the group's plan. During Palpatine's speech, Kenobi spotted Derrown, disguised as a Senate Commando, going to destroy the generator for the shield around the plaza. He alerted Windu, but Anakin Skywalker could not get to Derrown in time, and the generator exploded, the shield fell, and Palpatine was knocked unconscious. Then, while Twazzi posed as Palpatine, and Embo as his kidnapper, Bane and Eval escaped with the true Chancellor. Kenobi followed them, with Windu and Skywalker close behind, and the pair were arrested and the Chacellor recovered when they stop at the rendezvous point."}, {"tag": "p", "text": "Kenobi later returned to the apartment where he had had his position as a sniper, and discovered an activated comlink in his rifle case. He realized that Dooku had bugged him, and had known Kenobi's loyalties the whole time. Kenobi rushed back to the Royal Palace, where he discovered Skywalker dueling with Dooku, while Palpatine was held by a MagnaGuard. Kenobi rescued the Chancellor and Dooku fled, and Palpatine thanked the Jedi for their bravery."}, {"tag": "h4", "text": "Loss of the Negotiator"}, {"tag": "p", "text": "While Obi-Wan Kenobi was stationed aboard his flagship, the Star Destroyer Negotiator, he was contacted by Jedi initiates aboard the Jedi training cruiser Crucible, who informed him that their guardian, Ahsoka Tano, had been kidnapped by Hondo Ohnaka's pirates. The younglings said they wanted to rescue Tano from the pirates, and Kenobi expressed appreciation for their daring, but told them to stay on the Crucible for their safety."}, {"tag": "p", "text": "Kenobi was intending to send Commander Cody to rescue the stranded Jedi, but his plans were interrupted by an unforeseen attack by General Grievous on his fleet. Grievous's ships quickly gained the upper hand on Kenobi's, destroying several of his vessels. Upon learning that Grievous had sent a boarding party to the Negotiator, Kenobi and the clone forces on the ship stationed themselves in the hanger in order to repel it. Grievous himself accompanied the boarding party, and Kenobi began dueling with him as the clone troopers and battle droids engaged each other. Soon, however, Kenobi realized that this was a battle that he could not win, and as he retreated through the passageways of the Star Destroyer he ordered the crew to abandon ship and initiated the ship's self-destruct sequence. When Grievous arrived on the bridge, he found a hologram recording of Kenobi. Through it, Kenobi conceded the victory to Grievous but informed him that the ship was about to explode. Kenobi escaped the destruction on an escape pod, as did Grievous, who evacuated the Negotiator on a shuttle just before it exploded."}, {"tag": "p", "text": "Soon after, Kenobi joined Tano, the younglings, who had gone to rescue Tano despite Kenobi's orders, and members of the pirate gang, including Ohnaka himself. After Grievous's defeat of Kenobi, he had attacked the pirates' stronghold, and the Jedi and pirates had joined forces against Grievous and barely escaped with their lives."}, {"tag": "h4", "text": "The return of Darth Maul"}, {"tag": "p", "text": "During Obi-Wan's mission, Savage Opress was continuing his search for his brother, Darth Maul. He eventually went on to find the disfigured Sith Lord and brought him to Talzin, where he was mended to and equipped with a new, stronger lower half. Kenobi was informed of Maul's return by Master Yoda. Soon, Kenobi, Yoda and Mace Windu received a message from Maul from Raydonia, saying that he would slaughter everyone if Kenobi did not come. Despite Windu's call of precaution, Kenobi decided to defeat Maul by himself."}, {"tag": "h5", "text": "Skirmish on Raydonia"}, {"tag": "p", "text": "Obi-Wan went to Raydonia to face Maul at once. He quickly found the Sith Lord, who was full of anger. Obi-Wan realized Maul was not alone: Savage Opress quickly surprised Kenobi and struck him, knocking the Jedi unconscious. Kenobi was taken to the brothers' ship, where his lightsabers were taken, and he was cruelly tortured by the two. However, Kenobi had an ally in the form of Asajj Ventress, who found out Opress's location on Tatooine, at Chalmun's Spaceport Cantina, and followed the Nightbrother to Raydonia. After she got aboard the ship, she revealed herself to the brothers, making them angry enough to leave the Jedi alone, searching for Ventress. After the two left, Ventress roused Kenobi, and gave him one of her lightsabers, to defend himself when the brothers come back. They took up the fight, but they found themselves outmatched. They retreated to the cockpit of the ship, and before the two brothers could open the locked door with their lightsabers, they jettisoned the cockpit and fled into space, leaving the angry Maul and Opress behind."}, {"tag": "h5", "text": "Chasing Maul"}, {"tag": "p", "text": "After his encounter with Maul, Obi-Wan Kenobi joined with Adi Gallia to find the Sith Lord so that he could be stopped. When the two brothers attacked Cybloc Transfer Station, the space station sent out a distress signal, leading Kenobi and Gallia there to investigate. When they arrived, the pair spoke with the station supervisor, Morlimur Snugg, who confirmed that the attackers were indeed the two Zabrak and informed the Jedi that the brothers had taken his ship and were traveling to the Sertar sector. Kenobi correctly guessed that Maul was going to Florrum to find Hondo Ohnaka and his pirates."}, {"tag": "p", "text": "When Kenobi and Gallia's shuttle arrived at Florrum, they contacted Ohnaka. Ohnaka told them that the Sith had convinced his men to betray him, and asked the Jedi to help him. Kenobi agreed to confront the Sith Lords while Ohnaka dealt with the traitorous pirates. When the Jedi landed on the planet, Maul and Opress separated themselves from the battle between the pirates in order to confront and eliminate the Jedi threat. Maul began dueling with Kenobi, while Opress attacked Gallia. Gallia was overwhelmed by Opress, who killed her by first ramming his head into her and impaling her with his horns and then stabbing her with his lightsaber. Kenobi then tried to press his attack against the brothers, but was unable to hold his ground against their combined forces. Ohnaka, whose loyalists were losing the battle against the turncoats, ordered a retreat into his stronghold, and Kenobi followed him, grabbing Gallia's lightsaber as he went."}, {"tag": "p", "text": "As the pirates set up weapons in order to make a stand in their base, Kenobi volunteered to draw the Sith away from the rest of the battle. The pirates used explosives to collapse a tunnel in their base, separating Kenobi, Maul, and Opress from the rest of the battle, and Kenobi again began dueling with the brothers. Using both his own and Gallia's lightsabers, Kenobi was able to resist the brothers' attacks until he was able to get inside Opress's defenses and cut off the Sith's left arm. Maul then Force-pushed Kenobi into the wall, and the pair of Sith retreated out of the base and straight into the waiting pirates, including the traitors, who had again given their loyalty to Ohnaka. Maul and Opress were able to get to their ship and lift off, but they were brought down just as quickly by a rocket launched by one of the pirates. The brothers, however, unbeknownst to the onlookers, left the doomed ship in an escape pod before it crashed. As the pirates looted the wreckage, Ohnaka stated that he thought the absence of bodies meant that they had been vaporized, but Kenobi, who had been mistaken about Maul's fate once before, was hesitant to assume the brothers were dead."}, {"tag": "p", "text": "Once he returned to Coruscant, Kenobi reported the events to Supreme Chancellor Palpatine, along with several Jedi. Kenobi expressed his belief that Maul was still alive, but Palpatine told him that he should focus his efforts on the Separatists, who posed a greater threat, and Yoda agreed, saying that Kenobi was too focused on Maul. However, he said that if he revealed himself, the Jedi would be swift in their response."}, {"tag": "h5", "text": "Mandalore"}, {"tag": "p", "text": "Kenobi was later summoned to meet with Yoda and Ki-Adi-Mundi in the communications room. The two showed him a transmission that had been sent by Duchess Satine from Mandalore. In the message, she stated that her government had been overthrown by rogue criminals. Before she could say anymore, the transmission abruptly cut."}, {"tag": "p", "text": "Kenobi tried to convince the two that they could not make Kryze a martyr, and that they needed to help her. But both Jedi refused as they pointed out that the neutrality of the planet made things difficult. Despite this, Kenobi decided to help his friend. Going to the hangar, he asked Anakin Skywalker for his old freighter, the Twilight. Despite the long list of issues with the ship, he took it to Mandalore."}, {"tag": "p", "text": "On the planet, he stole armor from a Mandalorian super commando upon his arrival at the docks and proceeded to the prison where Kryze was. Once he rescued her, the two were pursued back to their ship by a squad of commandos. The two were forced to abandon the ship when a rocket destroyed it. In the confusion of leaping off the ship, Kenobi saw Darth Maul and Savage Opress approach."}, {"tag": "p", "text": "In the palace, Kenobi was forced to watch as Maul choked Kryze in front of him. He was forced to his knees by two of the commandos and watched in horror as Maul impaled Kryze on the darksaber. Kenobi held her in his arms before she died, and Maul ordered Kenobi taken to a cell to drown in his own misery. But en route to the prison, the commandos were neutralized by Bo-Katan and her renegade Nite Owls team."}, {"tag": "p", "text": "Kenobi and Bo-Katan allied and fled the scene in battle with more commandos. Bo-Katan ushered him to a ship that had approached to the site and ordered him to get Republic assistance. Kenobi said it would lead to Republic invasion, but she said that they would survive it. As he boarded the ship, he realized that she was Satine's sister, and gave her condolences before he left."}, {"tag": "h4", "text": "Onderon"}, {"tag": "p", "text": "Kenobi attended a session of the Jedi Council when rebels Saw Gerrera and Lux Bonteri contacted them with a request for assistance in their struggle against the Separatist forces on Onderon, led by King Sanjay Rash."}, {"tag": "p", "text": "Kenobi pointed out that at the beginning of the war, Onderon made their intentions to join the Separatists, but Gerrera said that their true king was silenced by the fake. The Council refused to help, but did consent to send advisors to train and advise them. Kenobi went there with Anakin Skywalker, Ahsoka Tano and Captain Rex."}, {"tag": "p", "text": "On Onderon, Kenobi met the rebels – and their charismatic leader Steela Gerrera – alongside his friends and together, they began to train the rebels in combat. When the Separatists discovered their outpost and attacked, Kenobi and his fellow Jedi assisted in battle, though cautious not to be in the thick of the battle. When the skirmish concluded, a strategy was devised to get into the capital city of Iziz."}, {"tag": "p", "text": "Once in Iziz, Kenobi, Skywalker and Rex decided to leave for Coruscant to report to the Council, leaving Tano as a liaison to the rebels. However, they decided to ensure that Tano did not reveal her Jedi identity, though allowing her to accompany the rebels on strike. After that, they kept in frequent communication with her. Kenobi attended the funeral service for Steela after the final battle after she had perished."}, {"tag": "h4", "text": "Asajj Ventress"}, {"tag": "p", "text": "The waning months of the Clone Wars saw Kenobi become obsessed with the Dark Jedi whom he and Skywalker had faced numerous times, Asajj Ventress. Through numerous battles with Ventress, Kenobi had found out much about her past and believed that there was still some good in her. For a time he forsook the war to search for this enemy and even brought his former Padawan Skywalker along with him, in what Skywalker considered to be a wild bantha chase since he believed himself to have killed Ventress when she followed him to Coruscant. However after following several clues that pointed to her survival, once Skywalker had destroyed the deadly bounty hunter Durge once and for all, he became less and less sure of this conviction."}, {"tag": "p", "text": "Eventually the two found Ventress on Boz Pity in a bacta tank. She attacked the two when she came out of her trance but was once again defeated, and abandoned by Dooku. Finally, she let go of her anger and rage and put herself in a trance that made her appear dead. She was taken aboard a medical ship (along with Alpha 17), awoke shortly after, and ordered the pilot to take her far away from the war, Dooku, and the Jedi. Kenobi was left believing that she was truly dead."}, {"tag": "h4", "text": "The Outer Rim Sieges"}, {"tag": "p", "text": "Kenobi spent the last few months before the end of the war serving with Skywalker on the Outer Rim Sieges. These took them to some of the most remote worlds in the galaxy, and forced them to stay for long periods of time. While this was a strain on Skywalker being away from his secret wife, Kenobi took these campaigns in his stride, leading the Republic to a long string of victories. One of their missions involved capturing Viceroy Gunray on his homeworld of Cato Neimoidia. In the few weeks before the Battle of Coruscant Kenobi and Skywalker even took up the search for the mysterious Darth Sidious, and uncovered information that almost allowed Mace Windu to find Sidious, but Windu was stopped before he uncovered Sidious' identity when Coruscant was attacked."}, {"tag": "p", "text": "Kenobi's legend had grown to be very great during the wars, as he and his partner Skywalker became household names from their daring exploits, and were known as the most famous Jedi in the Galaxy. This earned the attention of the Separatist general, Grievous, who wanted to add both Skywalker's and Kenobi's lightsabers to his belt as trophies.[source?]"}, {"tag": "h3", "text": "Rise of the Empire (19 BBY)"}, {"tag": "h4", "text": "Battle of Coruscant"}, {"tag": "p", "text": "When Supreme Chancellor Palpatine was kidnapped by General Grievous and taken onto his flagship, the Invisible Hand during the Battle of Coruscant in 19 BBY, Kenobi and Skywalker were quickly called in from the Outer Rim Sieges to rescue the captive leader of the Republic. It was Kenobi who developed the plan that allowed for Skywalker and himself to rush in and rescue the Chancellor. Once on board, the two fought their way to where the Chancellor was being held captive by Count Dooku himself."}, {"tag": "p", "text": "Kenobi and Skywalker once again engaged the aged Sith Lord in battle. Initially, the two Jedi used lesser styles to lull Dooku into a false sense of confidence, before suddenly switching to their more advanced styles. Dooku was caught off-guard and pushed Kenobi off to the side to deal with Skywalker exclusively. While Skywalker drove Dooku up the stairs to the entrance balcony of the General's Quarters, Kenobi dealt with the super battle droids that Dooku had brought to distract the two. However, once he did so, Dooku immediately kicked Skywalker aside and grasped Kenobi in a Force choke, hurled him to the side of the room, and brought a section of the balcony down on him, rendering Kenobi unconscious and injured."}, {"tag": "p", "text": "Consequently, he was unable to stop Skywalker from murdering Dooku at Palpatine's behest. However, Palpatine was unable to stop Skywalker from rescuing Kenobi."}, {"tag": "p", "text": "When Kenobi recovered, he found himself upside-down, in an elevator shaft, staring at Palpatine hanging on Skywalker's leg. Quickly righting himself, he asked the obvious, Did I miss something? After exiting the elevator, Obi-Wan, Anakin and Palpatine were confronted by more droids. Anakin was separated from Obi-Wan and the Chancellor by a magnetic ray shield, but they rendezvoused a little while later. Obi-Wan's com link then received a distress call from another Jedi Knight who's cruiser was being brutally attacked. Anakin and his master then mounted two of the Invisible Hand's cannons to attack the Separatist ship that was attacking the cruiser. They shot the vital sections of the ship, and destroyed the Banking Clan battleship. When they got back into the hallways, Kenobi suggested they make their way to the hangar bay to hopefully find something still capable of flight. Unfortunately, they were unable to make it to the hangar because they got caught in a ray shield."}, {"tag": "p", "text": "Brought to the bridge, they were gloated at by Grievous, but Kenobi remained confident. When R2-D2 created a distraction, Kenobi, using the Force, retrieved his lightsaber from Grievous and cut his and Skywalker's bonds. Engaging and defeating Grievous' MagnaGuards, they moved to corner the General. However, Grievous used an electrostaff set on overload to shatter the bridge viewport and exited, climbing along the ship exterior to the escape pods and launching all of them along the way. Having no other escape, Kenobi asked if Skywalker could pilot this cruiser. Skywalker managed to crash-land the remains of the ship, and they walked away relatively unscathed."}, {"tag": "h5", "text": "Suspicion"}, {"tag": "p", "text": "As Palpatine began to gather more power to himself, Kenobi became very concerned. He counseled Skywalker to be wary of the Chancellor. When Skywalker was appointed to the Council and instructed to spy on Palpatine, Kenobi was the only member who was against the Council's decision. Despite this, Skywalker began distrusting him just as much as the rest of the council, and Kenobi felt he was justified in this."}, {"tag": "h4", "text": "Battle of Utapau"}, {"tag": "p", "text": "When Grievous was discovered on Utapau, Kenobi was sent by the Jedi Council to eliminate him. With the death of Count Dooku during the Battle of Coruscant, Grievous had become the Head of State of the Confederacy of Independent Systems, meaning Grievous' death would end the Clone Wars."}, {"tag": "p", "text": "Kenobi eventually tracked Grievous down and went down alone to scout out the area. Deceiving the droids into thinking he had left, Kenobi quietly used a varactyl named Boga to move around in search of the general. Discovering the cyborg's hiding place, he faced the General alone, after defeating some of his bodyguards."}, {"tag": "p", "text": "The General fought the Jedi Master using four of his collected lightsabers in an unpredictable personalized style, using his top two lightsaber as saws, and his bottom two pointing at Obi-Wan. Grievous was a powerful opponent but Obi-Wan's mastery of Soresu allowed him to quickly slice off two of the cyborgs hands. When the 212th Attack Battalion, led by Commander Cody, successfully ambushed the unsuspecting Separatists, Grievous used the resulting confusion to flee, followed closely by Kenobi. Their vicious chase eventually led them to Grievous' private landing platform where the two completed the battle. It ended when Kenobi used the General's own blaster to shoot him through the gutsack, killing him."}, {"tag": "h4", "text": "The Beginning of the Purge"}, {"tag": "p", "text": "When Order 66 was issued by Palpatine, commanding all clone troopers to kill their Jedi Generals, Kenobi narrowly escaped murder at the hands of his clones; the blast from an AT-TE's main cannon that was intended to kill him was fired from a long range, and therefore did not manage a direct hit. It instead sent Kenobi plummeting into the lake at the bottom of the sinkhole with his mount, the varactyl Boga. After recovering from this attempted murder, Kenobi escaped using General Grievous' Belbullab-22 starfighter. Of particular note during the execution of Order 66 on Utapau was Commander Cody, Obi-Wan's friend for the past few months, who himself ordered his troops to eliminate Kenobi."}, {"tag": "p", "text": "Kenobi used Grievous' starship to escape from Utapau and was contacted by Senator Bail Organa, who had already rescued Master Yoda from Kashyyyk on his starship, the Sundered Heart. Kenobi and Yoda returned to the ruined Jedi Temple on Coruscant, they fought their way through to the beacon room and reversed the code to warn all remaining Jedi to stay away instead of returning. They then came across recordings on Temple security camera TR4-121 that showed his former apprentice cutting down Cin Drallig as well as two of his students, and bowing before Palpatine and being proclaimed his new Sith apprentice. Kenobi and Yoda then decided to split up and kill the two Sith Lords. Kenobi begged to fight the Emperor because he considered Skywalker as a brother. Yoda told him that the Emperor was too strong for Kenobi and that Skywalker was not the boy he trained, but consumed by Darth Vader. The two then separated."}, {"tag": "p", "text": "Kenobi went to visit Skywalker's secret wife Padmé Amidala, confronting her with the truth that Skywalker had turned to the Dark Side. Amidala refused to believe him, and would not tell Kenobi that Skywalker had been sent to Mustafar to kill the Separatist Council. It was at this moment too, that Kenobi took note of Amidala's heavily pregnant condition, realizing and forcing her to admit that Skywalker was the father of her child, hence her reluctance to help him: apologizing for what he had to do, Kenobi took his leave of her. Kenobi, after sneaking onto Amidala's space cruiser as the Senator prepared to leave to find Skywalker herself, tracked the Sith apprentice to the volcanic world of Mustafar."}, {"tag": "h5", "text": "Duel on Mustafar"}, {"tag": "p", "text": "Arriving on Mustafar stowed away on Amidala's ship, Kenobi witnessed the exchange between her and Vader. When he revealed himself, Vader was consumed by rage and began choking Amidala, accusing her of betraying him and bringing Kenobi to murder him. Barely able to convince Skywalker to let her go, but not before Vader choked her into unconsciousness, he attempted to reason with the Sith Lord. Vader retorted with an offer to let Kenobi go, but Kenobi refused, drawing his lightsaber. With a murderous battle cry, Vader drew his and leapt at Kenobi, and one of the greatest battles of Jedi history began, that would determine the fate of the galaxy."}, {"tag": "p", "text": "Vader viciously drove Kenobi back through the complex with his mastery of Djem So, however he was unable to penetrate Kenobi's mastery of Soresu. Their bout in the control room of the complex deactivated the energy shield protecting the settlement, so when their fight spread to the collection arms of the lava mining facility, they were forced to dodge a rain of fire. While they were fighting, the weight and heat of the lava caused the collection arms structure to weaken and eventually collapse and break loose."}, {"tag": "p", "text": "Kenobi and Vader continued to fight on the collection arm as it floated down a lava river, but when they came to a lava fall, Kenobi leapt off onto one of the mining platforms floating above the river. Thinking Vader dead, he turned to find the Sith Lord perched on a lava mining droid, having leapt from the structure before it plunged to oblivion. As their fight continued they floated back upriver, continuing to exchange verbal barbs. Kenobi desperately tried to convince Vader of Palpatine's evil, but when Vader retorted the Jedi were evil, Kenobi bellowed that his old student and friend was beyond redemption. As their battle edged close to shore, Kenobi took his chance and leapt onto the shore, gaining the high ground over Vader. Although Kenobi warned Vader off, the Sith snarled back, \"You underestimate my power!\". Obi-Wan, out of a last vestige of friendship, begged Vader not to try the jump, but out of sheer spite and hubris, Vader lunged at his former master, only to have his left arm and both legs cut off, sending the Sith tumbling down the lava bank."}, {"tag": "p", "text": "As Vader lay cursing his former master, Kenobi replied:"}, {"tag": "p", "text": "As Kenobi watched Vader attempt to scramble onto the bank, his old apprentice screamed: \"I hate you!\". Kenobi stared at his old apprentice, sadness in his eyes and realized the truth of Yoda's words: the boy he had trained was gone. Holding back his tears, he replied, \"You were my brother, Anakin. I loved you.\" As he watched Vader's graphic near-immolation from the heat of the lava, the Sith crying out his eternal hatred for Kenobi, he retrieved Skywalker's lightsaber. Considering ending Vader's life then and there, he chose not to murder his defenseless enemy in cold blood, and allowed the Force to determine Vader's fate. Believing that Vader was dead, Kenobi left the planet just before Palpatine and his clone escorts landed on the surface. Palpatine and his escorts rescued the Dark Lord from what was almost a horrific fiery demise."}, {"tag": "h5", "text": "Aftermath"}, {"tag": "p", "text": "After leaving Mustafar, Kenobi took Amidala to Polis Massa. There, with Bail Organa and Master Yoda, the three of them discovered that Amidala was carrying twins and had to be operated on quickly if they were to save the babies, because Amidala was literally dying of a broken heart. Kenobi served as Amidala's coach as the babies were born. Amidala gave her japor snippet to Kenobi to keep for her, but he didn't understand the significance of this gesture so he gave it back to her. It was supposedly buried with her. Amidala also told Kenobi she still believed there was good in her husband before she finally died."}, {"tag": "p", "text": "As they arrived on Naboo, Kenobi, Organa, and Yoda all agreed that Kenobi would take Anakin Skywalker's son Luke to Anakin's step-brother Owen Lars and his wife Beru on Tatooine. Organa meanwhile would take Skywalker's daughter Leia to Alderaan, and Yoda would hide on the swamp world of Dagobah. As the trio prepared to go their separate ways, Yoda asked Kenobi for a moment of his time. He revealed that his old Master, Qui-Gon Jinn has contacted him from beyond death to teach both of them the true path to immortality."}, {"tag": "h3", "text": "Exile (19 BBY–0 BBY)"}, {"tag": "p", "text": "During the Imperial era, Kenobi was forced into hiding. Taking Grievous's starfighter to Nar Shaddaa, Kenobi sold the ship and booked passage to the desert world, along with his young passenger, the baby Luke."}, {"tag": "p", "text": "Self-exiled on Tatooine, Kenobi spoke with his departed master, Qui-Gon Jinn, through a technique passed down to him by Yoda who had in turn been taught by Jinn. He chose to go by the name of \"Ben\" to the locals of Tatooine, he had seen that name on the map at the property office of Bestine and admitted there was \"some mesa by that name\"."}, {"tag": "p", "text": "For the first few months of his self-imposed exile, Kenobi had no idea what had become of Vader after he had left him to his fate on Mustafar, but one day at a cantina Kenobi finally heard that he was alive when news reached him of Vader's victory at the Battle of Kashyyyk. He was shocked that the remaining Jedi thought they could band together to defeat the Sith Lord. He had hoped that they would go into hiding like he and Yoda did."}, {"tag": "p", "text": "Kenobi visited the Lars Homestead everyday, always trying to stay clear of Owen and Beru so that they would not see him and watching Luke from afar. It was during these visits that he would contemplate on Skywalker's \"death,\" though he still had inkling that he was in fact alive as well as wondering why his former Master, Jinn, had not yet contacted him from beyond death. During one of these visits, the Lars discovered that twenty of their vaporators had been stolen by the Sandpeople. Although Owen decided to gather a group of farmers to combat the Tuskens and win his vaporators back through a bloody war, Kenobi had other ideas."}, {"tag": "p", "text": "Instead, Kenobi set out on his own and managed to track the Sandpeople, contemplating memories of his old apprentice before finally meeting with a group of Tuskens at dusk. At first things went well, as he quickly managed to find out which tent the Sandpeople were keeping the stolen vaporators in, and managed to silently break into the tent and load them onto a bantha without alerting the nearby Tuskens. Unfortunately, as he was about to leave, he was spotted by a lone Tusken Raider male."}, {"tag": "p", "text": "The Raider attacked him immediately. Kenobi quickly managed to slice through the attacker's weapon with his lightsaber, causing the Raider to howl. This alerted many others in the camp who all came out to meet with the foe. They all attacked him and though Kenobi found himself drawing upon his anger, he was able to let go of the dark and destructive feeling. Instead of murdering the entire clan as Anakin Skywalker had done in the past, Kenobi cleverly chose to cut their clothes off to reveal their skin; a taboo to the Sandpeople, which would usually result in others of the tribe murdering the offenders. This gave him time to escape on the bantha with the vaporators and gained him legendary reputation amongst the Sandpeople."}, {"tag": "p", "text": "On returning to the Lars Homestead, Kenobi was met with an icy welcome. Owen informed him that they did not need his help, as they were a family and could have handled it on their own. Kenobi left the farm, returning to his solitude and contemplation."}, {"tag": "p", "text": "Unknown to Kenobi, he was also being rigorously hunted down by Vader, who had tortured several Jedi in order to find Kenobi's whereabouts, and sparing no expense to do so. This would work to Vader's disadvantage, however, when Kenobi was said to have been at the infamous Conclave on Kessel."}, {"tag": "h4", "text": "Adventures with Ferus Olin"}, {"tag": "p", "text": "Over the next few months, Kenobi felt he was ready to train in the way of the Whills, but Jinn's spirit told him that he was not, and that he must realize it for himself why in order to begin. Roughly a year into his exile, Kenobi overheard spacers discussing events on Bellassa, where Ferus Olin, a former Padawan learner Kenobi had thought dead, was on the run from Imperial forces. Jinn convinced Kenobi to track Olin, promising him that this quest would help Kenobi's mission to protect the baby. With the spirit of Jinn temporarily looking after one-year-old Luke, Kenobi went to Bellassa. On Bellassa he assumed the identity of Ronar Hanare, a business man charged with working on a pipeline outside the city of Ussa. This allowed him access to the spaceport of Ussa which was controlled by The Eleven while he searched for Olin. He eventually found Olin and helped him escape the ruthless Inquisitor Malorum. Kenobi also discovered that Malorum was interested in the events of Polis Massa. Pursued by Boba Fett, Kenobi and Olin escaped from Bellassa to The Red Twins system."}, {"tag": "p", "text": "Evading the bounty hunter, Kenobi and Olin eventually found themselves on the planet Acherin where they met two former Separatists now against the Empire, a man named Toma and a skilled pilot named Raina Quill. With these new companions, as well as a boy from Bellassa, Trever Flume, Kenobi and Olin escaped the Imperials. Kenobi learned from Toma that Garen Muln, an old Jedi friend of his, survived Order 66 and was hiding on the frozen world of Ilum. Olin went to rescue Muln, while Kenobi went to Polis Massa to make sure Luke and Leia's birth was still a secret from the Empire. There he encountered the Inquisitor Sancor, a security expert sent by Malorum, and with the help of Polis Massan Maneeli Tuun, Kenobi tried to deceive him by pretending to be Osh Scal, the supply officer who had witnessed the events. Kenobi also tried to misguide Sancor offering a more tempting target for his research.\nWhen Sancor saw an image of Scal in the files, the charade failed and Kenobi was forced to eliminate him; Sancor was accidentally killed while trying to escape from the Jedi."}, {"tag": "p", "text": "Returning to Ilum, Kenobi picked up Ferus, Trever, and Garen and brought them to an asteroid that Ferus planned to make into a safe haven for Jedi. Olin asked Kenobi to join him, but the Jedi Master turned it down and returned to Tatooine. Kenobi had to leave the asteroid soon afterwards. He met with Olin and asked the former Padawan to take care of Malorum. Kenobi did not tell Olin about the birth of the Skywalker twins, but specifically asked Olin to not allow Malorum to discover whatever had happened in Polis Massa; Kenobi correctly believed that Sancor's death would not deter Malorum from continuing his research. Upon Kenobi's return, Jinn's spirit came to him once again, this time to tell him he was ready to train in the way of the Whills."}, {"tag": "h4", "text": "Later missions"}, {"tag": "p", "text": "On Tatooine in 17 BBY, Kenobi met A'Sharad Hett, another Jedi who had survived Order 66. A'Sharad was leading a Tusken Raider group near the Lars's moisture farm. Kenobi had noticed Hett's activities in his exile, and believed Hett was frighteningly close to the dark side, becoming the very thing he was claiming to fight. He begged Hett to stop his crusade there and then, not mentioning to Hett exactly why he had chosen to defend this small farm. However, Hett refused to listen; the settlers and farmers had killed countless Tuskens, and blood called out for blood. With little choice, both Jedi ignited their lightsabers and fought a brutal duel on the desert flat, with the entire Tusken army watching them."}, {"tag": "p", "text": "The duel ended with the loss of Hett's right arm, and the extra humiliation of having his mask removed. Hett became an outcast, and asked Kenobi to finish him off. However Kenobi would still follow the Jedi Order's tenets, and would never strike down an unarmed opponent. Instead, he made Hett swear on the honor of his late father that he would leave Tatooine and never return, hoping that one day, Hett would see the error of his ways and again take up the Jedi way. Hett never did and he eventually became the Dark Lord of the Sith known as Darth Krayt."}, {"tag": "p", "text": "It is believed that Kenobi was also responsible for the secreting away in the Lost City of the Jedi on Yavin 4 of the young Ken, just under seven years before the Battle of Yavin. Certainly, Kenobi knew of the city's location, as he would later send Luke Skywalker there, and Ken himself seemed to have vague memories of a \"brown-robed Jedi Master\"."}, {"tag": "p", "text": "A few years later, Kenobi had found Luke and his friend Windy alone in the Jundland Wastes. The two youths had tried to ease their boredom by riding Windy's pet dewback Huey around in the Wastes. They had been thrown in one of the canyons. By dusk, Luke and Windy still hadn't found their way out of the canyon and had been cornered in a cave by a krayt dragon. The dragon ate Huey and would have devoured Luke and Windy had Kenobi not put it in a Force-induced sleep. Kenobi guided the pair back to the Lars farm. Upon arrival, Owen told Luke and his friend to go inside so they would be out of earshot, then he confronted and berated Kenobi."}, {"tag": "p", "text": "The reason for Owen's anger was that Kenobi had attempted to give Anakin Skywalker's lightsaber to Luke, feeling that Luke was old enough and should be allowed to have it. Owen refused to allow it because he believed the Jedi path was a destructive one. He told Kenobi that he didn't want Luke to make the same mistakes Anakin Skywalker did, saying that he felt Anakin should have never left his mother and gotten involved with the \"damn foolish idealistic Jedi crusaders\" in the first place. He vehemently told Kenobi to leave and to stay away."}, {"tag": "p", "text": "At some unspecified point, Kenobi thought of trying to track down and trace Outbound Flight as there were twenty Jedi amongst its number, possibly the largest group of Jedi in existence. What he didn't know is that Outbound Flight had been destroyed by Commander Mitth'raw'nuruodo and all the Jedi aboard had perished. He recorded what information he could gather into an electronic tome which Princess Leia and Han Solo later recovered in 8 ABY. Although they were not able to immediately unlock the data, C-3PO at least determined what was on the device."}, {"tag": "h3", "text": "Return (0 BBY)"}, {"tag": "h4", "text": "Taking another apprentice"}, {"tag": "p", "text": "In large part because of Kenobi's status as a survivor and fugitive of Order 66, Kenobi was also listed as one of the eight most wanted criminals in the Galactic Empire. Since he hadn't been sighted since the Battle of Utapau by the galaxy at large, his image used that of his Clone Wars-era self, which frequently appeared in Stormtrooper recruitment videos as late as 1 BBY-0 BBY."}, {"tag": "p", "text": "Thirty-two years after the Battle of Naboo, Kenobi rescued Luke Skywalker from Tusken Raiders while Luke was tracking the errant R2-D2, who insisted he was the property of, and carried a message for, Obi-Wan Kenobi. They returned to Obi-Wan's home, and Kenobi used the opportunity to finally present Luke with Anakin Skywalker's lightsaber. However, when Luke asked Kenobi about his father's death, Kenobi disguised the truth from him."}, {"tag": "p", "text": "In Obi-Wan's way of thinking, this was not completely untrue: Anakin Skywalker died the moment he betrayed the Jedi and chose the path of evil, completely becoming Darth Vader, much to the confusion of Luke."}, {"tag": "p", "text": "After seeing R2-D2's message from Princess Leia Organa asking for his assistance in delivering the schematics of the Death Star to Bail Organa on Alderaan, Kenobi realized that the time he had been waiting for had arrived."}, {"tag": "p", "text": "His self-imposed exile was over. He invited Luke to accompany him to Alderaan and aid the Rebellion, but Luke initially demurred, offering only to take Kenobi and the droids to Anchorhead. On their way, however, they came across the remains of a Jawa sandcrawler. Luke assumed it was the Sand People because there were Gaffi sticks and bantha tracks everywhere. But Kenobi knew that it was Imperial Stormtroopers because the tracks were side-by-side, while Sand People ride single file to hide their numbers. And the blast points were far too precise for Sand People. Luke recognized the dead Jawas as the same ones that had sold them the droids earlier. Deducing that the Stormtroopers could have learned where the droids were sold to. Against Kenobi's warnings, Luke raced home to find his aunt and uncle already killed."}, {"tag": "p", "text": "Upon returning to Kenobi, the formerly reluctant Luke decided he would go with Kenobi to Alderaan and learn about the Force like his father. Pleased with this answer, Kenobi took Luke and the droids to Mos Eisley spaceport to find transport to Alderaan. Using a Jedi mind trick, Kenobi got the group past several stormtroopers who stopped them, which amazed Luke. Kenobi also bailed Luke out of trouble with a dangerous criminal and his Aqualish friend in a cantina, although it resulted in Kenobi chopping off the Aqualish's arm. In the cantina, Kenobi met Chewbacca, first mate on the Millennium Falcon. After some negotiation, the ship's captain, Han Solo agreed to fly them to Alderaan. As they were about to leave, they were ambushed in the hangar by several Imperial Stormtroopers, but they evaded capture and made a successful hyperspace jump to the Alderaan system."}, {"tag": "h4", "text": "Last stand on the Death Star"}, {"tag": "p", "text": "Before they could reach their destination, Alderaan was destroyed by the Imperial Super Weapon, the Death Star. The Falcon was captured by the Death Star. Kenobi and the others managed to elude capture, and the others even rescued the captive Princess Leia while Kenobi deactivated the tractor beam so the Falcon could escape. To escape, Kenobi tricked a stormtrooper, KE-829 into thinking there was something behind him using the Force, eventually attributing it to nothing more than outgassing."}, {"tag": "p", "text": "On his way back to the ship, Kenobi encountered his old student, Darth Vader. Vader had earlier surmised to Grand Moff Tarkin that Kenobi had intended from the beginning to meet him in combat. Kenobi distracted Vader and his stormtroopers in a fierce duel. Kenobi allowed Luke and the rest of the crew to reach the Falcon. As their battle progressed, Kenobi responded to Vader's mockings with cryptic warnings."}, {"tag": "p", "text": "Upon seeing Luke, he sacrificed himself for Luke and the Falcon's crew to escape. Kenobi let down his guard and concentrated for a moment, vanishing to the spiritual plane; his body disappearing entirely just as Vader's lightsaber (instead of severing his body) passed through his empty robe. Kenobi became a Force ghost, and was more powerful than ever."}, {"tag": "h3", "text": "After Death (0 BBY–9 ABY)"}, {"tag": "p", "text": "Kenobi did not vanish entirely. In accordance with his prediction, he became a Force ghost that could guide and counsel the young Luke from afar."}, {"tag": "p", "text": "The spirit of Kenobi played a vital role in the Battle of Yavin, for he was able to guide Skywalker in successfully destroying the Death Star I, instructing Luke to \"Use the Force\" when firing his proton torpedoes. When Luke was shocked into a catatonic state by the dark presence of Darth Vader, Kenobi appeared in a dream to help him fight his fear of the Dark Lord. Later, his spirit temporarily took control of Luke's body, allowing him to survive his first duel with Darth Vader on the mist-shrouded planet of Mimban, and even allowed Luke to knock the Dark Lord into a deep pit. His guidance also aided Luke in destroying a rogue moon that threatened the New Academy for space pilots. Kenobi's spirit also later appeared on Mustafar."}, {"tag": "p", "text": "Obi-Wan contacted Luke again on Drunost. He told to Luke to stretch out with the Force. Luke did as instructed and was able to sense danger from an imminent attack. Later on the Millennium Falcon when confronting pirates, Obi-Wan again spoke to Luke and told him to stretch out again with the Force. Luke did as he was told and was able to sense another ship in back of the Falcon. Luke assumed it was Pirate backup but Obi-Wan told him to focus his thoughts and Luke realized that the ship was not an enemy. Shortly after that, while held prisoner Obi-Wan again contacted Luke and told him that Leia was in danger. He told Luke where she was and helped him use the Force to uncover a weapons cache. When Luke suggested that Obi-Wan could help him more, he was admonished by Kenobi, who told him that he could not carry him through his journey, only guide him and teach him. Luke apologized and said he understood."}, {"tag": "p", "text": "Kenobi's memory was also exploited by the Empire. A few months after the Battle of Yavin Darth Vader devised a plan to capture Luke using an actor posing as Kenobi. Using this decoy Vader planned to lure Luke to the planet Aridus. Imperial surgeons and technicians also altered the actor's appearance and hid devices on the actor to simulate the Force. The false Kenobi was delivered to Aridus to help the rebellion being staged there, news of his exploits soon reached Luke's ears. The actor was ordered to lure Luke to the Iron Tower on the planet where he would meet Vader alone. The actor became so obsessed with this challenging role that he began to respect the dead Kenobi, and in the end sabotaged Vader's plan by destroying the Iron Tower. However, this cost the actor his life."}, {"tag": "p", "text": "Luke was not the only person Kenobi appeared to, having been seen on the planet Mustafar. He assisted an anonymous spacer in the destruction of a Dark Jedi and a very powerful crystal."}, {"tag": "p", "text": "On Hoth, when Luke was almost dead from a wampa attack and exposure to the harsh climate, Kenobi appeared to him and instructed him to go to the Dagobah system for further training with Yoda, \"the Jedi Master who instructed me.\" He also helped to convince Yoda that Luke was ready to be trained, reminding him that he himself had been much like Luke when Yoda had trained him to be an apprentice. Yoda proceeded to train young Luke, before the latter received a vision of his friends being tortured on Bespin by Darth Vader. As the young Skywalker prepared to leave, both Yoda and Kenobi attempted to dissuade him. Kenobi warned Luke that if he chooses to face Vader, he must do so alone, for he cannot interfere. As Luke departs Dagobah, Kenobi worried that the Jedi may have lost their last hope. However, Yoda reminded him of the other Skywalker, Leia."}, {"tag": "p", "text": "About a year later, he reappeared after the death of Yoda to explain why he did not tell Luke the truth about his father. Though Luke wanted to believe that there was still good in his father, echoing Padmé's belief from twenty-three years ago, Kenobi no longer held that belief. He tells Luke that he must face his destiny by confronting Vader once again. Luke asks what did Yoda mean by there's another Skywalker. Kenobi confesses that Leia was Luke's sister, though he warns Luke about the powers of the Emperor, the tyrant later being destroyed by Anakin Skywalker, an act his onetime Master, observing the duel from the Netherworld of the Force, could barely believe even after seeing it. Quickly greeting the redeemed spirit of Anakin as he entered the afterlife, Kenobi was able to teach his former Padawan how to revisit corporeal space, and was seen shortly after the Battle of Endor, standing next to the spirits of Anakin Skywalker and Yoda as they watched Luke and the other rebels celebrate their momentous victory, although Luke was the only one able to see them."}, {"tag": "p", "text": "It was also thanks to Jedi information kept safe at Kenobi's home on Tatooine that Luke was able to find out how to make his own lightsaber before the Battle of Endor."}, {"tag": "p", "text": "Kenobi spoke to Luke again, immediately after the Battle of Endor, warning him of the threat posed by the invading Ssi-ruuvi Imperium, and would also help Luke find the fabled Lost City of the Jedi."}, {"tag": "p", "text": "Kenobi, Yoda, and Anakin Skywalker again appeared to Luke in spirit form a few months later to warn him of the dangers presented by the Dark Lord of Belderone, Flint, apprentice of Lady Lumiya. Because of their warning, Luke was able to redeem Flint, leaving Lumiya without an apprentice."}, {"tag": "p", "text": "In 9 ABY, Kenobi, still a spirit, visited Luke for the last time in a dream. Kenobi told Luke that he must move on from his spirit form to another realm. As Kenobi explained it, from the time of his death until then, Kenobi's spirit had been in an intermediate stage between life and the afterlife. Luke was distressed that he would lose Kenobi's guidance, but he comforted Luke with the knowledge that he was not the last of the old Jedi, but rather the first of a new group of Jedi."}, {"tag": "p", "text": "Luke would only hear his ghostly mentor's voice again during his son's birth, a son he named Ben to honor Kenobi's memory, and again when watching the living planet Zonama Sekot leave at the end of the Yuuzhan Vong War. Kenobi said, \"She's leaving\", to which Luke told Mara, \"Ben's words, not mine.\""}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "As mentor to the first Jedi of the new order and one of the earliest heroes of the Rebel Alliance, Kenobi's legacy would continue long after his death. When Luke lost his lightsaber in the duel with Darth Vader on Bespin, he returned to Kenobi's hut on Tatooine to construct a new one from instructions left in Kenobi's journals. Kenobi's spartan hovel was actually a treasure trove of Jedi information, one of the very few repositories left after the Great Jedi Purge. The information contained there would be a great help to Luke in his reconstruction of the Order."}, {"tag": "p", "text": "His name was commemorated with the Obi-Wan, first of the Nebula-class Star Destroyers as well as the lightsaber crystal Kenobi's Legacy."}, {"tag": "p", "text": "Kenobi's Jedi legacy also continued in his namesake Ben Skywalker, the grandson of his first apprentice Anakin Skywalker and the son of his second apprentice Luke Skywalker."}, {"tag": "p", "text": "Tacticians, both from the Galactic Empire and Rebel Alliance would pay homage to the General through the study of the Kenobi Offensive, a starship maneuver developed by Kenobi during the Clone Wars. Rebel pilots would also strive to be awarded the Kenobi Medallion, named after the Jedi Master."}, {"tag": "p", "text": "Kenobi's lightsaber was inside Vader's TIE Advanced during the Battle of Yavin. Apparently, the weapon was later recovered by the Empire but a group of Jedi including Tionne Solusar, Ikrit, Anakin Solo, Tahiri Veila, R2-D2 and Uldir Lochett discovered the blade at Vader's fortress of Bast Castle's on Vjun in 22 ABY. They encountered \"Mage\" Orloc and his henchmen during the expedition though they managed to escape with the blade and an ancient Jedi holocron."}, {"tag": "p", "text": "However, Uldir Lochett, a classmate of Anakin Solo, stole the lightsaber believing that it would make him a great Jedi. He then went to find Orloc since he believed that Orloc possessed great powers and found him at Exis Station. However, Uldir would later learn that Orloc was actually a fraud since he possessed no Force powers at all. Luckily for Uldir, his Jedi companions came to his rescue and defeated Orloc. The weapon and the holocron were recovered and returned to the Jedi Praxeum."}, {"tag": "p", "text": "The Sith cult known as the Jensaarai, which taught that the Jedi had fallen to the dark side and that the Sith knew the truth, believed that the roles of Darth Vader and Kenobi were reversed, as they saw Kenobi as the monster. This was corrected when the cult was integrated into the greater Jedi Order by Luke Skywalker."}, {"tag": "p", "text": "Luke Skywalker finally met with his master, one last time, after the Recapture of Coruscant in 29 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his youth, the loyal and dedicated Obi-Wan Kenobi possessed a dry sense of humor and sarcastic wit, yet he dealt with a lot of emotional anxiety. Yoda said that he sensed Qui-Gon Jinn's defiance in him, but spoke very highly of him nonetheless. Jinn himself reflected upon Obi-Wan's considerable knowledge and potential; he also considered his Padawan a lot wiser than him. Despite having been apprenticed to the radical Qui-Gon Jinn, Kenobi was relatively orthodox in his views. Kenobi had a strong friendship with Commander Cody, who saved his life aboard an Arquitens-class light cruiser when the corridor was blown off by General Grievous. Cody reached out and grabbed Kenobi's hand before the General was sucked into the vacuum of space."}, {"tag": "p", "text": "As a young Jedi Knight, Kenobi was cynical, though wise beyond his years. His humble and soft-spoken demeanor belied his warrior prowess. Despite his numerous complaints during flight, he was also a skilled pilot. In many ways, he represented the strength of the old Jedi Order: steadfast, selfless, and modest. His later skill at resolving disputes without a single battle would earn him the sobriquet The Negotiator."}, {"tag": "p", "text": "Over time, Kenobi lost some of his youthful audacity and assumed the role of a more cautious and conservative mentor to Anakin Skywalker, who was in many ways his opposite in personality. Kenobi carefully measured his actions in any situation, garnering him the aforementioned nom de guerre. Kenobi was also known to be an accomplished storyteller. While hiding in the Jundland Wastes in his later years, he appeared as a kindly and eccentric old hermit (or, in Owen Lars' words, \"That wizard is just a crazy old man\") to those not familiar with the ways of the Jedi. In his final days, Kenobi retained his traits of patience and foresight as well as gaining some of the boldness reminiscent of his youth."}, {"tag": "p", "text": "Obi-Wan often thought out plans and strategies rather than leaping into action. He would usually place his hand on his chin or stroke his beard as he thought. This was a common trait of the Jedi Master, one that his apprentice Anakin Skywalker did not practice very often."}, {"tag": "h3", "text": "Romantic relationships"}, {"tag": "h4", "text": "Cerasi"}, {"tag": "p", "text": "Obi-Wan's first known experience with romance came in the form of Cerasi, a girl he met on Melida/Daan. She was a member of a group called the Young and was fighting to stop a civil war. Obi-Wan became attracted to her, and chose to leave the Jedi Order to help her. Sadly, Cerasi was mortally wounded shortly after he parted ways with Qui-Gon Jinn, and she died in his arms. The only Jedi he ever confided his feelings for Cerasi was Bant Eerin."}, {"tag": "h4", "text": "Lena Cobral"}, {"tag": "p", "text": "The recently widowed Lena Cobral may have been a few years older than Kenobi, but that did not stop him from developing a brief infatuation for her during his time on Frego. He admired her for her courage and strength, and could read her intentions through the Force so as to see her honesty. He stood by her side, looking to comfort and protect her as she persisted in her goal of liberating her homeworld from the criminal grasp of her late husband's family. Whenever he thought that Jinn was criticizing Lena or turning his back on Lena, he would be ready to defend her. In the end, the two Jedi helped Lena deliver her testimony to the Senate."}, {"tag": "h4", "text": "Siri Tachi"}, {"tag": "p", "text": "Siri Tachi was a youngling along with Kenobi. After Kenobi returned from his temporary desertion of the Order from Melida/Daan, Tachi strongly held it against him since she came to believe that he didn't take his loyalty to the Jedi seriously, and they bickered often. However, this hostility came to an end after a mission to Kegan. The two were captured and forced to work together to escape. Siri realized that Kenobi was truly loyal to the Jedi, and they became friends. Kenobi later taught Siri patience after he rescued her from the bounty hunter Ona Nobis."}, {"tag": "p", "text": "While apprenticed to Qui-Gon Jinn, Kenobi went on other joint missions with Master Adi Gallia and Siri Tachi. While involved in a life-threatening situation, the two Padawans acknowledged that they were in love, but never acted on their feelings for each other. They instead agreed they would focus on their duty as Jedi. When the two were reunited during what would be Siri's last mission, the two admitted that they still loved each other. When Siri died at the hands of a bounty hunter, Kenobi was heartbroken and almost killed the bounty hunter in anger. But he controlled his anger, and later realized that, despite losing his love, he could still go on."}, {"tag": "h4", "text": "Satine Kryze"}, {"tag": "p", "text": "As Qui-Gon Jinn's Padawan, Kenobi went on a mission to protect Duchess Satine Kryze. They were always on the run from bounty hunters and they never knew what would happen next. Kenobi saved Kryze in at least one instance when he was a Padawan."}, {"tag": "p", "text": "During the Clone Wars, their feelings for each other resurfaced, however, Kryze ended up being murdered in cold blood by the sith lord Darth Maul right in front of Kenobi's eyes she died in his arms professing her love for the Jedi Master. Their relationship also never developed and they broke off the affair to focus on their mutual responsibilities as peacekeepers. During his self-exile, he chose the name Ben for himself due to Satine calling him that in private and admitted he liked it."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Despite his preference for diplomacy, Master Kenobi was one of the greatest swordsmen and Force-users in Jedi history."}, {"tag": "p", "text": "As a young Jedi Padawan, Kenobi showed much potential, through feats such as resisting a memory wipe (being renewed) at the hands of the Syndicate, and defeating a corrupted Bruck Chun in a lightsaber duel. He accomplished the prior by placing Force barriers all around his mind, something only a Jedi Master should be able to do.[source?] This displayed not only his strength in the Force but also his strength of character.[source?]"}, {"tag": "h3", "text": "Lightsaber training"}, {"tag": "p", "text": "Obi-Wan Kenobi was one of the greatest lightsaber duelists of his time. A natural swordsman, Kenobi's ability was evident even at a young age. During his training under Qui-Gon Jinn, Kenobi chose to specialize in Ataru, his relatively advanced skills reinforced by his youth and stamina, which helped compensate for his relative inexperience. While he relied on the acrobatics to flank his opponents, and to facilitate his strong penchant for physical attacks, Kenobi largely eschewed the more impractical elements of Ataru, such as the open flourishes, favoring more simplistic and direct moves. In addition to Ataru, Kenobi also studied Shien, as evidenced by his accurate blast-deflections and his occasional use for the reversed grip, and Niman, to develop his ability to incorporate Force abilities into his fighting form. He also studied the martial art Tae-Jitsu, and was very fond of chaining hand-to-hand combat strikes into his lightsaber sequences. His degree of skill with this martial art was such that he was able to break the knee of the hulking Savage Opress with a well placed kick, though it should be noted that Opress's knee had been weakened from repeated trauma earlier in the duel. Kenobi also displayed an early interest in studying Form VII, specifically Mace Windu's Vaapad variant, but Qui-Gon refused to let him study it. Ultimately, Qui-Gon Jinn's death due to Ataru's lack of defensive capabilities prompted Kenobi to abandon Form IV as his primary style, but he mastered it nonetheless. Kenobi began studying the defensive Soresu, intending to create a hybrid between it and Ataru to compensate for Form IV's aforementioned lack of defense. Though Soresu eventually became his primary fighting form, he implemented elements of Ataru into his swordplay from time to time."}, {"tag": "p", "text": "Ten years of study into Form III resulted in Kenobi developing an extraordinary amount of proficiency in the form. His tight defense and energy-efficient moves stood him in good stead against masterful gunslingers such as Jango Fett, or during the chaotic firefights of the First Battle of Geonosis. However, Kenobi's Soresu proved unable to effectively counter Dooku's skills during their first confrontation. On that occasion, Dooku's elegant Makashi strokes and jabs worked away at Kenobi's defense; many of Kenobi's cutting parries missed Dooku's blade entirely, while Dooku's feints confused the Jedi and forced him to retreat, ultimately bringing him down. Over the course of the Clone Wars, Kenobi continued to develop his technique. His blast-deflection skills were further honed to the point where Kenobi could literally walk unscathed through what were described as hornet-swarms of blasterfire, single-handedly deflecting blasts from all directions simultaneously. Thousands of hours of sparring and practice sessions considerably advanced his skills as a duelist as well. Even unarmed, Kenobi was a formidable opponent, evading enemy attacks and working his way inside their defense to physically assault them, as he did against Asajj Ventress and Pre Vizsla. In addition to Soresu, Kenobi would also master and incorporate elements of Shii-Cho and Niman into his fighting style. He also was highly well versed in the art of Jar'Kai, which was perhaps most prominently displayed during his duel with Darth Maul and Savage Opress, as he proved proficient enough to hold his own against both brothers and he even managed to break Opress's left knee and sever his left arm. The dual ultimately ended as a stalemate when Maul used his Force powers to briefly incapacitate Kenobi, giving the Sith brothers time to escape. Earlier on, he momentarily used Jar'Kai against Asajj Ventress, General Grievous, and Cad Bane."}, {"tag": "p", "text": "By the end of the war, Kenobi's study into Soresu had resulted in absolute mastery of the style. His skill was such that he was considered by Mace Windu not to simply be a master of Soresu, but to be the master of Soresu. In his final duel with Dooku, Kenobi caught the Count off-guard with his advanced application, with Kenobi's simplicity and efficiency as well as also his bewildering speed and precision being praised by Dooku, and was able to fight him to a standstill, to the point that Dooku recognized that he couldn't defeat Kenobi in blade-work. Therefore, he relied on his Force abilities to defeat Kenobi, twice using telekinetic attacks to floor the Jedi Master. In his duel with Grievous, Kenobi provided one of his purest applications of Soresu. His blade's intricate pattern of blocks and parries moved just fast enough to subtly interfere with Grievous' multiple strikes, while his slight dodges and shifts of stance allowed him to simply evade the rest. His mastery allowed him to comfortably counter up to eighteen of Grievous's strikes per second. When Grievous intensified his attack, Kenobi stopped stonewalling the general and simply began altering the angle of his parries, cutting off two of Grievous' mechanical hands. Kenobi proved to be one of the only Jedi able to engage Darth Vader and survive, as his Soresu mastery perfectly countered Vader's angry Form V. Kenobi simply gave ground before Vader's onslaught, waiting until Vader grew frustrated and overconfident, and then dismembering the hapless Sith Lord when his defense lapsed."}, {"tag": "p", "text": "By the time of his rematch with Vader on the Death Star, however, Kenobi's seventeen years of not duelling, apart from the one point where he fought and came out on top over A'Sharad Hett, had made him out of practice, causing his skills to atrophy to an extent. However, Kenobi retained enough skill in Form III to be able to fight against Vader's newly improved skills well-enough that even the Dark Lord had to praise Kenobi's skills and acknowledged them enough that he opted for a cautious, controlled assault instead of an all-out attack despite Kenobi's older age due to having previously learned from his mistake in Mustafar. Although he was not able to find any openings to exploit, it was still impressive that Kenobi was able to still predict all of Vader's attacks and counter them, considering how Vader's new style contained elements of all forms of lightsaber combat and he was even able to briefly force Vader into the defensive with a flurry of attacks when the Dark Lord was off-guard. Ultimately, however, due to his age, lack of practice, and the sheer physical force of Vader's attacks, Kenobi recognized that his defeat was inevitable despite having put up a good fight and rather than continue the fight, he opted to sacrifice his physical self and become one with the Force. In this way, he taught both of his Skywalker students one final lesson."}, {"tag": "h3", "text": "Force powers"}, {"tag": "p", "text": "Though Kenobi focused largely on lightsaber combat he was also very skilled and powerful in use of the Force. At one point, Anakin compared Kenobi to Mace Windu in terms of Force power. He was trained in use of the Mind trick, Force persuasion and the more advanced Dominate Mind skill. As instructed by Qui-Gon Jinn's Force ghost, Kenobi eventually learned the ability to become a spirit after death, like his former Master. He would later put this skill to good use, guiding and counseling Luke Skywalker during the Rebellion."}, {"tag": "p", "text": "Kenobi was also capable of a very powerful Force Push, which he used consistently throughout the Clone Wars and against Grievous during their final duel in 19 BBY. He later displayed his mastery of Force Push during his duel with Darth Vader on Mustafar, as neither of them were able to overpower the other while simultaneously using the ability. The two struggled against each other for a short time, and though Kenobi was clearly giving ground, they both ended up being hurled in opposite directions across the room they were in. The fact that Vader's connection to the Force was, at the time, stronger than any known Force user in history further exemplifies Kenobi's mastery of the technique. Obi-Wan was capable of other telekinetic feats and could use the Force to increase his body's endurance and agility, amplifying his speed to such an extent that he could literally disappear from sight in a blur, either to avoid attacks or to strike first with his own. Kenobi was also capable of using the Force to perform extensive acrobatics, allowing him to leap huge distances and cover much more ground in a much shorter amount of time. Obi-wan was adept at the saber throw, as demonstrated during the Clone Wars to destroy a droideka."}, {"tag": "p", "text": "Apart from these impressive applications of the Force, Kenobi was known to be incredibly adept in the use of Animal friendship, allowing him to exert considerable influence over otherwise untamable beasts. During the Battle of Ryloth, the Jedi Master was able to calm and control a large group of starved, vicious and attacking gutkurrs."}, {"tag": "p", "text": "In addition, Kenobi was able to use Force deflection and Force repulse, both of which he utilized masterfully during his fight with the bounty hunter Durge on Muunilinst. During their initial bout, Kenobi was deprived of his lightsaber and forced to deflect blasts from both a rapid-firing dart launcher and a flamethrower using only the Force. This was all the more impressive considering that flamethrowers were so difficult to counter with the Force that they were considered a favorite among Jedi hunters. He later demonstrated the ability to deflect blaster bolts from a destroyer droid with the Force. During Kenobi's second bout with Durge, which occurred only a few minutes after their first encounter, Durge absorbed the Jedi Master into his body and attempted to smother him. However, Kenobi managed to use a Force Repulse (or some variation of the technique), to destroy the bounty hunter's body from within. Although largely unused on anything other than droids, the Jedi Council member was proficient in the use of the Force crush ability, which he used on one occasion to dispatch pairs of assassin droids. Kenobi was known to have some knowledge of Tutaminis in his repertoire. He was also capable of using his lightsaber to ground Force lightning, as he demonstrated against Dooku on Geonosis."}, {"tag": "p", "text": "Kenobi was also able to imitate sounds using the Force, like when he imitated a Krayt Dragon's roar scaring off the Tusken Raiders who were attacking Luke."}, {"tag": "h3", "text": "Other abilities"}, {"tag": "p", "text": "Obi-Wan Kenobi proved himself to be a great military strategist and a highly studious man, which resulted in his attaining the rank of High General along with Mace Windu during the Clone Wars. He personally led his troops to many famous victories on worlds such as: Raxus Prime, Muunilinst and Utapau, as well as countless others. His persuasive demeanor earned him the moniker of \"The Negotiator,\" and his tactical skills allowed the Republic to minimize Clone casualties during many of their battles. His use of Advanced Recon Commandos and Lance Troopers on Muunilinst were key elements to the victory of the Republic."}, {"tag": "p", "text": "His strategic ability was also shown in his lightsaber combat. Applying the principles of Soresu and Sokan, he often took advantage of his superior defensive capabilities and position on the battlefield to win his battles with as little effort exhausted as possible. He used this particular strategy to tire his former Padawan out and sever his legs and left arm on Mustafar."}, {"tag": "p", "text": "Despite his dislike of flying, Kenobi was an excellent pilot. As a Padawan, he was known as one of the greatest pilots in the Jedi Order, expressing great interest in the early Jedi starfighter program. During the Clone Wars, he led many attacks from the cockpit of his Jedi starfighter or his Jedi interceptor, often designated as Red Leader. He could repair all kinds of craft and machines as well as use computers to enhance his various skills. Constantly monitoring the hyperdrive generator of the Naboo Royal Starship, Obi-Wan readied the core for repairs. Obi-Wan then used his technical expertise to repair the hyperdrive on Queen Amidala's vessel."}, {"tag": "p", "text": "Kenobi was also a skilled hand to hand combatant. Trained at the Jedi Temple and having undergone extensive sparring matches with Masters Jinn and Windu, he developed a considerable level of skill in unarmed combat, enough so to outclass Pre Vizsla, leader of the Death Watch, in both their bouts of the lightsaber as well as their fists. During his duel with Jango Fett on Kamino, Kenobi was briefly deprived of his lightsaber, and fought the bounty hunter in unarmed combat."}, {"tag": "p", "text": "Though he preferred lightsabers, Obi-Wan was an excellent marksman, as demonstrated during his time as \"Rako Hardeen\" in the \"Box,\" something he boasted of to Anakin."}, {"tag": "p", "text": "In his later years, Kenobi apparently learned to understand Shyriiwook and other alien languages."}, {"tag": "h2", "text": "Lightsabers"}, {"tag": "p", "text": "When Kenobi was a youngling and Padawan, he was given a lightsaber by an unknown Jedi, probably Yoda, for training. His first Padawan lightsaber accompanied him until an unknown circumstance. Kenobi built a new lightsaber based on the designs of his friend Quinlan Vos and his Master Qui-Gon Jinn."}, {"tag": "p", "text": "The second Padawan lightsaber was with him until the Battle of Naboo, when Darth Maul disarmed Kenobi and kicked his lightsaber down a generator shaft. To defeat the Sith, Kenobi used Force pull to reach for his fallen Master's discarded lightsaber and kill Maul. There were debates as to what happened to Kenobi's second Padawan lightsaber. Either he somehow retrieved his saber from the pit or replaced his lost one by making an exact replica. He used Jinn's lightsaber for an unknown amount of time."}, {"tag": "p", "text": "Ten years after his Master's death and the approval of his training of young Anakin Skywalker, Kenobi still used the same design as his second Padawan lightsaber. This lightsaber was lost when Kenobi was captured by the Separatists on Geonosis. During the Battle of Geonosis, he was given a temporary replacement by one of the Jedi in the task force that had come to rescue him, Skywalker and Senator Amidala. Kenobi later reacquired his own lightsaber and used it during the early part of the Clone Wars."}, {"tag": "p", "text": "After being promoted to the rank of Jedi Master, Kenobi built what was to be his final lightsaber. This last one was based on the design of his first Padawan saber. During his exile, he made some adjustments with its parts, such as changing the belt fastener from a clip to a ring. It was either built, or later customized, to work underwater."}, {"tag": "p", "text": "Even after his death, he left a journal of how to create a lightsaber. Luke used that journal to build his first lightsaber based on the design of Kenobi's. In the New Jedi Order, that design provided inspiration to the newer generations, like Jaina and Anakin Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Obi-Wan Kenobi is played by Ewan McGregor in The Phantom Menace, Attack of the Clones and Revenge of the Sith and Sir Alec Guinness in A New Hope, The Empire Strikes Back and Return of the Jedi."}, {"tag": "p", "text": "In the Clone Wars micro-series, its sequel series The Clone Wars and the video games Star Wars: Battlefront II and Revenge of the Sith, Kenobi is voiced by James Arnold Taylor. David Davies provided the voice in the game Star Wars: Rogue Squadron II: Rogue Leader, while Timothy Omundson provided his voice in Star Wars: Rogue Squadron III: Rebel Strike. Lewis Macleod provided the voice of Obi-Wan Kenobi in Star Wars: Galactic Battlegrounds, Star Wars: Obi-Wan and Star Wars: Super Bombad Racing. In the radio dramatizations, he was voiced by Bernard Behrens."}, {"tag": "p", "text": "Despite great critical acclaim, Alec Guinness disliked being associated solely with the role of Kenobi. To limit his role in the trilogy, it was reportedly Guinness's own idea that Ben should die on the Death Star.[source?]"}, {"tag": "p", "text": "However, The Making of Star Wars: The Definitive Story Behind the Original Film stated that George Lucas originally came up with the idea of having Ben die, to which Guinness initially objected. By explaining that Ben would have little to do in the story after the Millennium Falcon escaped the Death Star, Lucas convinced him to allow it."}, {"tag": "p", "text": "Ewan McGregor's stunt double in Episodes II and III, Nash Edgerton, is the real-life brother of Joel Edgerton, who played Owen Lars in those two films."}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "In the early drafts of Star Wars, Luke Skywalker was the aged general returning to galactic affairs. Rewrites would change Luke to the hero and Kenobi into the aging mentor."}, {"tag": "p", "text": "In the third draft of Star Wars, Kenobi is said to be the author of The Diary of the Clone Wars, an important book that was studied by a young Luke."}, {"tag": "p", "text": "A trait of the early Jedi concepts was a piercing warrior cry that would frighten all those who challenged them. This became the krayt dragon call that Kenobi performs to frighten the Tusken Raiders. In the 2004 DVD release of A New Hope, the roar was changed to mimic that of his mount Boga from Revenge of the Sith. In the 2011 Blu-ray release, this call was changed yet again."}, {"tag": "p", "text": "The name \"Obi-Wan\" curiously resembles a droid name (e.g. Emkay (MK), Threepio (3PO), Artoo (R2) etc.), and theoretically it could also be written as OB1 (KNO-B)."}, {"tag": "p", "text": "Kenobi and Anakin Skywalker/Darth Vader are the only organic characters to appear in all six movies; the inorganic ones are R2-D2 and C-3PO."}, {"tag": "p", "text": "In the Wii version of the Star Wars: The Force Unleashed video game, if you enter BENKENOBI as a cheat code, you can play as Obi-Wan Kenobi."}, {"tag": "p", "text": "In the movie Indiana Jones and the Temple of Doom and its novelization, Obi Wan is the name of a nightclub."}, {"tag": "h3", "text": "Birth place"}, {"tag": "p", "text": "The novelization of Revenge of the Sith indicates that he speaks with a Coruscanti accent, although, as he was trained at the Jedi Temple on that planet, this could not be considered a clue as to his homeworld. Star Wars: Attack of the Clones: The Visual Dictionary identifies Kenobi as Coruscanti in the Dexter Jettster section, but again, since he was raised in the Jedi Temple on Coruscant, this doesn't necessarily indicate the planet of his birth. Star Wars: The Clone Wars Character Encyclopedia and Star Wars Character Encyclopedia also stated that Coruscant is Kenobi's homeworld. Early printings of the The Rebel Alliance Sourcebook and Star Wars Screen Entertainment both stated that Kenobi was born on Tatooine, and while his homeworld had yet to be revealed, this was highly unlikely, considering the planet's distance from the Core and the fact that Anakin Skywalker resided there and wasn't discovered until he was nine years of age. Furthermore, these two sources were written during a time when it was widely (but ultimately erroneously) accepted that Kenobi was the estranged brother of Owen Lars, who, at the time, was also believed to have been born on Tatooine before it was revealed he was born on Ator."}, {"tag": "p", "text": "On August 14, 2010, Obi-Wan's homeworld was finally named in an interview between George Lucas and Jon Stewart of The Daily Show at Celebration V. A fan-submitted question came up regarding the name of the homeworld, and Lucas already had a name for this planet, Stewjon."}, {"tag": "h3", "text": "Lightsaber debate"}, {"tag": "p", "text": "There have been debates about Kenobi's lightsaber during Revenge of the Sith due to his appearance in the Clone Wars animated series. Some say he wields the same lightsaber in Episode III as he wielded in Episodes I and II. Kenobi constructed his final lightsaber during the Clone Wars; however, there are quite a few scenes in the Clone Wars animated series that show his lightsaber quite clearly, and the lightsaber is the same one he wielded during The Phantom Menace and Attack of the Clones. It's possible that Kenobi lost that lightsaber during his imprisonment on Rattatak. Although some companies that make replicas, such as Master Replicas, use Kenobi's \"final\" design for the Revenge of the Sith model, other lightsaber replica makers claim that he wielded the same lightsaber in Episode III as in I and II. Several scenes in Revenge of the Sith show his lightsaber clearly, all of them showing his lightsaber resembling his final lightsaber, and no shots show the lightsaber he wielded in Episodes I and II."}, {"tag": "h3", "text": "Non-canon storylines"}, {"tag": "p", "text": "Around 16 BBY, Kenobi was finally tracked down by an individual he thought he had defeated many years ago, Darth Maul, rebuilt with cybernetic legs. Maul claimed to have been tracking Kenobi for years and only just missing him on Kamino, Geonosis and Mustafar and indeed having killed witnesses on Polis Massa before he had finally gained crucial information in Mos Espa from Watto, whom he had also killed. Maul proceeded to the Lars homestead where he threatened to kill a toddler-aged Luke Skywalker if Kenobi did not show himself."}, {"tag": "p", "text": "Kenobi, not wanting any harm to come to Luke, revealed himself from his hiding place in the sand and attacked Maul immediately. A ferocious battle ensued in which Maul lost a further arm as well as some of his horns before Kenobi was able to beat him into submission. With his lightsaber hilt to Maul's forehead and his finger on the blade-ignition button, Kenobi hesitated to execute his helpless opponent, but had the decision taken out of his hands when the revived Owen blew the former Sith's head apart with his damaged rifle. Kenobi said he would take the body and burn it in the Dune Sea, to which Owen replied, \"I told you I'd keep him safe, and I will. Even if that means from you. You don't come back here. Understand?\" Kenobi departed with Maul's corpse, speaking to Luke through the Force, assuring him \"Don't worry. I'll be right here... even if you can't see me.\""}, {"tag": "p", "text": "In the Star Wars Episode III: Revenge of the Sith video game, there is an option to play as Darth Vader during his duel with Kenobi. The level plays exactly as the canonical level until the ending. As Kenobi is on the hill warning Vader \"don't try it,\" Vader flips over Kenobi and stabs him in the back before kicking his body down towards the lava river."}, {"tag": "p", "text": "In Star Wars: The Force Unleashed: Ultimate Sith Edition, Lord Starkiller comes to Tatooine searching for R2-D2 and C-3PO, who have the plans to the Death Star. Starkiller tracks them to Docking Bay 94, and in an attempt to hold off the dark assassin, Kenobi duels Starkiller. The more experienced Kenobi is no match for the more powerful Starkiller, and Starkiller runs Kenobi through with his lightsaber before hurling him into the Millennium Falcon engines. Kenobi returns instantly as a blue Force ghost and is again defeated by Starkiller through the use of Force powers. In the non-canon Hoth level, the title crawl mentions that Luke has been learning the ways of the Force from Kenobi's spirit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}