{"url": "Obi-Wan_and_Anakin_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Obi-Wan and Anakin"], "nodes": [{"tag": "h1", "text": "Obi-Wan and Anakin 5"}, {"tag": "p", "text": "Obi-Wan and Anakin 5 is the fifth and final issue of the canon comic book miniseries Star Wars: Obi-Wan and Anakin. The issue was written by Charles Soule, illustrated by Marco Checchetto, and published on May 25, 2016 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "War breaks out…with our Jedi caught in the middle! Master and apprentice come to an important realization. Marvel's first Jedi-centric miniseries draws to a dramatic close!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Winning new allies"}, {"tag": "p", "text": "At the Fortress-Home of the Open on Carnelion IV, a bound Anakin Skywalker watches as Kolara asks the other Open youth what they should do. One of them believes that the Scavenger is the only one out there able to send a signal strong enough to reach offworld. He thinks that \"Mother\" Pran and the other adults have taken the war machines to kill the Scavenger, whom they believe to be a male"}, {"tag": "p", "text": "Kolara responds that that they don't know whether the \"Scavenger\" is a man but she thinks that they should do something. A third Open youth points out that the adults took all the airguns and walkers. He thinks that it will be unsafe to walk through the Celadon Sea. Skywalker offers to help and Kolara apologizes for kidnapping him. She explains that Mother Pran is their leader and asks Skywalker if he is hurt. Skywalker says he is fine and asks who is the Scavenger.\""}, {"tag": "p", "text": "Kolara says that the \"Scavenger\" is a mysterious person who lives in the wastes under the Celadon Sea. The kite that they saw on the airgun was one of her many gifts, which Kolara describes as coming from the world before. Kolara explains that the scavenger sends them beautiful gifts but can't describe the word for it. Anakin tells her that the Scavenger's works are art. Anakin says that the Open and Closed want the Scavenger dead because they remind them of The World That Was."}, {"tag": "p", "text": "A dark-skinned youth asks Kolara who is their prisoner. Kolara introduces Anakin as their Skygift. When the dark-skinned youth says he is perplexed that Anakin knows so much about their business, Anakin asks the youths how many of them have kept art from the Scavenger. All of them admit to keeping the Scavenger's art. Anakin then convinces the Open youth to help him save the Scavenger from being killed by the Open."}, {"tag": "h3", "text": "Defending the Scavenger"}, {"tag": "p", "text": "Inside Sera's fortress museum, Sera explains to Jedi Knight Obi-Wan Kenobi that she used an old starship to send a signal offworld but that it broke soon. She asks if Kenobi can fix it but he lacks the skills. Kenobi says his Padawan Anakin could help. When Kenobi asks how she learned to speak as the Jedi do, Sera explains that she found holo-recordings of warriors with \"swords of light\". The recordings also contained instructions on how to call the Jedi for help."}, {"tag": "p", "text": "Sera tells Kenobi that her plan was to bring the  Jedi to Carnelion IV  in order to kill the Open and the Closed and to start anew with the children. Kenobi then asks Sera what was the color of the lightsaber the warrior held. Sera reveals that it was red in color. Just then, they hear the noise of something battering the main doors. Sera and Kenobi flee to the roof only to find the fortress museum under siege by the Closed."}, {"tag": "p", "text": "The Closed demand that Sera let them in, offering to spare her life. Kenobi realizes that Grecker sent a flare to alert his people. Sera warns Kenobi not to trust the Closed. Sera wants Kenobi to kill the Closed but he attempts to reason with their leader, telling him that he has placed Sera under his protection. Just then Grecker resurfaces and tells them to kill Kenobi and to burn the place down to the ground."}, {"tag": "p", "text": "Kenobi deflects their blaster bolts with his lightsaber while telling them that he is not their enemy. Mother Pran leads the Open Mechs into combat against the Closed. Kenobi also tried to reason with Grecker by teling him that Sera wanted to save their world. Grecker dismissed Kenobi as a fool but was then killed by a laser cannon. Kenobi manages to dodge to safety."}, {"tag": "h3", "text": "Skywalker's help"}, {"tag": "p", "text": "Kenobi asks Mother Pran where is his Padawan. The Open leader instead blasts him with her Mech. However, Anakin rescues his master with a four-winged flying machine. Skywalker tells his master that he built the machine and brought over Kolara and the rest of the young Open."}, {"tag": "p", "text": "Kolara introduces herself to Sera, whom she learns is the Scavenger. Anakin tells his master that everything will be fine but Kenobi has his doubts. The dark-skinned Open youth asks Sera why she sent her kites. Sera tells him that she wanted to start the world again. She blames Kenobi for ruining her plans by bringing the Closed and Open to them. Kenobi responds that they are not killers and leads Anakin down to the starship."}, {"tag": "p", "text": "Sera tells the Open youth that hopefully the adult Open and Closed members will kill each other. However, Kolara responds that she doesn't want her people to die. Kenobi gets Skywalker to repair the ship's damaged communications unit in the museum. Despite Sera's warning, Kolara and the other Open youth depart on their flying machines to join the fight below. As Skywalker prepares to send the signal, Kenobi tells him that he is going to change the system."}, {"tag": "h3", "text": "Republic intervention"}, {"tag": "p", "text": "As the fighting between the Closed and Open rages, a fleet of Consular-class cruisers enter Carnelion IV's atmosphere and force a ceasefire. While Jedi and a silver 3PO-series protocol droid tend to the wounded, Skywalker asks Kenobi how he managed to convince the Galactic Republic to send a fleet to Carnelion IV. Kenobi replies that he told the Republic that he had discovered high concentrations of tibanna gas on the planet."}, {"tag": "p", "text": "While Kenobi is unsure whether this is true, he says that the Republic will not allow any fighting for the duration of their survey. Kenobi hopes this will bring peace to the world and that the locals can help themselves. When Anakin asks why the Republic believed him, Kenobi explains that being a Jedi is not just about power, lightsabers, or the Force but also about being connected to something greater. He says that being a Jedi gives him strength that he would never have on his own."}, {"tag": "h3", "text": "Anakin's destiny"}, {"tag": "p", "text": "In a flashback scene at the Jedi Temple on Coruscant, Kenobi tells Jedi Master Yoda about Skywalker's intention to stop his Jedi training and later return. Kenobi blames himself for this failure, telling Yoda that he believes that Skywalker belongs to the Jedi and is too young. Yoda reassures Kenobi that Skywalker's doubts are not his fault. He empathizes with Skywalker's youth and difficult upbringing and says that his questions are natural."}, {"tag": "p", "text": "Yoda tells Kenobi that they have received a call for Jedi aid and assigns Kenobi and Skywalker to investigate the matter. Yoda offers to release Skywalker should he choose to leave after the mission. Yoda asks Kenobi if he will still honor his vow to the late Master Qui-Gon Jinn should Skywalker choose to leave. Kenobi vows to complete Anakin's Force training and recalls that Qui-Gon and Yoda saw the currents that swirl around Anakin. They agree that Anakin needs guidance and protection from the dark side."}, {"tag": "p", "text": "Kenobi accepts that if Skywalker chooses to leave the Jedi Order, he will also have to leave. Back in the present, Kenobi asks Skywalker if he still wants to leave the Jedi Order. Anakin says that he will continue the journey as a Jedi. A pleased Kenobi says that he will show him the way and hands Anakin his lightsaber."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}