{"url": "Obredaan", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Galactic Alliance planets", "Category:Irishi sector planets", "Category:Mining planets"], "nodes": [{"tag": "h1", "text": "Obredaan"}, {"tag": "p", "text": "Obredaan was a planet in the Irishi sector of the Mid Rim and was known to have large deposits of cortosis ore, which made the mining industry the planet's main income source. Since Obredaan was located on the Entralla Route, it was known as one of the most active trading posts in the Irishi sector alongside Orinda and Ord Tessebok"}, {"tag": "p", "text": "After the Orinda campaign in the Galactic Civil War the planet became the last major stopping point before entering the Imperial Space on the Entralla Route. Thus the New Republic hosted its military presence here just in case an invasion would be imminent."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Obredaan was a planet in the Mid Rim's Obredaan system, located at galactic coordinates K-6 in the Irishi sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Obredaan was the mining world of the Jin'ha armorers; it played host to the facility where they attempted to synthesize cortosis ore for use in their weapons. Jedi Masters Plo Koon and Eeth Koth were sent to investigate the planet, but the Jedi High Council lost contact with their Consular-class cruiser and so sent Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to investigate. The pair found the wreck of the vessel in the swamps, but split up in order to achieve both of their objectives. Jinn left to search for the missing Masters while Obi-Wan was tasked with locating the Jin'ha facility."}, {"tag": "p", "text": "Kenobi managed to successfully infiltrate the facility, going deep within its bowels and recovering a sample which proved that the Jin'ha had been illegally synthesizing cortosis ore in order to battle the Jedi. He left the facility to find Jinn returning with the other Masters, and the group battled with the Jin'ha in order to leave the planet. Just before they were able to, however, a Trade Federation gunship flew overhead, leading Obi-Wan to believe that the Trade Federation had betrayed the trust of the Jedi Order, a suspicion that was confirmed during the Blockade of Naboo."}, {"tag": "p", "text": "The world was the site of a battle won by the New Republic during the Orinda campaign."}, {"tag": "p", "text": "Obredaan was a member of the Galactic Alliance in 40 ABY. During the Second Galactic Civil War, representatives of Obredaan condemned the raids on Corellian citizens on Coruscant by the Galactic Alliance Guard. The planet eventually joined the Confederation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jason Fry confirmed that Obredaan and Obreedan are the same planet. The correct spelling is Obredaan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}