{"url": "Obroa-skai/Legends", "categories": ["Category:Legends articles", "Category:Fortress worlds", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Ice planets", "Category:Inner Rim planets", "Category:Jedi planets", "Category:Obroa-skai locations", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Obroa-skai"}, {"tag": "p", "text": "Obroa-skai was a planet in the Obroa-skai system within a strategic position in the Borderland Regions of the Inner Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ecologically, the world was a terrestrial mix of tundras, mountains, grasslands and deserts. Its days lasted 26 standard hours, and its orbit took 456 local days."}, {"tag": "p", "text": "The reputation that had developed over the centuries was that the complete knowledge of the galaxy had been gathered within the computers of Obroa-skai's information repositories. Obroa-skai was also home to a large collection of Jedi-related antiquities which were destroyed by the Imperial Security Bureau."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 16,782 BBY, the Celebratus Archive was founded on Obroa-skai with the goal of collecting the complete data records of over 300,000 species, providing a boon to scholars and ensuring the planet's reputation as a library world. A Jedi training academy was also founded on the planet no later than 990 BBY, specializing in data collection and analysis."}, {"tag": "p", "text": "By 4 ABY, Obroa-skai had become an Imperial fortress world. However, it was abandoned by the Empire during the following year, and by 7 ABY, it was considered to be a stronghold of the New Republic."}, {"tag": "p", "text": "The Obroans kept their planet neutral during the Galactic Civil War, despite heavy petitioning by the New Republic in 9 ABY. Obroa-skai's expansive library of galactic information and numerous academic institutions drew Grand Admiral Thrawn to raid its central computer system. The data acquired gave Thrawn the hidden location of Wayland, while the raid also served as part of a distraction technique used on the New Republic forces prior to the Battle of Sluis Van."}, {"tag": "p", "text": "Obroa-skai was captured by the Yuuzhan Vong during their invasion of the Galaxy, and a yammosk was installed in the planet's mantle. Much was lost from the archives, but hardcopies of key items were saved before the assault. The Yuuzhan Vong kept many of the copies intact, at least until they could fully translate them. As such, much of the planet's buildings were kept intact, despite heavy Vongforming on other areas of the world. Obroa-skai was later liberated from the Vong, and the yammosk was destroyed."}, {"tag": "p", "text": "In 43 ABY, Obroa-skai was recovering from the Yuuzhan Vong War and the resultant terraforming on its surface. Institutions such as the Aurora Medical Facility were in operation as of this time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Mistakes and inconsistencies"}, {"tag": "p", "text": "The planet's name is repeatedly misspelled as \"Obra-skai\" in Before the Storm. Star Wars: Rebellion: Prima's Official Strategy Guide likewise misspells the planet as \"Obra-Skai.\""}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Obroa-skai in the Fakir sector of the Galactic Core. The Fakir sector is actually located in the Bakchou arm of the Colonies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}