{"url": "Obsession_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Obsession"], "nodes": [{"tag": "h1", "text": "Obsession 1"}, {"tag": "p", "text": "Obsession 1 is the first issue of the Star Wars: Obsession comic series, released November 24, 2004 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "While Anakin Skywalker enjoys a brief respite from the Clone Wars (and a reunion with his secret wife Padmé Amidala), Obi-Wan Kenobi embarks on a \"personal\" mission."}, {"tag": "p", "text": "Kenobi's first stop is a frontier town on the swamp world of Trigalis, where he fights a small army of bounty hunters, duels with a crime lord who has ties to Count Dooku, and obtains undercover help from fellow Jedi Aayla Secura. All that just to verify a rumor about an enemy that he can't forget."}, {"tag": "p", "text": "Obi-Wan is becoming obsessed, and he knows it. But the danger of flirting with the dark side is a risk he's willing take to save the person about whom he cares most in the galaxy."}, {"tag": "p", "text": "Dark Horse sets its sights on the events leading up to the most anticipated event in Star Wars history: Episode III – Revenge of the Sith!"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Obi-Wan, chased by thieves looking to steal and sell his lightsaber, rides on a swoop through a swamp on Trigalis. He dispatches his pursuers, and the subsequent Black Sun tax collectors who intend to take all his belongings. He then meets up with Aayla Secura, who informs him that the entire town is run by a crime lord named Xist, who has potential information about Asajj Ventress."}, {"tag": "p", "text": "Meanwhile, Anakin and Padmé share an intimate evening."}, {"tag": "p", "text": "After wrenching information from Xist, Kenobi informs the Jedi Council of his findings, and they give him permission to pursue Ventress, who Xist said might have been dropped off on a space yacht of Corillean trader Drama Korr. Aayla lends Kenobi her starfighter, and Kenobi sets off."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the comic, it depicts a scene where Padme first witnesses Anakin's scar A similar event was also depicted in Clone Wars micro-series in Chapter 22. However, in that version, it is depicted in a Naboo City while in the comic it is in the Naboo countryside."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}