{"url": "Atmosphere/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Gases", "Category:Type I atmosphere moons", "Category:Type I atmosphere planets", "Category:Type II atmosphere moons", "Category:Type II atmosphere planets", "Category:Type III atmosphere moons", "Category:Type III atmosphere planets", "Category:Type IV atmosphere moons", "Category:Type IV atmosphere planets", "Category:Weather"], "nodes": [{"tag": "h1", "text": "Atmosphere"}, {"tag": "p", "text": "An atmosphere is a collection of gases that surrounded a celestial body that possessed sufficient mass, and therefore sufficient gravity to hold it. Examples included many planets, moons, and large asteroids. Almost all species in the galaxy needed some form of atmosphere to breathe. During the height of the Galactic Empire's colonial period, a system of classification for atmospheres was established. This system, which was afterward adopted by nearly all subsequent governments in the galaxy, separates atmospheres into four distinct categories:"}, {"tag": "h2", "text": "Type I atmospheres"}, {"tag": "p", "text": "Breathable"}, {"tag": "p", "text": "Type I atmospheres had appropriate levels of oxygen, nitrogen, and hydrogen to be breathable by the majority of species in the galaxy. Some contaminants or other trace gases could have had long-term detrimental effects. Planets with these types of atmospheres almost always had some form of indigenous life. Plant life or some analog that frees oxygen was present on all planets with a Type I atmosphere—all oxygen in the atmosphere would have been bound to other elements within a matter of months without such life to free it up. Most heavily populated planets, such as Alderaan and Coruscant, had Type 1 atmospheres."}, {"tag": "h2", "text": "Type II atmospheres"}, {"tag": "p", "text": "Breath mask Suggested"}, {"tag": "p", "text": "Type II atmospheres usually had appropriate levels of atmospheric oxygen and nitrogen. Due to lack of sufficient pressure or the presence of contaminants and/or of other trace gases, however, these atmospheres usually caused detrimental effects to Humans and most other species over a shorter period of time. Many species could breathe Type II atmospheres without any trouble depending on physiology. Planets with a Type II atmosphere usually supported some form of indigenous life. Mustafar's volcanism gave it a Type II atmosphere."}, {"tag": "h2", "text": "Type III atmospheres"}, {"tag": "p", "text": "Breath mask Required"}, {"tag": "p", "text": "Within Type III atmospheres, due to either the lack of appropriate levels of atmospheric oxygen, nitrogen, sufficient pressure, the presence of contaminants and/or of trace gases, a breath mask had to be worn. For Humans and most other species, these atmospheres caused immediate or eventual impediments or even incapacitation. Some species could breathe these types of atmospheres depending on physiology and biology. Planets with a Type III atmosphere sometimes supported native life, such as Goroth Prime and Dorin."}, {"tag": "h2", "text": "Type IV atmospheres"}, {"tag": "p", "text": "Environment Suit Required"}, {"tag": "p", "text": "Type IV atmospheres were either toxic, flammable, extremely high pressure, or nonexistent; these types of atmospheres caused immediate incapacitation or death in most species of the galaxy. Few species could breathe in this type of atmosphere; planets with a Type IV atmosphere rarely supported life. Most asteroids had Type IV atmospheres."}, {"tag": "h2", "text": "Other uses"}, {"tag": "p", "text": "The word \"atmosphere\" was also used to represent the capacity of a starship to hold a determined atmosphere in its decks. A broken hull could produce a sudden loss of atmosphere (called \"decompression\")."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}