{"url": "Ocean/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Seas and oceans"], "nodes": [{"tag": "h1", "text": "Ocean"}, {"tag": "p", "text": "An ocean was a large body of liquid—usually water, although the lava fields of Mustafar were a notable exception. There were a number of planets that consisted entirely of oceans, like Dac and Manaan. Certain ice planets also had a liquid ocean under the layers of ice, due to core heating, such as Helska IV."}, {"tag": "h2", "text": "Impact"}, {"tag": "p", "text": "Oceans generally played a significant part in a planet's ecosystem, depending on the climate of the particular world, and affected the general habitability of the world for most species. However, it was by no means a mark of ability to sustain life. Despite the lack of significant bodies of water, arid worlds such as Tatooine sustained life through the use of moisture vaporators, albeit in a limited fashion. Not all such worlds used moisture vaporators; on Cona, the native Arcona harvested water from plant pods. The presence of water, or lack thereof, could possibly have had a major impact on the species inhabiting that world. On the dry and arid world of Kamar, an organization called the Cult of Varn held an understandable reverence for water."}, {"tag": "h2", "text": "Biology of aquatic species"}, {"tag": "p", "text": "Some oceans in particular were full of a variety of life forms. For example, the waters of the oceanic world of Dac, better known as Mon Calamari to the rest of the known galaxy, have produced no less than five sentient species, including the whale-like Whaladons. Aquatic species, such as the Mon Calamari and the Quarren, generally did not enjoy arid environments, preferring humid ones. The quarters of Jedi Master Bant Eerin were constantly kept misty and humid. The planet of Naboo contained vast uncharted oceans filled with dangerous creatures."}, {"tag": "h2", "text": "Hazards"}, {"tag": "p", "text": "Pollution was sometimes a problem for aquatic-based creatures and species. In the event of an industrial accident, currents would spread pollutants and other hazardous material fairly quickly, depending on the scale of the accident or size of the oceans. On ocean-covered planets, this potentially had widespread and disastrous ramifications, with far-reaching consequences. The aquatic planet of Manaan was the sole producer of kolto, a healing fluid generally believed to be produced with the aid of the Progenitor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A planet could be submerged under an ocean by a climate change; this was the case with Kamino, which underwent the so-called Great Flood in 19,000 BBY.\nDue to the fragile nature of their home waters, aquatic species tended to be environmentally conscious, although that was not a trait unique to marine species; Ergesh and Alderaanians were two groups that took great care of their natural environments. Conversely, on Coruscant, all natural bodies of water were drained and stored to provide for the multitudes of beings that called it home. The largest body of water, the artificial Great Western Sea, was the only remaining such body of water and was used as a tourist destination prior to the Battle of Coruscant, while afterwards it became a succession pool. During the Second Imperial Civil War, under the guise of it being Darth Krayt's wishes, Darth Wyyrlok (III) ordered the immediate destruction of Dac's ecosystem, with the desire to render the entire planet unsuitable for life at the hands of Vul Isen's viral spores as a part of the Final Protocol. It succeeded in poisoning the waters of the world within a week, killing billions and concluded the Genocide on Dac, rendering the world uninhabitable."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The computer game Star Wars: Knights of the Old Republic has a dark-side option for the player where Revan pumps a toxin into the water, thereby destroying the planet-wide production of kolto. This affected medicine prices, as kolto was used widely before the introduction of bacta."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}