{"url": "Occupation_of_the_Colossus", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles of Castilon", "Category:Cold War campaigns", "Category:Conquests and occupations", "Category:First Order–Resistance war campaigns", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Occupation of the Colossus"}, {"tag": "p", "text": "The occupation of the Colossus was an occupation by the First Order of the Colossus refueling station located on the Outer Rim world of Castilon that occurred during the end of the Cold War and the beginning of the war between the First Order and the Resistance."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The First Order, in their preparations for their planned war against the rest of the galaxy, particularly the New Republic, became interested in the Colossus, an old supertanker fuel depot on Castilon, as a potential staging area, due to its location. However, they were aware that the platform's owner, Captain Imanuel Doza, was reluctant to cede control of the platform to anyone, and distrusted the First Order. Therefore, the First Order hired the Warbird gang, led by Kragan Gorr, to repeatedly raid the platform to create a threat they could offer protection from."}, {"tag": "p", "text": "At the same time, the Resistance became aware of the First Order's interest in the platform and, suspecting they had a spy on the platform, sent in one of their own, the newly-recruited Kazuda Xiono, on a mission to discover what the First Order was doing there. Accompanied by the astromech droid BB-8, Xiono got a cover job as a mechanic at Jarek Yeager's repair shop and a member of Team Fireball."}, {"tag": "p", "text": "Over the course of the months after Xiono's arrival, the Warbirds attacked the platform several times, with the Ace Squadron, and various residents including Xiono, fighting them off. None were aware of the connection between the pirates and the First Order. In fact, Xiono unwittingly gave the pirates invaluable assistance when he and Poe Dameron rescued one of them, Synara San, from a derelict freighter, allowing her to become a spy on the platform. Eventually, after a particularly devastating attack, Doza, despite his concerns regarding the First Order, was forced to reconsider their offer."}, {"tag": "p", "text": "However, Doza's consideration of the offer took longer than Captain Phasma and Commander Pyre liked, and they eventually came up with another plan. When Gorr, unhappy about the higher-than-expected losses he had taken on the job, demanded triple payment, Pyre agreed, and ordered Gorr to kidnap Torra, Captain Doza's daughter, to finally pressure him into allowing a full-time First Order presence. Via San, pirates Valik and Drell were snuck onto the platform one night and into Doza Tower, where they kidnapped Torra. However, San had begun to doubt her mission after befriending several Colossus residents, including Xiono, and when she ran into him where he had been looking for her, told him about the kidnapping. Xiono and the Aces went in pursuit of Torra, and reached Gorr's ship the Galleon in enough time to see Torra be \"rescued\" by the First Order's Major Elrik Vonreg. Torra was returned to the platform on Vonreg's Upsilon-class command shuttle."}, {"tag": "h2", "text": "The Occupation"}, {"tag": "h3", "text": "In the name of security"}, {"tag": "p", "text": "As the First Order had hoped, the kidnapping they had staged proved the final pressure needed to convince Captain Doza to reluctantly accept a detachment of stormtroopers on the Colossus. However, Doza insisted that he wanted the troops to leave as soon as the pirate threat had been neutralized. The stormtroopers, and TIE fighters which arrived as well, instituted a curfew on the platform and frequently demanded that residents show their identification. Many residents of the platform were mostly unbothered, having fallen for the First Order's \"rescue\" of Torra, and believed that the troopers were there to keep security on Captain Doza's wishes."}, {"tag": "p", "text": "Doza, however, was displeased by reports of stormtroopers ignoring the platform's laws, but he was powerless to make them leave given what they had supposedly done in rescuing his daughter, as well as the pirate threat the First Order themselves had manufactured. Xiono wanted to inform Dameron and the rest of the Resistance about the occupation, but Yeager warned him that, as the First Order was almost certainly monitoring all off-planet communications, he might blow his cover if he did that, and advised him to wait until Dameron contacted him instead."}, {"tag": "h3", "text": "Helping Synara"}, {"tag": "p", "text": "The detachment's first order of business was identifying and capturing the Warbirds' spy, Synara San, who could inform Captain Doza of the pirate gang's former arrangements with the First Order. However, Xiono, who had befriended San and deduced she was a spy after Torra's kidnapping, decided to help her escape anyway. With the assistance of BB-8 and Neeku Vozo, Xiono helped San escape the Colossus via the last remaining escape pod on one of the underwater levels. Xiono and Vozo managed to avoid identification by the First Order, but Xiono was already under suspicion for having been seen in the vicinity of Doza Tower with San the night of the kidnapping, so he still had to be cautious."}, {"tag": "h3", "text": "Impersonating a stormtrooper"}, {"tag": "p", "text": "In preparation for the arrival of a full garrison on the platform, troops began cataloging all residents of the Colossus. During a search, trooper CS-515 overheard two children, Kel and Eila, who were in hiding on the platform as they were fugitives from the First Order, laughing while fishing for snarlfish. When he attempted to apprehend them, the siblings knocked him unconscious in self-defense, before hiding him inside a closet and going to Xiono for help. Xiono disguised himself as the stormtrooper to determine if CS-515 had reported the children's presence to any other First Order personnel."}, {"tag": "p", "text": "In his investigation, Xiono determined that the trooper hadn't had the chance to do so, and discovered that once the garrison arrived, the First Order intended to arrest all Colossus residents who refused to support them. Xiono was nearly unmasked after giving Pyre and Sergeant CS-812 the impression something was wrong with CS-515's mental conditioning, but managed to switch the trooper back before he could be captured, leading the dazed trooper to be led away for a \"brain scrub.\" Xiono later showed Yeager and BB-8 a data rod he stole from the First Order shuttle, which contained a galactic map marked with red dots that Yeager suspected were First Order fleets. This led him to suspect that the First Order wanted the Colossus as a military supply station to refuel their fleet for the oncoming war."}, {"tag": "h3", "text": "Sneaking offworld"}, {"tag": "p", "text": "While the occupation was going on, Commander Dameron snuck onto the Colossus to retrieve BB-8, as he and the droid had been assigned a mission to Jakku by General Leia Organa. He brought CB-23 along as a replacement. Xiono, Dameron and BB-8 snuck off the platform in the Fireball by means of a Widowmaker maneuver, and investigated the desolate Dassal system, where the First Order had been active, before parting ways, Xiono returning to the Colossus with CB-23. When his coworkers Vozo and Tamara Ryvora inquired about the new droid, Xiono claimed that he had had to leave BB-8 on Takodana for repairs, and that CB-23 was a temporary replacement. However, Ryvora was suspicious, as the Colossus had been locked down by the First Order, which for her begged the question of why and how Xiono had gotten off the platform unseen in the first place."}, {"tag": "h3", "text": "The purge"}, {"tag": "p", "text": "As Phasma's reinforcements arrived on the Colossus day by day, Commander Pyre convinced Captain Doza to suspend the platform races, ostensibly because they were a security risk, when in truth it was to eliminate the Aces as a threat. This outraged Hype Fazon, who attempted to take his ship out for a spin, only to find stormtroopers fitting it with a gravity lock, thus grounding him. Fazon was soon detained by the stormtroopers. His disappearance concerned Torra, who passed her concerns onto Xiono, Ryvora and Vozo."}, {"tag": "p", "text": "Overhearing their conversation, Aunt Z voiced her suspicions that the First Order was responsible for Fazon's disappearance and were mostly likely abducting anyone who so much as spoke against them. This was overheard by a First Order BB unit, who alerted two stormtroopers and insinuated the group were spouting conspiracy theories. Ryvora directly asked the stormtroopers as to Fazon's whereabouts and they falsely claimed that he had left the platform, which Ryvora accepted without question. The troopers suggested the youngsters join the First Order, prompting Aunt Z to toss their propaganda poster projector at them and order them to leave and find recruits elsewhere."}, {"tag": "p", "text": "Finding the troopers' story suspect, Torra and Xiono infiltrated Fazon's hanger and found his ship was sitting there, confirming the stormtroopers were lying. They soon returned to Aunt Z's to find the tavern being solely managed by G1-7CH, who claimed his master had disappeared, enabling the First Order to place as many propaganda posters as they desired. They ran to Yeager's repairs, where Xiono barged in on Yeager talking with Captain Doza. Doza admitted that he knew the First Order were quietly abducting platform citizens who defied them and were holding them on the west docks to await transport offworld, but he couldn't openly defy them without putting his constituents at risk."}, {"tag": "p", "text": "Though Yeager and Doza were planning on taking down the First Order communication blanket to contact the Resistance for aid in pushing the First Order off the platform, Xiono and Torra refused to wait and went to rescue the prisoners. They freed the prisoners and commandeered the First Order transport so the stormtroopers wouldn't know of their escape and tear the platform apart looking for them. Aunt Z and Fazon left for Takodana, where Aunt Z had a friend. The other freed prisoners, Grevel and Nod, chose to stay on the Colossus."}, {"tag": "h3", "text": "Unmasked"}, {"tag": "p", "text": "However, when Xiono and CB-23 returned to Yeager's repair shop, they found the rest of Team Fireball under arrest by Pyre and a squad of stormtroopers. Pyre told them that the Fireball had been reported in use by Resistance spies trespassing in the First Order-controlled Sector Epsilon 51-3, and Yeager denounced the claim as false. Ryvora, who did not believe the First Order was a threat, thought the incident must have been a misunderstanding, but Xiono and Yeager didn't deny it. Yeager's droid R1-J5, also known as \"Bucket,\" had been in the back of the garage when Pyre's troops arrived, and Yeager signaled him when Bucket saw the others were in danger. The astromech promptly shoved aside a crate and released a cloud of smoke which blinded the stormtroopers, allowing the members of Team Fireball to retreat to Yeager's office. Xiono, Yeager, Vozo and CB-23 made it to the office, but Bucket was shot by a stormtrooper and fell into the ocean, while Ryvora, believing that the situation was a misunderstanding and the First Order could be reasoned with, did not run and was captured. Yeager sealed the door to his office and led Xiono, Vozo and CB-23 out through his private hangar into the maintenance tunnels."}, {"tag": "p", "text": "The damaged Bucket was retrieved in fishing nets spread by Chelidae maintenance workers, and was brought to the engineering room for repairs. Pyre ordered Ryvora brought up to Doza Tower, and he insinuated to her that her friends had intentionally left her behind to take the fall for their activities. Ryvora was to be interrogated by Agent Tierny of the First Order Security Bureau, who was en route to the Colossus. While in the maintenance corridors, in response to Vozo's confusion about why they were being pursued by First Order troops, Xiono admitted to him that he was a spy. The literal-minded Nikto misinterpreted the statement as a poorly-timed joke. Eventually, Yeager, Xiono and Vozo's emotionally-charged conversation became loud enough that they were overheard by stormtroopers, who gave chase. Fortunately, they were also overheard by Eila, Kel and the Chelidae, who rescued Yeager, Vozo, Xiono and CB-23 when they had been cornered by opening a trapdoor beneath them. They were reunited with Bucket in engineering."}, {"tag": "p", "text": "When Captain Doza heard of the hunt for Team Fireball and the impending arrival of Tierny, he was taken aback, as was Torra. Pyre and Doza met Tierny when she disembarked from her shuttle, and brought her to Doza's office. When Ryvora was brought in wearing binders, Tierny was welcoming to her, ordering her uncuffed and immediately taking her to the Aces' Lounge to talk. When Tierny revealed to Ryvora that Xiono was not, as Ryvora had assumed, a poor kid from Coruscant but a wealthy former New Republic fighter pilot from Hosnian Prime, the mechanic was surprised, and felt betrayed at the deception."}, {"tag": "h3", "text": "The sinking"}, {"tag": "p", "text": "In engineering, Xiono made it clear that they had to establish contact with the main Resistance. Yeager agreed, but pointed out that that would only be possible if the First Order's jammer on Doza Tower was taken down, and it would be no easy feat to get to the top of the station from their location at its bottom. This led Xiono to come up with a bold plan: sink the Colossus so that only the very top of Doza Tower, where the jammer was, would be above the water, making accessing the jammer a simple matter of swimming up from the bottom of the station. Yeager considered the idea crazy, but knew they had few other options."}, {"tag": "p", "text": "Xiono sent CB-23 up to Doza Tower to inform Captain Doza of his intentions, which she did by ambushing a First Order ball droid and stealing the tray it was delivering, making it look like she had official business up there. Doza, upon being informed of Xiono's idea, was taken aback, but his daughter Torra thought it sounded like fun. CB-23 returned to engineering with Doza's permission for Xiono to carry out the plan, although Doza warned Xiono that he would be in trouble with him if the Colossus was damaged in the process. Xiono, Yeager and the Chelidae shut down power to the Colossus' turbines, causing the station to sink in a fashion which initially appeared accidental. However, Pyre and Tierny found the timing highly suspicious. Once the platform had settled, Xiono and Yeager donned breath masks and swam up to the tower, pulled by CB-23. When they reached the transmitter, which was just above the water line, it took them some time before Yeager located and removed the circuit controlling the jamming signal. Inside the tower, this was noticed. Doza suggested the cause was water damage, but Tierny noted that the transmitter was above water, causing Pyre to lead a squad of troopers out to deal with the situation. Xiono managed to send a message to the Resistance before the troopers arrived, and Yeager held off Pyre and his soldiers long enough for CB-23 to download the reply before pushing Xiono into the water, allowing himself to be captured so Xiono and CB-23 could escape."}, {"tag": "p", "text": "When Xiono and CB-23 returned to engineering with the message, it was only upon seeing it that Vozo realized Xiono had never been joking about being a spy. The message, however, was not what they'd hoped to hear: General Organa regretfully told Xiono that the Resistance had no ships to spare to help the Colossus. She included the coordinates of their next base, however, and advised Xiono to join them if he could, before signing off with a message that Xiono wasn't alone, as there were people fighting tyranny across the galaxy. After seeing the message, Vozo, Kel and Eila were demoralized, but Xiono reaffirmed that they were not alone, that they were all the Resistance, and that they would rescue their friends and take back the Colossus."}, {"tag": "h3", "text": "Truth and lies"}, {"tag": "p", "text": "After his capture, Yeager attempted to deflect blame from Xiono by making a false confession that he had been the Resistance spy all along, and had been responsible for all of Xiono's activities, claiming that he had recruited Xiono in the first place. He also claimed to have been the pilot who flew the Fireball into Sector Epsilon 51-3. However, Agent Tierny, who already believed Yeager to be a Resistance spy, used a recording of the confession to turn Ryvora to her side by making her think it was the truth. Ryvora correctly guessed that the \"confession\" was a lie after seeing it, but as Yeager was not there to defend himself and Tierny was a skilled manipulator, she was able to convince the politically-naïve mechanic that Yeager and Xiono were manipulative liars who had only been using her the entire time."}, {"tag": "p", "text": "Doza, upon hearing that Yeager had been arrested, confronted Commander Pyre, who had ordered all residents to stay in their homes while First Order personnel worked to raise the platform again. The captain, having come to have suspicions about the First Order's actions, accused Pyre of the Order having forced their way onto the platform through fear and intimidation. Pyre countered that they had been invited onboard, but Doza pointed out this was unlikely to sway the New Republic Senate."}, {"tag": "p", "text": "This led Pyre to insinuate that they were beyond the New Republic's reach, but that the New Republic was not beyond theirs, before ordering Doza's arrest for insubordination. Pyre also ordered the arrest of Ace Squadron. Doza and 4D-M1N fought off the other stormtroopers in the office, but Pyre then destroyed the droid, smugly calling the effort \"pathetic.\" As Doza was led off by more stormtroopers, he told Pyre that the First Order would not get away with their actions, which failed to shake the stormtrooper commander. Unknown to Doza and Pyre, Doza's daughter Torra was watching."}, {"tag": "h3", "text": "Leading the Colossus resistance"}, {"tag": "p", "text": "Following Yeager's capture, Xiono assumed the mantle of leadership over the newly formed Colossus resistance. Despite accepting that the Resistance was unable to send reinforcements, Xiono vowed to rescue Yeager and Ryvora from First Order captivity. During his first attempt, Kaz and CB-23 tried to swim up from the engineering deck towards Doza Tower. However, they were spotted by a pair of First Order SCUBA troopers, who pursued them into the flooded corridors beneath the engineering deck. Kaz and CB-23 barely escaped with the help of Vozo, who pressurized the corridor, sucking the troopers out into the sea."}, {"tag": "p", "text": "With the ocean route blocked, Xiono and CB-23 were forced to navigate through the corridors towards Doza Tower, dodging stormtrooper patrols on the way. Meanwhile, Vozo, Kel, and Eila discovered that the control room they were stationed in contained an operational Class 2 hyperdrive. After conversing with Flix and Orka, Xiono encountered Torra's pet voorpak Buggles, who had been sent by Torra to find Xiono. At the same time, Vozo informed Xiono about his hyperdrive discovery. Xiono tasked Neeku with finding a way to launch the Colossus into space."}, {"tag": "p", "text": "Meanwhile, Yeager encountered a bitter Ryvora, who berated him for lying about Xiono. Yeager tried to warn his former mechanic not to trust the First Order, but Ryvora countered that Yeager had put everyone in danger by concealing the truth about Xiono being a Resistance spy. Yeager was locked in the same cell as Captain Doza. Having successfully sown a wedge between Ryvora and her former friends, Agent Tierny then offered Ryvora a place as a pilot in the First Order."}, {"tag": "p", "text": "While navigating through the Colossus' corridors, Xiono, CB-23 and Buggles reunited with Torra, who informed them about the capture of Yeager and her father. They were discovered by the First Order BB unit MB-13A, which tried to raise the alarm. CB-23 fought with MB-13A and threw the droid down an elevator shaft. After avoiding a stormtrooper patrol, the two entered Doza Tower, which was now fully occupied by the First Order."}, {"tag": "h3", "text": "The real war begins"}, {"tag": "p", "text": "After stunning and locking a stormtrooper sentry in a closet, Xiono and Torra watched a group of stormtroopers viewing a holographic transmission by General Armitage Hux, the commander of the First Order's armies. Hux gave a speech denouncing the New Republic and the Resistance before unleashing Starkiller Base's phantom energy on the Hosnian system."}, {"tag": "p", "text": "Though Xiono was distraught at the loss of his homeworld, family, and friends, Torra urged him to continue with their mission to free Yeager and her father. Xiono, Torra, and CB-23 reached the detention block, where they managed to free Yeager and Captain Doza. After briefing the two about Xiono's plan to launch the Colossus into space, they stunned a pair of stormtroopers who had returned to the cell to check on the prisoners."}, {"tag": "p", "text": "Working in coordination with Vozo and his team, Xiono and Torra helped to release water from the outer corridors while simultaneously flushing stormtroopers out into the sea. Several stormtroopers drowned, while others were picked up by sharvo fish. In response to the loss of stormtroopers aboard the Colossus, Agent Tierny suggested calling in reinforcements to secure the station and evacuating Ryvora offworld."}, {"tag": "p", "text": "Shortly later, Yeager and Captain Doza retook Doza's office, which had been abandoned by the First Order. While Doza manned the controls, Yeager went to the landing pad in an attempt to convince Ryvora not to join the First Order. He was joined by Xiono, Torra, and CB-23, who tried to appeal to Ryvora from the top of the tower. However, Ryvora was still bitter towards Xiono and Torra for their secrecy and elected to go with the First Order. Yeager, Xiono, and Torra were then cornered by stormtroopers."}, {"tag": "h3", "text": "Flight of the Colossus"}, {"tag": "p", "text": "At the same time, Vozo and his team fired the Colossus' hyperdrive, causing the station to rise from the sea. Yeager, Xiono, Torra, and CB-23 took advantage of the commotion to fight off the First Order stormtroopers. CB-23 also squirted oil, causing the stormtroopers to fall off the platform onto the landing pad. Amidst a gun battle, Ryvora escaped with Pyre and Tierny aboard an Upsilon-class command shuttle."}, {"tag": "p", "text": "As the Colossus ascended into the skies of Castilon, Captain Doza freed the imprisoned Aces, who scrambled to their racers. They were joined by Yeager and Xiono and their droids Bucket and CB-23, who also scrambled into their ships. The Aces, Yeager, and Xiono engaged in a dogfight with First Order TIE fighters. They were helped by Hype Fazon and Aunt Z (who flew a stolen Atmospheric Assault Lander) and the Warbirds, who used their sail barge Galleon to strafe the TIEs."}, {"tag": "p", "text": "In response, the First Order deployed a Resurgent-class Star Destroyer, which proceeded to bombard the Colossus. Yeager and Xiono also fought First Order ace Major Elrik Vonreg, who flew his own personal starfighter. Following a prolonged chase, Xiono managed to shoot down and destroy Vonreg's fighter, killing the ace. After the fighters returned to the Colossus, the space station escaped into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "h3", "text": "The Colossus"}, {"tag": "p", "text": "Using coordinates provided by Xiono, Vozo intended to take the Colossus to D'Qar, where the Resistance had a base. However, he did not have time to fill in all the coordinates. Vozo broke the news to Xiono and his friends, who were recuperating in the hangar bay. While upset, Xiono reassured Neeku that wherever they were going, they would be going together. The group then watched the hyperspace tunnel. The loss of the Colossus deprived the First Order of a supply line for their fleets to invade the known galaxy."}, {"tag": "h3", "text": "The wider galaxy"}, {"tag": "p", "text": "Despite the Hosnian Cataclysm, the Resistance was able to destroy the First Order's Starkiller Base, dealing a major blow to the First Order. However, First Order forces attacked D'Qar before the Resistance could evacuate and pursued them through space, inflicting heavy casualties."}, {"tag": "p", "text": "Due to Vice Admiral Amilyn Holdo's kamikaze attack on the First Order flagship Supremacy, the Resistance were able to flee to Crait. They were pursued by Kylo Ren, Master of the Knights of Ren, who had killed and usurped Supreme Leader Snoke. With the help of Luke Skywalker, the Resistance were able to escape Crait to fight another day."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The First Order's occupation of the Colossus first appeared in the Star Wars Resistance episode \"The First Order Occupation,\" which premiered on February 3, 2019. The occupation serves as the main conflict for the remaining third of the series' first season, concluding with the finale, \"No Escape: Part 2,\" which premiered on March 17, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}