{"url": "Occupation_of_the_Kesh_capitol_building", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Kesh"], "nodes": [{"tag": "h1", "text": "Occupation of the Kesh capitol building"}, {"tag": "p", "text": "In 3000 BBY, the Sisters of Seelah, a faction of the Lost Tribe of Sith, occupied the Kesh capitol building. Their leader Iliana Merko then attempted to force the Caretaker Varner Hilts to produce a fake \"testament of the Tribe's founder Yaru Korsin that would favor his estranged wife Seelah Korsin and those that followed her teachings. However, this plan fell apart because the testament was read by an actual holocron recording of Yaru Korsin himself every Testament Day, which occurred every twenty-five years."}, {"tag": "p", "text": "The Sisters' presence attracted the attention of two rival Sith groups: the Korsinite League, which revered Yaru Korsin and his daughter Nida Korsin, and Force 57, which emulated the 57 Red Sith crew members of the ancient Sith dreadnaught Omen. They attacked the Sisters of Seelah but the fighting was interrupted when Varner Hilts offered to do a reading of the Testament. When Korsin Bentado, the Korsinite leader, objected to this reading on the grounds that Testament Day was eight days away, the Keshiri mathematician Jaye Vuhld pointed out that Kesh's calendar was eight days behind the Galactic Standard Calendar. Thus, Hilts was legally obliged to convene the Pantheon's Peace and the Sith leaders assembled for the reading."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "By 3000 BBY, the continent of Keshtah Minor had experienced almost a millennium of turmoil and civil warfare known as the Time of the Rot. This conflict had been sparked by the death of the reigning Grand Lord Lillia Venn during the Night of the Upside-Down Meteor in 3960 BBY, which saw the Lost Tribe of Sith splinter into twenty factions. Each faction selected their own Grand Lords and fought each other for control of Tahv, the capital of Keshtah and the seat of the Tribe's power. Different factions united long enough to invade Tahv and overthrow the ruling Grand Lord only to begin fighting among themselves. As a result, much of Keshtah's cities and infrastructure including the Kesh capitol building and aqueducts had fallen into ruins and disrepair."}, {"tag": "p", "text": "By 3000 BBY, the sole functioning office in the Tribe's bureaucracy was the Office of the Caretaker, whom was charged with safeguarding the Tribe's historical records and providing timekeeping. The Caretaker's office was based in the Kesh capitol building. The then-Caretaker was an elderly Human Sith man named Varner Hilts, who had little interest in the Tribe's political struggles. One important function of the Caretaker's office was to facilitate the reading of the Testament of Yaru Korsin which was convened every twenty-five years on Testament Day. On that day, the various Sith factions congregated peacefully at the Kesh capitol building to listen to the final testament of the Tribe's Founder Yaru Korsin, who was revered by most factions for discovering Kesh and creating the Tribe's political structure. Besides Testament Day, the year 3000 BBY also coincided with two other important dates including the Festival of Nida's Rise and 1,975th anniversary of Grand Lord Korsin's death."}, {"tag": "p", "text": "However, one faction known as the Sisters of Seelah hated Korsin and instead regarded his estranged wife Seelah Korsin as the \"true\" Founder of the Tribe. Their leader Iliana Merko concocted a plan to restore Seelah to a revered position within the Tribe's pantheon by producing a document purporting to be the real Testament of Yaru Korsin, which would favor those who followed Seelah's teachings. As followers of Seelah, the Sisters practiced eugenics and braided their hair in her style. The Sisters had a hostile relationship with the other factions particularly the Korsinite League, who revered Yaru and his daughter Nida Korsin, and Force 57, which revered the \"Other 57\" non-Human Red Sith who were aboard the Omen, the Sith dreadnaught which had brought the Tribe's ancestors to Kesh. Despite their differences, all these Sith factions believed that the Sith superior to the native Keshiri on the account that they were the Skyborn, gods in Keshiri religion."}, {"tag": "h3", "text": "The Occupation"}, {"tag": "p", "text": "Twelve days prior to Testament Day in 3000 BBY, the Sisters of Seelah put their plans into action and occupied the Kesh capitol building. Since the capitol building was only staffed by several Keshiri clerks, who were unsuitable for combat, the Sisters met no resistance and quickly seized control of the building. While Iliana's fellow Sisters waited in the atrium with their Keshiri hostages, Iliana herself went to confront Caretaker Hilts inside his office. To force Hilts' cooperation, she also threatened to kill one of Hilts' aides, Jaye Vuhld, with her Sith lightsaber. After informing Hilts of the situation, Iliana revealed the purpose of her visit; changing the Testament of Varner Hilts to favor the Sisters of Seelah. Her plan involved coercing Hilts into reading a document purporting to be Yaru Korsin's testament during the Pantheon's Peace."}, {"tag": "p", "text": "While Hilts admired the boldness and originality of Iliana's plan, he quickly revealed that her plan was flawed because he did not actually read from Korsin's Testament. Instead, the Testament was read by a holographic recording of the late Founder himself; the Testament was stored within a holocron, an ancient Jedi and Sith technology. For the next four days, the Sisters of Seelah occupied the capitol building. During that time, the Keshiri staff were locked up in another room. During that time, Iliana and her followers tried unsuccessfully to activate the holocron while ignoring Hilts' claims that the machine only activated on Testament Day. As Testament Day approached, large numbers of Humans and Keshiri occupied the Circle Eternal in preparation for the Festival of Nida's Rise. While the ordinary citizens were not permitted to attend the Testament Day reading, this did little to dispel their interest in hearing the Founder's words being relayed to the masses by the Tribe's leaders."}, {"tag": "p", "text": "Unsuccessful in their efforts of reactivating Korsin's holocron, Iliana threatened to kill Jaye Vuhld unless Hilts complied. Before any of them could make a move, they were interrupted by the arrival of a second faction, the Korsinite League. The Korsinites had managed to scale the capitol building's walls and enter the building through its glass windows. These new arrivals then descended into the atrium and attacked Seelah's followers. A lightsaber duel quickly ensued between the two factions. Iliana's followers outside the capitol building were also attacked and pursued by a third Sith faction, Force 57. Several Sith from all three factions were killed or wounded during this skirmish. Hilts and Jaye managed to escape the three-way skirmish by hiding behind the Sandpipes, ancient instruments used for recording time. During the fighting, the capitol building's windows were damaged; setting Hilts and his staffs' maintenance work back by thirty years."}, {"tag": "h3", "text": "Pantheon's Peace"}, {"tag": "p", "text": "Before more lives could be lost, Hilts managed to end the fighting by offering to provide lodging for them in the capitol building prior to Testament Day. The three Sith factions reluctantly disengaged from their skirmish but then began squabbling among themselves. Korsin Bentado and Neera, the leaders of the Korsinite League and Force 57 respectively, demanded to know why Iliana and her followers were occupying the capitol building. As devout followers of Yaru and Nida Korsin, the Korsinites regarded the Testament of Yaru Korsin as sacred scripture and were intolerant of those who did not share their beliefs about how the Tribe should be structured. Meanwhile, Force 57 hated Seelah Korsin for banishing the original 57 Red Sith from the Tribe."}, {"tag": "p", "text": "As the religious differences between the three factions threatened to boil over again into open fighting, Hilts tried to mediate between them by offering to do a reading of the Testament from Yaru Korsin's holocron. While Iliana was angry that the Caretaker had deceived her, the dogmatic Bentado refused to accept any reading prior to the designated Testament Day. He threatened to kill Hilts if the latter continued with his \"heresy\". However, Hilts managed to defuse the situation by getting Jaye Vuhld, who was a talented mathematician, to reveal his findings that Kesh was eight days behind Galactic Standard Time. While Bentado initially refused to accept Jaye's findings, the other Sith were convinced by Jaye's mathematical calculations and consented to the reading of Korsin's Testament. Thus, Hilts was legally obliged to convene the Pantheon's Peace."}, {"tag": "p", "text": "As a result, the Sisters of Seelah's occupation of the capitol building came to an end. The three Sith factions withdrew from the building while the Keshiri workers were freed and allowed to leave. Per tradition, only the Tribe's leadership was allowed to view the reading of Korsin's Testament and no Keshiri were permitted to participate in the Pantheon's Peace. Hilts convened the assembly which was attended by twenty Sith faction leaders including Iliana, Korsin, Neera, and the leader of the Golden Destiny, a faction that was concerned with the stellar aspects on the Tribe's history. Ultimately, Yaru Korsin's Testament did nothing to resolve the Sith factions' differences; with different factions interpreting the Founder's message differently."}, {"tag": "p", "text": "Following the end of Korsin's recording, Hilts discovered that it had been recorded over an earlier recording: a message from the ancient Sith Lord Naga Sadow to his slave Yaru Korsin. The faction leaders quickly discovered that their ancestors were not \"special\" but were actually the descendants of runaway slaves who had become trapped on Kesh. In an attempt to cover up this \"inglorious history\", Iliana personally destroyed the holocron and the Sith leaders swore not to reveal the contents of the meeting. However, news of the disastrous Testament Day eventually spread to their followers, which triggered a massive outbreak of violence on Keshtah Minor known as the Great Crisis. Varner Hilts was able to end the Great Crisis by discovering a map at the Kesh Sith Temple which confirmed the existence of a second continent known as Keshtah Major. As a result, the Hilts became the new Grand Lord and ushered in the Hilts Restoration."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}