{"url": "Ochi", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Assassins", "Category:Cyborgs", "Category:Individuals of unidentified species", "Category:Jedi hunters", "Category:Males", "Category:Members of the Acolytes of the Beyond", "Category:Pilots", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Ochi"}, {"tag": "p", "text": "Ochi, also known as Ochi of Bestoon, was a humanoid alien male devotee of the Sith Order. Since the time of the Clone Wars, Ochi was a Jedi killer and hunter of Sith arcana. An associate of Yupe Tashu, an adviser of the Galactic Emperor and Dark Lord of the Sith, Darth Sidious, he served the Acolytes of the Beyond of the Sith Eternal. Ochi also worked as a Sith assassin under Sidious, operating for the Lord of the Sith even after the latter's death at the Battle of Endor. Darth Sidious' Exegol-based cult, the Sith Eternal, sent Ochi to retrieve Sidious' granddaughter Rey. When Rey's parents refused Ochi her location, he killed them, sealing the girl's fate as the only blood-relative of Sidious. Later, after he bragged of knowing the secret location of the fallen Emperor at a cantina, Ochi was tracked by Luke Skywalker and Lando Calrissian to Pasaana, where Ochi became stranded under its desert sands and died."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi killer, relic hunter"}, {"tag": "p", "text": "The humanoid Ochi of Bestoon was an associate of Yupe Tashu who served the self-styled Acolytes of the Beyond. A Jedi killer since the time of the Clone Wars—a galaxy-wide conflict between the Galactic Republic and Separatist Alliance—Ochi became a hunter of Sith relics during his infamous career, operating as a ruthless assassin and a devotee to the dark side of the Force. Ochi eventually became a Sith loyalist. At some point in his life, Ochi acquired the services of the droid D-O from one of his victims."}, {"tag": "h3", "text": "Assassin of the Dark Lord"}, {"tag": "p", "text": "At some point in his life, Ochi of Bestoon came into the direct service of the Dark Lord of the Sith Darth Sidious, who was publicly known as Emperor Palpatine of the Galactic Empire, as a Sith assassin."}, {"tag": "h4", "text": "Hunting Darth Vader"}, {"tag": "p", "text": "In 3 ABY,[source?] Ochi was tasked by Darth Sidious with hunting down his wounded Sith apprentice, Darth Vader, on Mustafar as part of Vader's Sith training to strengthen his connection to the dark side of the Force."}, {"tag": "p", "text": "Ochi quickly engaged in a short duel with Vader, during which he managed to rob the Sith Lord of his lightsaber and trap him in a Mustafarian cave with the Eye of Webbish Bog and various other creatures. Despite the assassin's initial elation at having beaten Sidious' apprentice, Vader soon escaped the cave, having been gifted with a Sith wayfinder by the Eye. To attack the Sith Lord, Ochi employed the assistance of the Droid Crush Pirates of Bestoon, to whom he had promised any valuable spare parts from Vader's cybernetics."}, {"tag": "p", "text": "Vader managed to fend off the Pirates' onslaught, but not before one of the droids was able to cut off part of the Sith Lord's artificial leg. Upon examination, the droid realized that the parts that comprised Vader's suit were obsolete and useless, and turned on Ochi. The assassin was saved from the Pirates by Vader, who quickly incapacitated him to retrieve his lightsaber."}, {"tag": "h4", "text": "Darth Vader's prisoner"}, {"tag": "p", "text": "After destroying the Pirates, Vader used their parts to repair an abandoned Eta-2 Actis-class light interceptor. With Ochi at his mercy, the Sith Lord ordered him to decipher the coordinates hidden in the wayfinder's glyphs. Ochi attempted to trick Vader by entering different coordinates into the starfighter, but his captor noticed the ruse and threatened him until the assassin revealed the wayfinder's true path, to the planet Exegol. Satisfied, Vader trapped Ochi within an escape pod and attached said pod to the starfighter, jumping through hyperspace to follow the route laid out by the wayfinder."}, {"tag": "p", "text": "The two men soon arrived at the Red Honeycomb Zone, where they encountered a massive, tentacled space-faring creature related to the summa-verminoth, as well as several Star Destroyers. Strafed by hundreds of TIE Fighters, Vader flew the pair into the Zone, where several of the pursuing TIEs were destroyed by the creature's tentacles. However, the pair's safe passage through the nebula was short-lived, as the psychic creature overcame both of their minds, overwhelming them with visions of their own deaths. They crash-landed on Exegol's surface, where the creature loomed over them. Despite Ochi's insistence that they should flee, Vader stood his ground and used the Force to tame the creature."}, {"tag": "h4", "text": "Sith Citadel on Exegol"}, {"tag": "p", "text": "As Vader tamed the tentacled creature, Ochi fled downhill to the nearby Sith Citadel, where his master, Darth Sidious, was waiting. Ochi stood witness as Vader attempted to confront his master using the creature under his control. Sidious, however, ultimately defeated the creature with little effort, using the Force to compel the creature to squeeze itself with its own tentacles until it sliced itself apart."}, {"tag": "p", "text": "After the behemoth's death, Sidious laughed as he retreated into the Sith Citadel. Ochi followed Vader as he entered the Citadel to pursue his master. Inside, Ochi witnessed cloning facilities, ancient monuments and effigies of ancient Sith Lords, and legions of Sith cultists and acolytes. As Ochi followed Vader deeper into the Citadel, Ochi watched as the Sith Lord defeated both Force-sensitive and non-Force-sensitive assailants."}, {"tag": "p", "text": "As he continued to pursue Sidious, Ochi attempted to persuade Vader to give up his quest for vengeance against Sidious and offered to broker a deal with the Emperor if Vader would cease fighting, which Vader ignored. As they continued deeper into the Citadel, Vader and Ochi discovered one of the Emperor's greatest secrets: a massive fleet of Star Destroyers, each a thousand times more powerful than the Imperial I-class Star Destroyers currently in service by the Empire, and each equipped with a planet-destroying cannon."}, {"tag": "p", "text": "Ochi followed Vader as he continued to be drawn further into the Citadel. Following the sense of suffering and pain within the Citadel, Vader eventually led the pair to what appeared to be the Citadel's heart. Within a massive chamber was a dome with red-light shining from the glass pane's near the top. As Vader was drawn towards the chamber, Ochi attempted to persuade Vader to come back with him to broker peace with Sidious. Vader ignored him, as Ochi followed him into the chamber, they discovered its contents: the peak of a subterranean mountain of kyber crystal. Sith cultists forced the crystal to scream and suffer, which the Sith believed imbued the crystals with more power. Pieces mined from the kyber mountain were used to power the Emperor's machinations and his fleet's planet-destroying weapons."}, {"tag": "p", "text": "After the kyber crystal was cut, the crystal screamed out in pain and sent out a wave of power, throwing back the Sith cultists who worked in the chamber. Ochi was knocked back as well, and in the process, his helmet was thrown off and the blazing, blood-red light from the kyber crystal burned Ochi's exposed eyes, blinding him. Within the blinding, red light, Sidious appeared and revealed the unlimited power he harnessed through the planet's subterranean suffering kyber. Faced with such strength, Vader appeared to realize he could not compete with the Emperor's power, making Vader finally acquiesce to his master."}, {"tag": "h4", "text": "Serving Darth Vader"}, {"tag": "h5", "text": "A new master"}, {"tag": "p", "text": "Once they returned to Coruscant, Ochi was implanted with a cybernetic visor so he could continue to see. When Vader asked his master his will, the Emperor told him to decide that for himself. Vader then called Ochi over and the Emperor allowed him to leave with the Sith Lord. Traveling to a remote outpost somewhere in the Outer Rim, they met with a Hutt named Bokku. Ochi asked Bokku for the whereabouts of Han Solo, to which Bokku reported that Jabba had lost Solo and would recover him. However, Ochi then told the Hutt that he would recover Solo himself in exchange for power. When Bokku asked Ochi if he served the Emperor, Ochi replied that they both served Vader now."}, {"tag": "h5", "text": "Ambush at Zee-Nine City Seven"}, {"tag": "p", "text": "Vader was then attacked by a group of Gamorrean guards, which the Sith Lord slew with ease. Bokku quickly apologized for not recognizing Vader and reiterated that he didn't know where Solo was. From this, Ochi determined that Jabba had likely hired someone to find Solo and asked Bokku for their identity. Bokku expressed fear at the idea of betraying Jabba until Ochi pried into Bokku's willingness to take over the Grand Hutt Council himself. Bokku then revealed that he had been tracking the hunters who had taken Jabba's bounty and that one crew of droids had gone in a different direction from the others. Bokku told Vader the droids were deep in the heart of Hutt Space and that it would be better to go in Bokku's barge so as not to scare them away. On their way to the droids' location, Bokku inquired as to his compensation for his assistance, to which Vader assured him that he would be rewarded. He also asked Ochi if Vader could be trusted, to which Ochi replied that there was no safe haven anywhere and that the only way to survive was to find the biggest monster to stand behind. Under the piloting of Bokku's nav droid Gak-Sixtoo, they arrived at Zee-Nine City Seven while Vader and Ochi boarded their Lambda shuttle. But as they approached the city, their ship's engines were shut down, causing them to crash. After escaping the wreckage, Vader and Ochi were confronted by the Droid Crush Pirates, who expressed shock at Ochi's service to Vader. When Ochi claimed he had picked the winning side, the droid captain told him he had picked wrong as IG-88B revealed himself and fired upon both Ochi and Vader."}, {"tag": "p", "text": "As Vader deflected IG-88's attacks, the droid reminded his target that he had sustained damages while IG-88 himself had not. Vader informed the droid that he had information he required and commanded him to lay down his weapons, to which IG-88 replied that Vader would only access his information by downloading it from his severed head. Vader went to attack IG-88, but the droid then took out a device and used it to slice into Vader's armor, taking control of the Sith Lord. As IG-88 forced Vader to hold his own saber to his head, Vader demanded to know who had given the droid the code to breach his armor. IG-88 responded that the terms of his employment prevented him from sharing that information. While the droid was distracted, Vader used the Force to take the device from him, allowing him to use it against his attacker. Vader then forced IG-88 to hold his own blaster to his head and pull the trigger, incapacitating him. Vader then continued his fight against the pirates until Bokku's barge fired upon him. Vader blocked the blasts with his lightsaber and redirected the energy at the pirates, knocking them back along with Ochi. As the pirates retreated, Ochi ordered the droid captain to reveal Solo's location. However, the droid captain simply laughed and said he would kill Ochi next time, to which Ochi said he couldn't wait. Vader then took IG-88's hand and used it to access a terminal he had been using earlier. Upon activating the terminal, Vader and Ochi discovered various dead ends that the droid had been chasing, as well as the symbol of crime syndicate Crimson Dawn. After acquiring IG-88's information, Vader returned to Bokku's barge and confronted him over his betrayal. When Vader asked the Hutt what he had learned, Bokku conceded that the Sith could not be defeated, which Ochi noted was a good answer."}, {"tag": "h5", "text": "Auction for Han Solo"}, {"tag": "p", "text": "After discovering that Sly Moore had hired the droid, Vader and Ochi returned to Coruscant to find her, her court and IG-88 in Administrative Temple Garden 313A. As Vader struck down IG-88 once again, Moore and her court fled into the Imperial Palace. As they attempted to escape into the streets, Vader used the Force to close the door in front of them. However, Moore then took out another remote and used it to freeze Vader in his own armor, allowing her and her court to open fire on the Sith Lord. But this did not last as Vader overcame the Umbaran's control and struck down her entire court. Moore tried once more to take control of Vader, but Ochi revealed that Vader had fixed that vulnerability in his armor. Vader then knocked the remote out of Moore's hand and told her that she could not bend his will. Moore responded that she only wanted to see if Vader was still plagued by fear, to which Vader said that the only fear in that place was hers. Moore conceded that he could kill her effortlessly, but also pointed out that doing so would do nothing to save him from Luke Skywalker. When Vader asked the Umbaran what she knew of Skywalker, she revealed that the key to finding him, his friend Han Solo was currently being sold by Crimson Dawn. She also pointed out that if she secured Solo for Vader, then the Emperor would not learn of his plans. When Ochi asked Moore why Vader should trust her, the Umbaran answered that she would be delighted to reunite Vader with the only person who could kill him, to which Vader agreed and Ochi laughed."}, {"tag": "p", "text": "Shortly after, Ochi and Moore left for Jekara along with a few Imperial officers to attend the Auction for Han Solo, which was led by Crimson Dawn's leader, Lady Qi'ra. Once the bidding began within the Vermillion, Moore attempted to bid for the smuggler, but soon found herself in conflict with Jabba, Bokku and the rest of the attending Hutts. While the Umbaran was able to use the Force to weaken the minds of the other bidders, she found that the Hutts were too strong-willed for her to manipulate. After losing the bid, Moore took Ochi aside and asked why Bokku was bidding against her. Ochi explained to her that Vader had only sent her there to humiliate her in the Emperor's eyes. The auction was then interrupted by the arrival of Vader himself. Guarded by a pair of death troopers, the Sith declared that Solo belonged to him."}, {"tag": "h4", "text": "The rogue clone"}, {"tag": "p", "text": "Ochi was a member of the Sith Eternal cult devoted to following Darth Sidious after his death at the Battle of Endor and resurrection on Exegol. Ochi was tasked with the retrieval of Sidious' granddaughter, Rey, from her mother and father, who was the son of the Sith Lord himself. Wielding a dagger, Ochi eventually tracked down his master's son and daughter-in-law only to discover they had hidden her. Rey was left with junk boss Unkar Plutt on the planet Jakku. After refusing to surrender their daughter's location, Ochi used his dagger to murder them both aboard his ship, the Bestoon Legacy."}, {"tag": "h4", "text": "Silent sands"}, {"tag": "p", "text": "After killing Rey's parents, Ochi attracted the attention of Jedi Luke Skywalker, who was searching for a rumored \"key\" to Exegol, and, alongside Lando Calrissian, he tracked Ochi to the desert world of Pasaana. Ochi had come to their attention after bragging in a cantina about having a clue to the location of the Emperor's wayfinder, saying he had the coordinates inscribed. The two pursued the Jedi hunter hoping to gain information, but before they could arrive on Pasaana, Ochi was trapped in sinking sands of the Shifting Mires, dying in the deep caverns below. The trail went cold. When Skywalker and Calrissian found the Bestoon Legacy, they found it abandoned, with no trace of Ochi himself or clues of the wayfinder. Ochi's bones were picked clean by gouge-beetles."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In 35 ABY,[source?] Darth Sidious announced his revived intentions to dominate the galaxy, triggering the Resistance to renew their search for Exegol. On Pasaana, Rey, along with Finn, Poe Dameron, Chewbacca, C-3PO, and BB-8, found themselves in the same predicament as Ochi once did, after hoping to explore his derelict ship, only to be caught in the sands and to sink underground. While in the caves, Rey found Ochi's remains, as well as his Sith dagger, which she learned was the missing key that Luke Skywalker had searched for. Unlike Ochi, however, Rey and the others escaped the caves, and Rey sought justice for her parents."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ochi of Bestoon was obsessed with ancient Sith arcana. While not Force-sensitive himself, the relic hunter believed that the dark side of the Force propelled him and shaped his actions. He considered his murders to be in the service of the greater darkness beyond the veil."}, {"tag": "p", "text": "Before perishing in the sands of Pasaana, Ochi of Bestoon bragged about his knowledge of the location of the Emperor's wayfinder in a cantina. Ochi was an unkind master to D-O, a droid whom he neglected and discarded. After the assassin's demise, the stuttering droid was left aboard the Bestoon Legacy, depleted of battery charge."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ochi of Bestoon possessed a personal knife used to commit acts of murder. The assassin also captained a ship named the Bestoon Legacy, which was left with D-O on Pasaana after the Sith assassin's demise there. During the hunt for Darth Vader on Mustafar, Ochi wore a mask and armor to aid him in the fight. He was equipped with a blaster pistol and a spear with a spearhead on one end and an axe head on the other."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ochi of Bestoon was played by creature performer and puppeteer Liam Cook in the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third installment of the Star Wars sequel trilogy. Ochi's design came from a piece of concept art made for Boolio."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}