{"url": "Octusi", "categories": ["Category:Legends articles", "Category:Enslaved species", "Category:Octusi", "Category:Outer Rim Territories species", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Octusi"}, {"tag": "p", "text": "The Octusi were a semi-sentient species that lived on the planet Blaudu Sextus, where they were used as slaves by members of the world's mining colony. In 44 ABY, the slaves held a freedom march, but when Galactic Alliance Chief of State Natasi Daala heard of the development from Wynn Dorvan, her Chief of Staff, she arranged for a brigade of Mandalorians to be sent to Blaudu Sextus to prevent the incident from becoming a full-fledged revolution."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Octusi were a centauriform alien, with an Ithorian-like torso and head rising from the forequarters of a shaggy, barrel-chested nerf. They had shaggy white fur and a long, barrel-shaped abdomen connecting their hind and forequarters. In the broad, flat trunk rising up from the forequarters, there was a gracefulness hinting at their tranquil nature, and in their broad shoulders and hammer-shaped head there was a gentle beauty horn."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Octusi were natives of Blaudu Octus in the Regulan system. They were a pacifistic, gentle and rule-abiding species that could not conceive of others being otherwise. Most Blauduns (a hairless green biped with sunken eyes and a long dagger-thin nose), the colonizers of Blaudu Sextus, did not accept that they were truly sentient. The Octusi were mostly classified as semi-sentient."}, {"tag": "p", "text": "The Octusi spoke and understood nearly a hundred words, but they did not read or write, and they had no concept of time beyond now, later, and \"before\". They used simple hand tools to dig and to shape stone, but they did not understand levers or pulleys. They have also have always been confused by the idea of money."}, {"tag": "p", "text": "The Blauduns owned their Octusi, but regarded them as working pets and treated them well. Their harvesting ships made regular trips to Octus for more Octusi labor. They were escorted to work everyday, but only because they would spend the day wandering otherwise. When they were done working, they were free to do as they wish. But due to the steep axial tilt of their own planet, the Octusi spent their lives migrating and following the seasons in search of good grazing. This was a hard life where they rarely lived more than twenty standard years. So when an Octusi can no longer keep up, the band would often seek out a harvesting ship from Sextus and ask the Blauduns to take them. In their care, the Octusi were known to live eighty years. The Octusi were free to return to their homeworld of Octus to die if they wished."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}