{"url": "Odan-Urr", "categories": ["Category:Canon articles", "Category:Authors", "Category:Individuals of unspecified species", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Odan-Urr"}, {"tag": "p", "text": "Odan-Urr was a Jedi Master who served the Jedi Order. Odan-Urr was one of several Jedi who annotated the sacred Jedi texts, artifacts dating to millennia before the war between the First Order and the Resistance."}, {"tag": "p", "text": "A prominent figure in the legendary Qel-Droma Epics, Odan-Urr supposedly trained on the planet Ossus under Jedi Master Ooroo, fighting alongside Empress Teta in the Unification Wars. According to the epics, Odan-Urr was responsible for the construction of both the Great Jedi Library and the Knossa Branch Library on Ossus, cataloguing and studying ancient artifacts."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Odan-Urr was a constant figure throughout the stories of the Qel-Droma Epics, quasi-historical legends set long before the time of the Galactic Empire. According to the myths, Odan-Urr received his Jedi training at the Jedi Praxeum on the planet Ossus under Jedi Master Ooroo. Obtaining the rank of Jedi Master himself, he fought alongside Empress Teta in the Unification Wars, in which Teta conquered the Koros system and Koros Major, which were named in her honor. While Empress Teta was rebuilding from the Unification Wars, the Sith Empire invaded, initiating the Great Hyperspace War, during which Ooroo died."}, {"tag": "p", "text": "The Qel-Droma Epics also claimed that, honoring a promise to his Master, Odan-Urr designed and oversaw the construction of the Great Jedi Library atop the Ooroo Canyon on Ossus. Within the library, Odan-Urr catalogued and studied ancient artifacts in the Chamber of Antiquities, as well as translating and digitizing writings. Odan-Urr also commissioned the Knossa Branch Library in the Ossus city of Knossa, for academics and Jedi who sought knowledge for time-sensitive investigations."}, {"tag": "p", "text": "An author, Odan-Urr was one of several members of the Jedi Order who added annotations to the sacred Jedi texts, created millennia before the war between the First Order and the Resistance. Odan-Urr was also believed to have written the modern Jedi Code."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "According to the Qel-Droma Epics, Odan-Urr was a male individual who favored knowledge above all else."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the new Star Wars canon, Odan-Urr was first mentioned in Nexus of Power, a 2016 sourcebook for Fantasy Flight Games' Star Wars: Force and Destiny roleplaying game. In the Star Wars Legends, Odan-Urr first appeared in the comic Tales of the Jedi – Dark Lords of the Sith 3, written by Tom Veitch and Kevin J. Anderson, penciled by Chris Gossett, and published by Dark Horse Comics on December 1, 1994."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}