{"url": "Odavia_Anaru", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:New Republic Starfighter Corps personnel"], "nodes": [{"tag": "h1", "text": "Odavia Anaru"}, {"tag": "p", "text": "Odavia Anaru was a human female A-wing pilot who single-handedly destroyed the Imperial AT-AT Hellhound Two on Jakku. She was posthumously awarded the Medal of Valor for her actions."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Odavia Anaru was an A-wing pilot assigned to General Carlist Rieekan's ship Striking Distance during the Battle of Jakku. Anaru was among the starfighter escorts that accompanied the New Republic transports down to the surface of Jakku and guarded them while they off-loaded squads of commandos. Anaru circled above the battlefield, strafing Imperial positions and shooting down Imperial TIE fighters sent to oppose her."}, {"tag": "p", "text": "During the battle, Anaru was shot down by a surface-to-air missile over the Goazon Badlands. Anaru ditched her mangled A-wing and sprinted for cover despite her injured leg. Stranded far from the New Republic commandos, she fought off Imperial stormtroopers with nothing but her standard-issue blaster pistol."}, {"tag": "p", "text": "When the Empire deployed AT-ATs to protect its research facility, the walkers turned their cannons on the entrenched Republic commandos. Anaru, retreating to better cover, took a rocket launcher from a fallen trooper. Bracing the heavy weapon against a broken hull fragment, she took aim at the lead AT-AT, Hellhound Two, and fired. Despite stormtroopers rushing her position, Anaru didn't move, firing all six rockets at the AT-AT's weak points. While Hellhound Two crumbled, Odavia Anaru was not alive to see it. She was posthumously awarded the Medal of Valor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Anaru was a human female with light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a pilot of the New Republic, Odavia Anaru wore a green flight suit and helmet, while operating an RZ-1 A-wing interceptor."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}