{"url": "Oden_Malksch", "categories": ["Category:Legends articles", "Category:Humans", "Category:Lore Keepers", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Oden Malksch"}, {"tag": "p", "text": "Oden Malksch was a male Human Jedi Knight serving the Jedi Order and the Galactic Republic during the waning years of the Republic Classic era before the rise of the Empire and the dissolution of the Jedi."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Trained in the ways of the Force by the Jedi Order, the Force-sensitive Oden Malksch had risen to the rank of Jedi Knight after passing his Trials of Knighthood. Studying along the path of the Jedi Consular, Malksch specialized as a Lore Keeper, becoming a noted historian within the Order. Assigned to the experimental academy on Almas, Jedi Malksch wrote a number of papers concerning the happenings in the Cularin System. Of particular interest to Malksch were the radical changes in the Metatheran Cartel, the government on Almas, and the growing darkness from an ancient Sith fortress which seemed to be slowly gathering power. Malksch hoped that his writings would provide future historians an idea of the times he lived in and could use them to understand the course that history took."}, {"tag": "p", "text": "Around 20 BBY, Malksch was appointed as the head of the Academy Archives. During his tenure there, seven bodies were found at the Sith fortress and brought to the Academy for study. Amongst the bodies were two Jedi from the academy and the Dark Jedi Karae Nalvas. After a thorough examination, Malksch discovered that their Force-essences had been uprooted from their bodies and were being stored elsewhere. Concluding that the orange jewel pendants draped around the bodies' necks were some how connected to their strange condition, Malksch broke the pendant around Nalvas' neck and found his essence transferred into his body. Conscious in the form of Dark Jedi Nalvas, Jedi Malksch could sense where the man's essence was trapped and that his body yearned to be reunited with it. Guiding a Jedi rescue team to this location, the Jedi found the trapped Force-essences of the seven bodies and all were returned to their natural states."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}