{"url": "Odenji", "categories": ["Category:Legends articles", "Category:Aquatic sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Odenji"}, {"tag": "p", "text": "The Odenji were a sentient species indigenous to the planet Issor, which they shared with their cousin species, the Issori. Originally a nomadic underwater society, the Odenji moved to the land after being discovered by the Issori, with whom they formed a merged society. The two species advanced together and colonized the rest of their native star system, after which they were discovered by the rest of the galactic community. Members of the species could breath on land and in water, due to possessing gills and lungs, and instead of a nose each Odenji possessed four olfactory flaps. The Odenji suffered a long period of species wide depression known as the melanncho, during which their population was severely reduced. Following the disastrous period, the Odenji became a sad and pitiful species, rarely displaying happiness and taking a more apathetic role in their homeworld's society. Individual Odenji continued to suffer personal melanncho long after the period of species wide depression was over."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Odenji were a sentient species of medium-sized hairless, aquatic, bipeds which on average stood between 1.5 and 1.8 meters tall. The species was adapted to life underwater with both gills and large webbed hands and feet, although they also possessed lungs and so were perfectly capable of living and breathing on land. Odenji had normal upright humanoid posture, with two arms and two legs, the former of which ended in four-fingered hands. These limbs allowed the species to be capable swimmers. An Odenji's face included two large black eyes positioned above four horizontal flaps of skin with the same olfactory purpose as a nose. The species also possessed a protrusion on either side of their chin. Their skin was smooth and ranged from dark brown to tan in color. They were cousins to the Issori species, with whom they shared their homeworld."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Odenji were originally a nomadic culture which dwelt entirely within the oceans of their homeworld Issor, using feudal technology to survive. This changed upon the discovery of the Odenji by the Issori, who persuaded the Odenji to relocated their entire society onto the land. There the Issori and Odenji lived together, sharing the Issori's more advanced technology and eventually creating a space program which allowed them to colonize other worlds. The merged society in which the Odenji lived was governed by the Tribes of Issori and Odenji, which also came to govern the worlds the two species colonized. After the Odenji and Issori made contact with the rest of the galactic community, they imported large amounts of off-world technology, bringing them up to speed with other cultures. For the most part the Odenji allowed the Issori to handle all trade within the galactic community, although the species still aided in the production of the goods they traded."}, {"tag": "p", "text": "During the period of melanncho depression and violent crime reached an all time high within the Odenji species. Following the disastrous period, the Odenji became a sad and pitiable people, with few ever expressing happiness, joy or humor unless with very close friends of family. Due to the sadness, most Odenji behaved in an extremely apathetic manner, and many refused any positions of authority. Despite this outward attitude many Odenji wished to be more joyful, and some devoted their time to pursuit of happiness against the seemingly insurmountable odds. Any Odenji could fall into a personal melanncho after a tragic or disturbing event in their life, including the death of a friend of family member. When some Odenji came to believe that the melanncho had been caused by the species migration away from the oceans, they returned to their watery home, shunning all technology beyond the feudal devices their ancestors had used beneath the waves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Native to the Outer Rim Territories world of Issor, located in the Arkanis sector's Issor system, the Odenji's first developed culture was nomadic and totally aquatic. They lived in this manner until they were eventually discovered by their land-dwelling Issori cousins, who shared their feudal technology with the aquatic beings. The Odenji were then persuaded to move their society onto the land, leading to the two species soon living in unison and working together under a combined Tribes of Issori and Odenji. Within a few centuries of the two species cooperating they had reached information level technology due to a hugely increased rate of scientific advancement. Together with the Issori the Odenji started a space program to search for other intelligent life, and soon the two had colonized all of the other planets within their system including Trulalis where they established dominance over the Human population living there. The region of space in which Issor fell was first widely explored between 20,000 BBY and 15,000 BBY, and some years after the Odenji and Issor space program had begun, they were contacted by a Corellian scout team who landed on their planet, and although initially surprised at finding other sentients, the two partner species quickly joined the galactic community and gained access to far superior techonology to their own. The Issor system became the economic powerhouse of the entire Arkanis sector in terms of legal trade, with Issor becoming an industrial world. During the period between 11,000 BBY and 12,000 BBY the Odenji's homeworld fell within a region controlled by the Galactic Republic, but by 1004 BBY it was within the region known as Hutt Space, which was controlled by the Hutt species, and itself apart of Sith controlled space during the New Sith Wars."}, {"tag": "p", "text": "Several centuries prior to 0 ABY, the Odenji were nearly wiped out during a period known as the melanncho, in which they suffered an unexplained species-wide sadness. The sadness was so great in some individuals that it drove them to insanity and eventually death. The Odenji survived, but despite Issori attempts at helping, their population was severely reduced, leaving the Issori as the far more populous species on their shared homeworld. Even after the species wide melanncho subsided, many individual Odenji continued to experience it and various theories eventually arose as to what had caused the great depression. Some believed that the Odenji had been infected by a virus or strain of bacteria, and that the sadness was a symptom of the disease. This view was held by the Issori smuggler Fahs Oxsor, who mentioned the melanncho when his friend Toob Ancher came down with the disease known as Bitter Winter, which was similar to melanncho. Some Odenji started to believe that the depression had been caused by their migration from the sea, and as such small communities of Odenji began to move back under the water, much to the horror of the Issori. The region of space within which the Odenji lived was taken over from the Hutts by the newly formed Galactic Empire in 19 BBY. A new theory as to the cause of the melanncho period was created by Imperial scientists, who claimed the depression was merely a genetic default in the species which would of wiped them out had it not been for the intervention of Human medicine. Issor was no longer considered to be in Imperial space by 4 ABY. In the year 25 ABY, the Odenji homeworld fell within a region of space with an average of population per planet of between one million and ten million sentients. By 137 ABY The Odenji's homeworld fell within the Galactic Empire of the Sith Lord Darth Krayt."}, {"tag": "h2", "text": "Odenji in the galaxy"}, {"tag": "p", "text": "Some Odenji did leave their homeworld and travel the galaxy, although not in as greater numbers as the Issori. Those that did leave could often be found on ocean worlds or in marine-related professions. Odenji who began suffering from melanncho while away from home would usually return to Issor and spend the remainder of their days living in the planet's oceans."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Odenji were first mentioned in \"A Bitter Winter\", a short story written by Patricia A. Jackson and published in 1995 in Star Wars Adventure Journal 5. The species later received an entry in the Alien Encounters article series, which was written by Brian Smithson and published in Star Wars Adventure Journal 13. This entry included roleplaying stats for the species use in the West End Games Star Wars: The Roleplaying Game, and an image of the species. A shortened version of the Alien Encounters article entry was included in 1998 in Alien Encounters, a book compiled by Paul Sudlow, which also included a new illustration of the Odenji."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}