{"url": "Odik_II", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire planets", "Category:Prisons", "Category:Sector 5 planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Odik II"}, {"tag": "p", "text": "Odik II was a planet that was located on the Byss Run hyperlane in the Deep Core. It housed political detention wards used by the Galactic Empire to secretly imprison many dissidents. The Human officer Major Calders served at the detention facility before being reassigned aboard the Imperial Death Star battlestation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Odik II was a Deep Core planet that occupied the second orbital position within the Odik system. The Byss Run hyperlane connected it to the Prakith and Byss systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the first campaigns of the Clone Wars were waged between the Galactic Republic and the Confederacy of Independent Systems in 22 BBY, the Odik system fell within Sector 5, an area of space that the Fifth Deep Core Army of the Republic Military was tasked with defending against the military forces of the Confederacy. During the reign of the Galactic Empire, Odik II served as the seat of power for Grand Moff Cinzero Gann."}, {"tag": "p", "text": "Odik II also was the site of highly-secret political detention wards used to imprison many Imperial dissidents. The Human male officer Major Calders began his career as a security guard at the prison camps of Odik II. He excelled at his work and shortly became the warden for the entire detention facility. By 0 BBY, Calders had been reassigned to the Imperial Death Star battlestation, which was being constructed over the Outer Rim Territories planet Despayre."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Odik II was first mentioned in Death Star Technical Companion, a 1991 sourcebook authored by Bill Slavicsek for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Odik system, and therefore Odik II, in grid square K-11."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}