{"url": "Odion", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Sith Lords of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Odion"}, {"tag": "p", "text": "Odion, along with his younger brother and major rival Daiman, was a male Human Sith Lord who ruled an area of the Grumani sector which came to be known as the Odionate during the Republic Dark Age. Odion was the eldest son of Xelian, a powerful female Sith Lord who ruled a realm of space within the Grumani sector. Odion's unpleasant childhood experiences at the hands of his mother and younger brother amplified his dark side powers and drove him to embrace a nihilistic philosophy which embraced death and nothingness as true peace. Odion rose through the ranks of the Sith, becoming a commander who led the invasion of Aquilaris Minor in 1042 BBY. With the collapse of the Chagras Hegemony in 1040 BBY, the Grumani sector descended into internecine civil warfare as feuding Sith Lords struggled for dominance. Odion subsequently gathered a cult of like-minded followers and established his own princedom which became known as the Odionate, one of the many Sith states which emerged from the ruins of the Chagras Hegemony."}, {"tag": "p", "text": "Odion's nihilistic ambitions earned him the animosity of his estranged younger brother Daiman, who saw himself as the Creator of the Universe, and the Jedi Order, which had been locked into a protracted conflict against Sith forces for nearly a millennium since the Fourth Great Schism in 2000 BBY. Odion was also constantly locked into a battle for galactic dominance against Daiman and other rival Sith Lords. At some point, he discovered the existence of the Helm of Ieldis, an ancient Sith artifact capable of driving sentient beings into a homicidal frenzy. Odion commissioned a task force known as Project Pandemonium to locate the artifact but they disappeared in 1039 BBY. Odion's actions also made him a target of the novice Jedi Knight Kerra Holt, who wanted to avenge the devastation of her homeworld at his hands. In 1032 BBY, Odion narrowly survived an ambush on the planet Chelloa which left him with grievous wounds. However, his life was saved by medical technology and he vowed to hunt down and destroy Kerra, who had wounded him during the climax of the Chelloan affair."}, {"tag": "p", "text": "Seeking to retaliate against his younger brother, Odion sent the Bothan spy operative Narsk Ka'hane on a mission to Daiman's capital of Darkknell. Narsk was assigned with collecting information about Daiman's starship Convergence, which was under construction at the Black Fang testing facility, and then to destroy the installation. However, Narsk was intercepted by Jedi Knight Kerra, who overpowered him and destroyed both the datapad containing the data and the facility itself. Daiman retaliated by releasing the Bothan spy while feeding him with false intelligence about a business deal on Gazzari with the Quermian Sith Lord Ayanos Bactra relating to the sale of an arxeum, a mobile war university. In reality, Daiman planned to yet again lure Odion into a trap on Gazzari, where his forces lurked behind the planet's volcanic ash clouds."}, {"tag": "p", "text": "As expected, Odion took the bait and invaded Gazzari with both sides sustaining heavy losses. In the middle of the battle, their grandmother and family matriarch Vilia Calimondra contacted Narsk and ordered the two brothers to cease fighting and join forces against Bactra, who had outlived his usefulness to the dynasty. After wiping out Bactra's fleet, the two Sith brothers along with Lioko and Malakite conquered and divided up the Bactranate among themselves. Following this short-lived cooperation, tensions between the brothers quickly resurfaced during a family bequest where Odion was bequeathed the former Odionate capital of Jutrand while his younger brother obtained the Industrial Heuristics company. While Vilia managed to appease Odion by giving him two legions of her Trandoshan slave warriors as quid pro quo, Odion and Daiman remained bitter enemies and sought to thwart each other."}, {"tag": "p", "text": "An opportunity to move against his younger brother surfaced again when an outsider—the Hutt crimelord Zodoh—threatened the Grumani sector. During the Aquilaris campaign, Odion and other Sith Lords collaborated with Zodoh's irredentist campaign against the Daimanate; keeping Daiman's forces preoccupied on the border regions. Ultimately, Zodoh made no serious strategic gains and was subsequently executed by Daiman, following a failed attempt to conquer Darkknell. In retaliation for Odion's role in indirectly aiding Zodoh's campaign, Daiman would connive with Kerra to defeat Odion once and for all. Kerra infiltrated the Odionate disguised as a prospective Novitiate adept named \"Mercy.\" Meanwhile, Odion was determined to end the stalemate in the Grumani sector, and restarted Project Pandemonium. Odion's longtime foe Kerra was part of a team of hunters assigned to recover the Helm."}, {"tag": "p", "text": "Through Kerra's efforts, Odion was able to locate the Helm on Skarpos, a bleak desert world that had been recently annexed from the Menagerie, a realm ruled by Sith Lord Malakite. At the peak of his power, Odion would harness the power of the Helm and use it to drive other sentient beings into a maddened homicidal frenzy. Following a successful test demonstration on Skarpos, Odion intended to deploy the Helm on the entire Grumani sector, and then the galaxy, by tapping into energies of the child captives of his planet-sized cloister on Vanahame as part of his plan to exterminate all life so he could be the sole sentient being in the galaxy. However, Odion's bid for galactic genocide was thwarted by his Jedi foe Kerra, who had succeeded in turning his second-in-command General Beld Yulan against him. During the ensuing climatic showdown, Odion was killed after the Helm overloaded from a surge of positive emotions when the captive children were freed. With his death, the Odionate collapsed into anarchy while his Sith \"family\" carved up territories for themselves."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Odion was the older son of the Sith Xelian and the grandson of Vilia Calimondra, a powerful Sith Lord and matriarch of a large clan of Sith Lords. His estranged relations with his younger brother Daiman stemmed from his childhood experiences when his mother Xelian openly favored his younger brother while regarding Odion as repulsive and ugly. This sibling rivalry was further compounded by his grandmother Vilia promising her empire to the heir that conquered the most territory. Vilia's actions led to a series of internecine conflicts known as the First and Second Charge Matricas. Since the day of Daiman's birth, Odion had experienced painful headaches which only increased his hatred of Daiman. As Odion's Force powers grew, he became hypersensitive to the mere existence of other beings which he regarded as a debilitating and tormenting experience."}, {"tag": "p", "text": "Odion's inability to find respite from his ailments drove him to seek solace in a nihilistic belief rooted in causing the deaths of other sentient beings. He came to believe that he could find relief from his affliction through murder, believing that each individual act snuffed out the bright lights tormenting his mind. As Odion's dark side powers increased, he also found joy in learning how to make others run to destruction by channeling the misery around them. Gradually, Odion gathered a cult of like-minded followers known as the Novitiates who sought nothing more than destruction and death."}, {"tag": "p", "text": "In 1042 BBY, Odion fought under the banner of the Sith Lord Chagras, his uncle and ruler of the Chagras Hegemony. Odion led a force of Sith Warriors and minions to the world of Aquilaris, where they took the lives of hundreds of civilians. During the assault, his forces also captured Aron and Mercia Holt, the parents of future Jedi Knight Kerra Holt. Through Mercia, Odion learned about the existence of the Helm of Ieldis, an ancient Sith artifact created by the Sith Lord Ieldis, who had lived prior to the Great Hyperspace War. The Helm was a dark side object capable of driving sentient beings into a homicidal frenzy. Odion initiated a task force called Project Pandemonium to locate and retrieve this artifact. However, the expedition ended with the disappearance of the Holt couple near the planet Sarrassia around 1039 BBY."}, {"tag": "p", "text": "Following the death of Chagras in 1040 BBY, Odion took control of a portion of the late Sith Lord's domain which became known as the Odionate. Odion's domain was organized according to his nihilistic beliefs with sentient beings being pressed into slavery within his armies and factories churning war materiel. Odion also implemented a policy of capturing and imprisoning all the children within his realm within cloisters where they would be brainwashed into becoming pliable workers and warriors. Since his nihilistic politics rapidly drained the ranks of his armies, Odion had to use Force-sensitive recruiters known as Claimers to recruit more followers. His domain was also be locked into internecine civil warfare over territory and resources against several other rival Sith Lords including his estranged brother Daiman, his cousin Malakite, and Ayanos Bactra."}, {"tag": "h3", "text": "Aflame"}, {"tag": "h4", "text": "Operation Influx"}, {"tag": "p", "text": "In 1032 BBY, Odion found out about baradium mining operations on Chelloa in the war-torn Grumani sector by tapping into interstellar transmissions.Chelloa was part of the domain known as the Daimanate which was ruled by his deluded brother Daiman. He allowed a Jedi task force under Jedi Master Vannar Treece to attack Daiman's baradium operation on Chelloa. Taken by surprise, Daiman's overseers initially thought it was an ambush by his brother."}, {"tag": "p", "text": "After Daiman's Sith troopers were disposed by the the Jedi, Odion did attack with a large fleet including his mobile space factory the Spike. He planned to destroy the planet's entire baradium deposits, regardless of the planet-wide devastation it would cause. Odion engaged in duel with Vannar Treece, a Jedi Master he was familiar with, and killed him. However, Odion's plan was stopped by Jedi Knight Kerra Holt, Treece's former apprentice, who caused Odion's kinetic corruptor to explode before it could ignite all the baradium in the planet, thus keeping the destruction on a far smaller scale. Afterward, Odion and his surviving forces withdrew back to the main fleet orbiting Chelloa."}, {"tag": "h4", "text": "Brothers at War"}, {"tag": "p", "text": "Following a duel with Kerra, Daiman revealed that Odion's fleet included the mobile space factory The Spike which was building even more kinetic corruptors. Earlier, Kerra and Gorlan Palladane had learned that Daiman was importing more mobile munitions complexes. Daiman sought to lure Odion to Chelloa's surface by provoking him with a feign attack and sending Holt over to leak intelligence on his new factories. Odion would land with his army on Chelloa's surface to capture the mobile munitions complexes where they would be trapped and destroyed by Daiman's own kinetic corruptors."}, {"tag": "p", "text": "To provoke Odion, Daiman dispatched a small strike force of Daimanate starfighters in an attempt to knock out the Spike. However, his light starfighters were wiped out by Odion's warships which included his flagship the Sword of Ieldis. Sustaining heavy losses, the Daimanites were forced to retreat. While Odion gloated over an easy victory, Holt bailed out from her starfighter into space and infiltrated The Spike by entering through an open hatch. She then overpowered and reprogrammed a labor droid known as GAD-3 and then reset his motivation center. Gad-3 also revealed learned that The Spike was dedicated solely to the production of kinetic corruptors and that all floors were decentralized from the main structure for security reasons."}, {"tag": "p", "text": "At that moment, they were interrupted by the arrival of Odion and his Givin second-in-command Jelcho to Pod 17. However, he did not sense them initially since they were hidden under the catwalk. Odion was preoccupied with using his corruptors to extract Chelloa's baradium deposits. When Odion inquired about Daiman's movements, Jelcho informed him of Gorlan Palladane, who was acting as a spy for Odion, that supplied intelligence on the existence of Daiman's baradium operations. From a recorded transmission, Palladane claimed that all of Daiman's mining operations were permanently offline in an attempt to draw Sith attention away from Chelloa. However, Odion dismissed the informant's latest reports as an attempt by Daiman or other parties to undermine his planned baradium operations."}, {"tag": "p", "text": "Odion then concluded the meeting by ordering all his kinetic corruptors to be prepared for landing on Chelloa to harvest all the baradium. Due to the volatile nature of baradium, much of Chelloa would be destroyed and rendered uninhabitable. While gloating of his recent victory over the Jedi particularly Master Treece, Odion suddenly sensed the presence of an intruder through the Force. In a fit of rage, he ripped apart the catwalk and discovered Holt."}, {"tag": "h4", "text": "Enter the Jedi"}, {"tag": "p", "text": "Brushing away Jelchro's concerns that he would damage the space station's infrastructure, Odion pursued Holt in a heated lightsaber duel. Kerra was also pursued by a mob of armed Gamorrean guards, followers of Odion who craved dying in combat. The fighting led the combatants through a series of catwalks to the upper levels of the Spike, the main structure supporting the various assembly lines. In a verbal confrontation, Kerra told Odion that she had attacked him aboard his space station to drive him away from Chelloa thus saving the lives of thousands of sentients. She also revealed that Daiman's mobile munitions factories were bringing in thousands more slaves by the day."}, {"tag": "p", "text": "Odion shrugged away Holt's concerns for innocent lives, arguing that all sentients existed only to be killed by him. Due to his nihilistic philosophy, Odion saw himself as the destroyer of all life in the galaxy and embraced death. As he prepared to strike Holt down with his lightsaber, she played her final card by ordering the reprogrammed Gad-3 to open all containment fields, thus opening much of the space station to zero-gravity space. This triggered an explosion that wrecked large areas of The Spike, destroying many labor droids and killing many workers. Further destruction was averted only by Jelcho reactivating the emergency shielding. As with all Givin, Jelcho had a tough exoskeleton that could seal all external orifices for protection against depressurization, allowing him to survive in hard vacuum."}, {"tag": "p", "text": "In the midst of the chaos, Holt hijacked a construction shuttle, incapacitating the pilot and then fleeing into space. Meanwhile, Odion ordered his entourage back to his flagship Sword of Ieldis. Understanding his Jedi opponent, Odion knew that Holt would return to confront him which was proven right. In an ensuing cat-and-mouse race in space, Holt's shuttle engaged Odion's gunship. Anticipating that Holt was going to ram her shuttle into his ship, he ordered his crew to open fire. However, the duel was interrupted by an incoming transmission from Lord Daiman. In a live broadcast from his Chelloan headquarters, a furious Daiman revealed to Odion that he had seized and tortured his informant, Gorlan Palladane. In response to the intelligence leakage, Daiman had ordered a military crackdown on all mining settlements on Chelloa with his troops destroying Jenith."}, {"tag": "p", "text": "Witnessing the plight of her friend, Holt aborted her run by doing a quick jump into hyperspace and returned to Jenith to save Palladane. The Sword's gunners attempted to shoot Kerra's shuttle but it was too late. A dejected Jelcho lamented his failure to destroy the Jedi woman and apologized to Odion, claiming that he and his fellow Givin did not deserve to live and that they would be willing to accept death as punishment. To the relief of Jelcho, Odion chose to spare his crew due to the intelligence on Daiman's mining operations he had discovered from Holt. Rather than using his kinetic corruptors to destroy the surface of Chelloa, he ordered his elite Lightning Guard to be loaded into landing ships to capture Daiman's factories near the baradium mines. He also planned to conquer Chelloa and annex to his interstellar principality—the Odionate. All this played into Daiman's hands."}, {"tag": "h4", "text": "Trapped"}, {"tag": "p", "text": "Odion's Lightning Guard were ferried to Chelloa's surface by landing ships. The assault force consisted of Guardsmen donning jetpacks and several hover tanks. As they approached the perimeter of the ten mobile munitions complexes, they were engaged by a token force of Daimanate Sith troopers. With the airborne Lightning Guardsmen providing strike power, the Daimanate forces were easily overwhelmed. Odion himself sensed that he was fighting inferior forces. They arrived at the pyramidal factories only to discover that they were empty shells containing kinetic corruptors. As Daiman had intended, Odion had taken the bait by landing his troops on Chelloa's surface where they would be destroyed along with himself by the kinetic corruptors. The Daimanate detachment assigned to guard the \"factories\" were merely cannon fodder used to lure Odion's forces into a trap. While Odion was trapped, Daiman and the bulk of his forces escaped the planet."}, {"tag": "p", "text": "Meanwhile, Jedi Knights Kerra and Palladane successfully evacuating 60,000 Chelloan civilians by hijacking several Daimanate starships at Arboth's spaceport. This hastily-assembled fleet became the Freedom Fleet which would evacuate the population to Republic space. In the ensuing explosion, many of the Odionate and Daimanate combatants were killed by the molten lava released from the inflamed volatile baradium shales under Chelloa's surface. Trapped, Odion ordered his surviving troops to board the cargo transports at Arboth in an attempt to escape destruction. However, they were prevented from boarding by the efforts of Kerra and Palladane who managed to evacuate the fleet before the lava reached the spaceport."}, {"tag": "p", "text": "Odion was the sole survivor of his invasion since his jetpack allowed him to escape into the atmosphere. As the Freedom Fleet ascended into the upper atmosphere of Chelloa, Odion pursued his Jedi foe Kerra who had boarded an airspeeder. Their pursuit ended on the hull of a cargo liner which ended in a verbal altercation. Odion taunted her by telling Kerra she had run out of perches and observed that she was trying to distract him from his goal of killing the refugees. In an attempt to provoke Kerra, he further gloated over the deaths and destruction he had wrought on her homeworld of Aqualaris. He would have continued his rampage had he not been forced by other circumstances to leave."}, {"tag": "p", "text": "Before he could attack Kerra, he was attacked by Gorlan Palladane. Fastened to a safety cord, the male Jedi drove Odion to the engine thrusters, expressing his desire for retribution for the destruction wrecked on his planet. Palladane intended to kill Odion while dying in the process. During the confrontation, the two men were badly burned by the thrusters and Palladane later died from his wounds. Meanwhile, a mortally wounded Odion was recovered by his followers who tended to him at the Spike over the following days. He was badly burned and part of his armor had been painfully fused to his skin. Had it not been for his jetpack, Odion would have perished in the upper atmosphere. The crew tended to him by removing as much armor as they could and treating his burns. Odion commented he wanted to feel the pain to fuel his hatred towards Kerra Holt. Despite his severe wounds and the loss of his entire Lightning Guard, Jelcho viewed the recent engagement as a victory since it denied his master's foe Daiman access to ships, slaves and the baradium deposits of Chelloa."}, {"tag": "h3", "text": "Knight Errant"}, {"tag": "h4", "text": "The Bothan Spy"}, {"tag": "p", "text": "Later that year, Odion hired the independent Bothan spy Narsk Ka'hane for a mission to infiltrate the Daimanate capital of Darkknell and gather information on Daiman's starship, Convergence, which was under construction at the Daimanate Dynamic Testing Facility and subsequently, to destroy the ship. Using a Cyricept Personal Concealment System, Mark VI stealth suit, Narsk infiltrated the testing facility and downloaded the Convergence's technical readouts onto a datapad. Leaving several baradium thermal charges with the ship, Narsk left the facility. However, he was intercepted by the Jedi Kerra, who hoped to obtain the Mark VI for her own use against Daiman. After a chase through the streets of the city Xakrea, Holt incapacitated Narsk and activated his remote detonator, which caused the destruction of the testing facility. Taking Narsk's Mark VI and detonator, Holt left the Bothan in a garbage bin, where he was captured by Daiman's police, the Correctors."}, {"tag": "p", "text": "Daiman, with suspicions of Odion's involvement in the destruction of the facility, plotted to ambush his brother. He brought Narsk to his fortress, the Sanctum Celestial, where he contacted the Quermian Ayanos Bactra, a neutral Sith Lord who preferred to gain power through corporate bureaucracy rather than military might. Daiman had recently allowed one of Bactra's corporations, Industrial Heuristics, to recruit students from Darkknell and elsewhere in his territory—known as the Daimanate—in exchange for the fruits of the students' research. Daiman requested an arxeum, a mobile university dedicated to the science of war, as well as recruits that Industrial Heuristics had taken from the Daimanate. In exchange, Daiman granted Bactra safe passage through the Daimanate to strike at Vellas Pavo, a gadolinium-rich planet. Bactra agreed to deliver the arxeum and the students to the volcanic world of Gazzari, on the frontier of Daiman's border with the Odionate—Odion's territory."}, {"tag": "p", "text": "Intending to lure Odion to Gazzari, Daiman allowed Narsk to listen in on his conversation with Bactra and secretly ordered the bonds holding the Bothan spy to be loosened, so that Narsk could escape and tell Odion what he had overheard. With the help of Holt, who sneaked into the Sanctum with Narsk's Mark VI, the Bothan escaped into the junkyard and made his way to a spaceport where he found passage offworld to a neutral world. There, he met several Odionites and hitched a ride back to the Odionate. Meanwhile, Daiman recruited the services of several mercenaries to execute the ambush including Brigadier Jarrow Rusher, Mak Medagazy, Kr'saang the Togorian, and a Nosaurian mercenary. Upon arriving on Gazzari, they assembled a series of Kelligdyd laser cannons on the eastern ridge of a massive bowl crater several kilometers across. Daiman's forces, invisible from orbit due to the thick clouds of volcanic ash, lined the ridge on all sides, surrounding the crater, where the trap set for Odion was to be sprung. Unknown to Daiman and the other participants, their perennial Jedi opponent Kerra had secretly stowed away on his flagship Era Daimanos."}, {"tag": "h4", "text": "The Gazzari Trap"}, {"tag": "p", "text": "As planned, Narsk returned to the Odionate and alerted his master about Daiman's business deal with Bactra. While Odion was enraged at the loss of the information on the Convergence stored in his datapad, the Sith Lord spared the Bothan's life since he had succeeded in fulfilling part of the mission by destroying the Black Fang facility. Narsk had also alerted his master to the Jedi Knight Kerra's presence, which interested Odion since he desired revenge against the Jedi woman for seriously wounding him during the Chelloan incident. In return for his services, Odion allowed Narsk to participate in his battle preparations for the assault on Gazzari on the Sith Lord's flagship Sword of Ieldis. Despite Narsk's misgivings that Daiman was planning a trap, Odion dismissed it as merely a natural part of his younger brother's tactics. Due to his nihilistic ideology, Odion was also willing to recklessly sacrifice the lives of his men to hasten the end of time."}, {"tag": "p", "text": "Upon arriving in the Gazzari system, Odion ordered his Givin navigator, Jelcho, to search for Daiman's forces. Although they saw no trace of Daiman's fleet in the system, they did spot about a dozen of Bactra's ships near Gazzari's sun, where they could observe the events on the planet from a safe distance. Bactra had already arrived on the planet with the arxeum, which landed in the crater along with four transports filled with hundreds of students, impoverished younglings who had been recruited from the Daimanate. Although Odion knew that Bactra had just delivered the arxeum, he ordered his fleet not to fire on the Quermian's forces since he intended to attack his estranged younger brother Daiman, whom he regarded as his main rival. He also intended to track down his perennial Jedi foe: Kerra, whom he regarded as a dangerous threat to his nihilistic ambitions. After sighting Bactra's fleet, Odion contacted the Quermian, and Bactra informed him that the deal with Daiman had taken place, and that the Bactranites were no longer concerned with the fate of the arxeum. Bactra's fleet then remained in the Gazzari system, observing the battle between the Daimanites and the Odionites."}, {"tag": "p", "text": "For this engagement, Odion had deployed a quarter of his own home fleet including elements of his elite Thunder Guards. During the early stages of the battle, Odion's home fleet formed an orbital perimeter around the planet and awaited the arrival of his most important weapon, a massive siege tower called the Death Spiral. Once the Death Spiral exited hyperspace behind Odion's fleet, the Sith Lord ordered his Thunder Guard units to their transports. Narsk was present on the bridge of the Sword of Ieldis where Odion had outlined his battle plan. Prior to the ground assault, Odion ordered both Narsk and Jelcho to accompany him on his personal transport. However, unknown to Odion, Daiman's forces had already landed on Gazzari where they had positioned themselves on the ridges of a massive crater on Gazzari where they were hidden under the metallic ash."}, {"tag": "p", "text": "During the subsequent Battle of Gazzari, Odion's forces including the Death Spiral landed inside a crater. In the subsequent fighting, Odion's forces engaged Daiman and his mercenaries, destroying all four transports and significantly damaging the arxeum. The mercenaries bombarded the Death Spiral with cannon fire, but were unable to destroy the tower, which deployed several speeder bikes, airspeeders, and walkers from its base. Unable to withstand the firepower of the Death Spiral, Daiman's mercenaries were forced to retreat and the Death Spiral inflicted heavy casualties on Daiman's mercenaries. In the midst of the fighting, Odion's Jedi adversary Kerra resurfaced. She fought off several enemy troops before evacuating the student refuges aboard the transports destined for the axeum, saving the lives of approximately a thousand youths."}, {"tag": "p", "text": "During the middle of the battle, Narsk received a signal from his true master, Vilia Calimondra. The Sith Lord wished for her two grandsons Odion and Daiman to end their sibling feud and unite against Bactra, who had outlived his usefulness to the Calimondra family. However, he waited to deliver the message, as both Odion and Daiman were on the battlefield, approaching each other and preparing for a duel. With both Sith Lords engrossed in the battle, the Bothan found it unlikely either of them would receive his message.By then, the tide of the battle had began to turn in Daiman's favor since a fleet of Daimanate warships had emerged from hyperspace, trapping Odion's fleet within the Gazzari system. in a similar development, Kerra succeeded in destroying Odion's Death Spiral. After incapacitating Odion's lieutenant Jelcho—who had entered the battle on a speeder bike, the Jedi woman used a bandolier to secure Jelcho to the bike before jamming its accelerator and sending it into the Death Spiral's speeder bays. This created an explosion which destroyed the siege tower, allowing Narsk to deliver Vilia's message via comlink to Daiman and Odion since it had eliminated the physical barrier that had blocked the signals."}, {"tag": "h4", "text": "Spoils of War"}, {"tag": "p", "text": "As planned, both Odion and Daiman received Vilia's message which was then transmitted to their ground forces and orbiting fleets which quickly ended their hostilities. They then immediately joined forces and turned on Bactra's fleet with their combined firepower destroying half of his warships within under a minute. The remnants of Bactra's fleet jumped into hyperspace and fled to Jutrand, the capital of the Bactranate. However, the Daimanite and Odionite forces pursued them, and, within a few days, Bactra's empire had fallen to Daiman, Odion, and the Sith Lords Lioko and Malakite."}, {"tag": "p", "text": "Following the collapse of the Bactranate, Odion and Daiman were later present at a hologram conference where Vilia divided Bactra's former assets up among her grandchildren. During the bequest, Daiman inherited Bactra's corporate assets including Industrial Heuristics and its affiliated enterprises. While Daiman was pleased with his acquisition, Odian objected and claimed that he had a stake to the company since it was headquartered in Jutrand, which had fallen to the Odionate. In an attempt to appease Odion, Vilia allowed him to keep Jutrand but ordered that he allow the company's executive staff enough time to relocate to Daimanate territory. However, an enraged Odion retorted that he would kill the staff rather than allow them to leave."}, {"tag": "p", "text": "In response, his grandmother reminded him and the rest of her family that despite their differing philosophies, they had to preserve corporations since they were essential economic assets in the war effort against the Galactic Republic. When Odion dismissed corporations as a tool of the Republic, his cousin Sith Lord Arkadia Calimondra responded that the Republic was controlled by corporations. As quid pro quo, Vilia proposed a deal where she would compensate Odion's loss by sending two legions of Trandoshan slave warriors from her own forces to augment Odion's forces. They would arrive in the Odionate within the span of three days just as the Industrial Heuristics staff departed for the Daimanate. Odion reluctantly complied and the meeting turned its attention to other issues like Arkadia's recent annexation of the Dyarchy and the welfare of the adolescent Sith Lord Quillan. While tensions between the two siblings were momentarily soothed, these would re-emerge later during the year as both twins sought to undermine each other."}, {"tag": "p", "text": "His Jedi opponent Kerra Holt was also present via hologram during the Bequest. Following the Battle of Byllura, Kerra and Brigadier Jarrow Rusher had been invited to the icy Arkadiante capital of Syned by its titular ruler Arkadia, the eldest daughter of the late Lord Chagras. In an attempt to recruit the young Jedi woman into her services as an assassin, she allowed Kerra to attend to this secret meeting of the Grumani sector's Sith lords. She learned that Odion, Daiman, Quillan, Dromika and Arkadia were all related and part of a powerful Sith dynasty, the Calimondra family, led by Vilia. During the ten minute meeting, Kerra was surprised to see that the so-called \"destroyer of the universe\" could be brought down by his grandmother. This merely solidified her commitment to defeating the Sith warlords of the region."}, {"tag": "h3", "text": "Deluge"}, {"tag": "p", "text": "Odion is seen in a hologram conference during Zodoh the Hutt's invasion of Grumani sector where he and Arkadia expressed their rage against the Hutt for intruding into Sith territory. He was still undergoing burns treatment and the left side of his face was still covered in burns. Zodoh was unmoved by their outrage, belittling his bipedal rivals as petty crooks who were always warring with each other. Zodoh offered to deal with them by supplying them with slaves and munitions in return for their cooperation. Finally, the Hutt Lord warned the Sith to keep an eye on future developments on Aquilaris before cutting transmission."}, {"tag": "p", "text": "However, by the Battle of Darkknell, Odion's burns had healed with no visible scars left on his face. He was present via hologram when his brother Daiman was besieged by Zodoh's fleet of Stormdrivers, large capital ships capable of creating global artificial floods and storms. Daiman castigated Odion for keeping his forces busy in protracted border engagements which forced him to divert forces from Darkknell; allowing Zodoh to attack his capital with relative ease. Prior to the transmission being interrupted by a floodwave from the burst Southern Reservoir, Odion gloated over the impending deaths of billions which resonated with his nihilistic philosophy. However, Zodoh was ultimately defeated through the efforts of Odion's main enemy Kerra Holt and Grace Command Captain Jenn Devaad who succeeded in destroying Zodoh's flagship Voracious, which effectively disrupted the Stormdrivers. Daiman's forces were able to regain control of the battle and routed the Hutt invaders. Zodoh himself was captured and personally executed by Daiman. Odion was also present during the execution via hologram transmission along with Arkadia and Lord Malakite."}, {"tag": "h3", "text": "The Helm of Ieldis"}, {"tag": "h4", "text": "Reviving Project Pandemonium"}, {"tag": "p", "text": "Following the Battle of Darkknell, Odion reappeared on Jubalene, his temporary capital, where he explained his intentions of restarting Project Pandemonium to find the Helm of Ieldis, a powerful Sith relic. With this, Odion would be able to greatly increase his powers. These emanations in the Force led Daiman to experience apocalyptic visions which he used to coerce the Jedi Knight Kerra Holt into a deal whereby he assisted her in infiltrating Odion's Novitiates, an elite unit within the Odionate. Under the pseudonym \"Mercy,\" Kerra was able to establish contact with the Claimer Wayman and successfully infiltrate Jubalene where she learnt more about Odion's plans."}, {"tag": "p", "text": "Meanwhile, Odion made plans to assemble a team of Novitiates to locate the Helm of Ieldis. The Claimer Wayman volunteered \"Mercy\" and her team for this project and had them recalled from the invasion of Skarpos, a world in Lord Malakite's realm known as the Menagerie. At Jubalene, Odion and his Novitiates including \"Mercy\" were present with Odion during a combat duel pitting three Duros bankers against a rancor. The Duros had been duped into adopting Odion's nihilistic teachings and believed that they could embrace death by tackling a fully-grown rancor. With Odion exhorting them \"to end the pain,\" the three bankers entered into a berserker rage and attacked the rancor with their spears. Ultimately, their efforts proved futile and they were eaten by the beast in the presence of a satisfied Odion who commented that even Lord Bactra's bankers could be used for his own purposes when properly motivated."}, {"tag": "p", "text": "Odion also added that he savored the deaths of individuals who had embraced death willingly, since it strengthened his connection with the dark side. He also expressed his annoyance at life energies which glowed through the light side of the Force. While other Sith could tolerate it, he tried to block it and saw death as a relief. Odion explained that he could channel despair into a lust for destruction. Using an example, the Sith Lord attributed the Duros' berserker rage to the anguish and despair emanating from the millions of workers in Jubalene's military forge. Wayman expressed interest in Odion's \"rediscovery\" and asked if anyone could wield it. Odion replied that only those with the same type of \"affliction\" he was experiencing could tap into this destructive energy."}, {"tag": "p", "text": "Odion then briefed his acolytes about his plans to reopen Project Pandemonium. The trail last ended at Sarrassia and the project was suspended since the planet was part of the Bactranate, a rival Sith domain. With the annexation of the Bactranate, Odion revealed his intentions to invade Sarrassia and reclaim the relic. Wayman's team including Kerra were assigned the task of continuing the research where the trail ended, beginning with the material available in his data center at Jubalene. At that point, Odion sensed a familiar presence in the room but could not discern who it was. However, Kerra escaped further notice with the arrival of his trusted protege General Beld Yulan who had arrived back from Vanahame rearmed and replenished for the invasion of Sarrassia. While Odion and Yulan departed to watch several of Bactra's former attorneys fighting a gundark at the arena, Wayman confided to Mercy about his discomfort that Odion favored Yulan and had thus kept him alive. He also expressed that he sensed a great emptiness in the force emanating through Odion's spirit. Wayman subsequently departed for the arena, leaving Kerra along with the computer. She would used that small window of solitude to access information which confirmed her parents Aron Holt and Mercia Holt had been taken captive by Odion and dragooned into Project Pandemonium."}, {"tag": "h4", "text": "Bloodbath on Skarpos"}, {"tag": "p", "text": "Unknown to Kerra, Yulan or the other Novitiates, Odion was aware of Kerra's true identity ever since she had entered his realm. However, he allowed her to remain because he knew that she would lead him to the Helm of Ieldis. Thus, Odion had assigned his recruitment agent Wayman to keep an eye on her whereabouts. Following the Invasion of Sarrassia, Odion received no further news from his team of Novitiates who were still hunting for the Helm of Ieldis. He decided to travel to the frontline itself, after learning from Wayman that they had gone to Skarpos. His shuttle landed at the top of the Morbollon Mesa where his forces had set up a garrison below. Upon arrival, Odion's forces were caught up in a three-way battle involving his cousin Malakite, who had sought to recapture the planet from Odion, and his estranged younger brother Daiman, who wanted the Helm for himself. Daiman also had a spy within the ranks of the Novitiates—a Kubaz named Glenk."}, {"tag": "p", "text": "Upon landing, Odion donned a jetpack and descended into the mesa's network of tunnels and caves. He made his way to the Grumani temple chamber where he recovered the Helm of Ieldis. There, he encountered Kerra, who had grievously wounded him during the Chelloan campaign. After disarming her with a blast of Force lightning, Odion revealed that he had already captured the Helm of Ieldis for himself. He also added that Kerra would be the first to witness its test demonstration on his opponents in the battle beneath the mesa."}, {"tag": "p", "text": "Odion had Kerra taken captive with her wrists clasped in restraints. They then ascended to the top of the Mesa where they were joined by Yulan, Doyan, and the other Novitiates. While Odion's sages read a prophecy which confirmed that Odion was prophesied to wear the Helm, Yulan and his men did an exploration of the collapsed temple chamber below. Despite his victory, Odion still expressed frustration that the Helm was a tight fit for his head and he did not known how to activate it. When Kerra attempted to goad him by telling him to fit a trash compactor on his head, the Novitiate leader Doyan offered to kill Kerra to atone for her failure to detect a Jedi infiltrator within their ranks. Odion replied that it would have been worth killing the entire squad of Novitiates had he not already known from the start that Kerra had infiltrated the Odionate. However, he did not hinder her plans because he believed she and her family were always destined to lead him to the Helm."}, {"tag": "p", "text": "Odion also revealed to Kerra that he had learnt about her parents' research on the Helm following a raid on the University of Sanbra. While the researchers had scattered, Odion was able to track several of them including her parents down on Aquilaris Minor. Odion's spies also found out that several Jedi including Vannar Treece were planning to meet the researchers. Thus, the invasion of her homeworld had actually been a cover to capture the researchers for Project Pandemonium. Shortly later, Yulan and his search team arrived to report their findings. During their excavation of the chamber, they found the crushed remains of Kerra's parents along with a necklace and holorecorder. Upon recognizing the necklace as belonging to her parents, Kerra descended into a state of grief and angst which activated the Helm."}, {"tag": "p", "text": "Odion then used the Helm of Ieldis to convert her grief into Dark Side energy. At that moment, a pair of Malakite's Mutate warriors riding dragon steeds stumbled upon Odion and his entourage, intending to slay him themselves and take back his hide as a trophy to their Master. Instead of fighting them, Odion used the Helm to compel the two enemy warriors and their steeds to turn on themselves and kill each other. Addressing a captive audience in the form of Kerra, Odion commented that the Helm of Ieldis had forcibly brainwashed them into accepting his own nihilistic rationale that the only way to end their own pain was through bloodshed and death. Odion then ordered Yulan to start evacuating his best companions aboard their shuttle since he was going to deploy the Helm against the three massed armies beneath the mesa."}, {"tag": "p", "text": "The Helm of Ieldis had an immediate effect on the three massed armies, driving all the combatants into a homicidal frenzy. By forcing his opponents to kill each other and therefore embrace death and nothingness, Odion hoped to become the sole owner of the Universe. Within minutes, the combatants descended into a murderous rampage, killing even their own comrades indiscriminately. Daiman himself narrowly survived an assassination attempt by his Kubaz double agent Glenk, who had earlier infiltrated Odion's Novitiates to monitor on Kerra and had revealed details about the Helm of Ieldis and Project Pandemonium to his Master, who also had ambitions of galactic dominance. However, Daiman was able to fight off Glenk and struck him with Force lightning, causing him to topple to his death beneath the Morbollon Mesa. With their armies in total disarray, Odion's competitors Daiman and Malakite were forced to flee the battle while they could still resist the power of the Helm."}, {"tag": "p", "text": "Under the influence of the Helm, the three armies annihilated each other. However, the Second Battle of Skarpos would prove to be a pyrrhic victory for Odion. While he succeeded in testing the Helm of Ieldis on the armies of his rivals Daiman and Malakite with devastating results, the Helm also annihilated his entire army with the exception of General Yulan and his troops who were exploring the Mesa, the Novitiates, and a captive Kerra Holt. When Yulan expressed concerns about sacrificing his entire force on Skarpos, Odion merely rebuffed the General's concerns by telling him that his men's deaths were inevitable, and that the Helm merely hastened the process. A triumphant Odion then set on course for Vanahame, intending to harness the anguish and misery of the captive orphans within the closter there to power the Helm on a galactic level. He planned to use the Helm to exterminate all life in the galaxy, starting with the Grumani sector, and fulfill his desire to be the only sentient being in the galaxy, the king of a graveyard."}, {"tag": "p", "text": "En route to Vanahame, Odion watched the holorecorder recovered on Skarpos and found that it contained a transmission left by Kerra's parents Mercia and Aron prior to their deaths. The husband and wife team had sacrificed their lives on Skarpos by exploding the chamber in an attempt to deny Odion and any other Sith access to the dangerous Sith artifact. As a Sith, Odion was unable to understand why other individuals would willingly sacrifice their lives for people they did not know. For him life was meaningless and so was death. While Odion realized that the Holts had merely feigned devotion to his cause during Project Pandemonium, he still saw it as an opportunity to torment Kerra. He ordered Yulan to show the recording to her. However, rather than demoralizing her, the holorecording had the opposite effect. It merely galvanized Kerra to continue her fight against the Sith. She also recognized that beings could still accomplish great acts even through death. Yulan also softened his initial hostility towards Kerra and came to grudgingly admire her for risking her life to find her parents in the Odionate."}, {"tag": "h4", "text": "Preparation for Armageddon"}, {"tag": "p", "text": "Vilia, having found out about Odion's plans through Daiman, persuaded the other members of her family to put aside their differences and unite to stop Odion. The Lords sent a combined fleet on a hyperspace course to Vanahame, while Vilia tried to contact her grandson by intercom, so she could talk to him and persuade him not to go through with his plan. However, she failed as he refused to speak with her. In his own deranged, nihilistic beliefs, Odion believed that he had no family or friends, only enemies to be killed so he could end the pain of existence."}, {"tag": "p", "text": "Odion had ordered the installation of subspace links which would provide live feeds of the Helm's effects on locations within Odion's targeting range, so he could see the effects of the Helm's power. He also had a captive Kerra bound to a frame where she would be forced to watch the carnage wrought by the Helm. Odion tried to taunt Kerra by asking her if she wanted to hear her parents' last words on the holorecorder but she refused, saying that all his rivals were coming for him, and that he should be more concerned with them."}, {"tag": "p", "text": "For the first time, Odion then ordered all the lights in the Cloister to be turned off, frightening the captive children and providing the necessary negative emotions like fear and anguish which were needed to power the Helm. While Odion and most of his Novitiates sadistically enjoyed the children's suffering, Kerra and Yulan were disgusted and unsettled. When Kerra expressed surprise that turning the lights off was all that was needed, the General stated that they were never turned off before, and that the worst torture created by a adult mind was nothing compared to what a frightened youngling could imagine."}, {"tag": "p", "text": "Odion again taunted Kerra, saying that she had really missed out, and that if she had known what was going to happen, she would have given into the Dark Side and accepted his nihilistic beliefs. However, as it was due to her steadfast devotion to the Jedi path, she could only watch in captivity. Odion stated that the children's anguish would power the Helm, while Kerra's merely made him happy. Meanwhile, Kerra attempted to appeal to Yulan's decency and humanity, and urged him to turn against Odion and destroy the facility. When Yulan asked her if she was willing to sacrifice her life to save a group of strangers, she said that she still wanted to live and save the children, and everyone's children. However, going out then and there would mean something if it stopped Odion. Kerra successfully got through to Yulan by stating that the difference between droids and people was that people were able to accomplish something even in death. She also added that people mattered including his own deceased children. When Yulan stated that they were dead, Kerra reiterated that they still mattered."}, {"tag": "p", "text": "As Odion's Novitiates prepared for the galactic apocalypse, he gave Yulan a chance to ask for a last request as a \"reward\" for his service. Feigning a desire to add his energies to the Helm, Yulan asked Odion if he could go down to the Cloister to spend his final moments. Odion, not knowing that Yulan had renounced him, granted his request, saying that he could add his misery to the younglings. Once the death ritual had finished drawing on all the emotional energies of the captive children, Odion planned to shut down the life support systems in the Cloister, killing the younglings."}, {"tag": "h4", "text": "Final conflagration"}, {"tag": "p", "text": "With the Helm fully charged by the suffering of his child captives, Odion proceeded to unleash his powers in a death ritual. He started with a rousing statement affirming his beliefs and then exhorted his Novitiates to \"end the pain\" by killing each other in a homicidal frenzy. He then used the Helm to bring about a wave of murderous chaos throughout the Grumani sector, with numerous sentient beings being killed or wounded. Even his Sith family was not immune and several of the allied ships began firing on each other. In this subsequent Force-induced madness, his estranged brother Daiman was also forced to use Force lightning to fend off several crazed crewmembers on his flagship. Meanwhile, Kerra managed to escape her bonds and grabbed a lightsaber from a Novitiate, attempting to kill Odion while he was distracted on his throne. However, she was stopped by Wayman who attempted to force her to submit once and for all to Odion's will. Odion expressed sadistic glee over the carnage occurring throughout the Grumani sector and within his throne room."}, {"tag": "p", "text": "While all this was going on, Yulan entered the Cloister's control room, catching the two men stationed there by surprise since they were distracted by the screaming coming from the frightened children and the chaos occurring upstairs. When one of the operators tried to tell Yulan to leave, he shot him with a blaster pistol. He then forced the remaining operator, a Human man named Murl, to step away from the controls at gunpoint. Yulan quickly switched the lights back on, which quickly ended the state of dismay and panic among the cloister children. This had an immediate effect of ending the Helm's destructive rampage. Odion was about the unleash the Helm of Ieldis's power on the entire galaxy, which would have resulted in the deaths of trillions of sentient beings, and enabled him to attain his nihilistic goal of being the only living being in the galaxy. However, the Helm's powers immediately ceased as the emotions in the cloister turned from despair to relief, quickly ending the murderous frenzy and bringing pain to Odion. Wayman was surprised and distracted by his master's distress and Kerra took the opportunity to run him through with her lightsaber, killing him."}, {"tag": "p", "text": "Odion, realizing that someone turned on the lights in the Cloister, opened a channel to the control room to find out what was happening. Kerra, realizing that Yulan was the one who did it, told him to throw the other switch to release the younglings from their bubble prisons. This resulted in their emotions in the Cloister being changed from feelings of fear and misery to those of joy and happiness as the children realized their freedom. This sudden surge in positive emotions caused the Helm to malfunction, creating a storm of energy which blasted the roof off the tower and set Odion alight."}, {"tag": "p", "text": "As Odion was burning, he pleaded with Kerra to help him by transporting him to Jubalene where he could receive medical treatment. He feared the arrival of his rivals and the impending collapse of the Odionate. However, Kerra was unmoved by his parleying since he had nearly ended all sentient life in the galaxy. She also told him that her parents' deaths had meant something to her, and his death would as well. Out of desperation, Odion attempted to appeal to Kerra by telling her that he could help her find her younger sibling if she would save him. However, Kerra by then had reached the viewpoint that all the children in the various Odionate cloisters were her brothers and sisters regardless of their gender and species. Instead, Kerra refused to make any dealing with Odion, and left him to burn to death."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Because of the centralized nature of governance within the Odionate, the death of Odion meant that there was no successor who could replace him. As a result, the Odionate collapsed, Odion's relatives each taking the opportunity to seize as much territory as possible, with Daiman taking the largest portion, seeing a opportunity to expand his own holdings."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Odion experienced a difficult and unhappy childhood; he was unloved by his mother Xelian who looked down upon him as repulsive while openly favoring his younger brother Daiman. Odion's personality was also shaped by his allergic hypersensitivity to the presence of other sentient beings whom he perceived as burning brightly through the Force; an effect which blinded and overwhelmed his senses. These childhood experiences coupled by his hypersensitive Force connection led Odion to develop a nihilistic worldview with the goal of destroying as much of the galaxy as he could. He believed that all people existed to be killed by him, viewing each murder as different and pleasurable in its own way. He believed that he could only find peace by destroying all other sentients in the galaxy."}, {"tag": "p", "text": "He also had an estranged relationship with his younger brother Daiman which dated to the latter's birth which had triggered perpetual debilitating headaches throughout Odion's life. Odion also had a dysfunctional relationship with his mother Xelian who openly favored Daiman over him. This was further accelerated by an internecine sibling rivalry encouraged by their grandmother Vilia Calimondra, who had promised to give her holdings to the heir that had conquered the most territories. This plunged the Grumani sector into unceasing warfare during the Republic Dark Age. Throughout his life, Odion constantly sought to best his brother, fighting his forces directly during the Chelloan campaign and even abetting Zodoh's efforts to conquer the Daimanate during the Aquilaris campaign."}, {"tag": "p", "text": "By 1032 BBY, Odion's nihilistic quest for galactic domination led him to invest substantial resources in securing the Helm of Ieldis. It had been developed by the Sith Lord Ieldis for the purpose of driving sentient beings into a homicidal frenzy through the dark side of the Force. At the climax of his rule, Odion attempted to unleash a murderous Force-induced apocalypse on the galaxy through the Helm. He hoped to fulfill his nihilistic ambitions of ending all other life in the galaxy except for himself. However, his efforts were thwarted by the Jedi Kerra Holt and his General Yulan, who repudiated his nihilistic cult."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Odion differed from most other Sith Lords in several aspects. Whereas most other Sith were unaffected by the glow of life in the Force, that glow caused Odion pain which manifested in debilitating headaches. These headaches started following the birth of his estranged younger brother, Daiman. His inability to cope or hide from this pain led him to embrace a nihilistic mindset which glorified death and destruction as a means of alleviating this pain."}, {"tag": "p", "text": "However, as he continued his study of Sith knowledge, he discovered that with that weakness came a strength—namely he could channel feelings of anguish and despair in one person into a crazed, enraged madness in another. Odion was also capable of generating mindless battle frenzy and rage in another being. On one occasion in Jubalene, he used this power to compel three former Duros bankers into attacking a rancor at an arena. Odion was able to harness the dark side energies which resulted from their violent deaths. In addition, Odion could also harness Force lightning, using it to briefly stun Kerra Holt in the back, revealing himself and his possession of the Helm of Ieldis."}, {"tag": "p", "text": "As with many Sith warriors, Odion was proficient in lightsaber combat, which he used on a number of occasions including a duel which ended in the death of Jedi Master Vannar Treece. Despite his combat skills, he was occasionally outwitted by the Jedi Knight Kerra Holt, who became a perennial foe of the Sith Lord towards the end of his life. Odion was also able to harness the powers of the Helm of Ieldis by using it to channel feelings of anguish and despair emanating in other sentient beings. On Skarpos, he used Kerra's despair to destroy three entire armies. Later on Vanahame, he attempted to use the fear and panic of the child inmates in the cloister there to destroy the galaxy. However, he was thwarted by Kerra and Yulan, who freed the children, which released a surge of positive emotions that caused the Helm to overload and explode into flames, killing Odion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Odion was the elder brother of Daiman; in African cultures, the name \"Odion\" meant the \"eldest of twins.\"He was developed as one of the major antagonists of the Knight Errant comic series which debuted with the release of Knight Errant 0 during Celebration V in August 12–15, 2010. Odion serves as one of the two main antagonists in the series' first story arc Star Wars: Knight Errant: Aflame, which ran from October 13, 2010 through to February 16, 2011. His story background was developed by John Jackson Miller while the character was drawn by artist Ivan Rodriguez, inked by Belardino Brabo, and colored by Michael Atiyeh. He also appeared in Miller's tie-in novel Knight Errant, which was first released on January 22 2011. This novel further contextualized Odion's role within the dynamics of the Calimondra family, a powerful Sith dynasty in the Grumani sector."}, {"tag": "p", "text": "Odion plays a smaller role within the second story arc Star Wars: Knight Errant: Deluge, which ran from August 17 to December 21, 2010. However, he makes three separate cameo appearances in the first and last issues. In the first issue, Odion was still shown with burn injuries on the left of his face. As with the first story arc, he was drawn by Rodriguez and colored by Atiyeh. However in the fifth issue, his face is shown as fully healed with no burnt tissue. In this issue, he was drawn by David Daza, inked by Sergio Abad, and colored by Atiyeh."}, {"tag": "p", "text": "Odion plays a greater role in the story plot of the third story arc Star Wars: Knight Errant: Escape which ran from June 13 to October 10, 2012. This comic arc delves into both his nihilistic beliefs and quest for the Helm of Ieldis while the third issue in the story arc Knight Errant: Escape 3, which debuted on August 8 2010, gives a glimpse into how his troubled childhood shaped his worldview. In the last issue of the arc Knight Errant: Escape 5, Odion's character is killed off at the height of his power which ended in a climatic confrontation with the main protagonist Kerra Holt. In this story arc, he is drawn by Marco Castiello and Andrea Chella, inked by Vincenzo Acunzo, and colored by Atiyeh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}