{"url": "Atoan", "categories": ["Category:Legends articles", "Category:Races and species stubs", "Category:Atoans", "Category:Expansion Region species", "Category:Human and Near-Human species"], "nodes": [{"tag": "h1", "text": "Atoan"}, {"tag": "p", "text": "The Atoan were a sentient Near-Human species from the Atoan system."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "Atoans possessed an outward appearance that resembled baseline Humans, though their internal structure lacked a heart, rather having numerous \"hearts\" throughout their bodies. This feature made them faster and stronger, but also caused them bleed to death quickly. However, like Humans, they had lungs and a sternum."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Atoans were native to Atoa, a planet of the Atoan system. By 19 BBY, the newly founded Empire had little information regarding their civilization."}, {"tag": "h3", "text": "Atoan insurgency"}, {"tag": "p", "text": "In 19 BBY Garoche Tarkin defected from the Empire to Atoa in part due to a deep resentment of the atrocities he had to commit in the name of Palpatine, and aided in their insurgency along with Lady Saro, the High Priestess of Atoa. The pair became lovers, and Saro conceived his child. Captain Shale also joined in his defection, with the former seeking to kill Lord Vader, but failed. He later appeared with Saro and persuaded Vader to repent his sins. Vader ultimately killed them both in an attempted suicide by collapsing the cathedral they were in order to atone for his sins as Vader. However, he ultimately survived, blaming Garoche's death on the Atoan Insurgents, as part of a plan with the Emperor to deepen Wilhuff Tarkin's hatred of any form of insurgency and make him a better tool of the Empire."}, {"tag": "p", "text": "True to Palpatine's plans, Garoche's death led to his father committing genocide against the Atoans as revenge for their perceived part in his demise."}, {"tag": "h2", "text": "Culture and technology"}, {"tag": "p", "text": "Atoan civilization was rules by a theocracy, where head figures were known as High Priestesses. They believed in the Twenty-nine Atoan gods."}, {"tag": "p", "text": "Despite being native from the same sector as Umbara, Atoans spoke their native language rather than Galactic Basic Standard. This language was untranslatable even for protocol droids. The shaman Lady Saro learned to speak Basic after killing a stormtrooper and eating his tongue."}, {"tag": "p", "text": "They were an advanced species, having at their disposal blasters, starfighters and floating cities located on a tar-pit planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}