{"url": "Atoan_insurgency", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Atoan insurgency", "Category:Early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Atoan insurgency"}, {"tag": "p", "text": "The Atoan insurgency was a conflict that occurred within the early stages of the Imperial Period. The Galactic Empire suffered heavy losses but conquered the Atoan system."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Not long after the Declaration of a New Order, Admiral Garoche Tarkin, the son of Moff Wilhuff Tarkin, disappeared along with his Imperial I-class Star Destroyer during a mission to hunt down insurgents in the Ghost Nebula."}, {"tag": "p", "text": "In response, Emperor Palpatine commanded his Sith apprentice Darth Vader to find and retrieve the lost admiral, much to the displeasure of Moff Tarkin. In the event that Vader became distracted from his objective, hunting down Jedi fugitives, Tarkin appointed Captain Shale, a friend of his son, as Vader's second in command during the mission. A Imperial I-class Star Destroyer was attached to Darth Vader, along with a detachment two battalions of stormtroopers from the 501st Legion commanded by Commander Voca."}, {"tag": "h2", "text": "The campaign"}, {"tag": "p", "text": "After reaching the Atoan system, the last known location of Admiral Tarkin in the Ghost Nebula before his disappearance, Vader and his troops began their search on the system's primary planet, Atoa, homeworld of the near-Human Atoans. Imperial forces assaulted the main city, killing or capturing any resisting Atoan."}, {"tag": "p", "text": "In the aftermath of the battle, Vader ordered Voca to burn the city and drown the prisoners. However, a boat loaded with white-robed figures drifted towards the Imperials at that moment. A female Atoan disembarked and greeted Vader, identifying herself as Lady Saro, High Priestess of Atoa. She claimed to know the location of Admiral Garoche Tarkin, though she would not divulge the information unless Darth Vader declared her the Queen of the Ghost Nebula."}, {"tag": "p", "text": "Vader agreed to Lady Saro's terms, provided that she swore fealty to the Emperor. The priestess guided the Imperials to Admiral Tarkin's destroyed Star Destroyer. Accompanied by Voca and Shale, Darth Vader led a group of V-wing starfighters to investigate the wreckage. Damage to Tarkin's warship were identified as explosions that had to have occurred from within the vessel, thus indicating a sabotage. However, the group suddenly set upon by Atoan starfighters in an ambush. Although caught off guard, the Imperials quickly turned the skirmish around."}, {"tag": "p", "text": "After having successfully interrogating a captured pilot, Vader then hunted Tarkin to another Atoan world. While AT-AT walkers and ground forces attacked as a distraction for the insurgents, Vader and Captain Shale led a stealth attack with Shale's storm commandos. Despite successfully annihilating the insurgents and the loss of some walkers in the planet's boiling tar oceans, Vader and Shale failed to locate Garoche Tarkin. The revelations of the prisoners caused Vader to suspect that Admiral Tarkin was a traitor to the Empire."}, {"tag": "p", "text": "Vader's suspicion was confirmed later, when Captain Shale's storm commandos attacked the Dark Lord of the Sith and the 501st stormtroopers aboard Vader's Star Destroyer. Although Vader managed to repulse his assailants, the 501st was taken by complete surprise. Commander Voca and a group of stormtroopers managed to hold their ground until Vader arrived and eliminated the traitors. The Sith gathered the remaining clones but massive explosions suddenly went off throughout the starship. Vader and his soldiers headed to the hangars and escaped the doomed ship just in time."}, {"tag": "p", "text": "The damaged shuttle, piloted by Darth Vader himself, eventually crash-landed on a Atoan crystal planet. The surviving clones, including Voca, followed Vader on foot until they found the rest of Shale's storm commandos, all of them apparently executed. At that moment, Atoan insurgents led by Lady Saro ambushed the Imperials. While the Sith Lord attacked the enemy, the outnumbered clones retreated but their escape was cut off by a group of Atoans led by the former Captain Shale. Shale apologized to Commander Voca before his men opened fire on the clones, killing the last remaining stormtroopers. Moments later, Darth Vader was overwhelmed by the rebels and stunned by Lady Saro."}, {"tag": "p", "text": "Darth Vader was captured and finally met Garoche Tarkin. Disgusted by the atrocities he committed in the name of Palpatine, Moff Tarkin's son defected to the Atoans after becoming Saro's lover. He revealed to the Sith that he was manipulated: all the Atoans killed during the insurgency were rivals of the High Priestess."}, {"tag": "p", "text": "But Vader did not remain in captivity for long. He succeeded in escaping from his confinements and killed many insurgents that stood in his way, including Shale who hoped to kill him by using his own lightsaber. When the Sith Lord eventually found Tarkin and Saro, the Atoan Priestess projected an image of Padmé Amidala, Vader's deceased wife, from reading into his heart. When learning of this ability, he attempted to kill Saro in despair-driven madness to get her to return Padmé to him, although he relented after he discovered that she was pregnant, presumably out of guilt for his role in Padmé's death. Vader later killed them both in an attempted suicide by collapsing the Atoan cathedral on them."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Vader survived several days under the rubble until he was discovered by Imperial reinforcement troops sent by the Emperor. Palpatine was pleased for the subjugation of the Atoan system. Garoche Tarkin's death was blamed on the Atoans to further his father's hatred of all rebels and insurgents."}, {"tag": "p", "text": "At some point afterwards, a military coup would be orchestrated. Both this and the later Ghost Prison incident were later recorded onto holograms."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}