{"url": "Of_Possible_Futures:_The_Tale_of_Zuckuss_and_4-LOM", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Tales of the Bounty Hunters"], "nodes": [{"tag": "h1", "text": "Of Possible Futures: The Tale of Zuckuss and 4-LOM"}, {"tag": "p", "text": "\"Of Possible Futures: The Tale of Zuckuss and 4-LOM\" is a short story written by M. Shayne Bell and featured in Tales of the Bounty Hunters, which was published in December 1996 by Bantam Spectra. It concerns the backstory of the bounty hunters Zuckuss and 4-LOM."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The story begins immediately before the bounty hunter scene in Star Wars: Episode V The Empire Strikes Back with Zuckuss meditating. With his meditation he is able to intuit possible futures. The idea of futures and change is a central theme: the characters come across some survivors from the Battle of Hoth, and the plot progresses from there. There is no real resolution, as the writer prefers to leave ambiguity, and the story is really the writer's own meditation of the consequences to actions."}, {"tag": "p", "text": "Zuckuss and 4-LOM both undergo changes in the course of the story, and the changes reflect changes they've also had in the past. They act almost to counter each other. Our eternal window on life, like 4-LOM's vision, is a \"brief glimpse only, and one of many possible futures,\" and as such the author is really trying to put across this idea of perception, and what effect perception has on us.[source?]"}, {"tag": "p", "text": "The idea of perception comes through side-by-side with the counter-epiphanies as a theme in the story. Perception changes."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the film The Empire Strikes Back, Princess Leia Organa orders a male controller in the Echo Base command center to \"give the evacuation code signal. And get to your transports!\" However, in the story, the line reads differently: \"Give the evacuation code, and get to the transport!\" Additionally, Toryn Farr is the controller who orders the retreat to the troops still fighting during the story, which suggests the order was directed at her, and not at the male controller."}, {"tag": "p", "text": "The final transport to leave the planet, the Bright Hope, is stationed inside a hangar of the base, and not assembled on the South Slope, as Organa explains while debriefing Rogue Squadron prior to the battle during the film."}, {"tag": "p", "text": "It is unclear in the story if \"F4-7\" is a different medical droid than FX-7, as author M. Shayne Bell seems to inexplicably alternate between the two names when seemingly referring to one droid. The Essential Reader's Companion later established that F4-7 is a misnaming of FX-7."}, {"tag": "p", "text": "\"Of Possible Futures\" is one of the sources that suggests the Rebel Alliance leaves the galaxy at the end of The Empire Strikes Back."}, {"tag": "p", "text": "The story also introduces a man named Darklighter who escapes aboard the Bright Hope. It is unclear if this man belongs to the Darklighter family of Biggs and Gavin Darklighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}