{"url": "Office_of_the_Chancellor", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Republic organizations"], "nodes": [{"tag": "h1", "text": "Office of the Chancellor"}, {"tag": "p", "text": "The Office of the Chancellor, also known as the office of the Supreme Chancellor, consisted of the immediate staff of the Supreme Chancellor of the Galactic Republic. The second highest-ranking official in the office was the Vice Chair, who served as both vice chancellor and speaker of the Galactic Senate. In addition, a senior aide assisted the chancellery with the administrative matters of state. In the last days of the Republic, the office gained a representative on the Jedi High Council, the ruling body of the Jedi Order."}, {"tag": "p", "text": "The Office of the Chancellor maintains both the Chancellery Secretariat beneath the Senate chambers of the Galactic Senate Building and the Chancellor's office in the Senate Office Building."}, {"tag": "p", "text": "Following the death of Jedi Master Sifo-Dyas over the moon of Oba Diah, much of the information surrounding his demise was classified by the the administration of Chancellor Finis Valorum. The office's authority and influence expanded to an unprecedented level throughout the Clone Wars, a process that began with the Galactic Senate empowering Valorum's successor, Chancellor Sheev Palpatine, with wartime powers. In the aftermath of the Republic invasion of Scipio, the chancellery gained control over the assets of the InterGalactic Banking Clan. The office was ultimately dissolved when Palpatine proclaimed the formation of the First Galactic Empire, with himself as Emperor of the galaxy."}, {"tag": "h2", "text": "Composition"}, {"tag": "h3", "text": "Positions"}, {"tag": "p", "text": "The Office of the Chancellor was headed by the Supreme Chancellor of the Galactic Republic. The Vice Chair was part of the office as vice chancellor in addition to their role as speaker of the Galactic Senate. The senior administrative aide served the chancellor as an executive assistant. In the waning days of the Republic, a representative of the chancellery was appointed to the Jedi High Council."}, {"tag": "h4", "text": "Soh chancellery"}, {"tag": "p", "text": "Officials who served the office under Supreme Chancellor Lina Soh:"}, {"tag": "h4", "text": "Kalpana chancellery"}, {"tag": "p", "text": "Officials who served the office under Supreme Chancellor Skor Kalpana:"}, {"tag": "h4", "text": "Valorum chancellery"}, {"tag": "p", "text": "Officials who served the office under Supreme Chancellor Finis Valorum:"}, {"tag": "h4", "text": "Palpatine chancellery"}, {"tag": "p", "text": "Officials who served the office under Supreme Chancellor Sheev Palpatine:"}, {"tag": "h3", "text": "Organizations"}, {"tag": "p", "text": "During the Separatist Crisis and subsequent Clone Wars, a number of organizations were associated with the Office of the Chancellor, including:"}, {"tag": "p", "text": "The Jedi High Council, though autonomous in the management of the internal affairs of the Jedi Order, was bound by duty to serve the Senate. By extension, the Jedi served at the discretion of the Senate's elected leader, the Supreme Chancellor, but nonetheless maintained their direct allegiance to the galactic legislature."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}