{"url": "Official_Tournament_Sealed_Deck", "categories": ["Category:Real-world articles", "Category:Star Wars Customizable Card Game"], "nodes": [{"tag": "h1", "text": "Official Tournament Sealed Deck"}, {"tag": "p", "text": "The Official Tournament Sealed Deck of the Star Wars Customizable Card Game was released May 1998. This set came with a special exclusive fixed pack of 18 black-border cards. Each Official Tournament Sealed Deck contained 4 white-border Premier expansion packs (15 cards each), plus one black-border Star Wars: Episode IV A New Hope expansion pack (15 cards) plus one fixed pack of 18 new black-border cards (9 Light Side and 9 Dark Side) that were the same in every set. The Sealed Deck box held 300 unsleeved cards or 150 sleeved cards."}, {"tag": "p", "text": "There were six Sealed Deck box designs in all, each featuring a different popular Star Wars character:"}, {"tag": "p", "text": "While all the box lids were full frontal head shots, representative of the pictures from the game, Luke Skywalker's box was an image that was never used in the game for a character card: Luke in full pilot gear. None of Luke's personas from other sets ever depicted him in pilot gear."}, {"tag": "h2", "text": "Cards"}, {"tag": "p", "text": "The 18 cards included in the set were:"}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Both the Dreadnaught and the Z-95 were images created by the Decipher Art Department and LucasArts in an effort to bring images from outside the movie into the game. While not the first effort (TIE Scout was the first, as well as the bounty hunter ships created for Dagobah and later used as the basis for the Micro Machines Star Wars Action Fleet toy line), these cards were the first to use ideas introduced in The Thrawn Trilogy."}, {"tag": "p", "text": "Z-95 Headhunter, Gold Squadron Y-Wing, Red Squadron X-Wing, Arleil Schous, Dreadnaught-Class Heavy Cruiser, Black Squadron TIE, and Chall Bekan were all later reprinted in foil form in Reflections II."}, {"tag": "h2", "text": "External links"}]}