{"url": "Oga%27s_Cantina", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Batuu dining establishments", "Category:Cantinas"], "nodes": [{"tag": "h1", "text": "Oga's Cantina"}, {"tag": "p", "text": "Oga's Cantina was a cantina found near Smuggler's Alley on Merchant Row, located in Black Spire Outpost on the Outer Rim planet Batuu. It was owned by a Blutopian bartender named Oga Garra, and pilot droid RX-24, now under the name \"R-3X,\" worked as a DJ there. The bounty hunter Harkos was known to frequent the cantina. Unlike Chalmun's Spaceport Cantina, droids were allowed on premise despite there being a droid detector. Kendoh Voss once arrived at the cantina to meet up with a fortune teller she knew of, eventually meeting with Hondo Ohnaka of Ohnaka Transport Solutions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Oga's Cantina was located on the Outer Rim planet of Batuu. It could be found near Smuggler's Alley on Merchant Row in the settlement of Black Spire Outpost. It was run by the Blutopian crime boss Oga Garra and was known for serving pilots, bounty hunters, smugglers, locals, and galactic travelers. These denizens used the establishment to conduct illegal business, meet a friend, confront an enemy, or just unwind. The cantina would eventually gain a reputation as a popular pit stop for those looking to avoid the eyes of the authorities. First Order stormtroopers were even known to occasionally pop in for a visit."}, {"tag": "p", "text": "The cantina was a circular domed building that protruded from the side of one of Black Spire's many petrified trees."}, {"tag": "h3", "text": "Offerings"}, {"tag": "p", "text": "The establishment offered alcoholic beverages, including Andoan White, Bad Motivator IPA, Bespin Fizz, Bloody Rancor, Dagobah Slug Slinger, Fuzzy Tauntaun, Imperial Guard, Jedi Mind Trick, Jet juice, Spice Runner Hard Cider, T-16 Skyhopper, The Outer Rim, Toniray, White Wampa Ale, and Yub Nub. There were also a number of non-alcoholic drinks served there, such as Black Spire Brew, Blue Bantha, Carbon Freeze, Cliff Dweller, Hyperdrive (Punch It!), Jabba Juice, and Spiran caf. Moogan tea was available both with and without alcohol. The cantina served drinks for both children and adults, and people came from all over the galaxy to sample the famous concoctions, which were formed from exotic ingredients using otherworldly methods and served in unique vessels."}, {"tag": "p", "text": "The cantina also provided food for its patrons. Batuu Bits, Mustafarian Lava Rolls, Oga's Obsession, Rising Moons Overnight Oats, and Rodian Rations were all served there."}, {"tag": "p", "text": "Entertainment was provided in the form of music performed by DJ R-3X."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oga's Cantina is a dining establishment at Disney's Star Wars: Galaxy's Edge attractions. Its design was based on a Ralph McQuarrie sketch that depicted the interior of Jabba's Palace."}, {"tag": "p", "text": "The cantina was first unveiled during the D23 Expo for 2017 via a scale model of the Galaxy's Edge park area. The exterior of the cantina also appeared very briefly in a scene added to the Star Tours: The Adventures Continue attraction on November 17, 2017. Further details were revealed during the Galactic Nights event on December 16 of the same year via two trading cards that gave some details of the locations and expected elements of the park. The first, the cover of the card, revealed that RX-24 from the original Star Tours was re-purposed as a DJ, with the new name \"R3X\", and the second, as part of the map portion of the card, revealed that it acted as the local watering hole, was located near Smuggler's Alley, and that one of its beverages was Blurrgfire. It included two Aurebesh statements on its borders, stating, \"BLACK WAS THE SPIRE THAT\" and \"CALLED ME TO STAY.\""}, {"tag": "p", "text": "According to the Walt Disney World News Today fan site, the cantina is the place where one can purchase drinks, as well as interact with various criminals, bounty hunters, and smugglers, and see live music performed. A piece of concept art released earlier by Disney resembled the card's image of the cantina. A name and more details were revealed on August 30, 2018 on the Disney Parks Blog. When it opened, it became the first public dining location in Disneyland Park to serve alcohol, breaking a tradition of serving no alcohol in the park instituted by Walt Disney himself.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}