{"url": "Okator_VIII", "categories": ["Category:Legends articles", "Category:The Divide", "Category:Eucer sector astronomical objects", "Category:Galactic Republic astronomical objects", "Category:Okator VIII locations", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Okator VIII"}, {"tag": "p", "text": "Okator VIII, also known as Okator, was a Mid Rim astronomical object located in the Eucer sector. It had a chilly climate and a surface that featured forests and tree-covered hills. The fauna of Okator VIII included nightscowls, shakwulfs, and whellays. During the century-long Tionese War, fought between the Galactic Republic and the Honorable Union of Desevro & Tion, a family from the celestial body Little Atullus moved to Okator VIII after buying a land property there. The family established a farm and made a living by herding whellays and growing various plants."}, {"tag": "p", "text": "Months before the war's end, Tionese warships carried out an attack on Okator VIII, destroying several settlements there. The young boy of the farmer family also witnessed the destruction of his farm during the attack. Eventually leaving Okator VIII, the boy enlisted with the Republic Military but did not see action in combat before the war came to a close. Twelve years after being assigned to the Republic fortress world Falang Minor, the soldier narrated an account of the attack on Okator VIII that he imprinted on a Baragwin sense lattice."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Okator VIII, also known simply as Okator, was a terrestrial astronomical object located in the Okator system, a part of the Eucer sector of the Mid Rim. During the Tionese War, waged between the Galactic Republic and the Honorable Union of Desevro & Tion, Okator VIII was situated in the region known as the Divide and was located off the Perlemian Trade Route, a super-hyperroute that connected the Republic's core regions with the Tion Cluster, in what was later known as the Outer Rim Territories."}, {"tag": "p", "text": "Okator VIII was illuminated by a single sun and had a chilly climate. Its surface featured forests and tree-covered hills. The soil on the celestial body was poor but could be improved with effort, and farmers on Okator VIII grew charsby orchards, galt-gourds, and saria. The fauna of the astronomical object included shakwulfs and whellays, which could both be domesticated, as well as the forest predators known as nightscowls."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "A boy's childhood"}, {"tag": "p", "text": "During the Tionese War, fought for roughly a century beginning in 24,000 BBY, a group of traders from the Core Worlds planet Brentaal promised a family on the Inner Rim celestial body Little Atullus cheap land on Okator VIII. The parents of the family invested their life savings into a property on the astronomical object and moved there, taking their young son with them."}, {"tag": "p", "text": "Over time, the family developed a farm on their land, maintaining a herd of the local whellays and fields where several types of plants were grown. The family sometimes went into the local town where they would learn the latest news regarding the ongoing war against the Tionese; however, the family's boy dismissed the relevance of the conflict to them due to the remote location of Okator VIII. Eventually, the boy grew to like life at a farm, taking a special liking to his favorite shakwulf, Brun."}, {"tag": "h3", "text": "Tionese attack"}, {"tag": "p", "text": "At some point months before the war's end around 23,900 BBY, a group of Tionese Tionjack warships arrived at Okator VIII. Commencing an attack run on the celestial body's settlements, the Tionjacks destroyed Derway Township by dropping a pressure bomb on it. At the time, the farm-boy was tracking a lost whellay in the forests together with Brun, and he witnessed both the destruction of Derway and the subsequent decimation of the Duny Gap and Shillagh Hollow settlements. A Tionjack then prepared to destroy the farm of the boy's family, and both Brun and the boy rushed to their home, only for the boy to witness the warship burn everything there, including property and animals, via the use of a plasma torch. At that point, with their task accomplished, the Tionese warships left Okator VIII."}, {"tag": "p", "text": "Three weeks later, a courier starship on a business errand from the celestial body Hleua arrived on Okator VIII, discovering the destruction of Derway Township. The boy was able to hail a scoutship that took him off-world, in what turned out to be last time he—or anyone else, to his knowledge—saw Okator VIII. Although the boy was encouraged to tell the story of the attack on Okator VIII on Coruscant, the capital world of the Republic, he instead enlisted in the Republic Military at Abhean, which was at that time the farthest major Republic world."}, {"tag": "p", "text": "Before the young Republic soldier could exact his vengeance upon the Tionese in combat, however, the war ended. The soldier was eventually assigned to Falang Minor, one of a series of Republic fortress worlds established along the Coreward boundaries of the Tion Cluster. After twelve years of monitoring starship traffic, intelligence, and transmissions originating in the cluster under the command of watchmen of the Jedi Order, the soldier imprinted on a Baragwin sense lattice an audio-visual account of the attack on Okator VIII. In the record, the former farm-boy noted that he had heard the reason why the Tionese had selected Okator VIII for their attack instead of a major Republic city-world was that they wanted to attack a location where they could \"kill everybody.\""}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The inhabitants of Okator VIII included a family of farmers originally from the celestial body Little Atullus. Beside the family's farm, there were also several settlements on Okator VIII. The astronomical object was regularly visited by Republic tradeships and couriers from Hleua. These starships relied on the hyperspace jump-beacon at Uthtara for their visits to Okator VIII, and when the jump-beacon occasionally experienced malfunctions, the vessels would not visit the astronomical object for weeks."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The settlement of Derway Township was located on Okator VIII, beyond the natural formation known as the Pinson ridge. In addition, the settlements of Duny Gap and Shillagh Hollow were separated by a ridge from a valley where a farm owned by a family of farmers lay."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Okator VIII was originally meant to be mentioned in the 2012 reference book The Essential Guide to Warfare by Jason Fry and Paul R. Urquhart; however, the section that would have mentioned the astronomical object, which Fry characterized in his personal blog as a \"Republic frontier world,\" was cut before the book's release."}, {"tag": "p", "text": "The information regarding Okator VIII was later released in 2014 as part of Star Wars: The Essential Guide to Warfare Author's Cut, a series of articles published on the StarWars.com Blog by Fry and Erich Schoeneweiss containing various cut content from The Essential Guide to Warfare. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Okator system, and therefore Okator VIII, in grid square Q-7."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}