{"url": "Old_City_(Tython)", "categories": ["Category:Legends articles", "Category:Cities", "Category:Tython locations"], "nodes": [{"tag": "h1", "text": "Old City  (Tython)"}, {"tag": "p", "text": "The Old City was an ancient and abandoned city of ziggurats and pyramids located in the Red Desert, on Talss, a continent of Tython. When the Je'daii Order discovered the site after their arrival on the world in 36,453 BBY, the city was already ancient and of unknown origin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Erected by a long lost civilization of unknown origin, the sprawling city was comprised of ziggurats and pyramids that erupted out of the Red Desert. Built over caverns and tunnels which had an unexplained deafening effect on the Force, the Old City, as the Je'daii Order knew it, was ancient and abandoned as of 36,453 BBY. After millennia of exploration and investigation, the Je'daii came to speculate that the Old City was constructed or at some point inhabited by the Gree, potentially for tens of millennia. Some Je'daii believed that the city predated even the Gree, citing the strangely enormous scale at which some of the architecture was constructed."}, {"tag": "p", "text": "Regardless of its original builders, the Gree did install a hypergate within the bowels of the cavern system beneath the tallest of the pyramids. The caverns leading to it were dotted with pitfalls and great ravines, subterranean lakes and vents that blew warm air from the darkness. The Je'daii Council did not explicitly acknowledge the existence of the hypergate, though they placed traps along the caverns leading to its alleged location. During the year prior to the beginning of the Force Wars, Dalien Brock led a sect of Stargazers into the pits in hopes of activating the hypergate and leaving Tython behind in search of their long-lost homeworlds. Je'daii Ranger Lanoree Brock, Dalien's sister, stopped this attempt, supposedly killing her brother, though his body was never recovered."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}