{"url": "Old_Friends_Not_Forgotten", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Old Friends Not Forgotten"}, {"tag": "p", "text": "\"Old Friends Not Forgotten\" is the ninth episode of the seventh and final season of Star Wars: The Clone Wars. It was released on April 17, 2020."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The siege of Mandalore begins, and Ahsoka turns to Anakin and Obi-Wan for help."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Master and apprentice"}, {"tag": "p", "text": "The narrator explains that the Outer Rim has been under siege by Separatist forces led by General Grievous, with Republic forces suffering major losses. In response to this, the Jedi Council dispatches their Jedi Generals, Aayla Secura and Plo Koon, to the respective planets Felucia and Cato Neimoidia to help turn the tide of the battle."}, {"tag": "p", "text": "Meanwhile, over the skies of Yerbana, Separatist droid tri-fighters and artillery are strafing Clone Z-95 Headhunters and LAAT gunships providing support for Commander Cody and his troops, desperate to get help. After killing the lead Z-95 Headhunter, Separatist droid fighters shoot down a gunship, causing it to collide with a bridge and crash into a river. Cody orders his men to take cover as they advance on a phalanx of Separatist droids including dwarf spider droids, Octuptarra tri-droids, and NR-N99 Persuader-class droid enforcers. Many clone troopers are killed during the charge by enemy fire."}, {"tag": "p", "text": "A missile closes in on Cody. However, at the last minute, Jedi General Obi-Wan Kenobi jumps in and uses his lightsaber to deflect the blast. He tells Cody to get down before deflecting a laser blast back at the Separatist droids, causing an explosion. The clone troopers fall back. Once Kenobi and Cody have regrouped, Cody informs the Jedi General that his forces have been unable to locate the tactical droid because he is staying out of sight. Kenobi asks where Anakin Skywalker is."}, {"tag": "p", "text": "The Jedi Knight responds that he is right here, appearing behind them. When Skywalker asks what they are doing down there, Kenobi tells him that they are taking cover and to get down. Skywalker is not intimidated by the thousand droids they are facing. Kenobi asks Skywalker what he is up to and where Captain Rex is. Skywalker replies that they have finished their battle and decided to come and help Kenobi and Cody's forces. Kenobi thinks that Skywalker is overdoing it, and Skywalker responds that he could come and hide with him and let the people of the city suffer longer, or they could help them now with his plan."}, {"tag": "p", "text": "Kenobi agrees to follow Skywalker's leadership and asks what his plan is. Skywalker tells Kenobi to stay where he is. The Separatist droids in the command post watch Anakin Skywalker striding out to meet them. The battle droid commander orders his forces to cease fire and to focus on the Jedi. However, Skywalker tells them to hold their fire and claims that he has come to surrender. The battle droid commander is relieved and decides to inform the tactical droid."}, {"tag": "p", "text": "Skywalker flatters the Separatist droids by telling them that they have fought valiantly, claiming that the Republic forces have been outmatched. However, R2-D2 is watching them through his periscope from the side of the bridge. Captain Rex, on the underside of the bridge, asks how much longer they're going to be stuck there. R2-D2 responds in Binary and Rex says that he will go and inform the boys. He tells the clone troopers under the bridge to hang in there a bit longer."}, {"tag": "p", "text": "Skywalker offers his surrender to the tactical droid. However, the tactical droid realizes that it is a trap and tells them to open fire. Skywalker gives R2-D2 the signal and he relays Skywalker's orders to Rex and his clone troopers. Skywalker uses the Force to drag the tactical droid towards him before beheading him with his lightsaber. The clone troopers activate their jetpacks and emerge from their hiding places beneath the bridge."}, {"tag": "p", "text": "The clone jetpack troopers attack the Separatist forces, destroying them with explosives and laserfire. They also plant explosives on the Octuptarra tri-droids. With the Separatist forces in disarray, Kenobi allows Commander Cody and his troops to join the battle. General Kenobi compliments General Skywalker, who thanks Kenobi for helping their victory. Kenobi says that he is always glad to help."}, {"tag": "h3", "text": "An old friend"}, {"tag": "p", "text": "Admiral Wullf Yularen then contacts Anakin Skywalker via comlink, telling him that they have received contact from someone using his subspace frequency \"Fulcrum.\" Skywalker thinks that it is Saw Gerrera, while Kenobi speculates that the siege at Onderon must have taken a turn for the worse. Yularen clarifies that it is not Gerrera and says that it would be best for both of them to take this transmission back on the ship."}, {"tag": "p", "text": "Skywalker and Kenobi take an LAAT gunship back to Admiral Yularen's Venator-class Star Destroyer. Upon arriving in the bridge, Skywalker asks Yularen what is so important that he has brought them all the way back. Skywalker is shocked to see Ahsoka Tano on a holoprojector. She tells Skywalker that it has been a while since they have spoken, while General Kenobi looks surprised. Standing beside Tano is a Mandalorian warrior."}, {"tag": "p", "text": "After exchanging pleasantries, Tano tells Skywalker and Kenobi that she has urgent information. She explains that she and Lady Bo-Katan Kryze have located the rogue Sith Lord Maul and says that if they move swiftly, they can capture him. Later in the hangar, Skywalker walks with Kenobi and R2-D2. Skywalker remarks that if Ahsoka had not left the Jedi Order, she wouldn't have been where she needed to be. Kenobi says that is one way to look at it, but Skywalker counters that is the only way to look at it. He says that they will finally capture Maul."}, {"tag": "p", "text": "Skywalker is struck by Kenobi's lack of excitement, but the Jedi Master responds that he is cautiously optimistic. Shortly later, a Mandalorian shuttle lands in the hangar. Ahsoka Tano exits the gangplank. R2-D2 rushes to meet her and she strokes his dome. Tano is followed by Lady Bo-Katan and several Mandalorians."}, {"tag": "h3", "text": "Seeking Republic help"}, {"tag": "p", "text": "Skywalker wants to chat with Ahsoka but she gets down to business, telling him that things are moving quickly. Bo-Katan warns that every minute they waste here gives Maul the opportunity to slip away. Kenobi says that they understand and tells them to follow him. Skywalker is unnerved by the Mandalorians."}, {"tag": "p", "text": "Inside the war room, Tano explains that Bo-Katan had been tracking Maul for several months. She adds that she had been able to obtain some transmission codes from the Pykes on Oba Diah, which helped to pinpoint some of his previous locations. When Skywalker asks what she was doing on Oba Diah, Tano replies that that's a long story which was not really relevant then.  Bo-Katan explains that they know that Maul is in the Mandalorian city of Sundari."}, {"tag": "p", "text": "When Kenobi asks how certain she is, Bo-Katan replies that he arrived two days ago. Kenobi then asks Bo-Katan why she is seeking the Republic's help. Bo-Katan explains that her forces lack the numbers needed for a siege and fears that Maul will escape without a complete lockdown of the city. She proposes a joint operation to capture Maul and liberate Mandalore. Kenobi warns that if Republic forces aid Bo-Katan's assault, that would break treaties that are a hundred years old, drawing the Republic into yet another war."}, {"tag": "p", "text": "Bo-Katan rhetorically asks what is one more. Skywalker adds that they are not yet finished with their first one. Kenobi says that he will advise the Jedi Council of this development, but Lady Bo-Katan warns that there is no time because Maul's influence on Mandalore is destroying her people. She reminds him that Maul murdered their ruler, her sister Satine Kryze. Angrily, Bo-Katan points out that she thought Satine meant something to Kenobi, who replies that she did and still does. However, he says that he won't let his feelings cloud his judgments and leaves the matter for the Jedi Council to decide. Kenobi exits the war room."}, {"tag": "h3", "text": "Gathering forces"}, {"tag": "p", "text": "Bo-Katan turns to Ahsoka and tells her that she had warned that this would be a waste of time. After Bo-Katan and her guards have left, Tano speaks with Skywalker in private, telling him that he and Kenobi have not changed. When Skywalker asks if that is a bad thing, she remains silent. Skywalker tells Tano that he has a surprise for her and leads her through the ship. Passing clone troopers salute her, surprising Tano, who no longer regards herself as a Jedi."}, {"tag": "p", "text": "Skywalker explains that the clones respect her because they know what she went through for them in battle. Skywalker tells her that loyalty means everything to the clones. He leads her into a hangar where she is greeted by Captain Rex and his company, all with helmets painted in the likeness of her facial markings. At Rex's command, the clone troopers stand at attention, as Tano and Skywalker inspect them. Skywalker explains that as soon as Rex and his men knew she was coming, they got to work."}, {"tag": "p", "text": "Rex explains that he and his men painted their helmets to honor her, and that although the paint job is a little crude he thinks it gets the point across. He tells Ahsoka that he and his men are glad to have their Commander back. Tano is grateful but tells Rex that he doesn't have to address her as Commander anymore, which he chooses to ignore. Skywalker tells Tano that he has one more surprise for her and presents her with a box handed to him by Rex. Before she can open it, they hear the klaxons ringing."}, {"tag": "p", "text": "Kenobi enters the hangar to tell Anakin and Rex to prepare their forces because they are jumping into hyperspace immediately. Rex prepares his men. When Skywalker asks if the attack on Mandalore was approved, Kenobi explains that General Grievous has attacked the galactic capital of Coruscant. When Skywalker asks about Supreme Chancellor Palpatine, Kenobi says that Shaak Ti has been sent to protect him but that Jedi Master Mace Windu has lost contact with her. He reassures Skywalker that their fleet can be there in an hour."}, {"tag": "p", "text": "Tano is upset and thinks that the Jedi are going to abandon Bo-Katan and her people. Kenobi tries to explain that they are entering a pivotal moment in the Clone Wars and that the heart of the Republic is under attack. Tano counters that Kenobi is playing politics and says that this is why the people have lost faith in the Jedi. She explained that she had too until she was reminded of what the Order means to people who truly need them. Kenobi says that people on Coruscant need them, but Tano counters that only the Chancellor actually needs them."}, {"tag": "p", "text": "Kenobi tells Tano to be fair, but Tano counters that she is not trying to be. As a concession, Skywalker decides to divide the 501st Legion and create a new division under Ahsoka's command. Kenobi reminds Skywalker that Ahsoka is no longer a member of the Grand Army of the Republic. Skywalker proposes promoting Rex to Commander and having him lead the new division. He appoints Ahsoka as Rex's adviser. Ahsoka accepts this plan but asks if Kenobi approves of it. Kenobi consents and tells Ahsoka \"May the Force be with you.\" Before leaving, Kenobi tells Ahsoka that he killed Maul once and advises her to capture him, because he tends not to stay dead."}, {"tag": "p", "text": "Tano thanks Anakin for the support, and Skywalker replies that it's what friends are for. Since she is going to face Maul, he gifts her a box containing her lightsabers. Anakin tells Ahsoka that he took care of them and that her lightsabers are as good as new. When Ahsoka finds that the blades are now blue, Anakin admits that they're even better than new, to which she smiles wryly. He tells her to capture Maul while he takes care of General Grievous. He hopes that if they are lucky, the Clone Wars will be over soon. Tano reminds him that Master Kenobi said that there is no such thing as luck. Before Anakin leaves, Tano wishes him good luck and he smiles back. Tano then turns to address Commander Rex and his men, who are boarding an LAAT gunship."}, {"tag": "h3", "text": "Making planetfall"}, {"tag": "p", "text": "Several LAAT carriers ferrying AT-TE walkers descend into Mandalore's atmosphere with squadrons of Republic starfighters. A small fleet of Star Destroyers wait in orbit. As Tano and Rex ride with the clone troopers in an LAAT gunship, the pilot informs Rex, Tano, and Bo-Katan that he has Prime Minister Almec on the comm. Rex tells him to put him through."}, {"tag": "p", "text": "Almec demands to know the meaning of this invasion and claims that the Republic presence there violates their treaty with Mandalore. Bo-Katan counters that his time is over and they know that he is Maul's puppet and that they are coming for Maul. Almec denounces her as a traitor and warns her that siding with the Republic will make her an enemy in the eyes of the people. Bo-Katan responds that she is fine with that, leading Tano to remark that she is nothing like her sister."}, {"tag": "p", "text": "At the Sundari royal palace, Prime Minister Almec orders Gar Saxon to prepare their forces for an attack and tells Rook Kast to inform the syndicate of the invasion. After Rook leaves, Saxon tells Almec that it has been a while since they have been involved in a fight like this and asks if he is ready."}, {"tag": "p", "text": "Republic gunships and starfighters descend on Sundari. Aboard the lead gunship, Bo-Katan asks Ursa if she can confirm the target's location. Ursa responds that she can only confirm that Maul has not left the city and that all other attempts to track him down have been blocked. She adds that Saxon is already scrambling his forces."}, {"tag": "p", "text": "Just then, the pilot informs them that they have encountered hostiles. An LAAT carrier is hit by enemy fire and another gunship is shot down. As Mandalorian warriors equipped with jetpacks fly out to meet them, Bo-Katan's loyalists and clone jet troopers ride out of their gunships and a battle breaks out."}, {"tag": "p", "text": "Rex apologizes to Ahsoka that he forgot to bring her a jetpack. Tano replies that she doesn't need one and offers to race him to the surface. Using her Force powers, Tano jumps out of her gunship and attacks two of Almec's warriors with her lightsabers. She leaps onto a second gunship and drives away the Mandalorians that have hijacked it."}, {"tag": "p", "text": "Tano jumps onto a hit gunship and rescues the pilot, allowing him to bail out. After jumping off the stricken gunship, she lands on a platform and faces several of Almec's Mandalorian warriors. Bo-Katan and her warriors come to her aid, driving Almec's forces away. When Rex turns up, Tano tells him that she has beaten him, and he quips that some things never change. A gunship lands as Ahsoka and Rex run into the city."}, {"tag": "h3", "text": "Capturing the docks"}, {"tag": "p", "text": "Clone jet troopers battle Almec's Mandalorians in the streets of Sundari. Gar Saxon informs Prime Minister Almec that Republic forces have already taken the docks and are closing in on his position. Almec orders him to retreat to the undercity. Saxon and Rook lead their warriors to the Undercity, allowing Bo-Katan and her forces to capture the upper city."}, {"tag": "p", "text": "Though they haven't encountered Maul yet, Bo-Katan warns Ahsoka and Rex that they can't withstand a long siege. Bo-Katan intends to go to the throne room to confront Almec and tasks Tano with finding Maul. She and her warriors then jet off."}, {"tag": "p", "text": "Ahsoka tells Rex to support Ursa at the docks to ensure that Maul doesn't escape. Rex says that everything plays into Maul's hands. Captain Vaughn then informs Rex that they have encountered something. Tano travels to meet Vaughn's forces at an access point to the Undercity. He tells Tano that they had pursued Gar Saxon, who had fled into Sundari's sewers. Tano asks if they lead outside the city and leads the clone troopers inside."}, {"tag": "p", "text": "Meanwhile, in the throne room, Rook informs Almec that the Jedi was sighted entering the lower city. Almec says that it is just as their lord predicted. Just then, Bo-Katan and her warriors force their way into the throne room and engage Almec's guards in a gun battle. Bo-Katan fights with Almec in hand to hand combat and subdues him."}, {"tag": "h3", "text": "Maul's trap"}, {"tag": "p", "text": "Bo-Katan demands to know where Maul is, but Almec retorts that she was never the politician that her sister was. Almec reveals that Maul wanted her to bring the Jedi here but says that she brought the \"wrong one.\" Bo-Katan tries to warn Ahsoka that she is walking into a trap, but receives only static."}, {"tag": "p", "text": "Meanwhile, Ahsoka and the clone troopers walk through the sewers silently. However, Rook Kast and her warriors are waiting for them. Rook fires an explosive at them, which knocks down Ahsoka when she deflects it into a wall. Vaughn and his men pursue. Ahsoka tells them to wait, but the clones are killed by unseen foes. Ahsoka rushes to the dying Vaughn and holds his hand. He apologizes to his Commander before succumbing to his wounds"}, {"tag": "p", "text": "Ahsoka finds herself surrounded by Saxon's warriors and Maul. She draws her lightsabers. Maul tells her that he was hoping for Kenobi and asks Tano what she is doing here."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Unlike previous episodes, the episode title is shown in place of a moral, and an arrangement of the Star Wars theme by John Williams is played during the title sequence in place of the standard arrangement by Kevin Kiner. Additionally, the title card is red instead of its usual yellow color, similar to the final arc of Season Four, in which Maul was reintroduced. The title card is preceded by Lucasfilm's original green plain text logo, used in the original trilogy. This new format lasted for the remainder of the series."}, {"tag": "p", "text": "The clips of Aayla Secura and Plo Koon during the narration depict the characters in settings reminiscent of their death scenes in Revenge of the Sith."}, {"tag": "p", "text": "The Conquest of Kaller is briefly shown during the newsreel in footage that was later used in Star Wars: The Bad Batch series premiere \"Aftermath\", albeit mirrored."}, {"tag": "p", "text": "The armor accessory Cody wears on his back is missing while he is telling Obi-Wan about the elusive tactical droid."}, {"tag": "p", "text": "In the announcement trailer for Season Seven, the scene depicting Ahsoka and Anakin's reunion on the ship is different, as in the trailer it was Rex who was on the ship instead of Yularen."}, {"tag": "p", "text": "In the Ahsoka novel, when returning Ahsoka's lightsabers to her, Anakin warns her about Maul, saying that he is \"tricky\" and \"has no mercy in him,\" also reminding her to \"be careful,\" to which she asks \"What could happen?\" In the episode, however, their conversation is about her lightsabers now being blue and wishing each other luck."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}