{"url": "Old_Ord_Mantell_City", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cities on Ord Mantell", "Category:Destroyed cities"], "nodes": [{"tag": "h1", "text": "Old Ord Mantell City"}, {"tag": "p", "text": "Old Ord Mantell City was a ruined city on the planet Ord Mantell. It was located on the far side of the planet from Ord Mantell City. At the beginning of the Imperial Era, a group of Zygerrian slavers led by Raney holed up in the ruins with several captives and Muchi, a stolen rancor belonging to Jabba Desilijic Tiure. The informant Cid recruited the fugitive Bad Batch to retrieve the rancor when they came to her for information, resulting in a skirmish in the ruins."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Old Ord Mantell City was a city on Ord Mantell, situated on the far side of the planet from Ord Mantell City. Located in a mountain valley, the city had an extensive array of buildings, including at least one plaza with fountains, fortresses, and various beautiful edifices. All of it had been reduced to ruins by the beginning of the Imperial Era."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Old Ord Mantell City was constructed on Ord Mantell sometime prior to the year 19 BBY. By the beginning of the Imperial Era in that year, the city had been reduced to ruins, with its population gone. At that time, a group of Zygerrian slavers led by Raney holed up in the ruins with several slaves and Muchi, a young rancor stolen from the crime lord Jabba Desilijic Tiure."}, {"tag": "p", "text": "Jabba's majordomo, Bib Fortuna, hired the information broker Cid, who was based in Ord Mantell City, to retrieve Muchi. In turn, Cid recruited the fugitive Bad Batch, a group of clone commandos who had defected from the Empire, to carry out the job when they came to her for information. The Batch travelled to the ruins and scouted them out, noting the square where the slavers were encamped with their captives."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}