{"url": "Olia_Choko", "categories": ["Category:Canon articles", "Category:Alliance Intelligence members", "Category:Females", "Category:New Republic individuals", "Category:Pantorans"], "nodes": [{"tag": "h1", "text": "Olia Choko"}, {"tag": "p", "text": "Olia Choko was a female Pantoran who served in the Alliance to Restore the Republic and later the New Republic as the public relations representative between Chancellor Mon Mothma and the Galactic Senate. During a news broadcast that took place before the first official meeting of the new Galactic Senate, she spoke to the galaxy about a need for peace and reform. One angry citizen threw rotten fruit at her, but she brought him on camera and spoke to him about his needs, asking him to present his case to the Galactic Senate where they could take care of his people's needs. She also saw a New Republic soldier parading around Imperial prisoners, so she reprimanded him to show the galaxy that the New Republic would be nothing like the Galactic Empire before it."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Olia Choko was a female Pantoran who lived during the Age of the Empire and the rise of the New Republic. Choko was a member of the Alliance to Restore the Republic by the time of the Battle of Yavin in 0 BBY. In order to turn the Alliance victory over the Galactic Empire into a propaganda campaign, Chancellor Mon Mothma wrote a report to Minister of Education Tynnra Pamlo of the assets she had at her disposal. One asset was holographic footage of the medal ceremony of Luke Skywalker and Han Solo following the battle, though permissions had to be routed to Choko who served in the communications section."}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, Choko became the public relations representative for Chancellor Mon Mothma and the new Galactic Senate. While the Rebellion on Akiva was taking place, Choko was interviewed by the Queen of the Core Network journalist Tracene Kane and the Trandoshan cameraman Lug. This was the first broadcast of the new HoloNet channel."}, {"tag": "p", "text": "When Kane noted her nervousness, Choko reassured her that she would be fine as a pretty alien. Choko made sure that Lug got a good shot of Hanna City, Chandrila's capital and the current headquarters of the Galactic Senate. Choko also told Kane and Lug to get a good shot of the stormtrooper helmet art installation in the city circle. Having sorted out the surroundings, Kane commenced the interview and Lug commenced filming."}, {"tag": "p", "text": "During the interview, Choko was struck in the face by a rotten fruit flung by the disgruntled Xan named Geeska Dotalo. While Kane wanted to cut the footage, Choko told Lug to continue filming and confronted the Xan. While Dotalo was reluctant to be filmed, Choko asked him to tell her his problems. Dotalo recounted that the fighting between the New Republic and the Empire had led to chaos, crime, and famine on his homeworld of Gan Moradir. Taking pity on the Xan, Choko promised that the Galactic Senate would help him and asked if he was interested in serving as his world's representative on the Senate. She then put him in touch with another Pantoran Galactic Senate official."}, {"tag": "p", "text": "Following the interview, Choko went to confront the New Republic Corporal Camerand Argell, who was parading several captured Imperial officers and stormtroopers. With Lug filming, Choko chastised the officer for parading prisoners like cattle and ordered him to tell Commander Rohr to cease the parade. When the Corporal protested that they should be proud of winning the war, Choko responded that the New Republic would not behave like the Empire."}, {"tag": "p", "text": "After Argell had led the prisoners away, Kane chatted with Choko on live camera. Choko told Kane that the New Republic had to continue standing up for what was right. When Kane asked if the protestor, the orphans, and the parade of prisoners were warning signs of danger, Choko responded that the New Republic was a democracy and was focused on trying to get things right. While the Empire only cared about order, she reiterated that the New Republic would put the greater good above everything else. After bidding Kane farewell and promising to keep the New Republic accountable, Choko then accompanied a procession of a hundred senators down to the provisional Galactic Senate, which was based in the old Chandrila Senate house."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Olia Choko was female Pantoran with blue skin. She had golden hair pulled back into a simple, practical braid. She wore a plain and unpretentious dress and her only jewelry consisted of a pair of silver bracelets. As a public relations representative, Choko was trained to smile. Choko was a righteous and compassionate woman who cared for the victims of war. She regarded Imperial officers and soldiers as fellow sentient beings and spoke up for them when a New Republic officer decided to parade them as \"spoils of war.\" Choko firmly believed in the righteousness of the New Republic's cause. While acknowledging that the New Republic would not get things right, she believed that it was important for the Republic to remain a democracy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Olia Choko first appeared as a minor character in Chuck Wendig's 2015 novel Aftermath."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}